{"url": "http://nypost.com/2017/07/14/judge-expands-list-of-relatives-exempted-from-trump-travel-ban/", "id": "168", "title": "Judge expands list of relatives exempted from Trump travel ban", "text": "HONOLULU — A federal judge in Hawaii on Thursday expanded the list of family relationships needed by people seeking new visas from six mostly Muslim countries to avoid President Donald Trump’s travel ban.\n\nU.S. District Judge Derrick Watson ordered the government not to enforce the ban on grandparents, grandchildren, brothers-in-law, sisters-in-law, aunts, uncles, nieces, nephews and cousins of people in the United States.\n\n“Common sense, for instance, dictates that close family members be defined to include grandparents,” U.S. District Judge Derrick Watson said in his ruling. “Indeed grandparents are the epitome of close family members.”\n\nThe U.S. Supreme Court last month exempted visa applicants from the ban if they can prove a “bona fide” relationship with a U.S. citizen or entity.\n\nThe Trump administration has said the ban won’t apply to citizens of the six countries with a parent, spouse, fiance, son, daughter, son-in-law, daughter-in-law or sibling already in the U.S.\n\nHawaii said grandparents, uncles and aunts and other close relatives should also be exempted. The state asked Watson, who blocked the president’s revised travel ban in March, to clarify that those family members are also exempt from the ban.\n\nWatson rejected Hawaii’s request, saying the state should go to the U.S. Supreme Court since it was seeking to clarify that court’s requirement of a “bona fide relationship.”\n\nHawaii appealed Watson’s ruling to the 9th U.S. Circuit Court of Appeals, but the court said Watson’s ruling was not appealable under federal judicial laws. The 9th Circuit, however, said Watson had the authority to interpret the Supreme Court’s order and block any violation of it. Hawaii then renewed its last week request with Watson in a different form.\n\n“Because plaintiffs now seek such injunctive relief, the court reaches the merits of their request, consistent with the Ninth Circuit’s guidance,” Watson wrote.\n\nThe Hawaii attorney general’s office didn’t immediately comment on Watson’s ruling.\n\nThe U.S. Department of Justice declined to comment Thursday.", "authors": ["Associated Press", "July"], "publish_date": "2017-07-14", "source": "nypost", "top_words": ["list", "ruling", "travel", "trump", "ban", "expands", "family", "watsons", "judge", "supreme", "court", "relatives", "exempted", "request", "watson", "grandparents"], "summary": "HONOLULU — A federal judge in Hawaii on Thursday expanded the list of family relationships needed by people seeking new visas from six mostly Muslim countries to avoid President Donald Trump’s travel ban.\n“Common sense, for instance, dictates that close family members be defined to include grandparents,” U.S. District Judge Derrick Watson said in his ruling.\nThe state asked Watson, who blocked the president’s revised travel ban in March, to clarify that those family members are also exempt from the ban.\nCircuit Court of Appeals, but the court said Watson’s ruling was not appealable under federal judicial laws.\nThe Hawaii attorney general’s office didn’t immediately comment on Watson’s ruling."}