{"url": "http://pagesix.com/2017/04/26/salma-hayek-slams-trumps-dumb-border-wall/", "id": "196", "title": "Salma Hayek slams Trump’s ‘dumb’ border wall", "text": "Salma Hayek didn’t mince words when discussing President Donald Trump’s proposed border wall with Mexico.\n\n“It’s a dumb solution and proposition,” Hayek, 50, told People in an interview released Wednesday.\n\n“Whether it gets built, whether it doesn’t get built, nobody has given you a real budget on it — we do know it’s billions and billions of dollars,” she fumed. “We’re talking about who’s going to pay for it and the wall is not the solution. How is this wall that is immense going to go through the many rivers? Are you going to build dams? Are you going to go up and down the mountains?”\n\nThe “From Dusk til Dawn” star hinted that she thinks the border wall may be a diversion tactic.\n\n“Sometimes we talk about the wrong part of the issues,” Hayek noted. “And that can be a trick, talking about the wrong part of the issue and not dealing with it, or talking about the wrong issues, which distract from other issues — we have to be careful not to fall in that trap.”\n\nsee also Salma Hayek, Mexico unite against Trump at Guadalajara The actress alongside director Jim Sheridan and Mexican authorities backing...\n\n“We have to talk about smart reforms because it’s very necessary,” the actress, who moved to the United States from Mexico in 1991, urged. “There are smarter ways we can come up with to control immigration and do immigration reform that is much more beneficial for America.”\n\n“For example, there’s a lot of work for farmers in this country and there are not enough farmers for all the work there is,” she said. “A lot of the people that do not want to be involved in the drug industry of Mexico are very skilled farmers; they do not want to participate in that, so some of them are here.“\n\n“The people that come — they don’t necessarily want to stay,” she added. “They would be happy to come and work at the time of the harvest and go back to their country. America can benefit from these expert workers and they can pay taxes that can benefit America.”", "authors": ["April"], "publish_date": "2017-04-26", "source": "nypost", "top_words": ["salma", "mexico", "issues", "wall", "dumb", "slams", "wrong", "going", "trumps", "work", "border", "talking", "come", "farmers", "hayek"], "summary": "Salma Hayek didn’t mince words when discussing President Donald Trump’s proposed border wall with Mexico.\n“It’s a dumb solution and proposition,” Hayek, 50, told People in an interview released Wednesday.\n“We’re talking about who’s going to pay for it and the wall is not the solution.\n“Sometimes we talk about the wrong part of the issues,” Hayek noted.\n“They would be happy to come and work at the time of the harvest and go back to their country."}