{"url": "http://nypost.com/2017/01/29/de-blasio-travel-ban-may-be-first-step-towards-a-muslim-registry/", "id": "111", "title": "De Blasio: Travel ban may be ‘first step towards a Muslim registry’", "text": "WASHINGTON — Mayor Bill de Blasio on Sunday called President Trump’s travel ban “simply un-American” and warned it could be “the first step towards a Muslim registry.”\n\nDe Blasio told CNN’s “State of the Union” it’s “still not clear” whether Trump is honoring the Brooklyn court order to stay the travel ban and it appears refugees are still trapped inside New York area airports.\n\nLocal authorities were given “no guidance” on how to enact Trump’s executive order, which affected people who are legal green card holders, de Blasio said. Detention without due process should be “chilling” to Americans.\n\nProtests broke out at airports over the weekend as Trump’s executive action was signed — keeping with his campaign promises to issue a temporary ban on immigration from terror hotspots.\n\nThe Department of Homeland Security said this weekend it will continue to enforce all of Trump’s executive orders because the “U.S. government retains its right to revoke visas at any time if required for national security or public safety.”\n\nTrump administration dismissed the Brooklyn judge’s emergency court action, noting it came from a President Obama appointee.\n\n“The stay of order doesn’t really affect the executive order at all,” Trump counselor Kellyanne Conway told Fox News Sunday.\n\nConway said just 1 percent of the more than 325,000 daily international air travelers were inconvenienced as the enhanced security measures were put in place. Those who passed the extra vetting were allowed to stay, Conway said.\n\n“I think in terms of the upside being greater protection of our borders and our people, it’s a small price to pay,” Conway said, who also rejected the travel restrictions from seven countries was a “Muslim ban.”\n\nMeanwhile, de Blasio defended New York’s sanctuary city status saying it’s a long standing policy that helps police keep lines of communication open with undocumented New Yorkers and any cuts to funding would hurt terror fighting.\n\n“We’re not going to stand for that,” de Blasio said, pledging New York City would challenge the order in court if Trump tries to enforce it.\n\nDe Blasio backed New York City policy that prevents undocumented people from being turned over to the feds for lesser crimes, such as drunk driving, which is minor offense as long as the driver doesn’t cause any other “negative outcome,” de Blasio said.", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["executive", "stay", "travel", "trump", "blasio", "ban", "security", "court", "registry", "trumps", "step", "order", "muslim", "york"], "summary": "WASHINGTON — Mayor Bill de Blasio on Sunday called President Trump’s travel ban “simply un-American” and warned it could be “the first step towards a Muslim registry.”De Blasio told CNN’s “State of the Union” it’s “still not clear” whether Trump is honoring the Brooklyn court order to stay the travel ban and it appears refugees are still trapped inside New York area airports.\nLocal authorities were given “no guidance” on how to enact Trump’s executive order, which affected people who are legal green card holders, de Blasio said.\nProtests broke out at airports over the weekend as Trump’s executive action was signed — keeping with his campaign promises to issue a temporary ban on immigration from terror hotspots.\nThe Department of Homeland Security said this weekend it will continue to enforce all of Trump’s executive orders because the “U.S.\n“The stay of order doesn’t really affect the executive order at all,” Trump counselor Kellyanne Conway told Fox News Sunday."}