{"url": "http://nypost.com/2017/05/09/stop-copying-trump-to-try-to-counter-him/", "id": "141", "title": "Stop copying Trump to try to counter him", "text": "A great deal has been said about Donald Trump’s violations of “democratic norms.” I agree with much of it.\n\nBut the big problem with violating democratic norms (the unwritten customs and practices even political foes traditionally abide by) is that once you’ve done it, everybody else wants to do it, too.\n\nThis makes everything worse, because when the people most offended by Trump’s violations respond in kind, they not only contribute to the problem, they create incentives for Trump and his biggest supporters to keep doing it.\n\nFor example, the Obama administration was horrified by the prospect of being replaced by the Trump team. The exact details have yet to be revealed, but it seems some in the old guard may have violated norms about “unmasking” certain individuals, and they certainly violated norms by leaking highly classified details to the press. In response, Trump claimed vindication in his claims that he was wiretapped.\n\nA better example might be CBS’s Stephen Colbert. He has found a sweet spot in the ratings as a leading voice of the anti-Trump “resistance.” That’s fine. TV is a niche business these days, even at the broadcast networks. But last week, Colbert’s animus got the better of him. Suffice it to say that if you want to condemn a president for his incivility, you squander some credibility when you describe the president of the United States in a lewd act with a foreign dictator.\n\nThe most acute example of the problem is working its way through the courts. In the campaign, Trump outrageously and ridiculously called for a “total and complete shutdown” of Muslims entering the US. He justified it with lots of incendiary statements.\n\nOne of his first acts as president was to sign an executive order suspending US entry by residents of seven countries for 90 days. It empowered government agencies to make case-by-case exceptions.\n\nThe order, which was immediately blocked by federal courts and ultimately rescinded, was a sloppy piece of work. But it wasn’t a Muslim ban. The vast majority of Muslims live outside of those seven countries and were unaffected by it.\n\nIn March, Trump issued a second “travel ban” order taking into account some of the objections to the first. Iraq was dropped from the list, for example. That order, too, was blocked by judges. The 4th Circuit in Virginia heard arguments in the case Monday.\n\nReasonable people can disagree with the merits of the ban, legally, morally and politically. But what I find troubling is the way various judges have taken to acting like pundits weighing in on Trump’s campaign rhetoric. Hawaii federal Judge Derrick Watson responded to the idea that Trump’s past utterances are irrelevant with this preening statement: “The court will not crawl into a corner, pull the shutters closed and pretend it has not seen what it has.”\n\nHistorically, paying such deference to political rhetoric is highly irregular. The motivations of politicians, real or perceived, aren’t normally given any weight and virtually never disqualify legal language “between the four corners of the page” — the text of the executive order itself, in this case.\n\nYou might have noticed that even before Trump, candidates often promised grandiose, irresponsible or silly things on the campaign trail. Once elected, they discover they can’t deliver. And that’s how democratic norms, formal and informal, are supposed to work.\n\nBarack Obama was once a vocal fan of single-payer health care. Imagine the outrage if judges ignored the text of ObamaCare and invalidated it on the grounds that his campaign rhetoric proved his real intent.\n\nIn Monday’s hearing, a lawyer for the ACLU conceded that if a hypothetical president (Hillary Clinton or someone else) had issued the same executive order, it could be constitutional. But Trump makes it unconstitutional. That’s nuts.\n\nI don’t blame anyone for being disgusted with Trump’s rhetoric. But judges aren’t comedians or pundits. Their job is to follow the law.\n\nTrump doesn’t help by referring to his executive orders as a “ban” (so as to pretend he’s fulfilled that promise). But the reality is that he abandoned the ban from the get-go. When judges pretend otherwise to prove their “wokeness” they undermine democratic norms even further. And they give Trump and his boosters one more reason to screech that the courts are biased against him.", "authors": ["Jonah Goldberg", "May"], "publish_date": "2017-05-09", "source": "nypost", "top_words": ["executive", "norms", "judges", "trump", "ban", "example", "stop", "trumps", "counter", "try", "copying", "rhetoric", "order", "president"], "summary": "One of his first acts as president was to sign an executive order suspending US entry by residents of seven countries for 90 days.\nIn March, Trump issued a second “travel ban” order taking into account some of the objections to the first.\nI don’t blame anyone for being disgusted with Trump’s rhetoric.\nTrump doesn’t help by referring to his executive orders as a “ban” (so as to pretend he’s fulfilled that promise).\nAnd they give Trump and his boosters one more reason to screech that the courts are biased against him."}