{"url": "http://nypost.com/2017/06/13/trump-rips-appeals-court-and-media-in-morning-tweetstorm/", "id": "14", "title": "Trump rips appeals court after latest travel ban ruling", "text": "President Trump unleashed a tweetstorm on Tuesday morning blasting the federal court that ruled against his travel ban and railing at the “Fake News Media” for publishing “phony stories.”\n\n“Well, as predicted, the 9th Circuit did it again – Ruled against the TRAVEL BAN at such a dangerous time in the history of our country. S.C.,” Trump posted on the social messaging site. The initials at the end of the tweet stand for Supreme Court.\n\nThe Ninth Circuit Court of Appeals on Monday ruled unanimously that the order restricting travel from six mainly Muslim countries “exceeded the scope of the authority delegated to him by Congress.”\n\nThe three-judge panel said, “Immigration, even for the President, is not a one-person show.”\n\nThe court, based in San Francisco, also cited Trump’s tweets about the need for “extreme vetting” as part of its decision not to reinstate the ban.\n\nThe White House has appealed a similar ruling from the Fourth Circuit Court in Richmond, Va., last month to the Supreme Court.\n\nTrump also called out the media in a tweet, but it’s unclear exactly what stories he was addressing.\n\n“The Fake News Media has never been so wrong or so dirty. Purposely incorrect stories and phony sources to meet their agenda of hate. Sad!,” the president wrote.", "authors": ["June"], "publish_date": "2017-06-13", "source": "nypost", "top_words": ["ruling", "travel", "trump", "ban", "appeals", "circuit", "ruled", "supreme", "court", "phony", "media", "fake", "latest", "president", "rips"], "summary": "President Trump unleashed a tweetstorm on Tuesday morning blasting the federal court that ruled against his travel ban and railing at the “Fake News Media” for publishing “phony stories.”“Well, as predicted, the 9th Circuit did it again – Ruled against the TRAVEL BAN at such a dangerous time in the history of our country.\nThe initials at the end of the tweet stand for Supreme Court.\nThe White House has appealed a similar ruling from the Fourth Circuit Court in Richmond, Va., last month to the Supreme Court.\nTrump also called out the media in a tweet, but it’s unclear exactly what stories he was addressing.\n“The Fake News Media has never been so wrong or so dirty."}