{"url": "http://nypost.com/2017/06/28/us-issues-new-visa-criteria-for-6-muslim-nations/", "id": "123", "title": "US issues new visa criteria for 6 Muslim nations", "text": "The Trump administration on Wednesday set new criteria for visa applicants from six mainly Muslim nations and all refugees that require a “close” family or business tie to the United States. The move came after the Supreme Court partially restored President Donald Trump’s executive order that was widely criticized as a ban on Muslims.\n\nVisas that have already been approved will not be revoked, but instructions issued by the State Department say that new applicants from Syria, Sudan, Somalia, Libya, Iran and Yemen must prove a relationship with a parent, spouse, child, adult son or daughter, son-in-law, daughter-in-law or sibling already in the United States to be eligible. The same requirement, with some exceptions, holds for would-be refugees from all nations who are still awaiting approval for admission to the US.\n\nGrandparents, grandchildren, aunts, uncles, nieces, nephews, cousins, brothers-in-law and sisters-in-law, fiancees or other extended family members are not considered to be close relationships, according to the guidelines that were issued in a cable sent to all U.S. embassies and consulates late Wednesday. The new rules take effect at 8 p.m. EDT Thursday, according to the cable, which was obtained by the Associated Press.\n\nAs far as business or professional links are concerned, the State Department said a legitimate relationship must be “formal, documented and formed in the ordinary course rather than for the purpose of evading” the ban. Journalists, students, workers or lecturers who have valid invitations or employment contracts in the US would be exempt from the ban. The exemption does not apply to those who seek a relationship with an American business or educational institution purely for the purpose of avoiding the rules, the cable said. A hotel reservation or car rental contract, even if it was pre-paid, would also not count, it said.\n\nConsular officers may grant other exemptions to applicants from the six nations if they have “previously established significant contacts with the United States”; “significant business or professional obligations” in the US; if they are an infant, adopted child or in need of urgent medical care; if they are traveling for business with a recognized international organization or the US government; or if they are a legal resident of Canada who applies for a visa in Canada, according to the cable.\n\nCritics said they are watching closely to see how the guidelines are used.\n\n“Initial reports suggest that the government may try to unilaterally expand the scope of the ban — for example, by arbitrarily refusing to treat certain categories of familial relationships as ‘bona fide.’ These reports are deeply concerning. We are watching for official word,” said Omar Jadwat, director of the ACLU’s Immigrants’ Rights Project.\n\nOn Monday, the Supreme Court partially lifted lower court injunctions against Trump’s executive order that had temporarily banned visas for citizens of the six countries. The justices’ ruling exempted applicants from the ban if they could prove a “bona fide relationship” with a US person or entity, but the court offered only broad guidelines — suggesting they would include a relative, job offer or invitation to lecture in the US — as to how that should be defined.\n\nSenior officials from the departments of State, Justice and Homeland Security had labored since the decision to clarify the ruling and Wednesday’s instructions were the result. The new guidance will remain in place until the Supreme Court issues a final ruling on the matter. Arguments before the justices will not be held until at least October, so the interim rules will remain in place at least until the fall.\n\nShortly after taking office, Trump ordered the refugee ban and a travel ban affecting the six countries, plus Iraq. He said it was needed to protect the US from terrorists, but opponents said it was unfairly harsh and was intended to meet his campaign promise to keep Muslims out of the United States.\n\nAfter a federal judge struck down the bans, Trump signed a revised order intended to overcome legal hurdles. That also was struck down by lower courts, but the Supreme Court’s action Monday partially reinstated it.\n\nThe initial travel ban led to chaos at airports around the world, but because the guidelines exempt previously issued visas, similar problems are not expected. After a judge blocked the original ban, Trump issued a scaled-down order and the court’s action Monday further reduced the number of people who would be covered by it. Also, while the initial order took effect immediately, adding to the confusion, this one was delayed 72 hours after the court’s ruling.\n\nUnder the new rules, would-be immigrants from the six countries who won a coveted visa in the government’s diversity lottery — a program that randomly awards 50,000 green cards annually to people from countries with low rates of immigration to the United States — will also have to prove they have a “bona fide relationship” in the US or are eligible for another waiver or face being banned for at least 90 days. That hurdle may be a difficult one for those immigrants to overcome, as many visa lottery winners don’t have relatives in the US or jobs in advance of arriving in the country.\n\nGenerally, winners in the diversity lottery only need prove they were born in an eligible county and have completed high school or have at least two years of work experience in an occupation that requires at least two other years of training or experience.", "authors": ["Associated Press", "June"], "publish_date": "2017-06-28", "source": "nypost", "top_words": ["relationship", "trump", "ban", "supreme", "issues", "order", "court", "criteria", "united", "states", "nations", "muslim", "business", "visa"], "summary": "The Trump administration on Wednesday set new criteria for visa applicants from six mainly Muslim nations and all refugees that require a “close” family or business tie to the United States.\nThe move came after the Supreme Court partially restored President Donald Trump’s executive order that was widely criticized as a ban on Muslims.\nThe same requirement, with some exceptions, holds for would-be refugees from all nations who are still awaiting approval for admission to the US.\nOn Monday, the Supreme Court partially lifted lower court injunctions against Trump’s executive order that had temporarily banned visas for citizens of the six countries.\nThe new guidance will remain in place until the Supreme Court issues a final ruling on the matter."}