{"url": "http://nypost.com/2017/05/10/first-lawsuit-against-trumps-travel-ban-is-wrapping-up/", "id": "192", "title": "First lawsuit against Trump’s travel ban is wrapping up", "text": "The first ​law​suit challenging President Trump’s original travel ban could be nearing a settlement, according to court documents.\n\nThe​ many attorneys on the case discussed settlement efforts behind closed doors with Brooklyn federal court judge Carol Bagley Amon Wednesday.\n\nThey mutually agreed to continue discussions in open court before Magistrate Lois Bloom on May 26.\n\nThe proposed class action, filed in January, was the initial legal response to the Trump ​a​dministration’s executive order banning travel from even Muslim-majority countries. It was filed on behalf of Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi, who were detained at JFK amid the chaos of the first ban.\n\nMore than 700 foreign nationals were detained for questioning nation-wide following the controversial order, according to the ACLU.\n\nWhile Brooklyn’s federal court case battling Trump’s original travel ban may be drawing to a close, other district courts across the country continue to battle the legality of his revised ban, which went into effect in March.", "authors": ["May"], "publish_date": "2017-05-10", "source": "nypost", "top_words": ["original", "travel", "settlement", "ban", "court", "filed", "trumps", "federal", "lawsuit", "order", "wrapping", "detained"], "summary": "The first ​law​suit challenging President Trump’s original travel ban could be nearing a settlement, according to court documents.\nThe​ many attorneys on the case discussed settlement efforts behind closed doors with Brooklyn federal court judge Carol Bagley Amon Wednesday.\nThe proposed class action, filed in January, was the initial legal response to the Trump ​a​dministration’s executive order banning travel from even Muslim-majority countries.\nIt was filed on behalf of Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi, who were detained at JFK amid the chaos of the first ban.\nWhile Brooklyn’s federal court case battling Trump’s original travel ban may be drawing to a close, other district courts across the country continue to battle the legality of his revised ban, which went into effect in March."}