{"url": "http://nypost.com/2017/01/29/trump-defends-immigration-ban-calls-the-world-a-horrible-mess/", "id": "118", "title": "Trump defends immigration ban, calls the world ‘a horrible mess’", "text": "The Commander-in-Tweet unleashed his typical Sunday morning social media tirade — this time, defending his controversial executive actions on immigration and slamming the “failing” New York Times.\n\nPresident Trump insisted that his push for a Mexican wall and a travel ban for seven Muslim-majority nations was necessary following public outcries and protests across the country.\n\n“Our country needs strong borders and extreme vetting, NOW. Look what is happening all over Europe and, indeed, the world – a horrible mess!” Trump fired off just after 8 a.m.\n\nHe later added, “Christians in the Middle-East have been executed in large numbers. We cannot allow this horror to continue!”\n\nThe tweet came hours after federal judges in both Brooklyn and Boston temporarily blocked parts of Trump’s executive order, which he issued Friday.\n\nThe presidential directive bars immigrants from Iraq, Iran, Yemen, Somalia, Sudan, Libya and Syria from entering the country as well as stymieing refugees from coming to the Land of the Free for three months. It also indefinitely blocks Syrian refugees.\n\nBut the judge’s decisions meant that dozens of legal immigrants that were taken into custody at major airports across the country over the weekend could be released as long as they held valid visas or green cards.\n\nTrump also tore into The New York Times again.\n\n“Somebody with aptitude and conviction should buy the FAKE NEWS and failing @nytimes and either run it correctly or let it fold with dignity!” he wrote.", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["executive", "wrote", "world", "trump", "judges", "ban", "immigrants", "immigration", "failing", "yemen", "mess", "calls", "country", "defends", "york", "horrible"], "summary": "The Commander-in-Tweet unleashed his typical Sunday morning social media tirade — this time, defending his controversial executive actions on immigration and slamming the “failing” New York Times.\nPresident Trump insisted that his push for a Mexican wall and a travel ban for seven Muslim-majority nations was necessary following public outcries and protests across the country.\nLook what is happening all over Europe and, indeed, the world – a horrible mess!” Trump fired off just after 8 a.m.\nTrump also tore into The New York Times again.\n“Somebody with aptitude and conviction should buy the FAKE NEWS and failing @nytimes and either run it correctly or let it fold with dignity!” he wrote."}