{"url": "http://nypost.com/2017/01/30/brooklyn-doctor-cuny-student-among-stranded-after-travel-ban/", "id": "127", "title": "Brooklyn doctor, CUNY student left stranded after travel ban", "text": "A Brooklyn doctor and a CUNY student on Monday were unable to return to work and school under President Trump’s travel ban after visiting their homelands.\n\nDr. Kamal Fadlalla, a second-year resident at Interfaith Medical Center in Crown Heights, left the US for his home of Sudan on Jan. 13 for the first time since starting his residency and planned to remain with his family through February.\n\nHe decided to cut the trip short after Trump took office, but got stuck after an officer stopped him from boarding his flight back to the US.\n\n“My colleagues are going to be affected. My hospital is going to be affected. And for sure, my patients are going to be affected,” Fadlalla said Monday.\n\nMeanwhile, protesters rallied in Brooklyn to blast the barring of another stranded traveler, an Iranian CUNY grad student.\n\nSaira Rafiee, a political-science Ph.D. candidate, was returning from vacation when she found herself marooned in the United Arab Emirates.\n\n“I got on the flight to Abu Dhabi, but there at the airport was told that I would not be able to enter the US,” she wrote on Facebook. “I had to stay there for nearly 18 hours, along with 18 other Iranians, before getting on the flight back to Tehran.”\n\nHer supporters gathered in front of Brooklyn federal court Monday to demand her return.\n\n“Let Saira back to school!” they chanted.\n\nCUNY officials said that roughly 120 of their students were affected by the ban and that they are working to secure their swift return.", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["doctor", "travel", "return", "ban", "affected", "18", "brooklyn", "stranded", "going", "flight", "school", "left", "student", "fadlalla", "cuny"], "summary": "A Brooklyn doctor and a CUNY student on Monday were unable to return to work and school under President Trump’s travel ban after visiting their homelands.\nAnd for sure, my patients are going to be affected,” Fadlalla said Monday.\nMeanwhile, protesters rallied in Brooklyn to blast the barring of another stranded traveler, an Iranian CUNY grad student.\nSaira Rafiee, a political-science Ph.D. candidate, was returning from vacation when she found herself marooned in the United Arab Emirates.\nCUNY officials said that roughly 120 of their students were affected by the ban and that they are working to secure their swift return."}