{"url": "http://nypost.com/2017/01/30/trump-mccain-and-graham-are-trying-to-start-world-war-iii/", "id": "161", "title": "Trump: McCain and Graham are trying to start ‘World War III’", "text": "Republican Sens. John McCain and Lindsey Graham blasted President Trump on Sunday — issuing the first GOP statement condemning his Muslim ban on travel to the United States in a tag-team assault that later sparked tweets of “World War III” from the president.\n\nsee also Politicians worldwide come out against Trump’s travel ban Battle lines were drawn Sunday as Republican and Democratic lawmakers...\n\n“Our government has a responsibility to defend our borders, but we must do so in a way that makes us safer and upholds all that is decent and exceptional about our nation,” the senators said in a statement.\n\nMcCain (R-Ariz.) and Graham (R-SC) added that Trump’s executive order ultimately “may do more to help terrorist recruitment than improve our security.”\n\n“We fear this executive order will become a self-inflicted wound in the fight against terrorism,” the pair said. “This executive order bans Iraqi pilots from coming to military bases in Arizona to fight our common enemies. Our most important allies in the fight against ISIL [ISIS] are the vast majority of Muslims who reject its apocalyptic ideology of hatred. This executive order sends a signal, intended or not, that America does not want Muslims coming into our country. That is why we fear this executive order may do more to help terrorist recruitment than improve our security.”\n\nTrump took to Twitter.\n\n“The joint statement of former presidential candidates John McCain & Lindsey Graham is wrong,” the president tweeted. “The two . . . Senators should focus their energies on ISIS, illegal immigration and border security instead of always looking to start World War III.”", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["executive", "travel", "world", "trump", "fight", "statement", "terrorist", "mccain", "iii", "trumps", "war", "graham", "order", "start", "trying"], "summary": "John McCain and Lindsey Graham blasted President Trump on Sunday — issuing the first GOP statement condemning his Muslim ban on travel to the United States in a tag-team assault that later sparked tweets of “World War III” from the president.\n“This executive order bans Iraqi pilots from coming to military bases in Arizona to fight our common enemies.\nThis executive order sends a signal, intended or not, that America does not want Muslims coming into our country.\nThat is why we fear this executive order may do more to help terrorist recruitment than improve our security.”Trump took to Twitter.\nSenators should focus their energies on ISIS, illegal immigration and border security instead of always looking to start World War III.”"}