{"url": "http://nypost.com/2017/03/07/hawaii-to-challenge-new-travel-ban-in-court/", "id": "126", "title": "Hawaii to challenge new travel ban in court", "text": "HONOLULU — Hawaii plans to challenge President Donald Trump’s revised travel ban, Attorney General Doug Chin said Tuesday.\n\nThe state wants to amend its existing lawsuit challenging Trump’s previous order to contest the revised one, according to a motion filed Tuesday in federal court in Honolulu.\n\nThe new order bars new visas for people from six Muslim-majority countries and temporarily shuts down America’s refugee program, affecting would-be visitors and immigrants from Iran, Syria, Somalia, Sudan, Yemen and Libya.\n\nHawaii’s lawsuit had been on hold while a nationwide injunction on the initial ban remained in place.\n\nThis is the second time Hawaii has asked a judge to lift the stay in order to file an amended lawsuit.\n\nLast month, U.S. District Court Judge Derrick Watson in Honolulu allowed the state to file an amended\n\nlawsuit adding the Muslim Association of Hawaii’s imam as a plaintiff. The mother-in-law of Imam Ismail Elshikh is a Syrian national living in Syria, according to the lawsuit that details the effect the ban would have had on Elshikh’s family and others in Hawaii.\n\nAccording to the motion, attorneys for the government had no position on the request to file another amended lawsuit.\n\nHawaii plans to file its amended lawsuit and a motion for a temporary restraining order on Wednesday.\n\nTuesday’s motion proposes a hearing on March 15, a day before the revised ban goes into effect.\n\nHawaii has hired a Washington, D.C., law firm to help. Josh Wisch, a spokesman for the attorney general’s office, said last month the firm is giving the state a 50 percent discount.\n\n“This new executive order is nothing more than Muslim Ban 2.0,” Chin said in a statement Monday. “Under the pretense of national security, it still targets immigrants and refugees. It leaves the door open for even further restrictions.”", "authors": ["Associated Press", "March"], "publish_date": "2017-03-07", "source": "nypost", "top_words": ["travel", "file", "hawaii", "revised", "amended", "ban", "challenge", "state", "court", "trumps", "syria", "lawsuit", "order", "motion"], "summary": "HONOLULU — Hawaii plans to challenge President Donald Trump’s revised travel ban, Attorney General Doug Chin said Tuesday.\nThis is the second time Hawaii has asked a judge to lift the stay in order to file an amended lawsuit.\nAccording to the motion, attorneys for the government had no position on the request to file another amended lawsuit.\nHawaii plans to file its amended lawsuit and a motion for a temporary restraining order on Wednesday.\nTuesday’s motion proposes a hearing on March 15, a day before the revised ban goes into effect."}