{"url": "http://nypost.com/2017/06/01/trump-asks-supreme-court-to-reinstate-travel-ban/", "id": "19", "title": "Trump asks Supreme Court to reinstate travel ban", "text": "see also Appeals court refuses to reinstate Trump's travel ban A federal appeals court in Virginia on Thursday upheld a...\n\nWASHINGTON — The Trump administration is asking the Supreme Court to reinstate its ban on travelers from six mostly Muslim countries.\n\nThe Justice Department filing to the high court late Thursday argues that the federal appeals court in Richmond, Virginia, made several mistakes in ruling against the Trump travel policy. The government says the nation will be safer if the policy is put in place.\n\nDepartment spokeswoman Sarah Isgur Flores says the ban is lawful.\n\nImmigration officials would have 90 days to decide what changes are necessary before people from Iran, Libya, Somalia, Sudan, Syria and Yemen may resume applying for visas.\n\nThe 4th U.S. Circuit Court of Appeals called the national security concerns an after-the-fact justification for a policy that was “intended to bar Muslims from this country.”", "authors": ["Associated Press", "June"], "publish_date": "2017-06-01", "source": "nypost", "top_words": ["travel", "trump", "yemen", "ban", "supreme", "asks", "appeals", "virginia", "court", "reinstate", "federal", "policy"], "summary": "see also Appeals court refuses to reinstate Trump's travel ban A federal appeals court in Virginia on Thursday upheld a...WASHINGTON — The Trump administration is asking the Supreme Court to reinstate its ban on travelers from six mostly Muslim countries.\nThe Justice Department filing to the high court late Thursday argues that the federal appeals court in Richmond, Virginia, made several mistakes in ruling against the Trump travel policy.\nThe government says the nation will be safer if the policy is put in place.\nDepartment spokeswoman Sarah Isgur Flores says the ban is lawful.\nCircuit Court of Appeals called the national security concerns an after-the-fact justification for a policy that was “intended to bar Muslims from this country.”"}