{"url": "http://nypost.com/2017/09/22/trump-revises-travel-ban-restrictions/", "id": "1", "title": "Trump revises travel ban restrictions", "text": "The Trump administration’s travel ban for six majority-Muslim countries will be replaced with narrower restrictions on who can visit the US that will differ by country, according to a new report Friday.\n\nThe revised restrictions, which could go into effect as early as Sunday, would specifically focus on preventing those considered security threats from entering the country, the New York Times reported.\n\nThe changes come after a 90-day review of Team Trump’s original policy.\n\nAdministration officials told the paper that the Department of Homeland Security identified more than six countries that weren’t properly screening potential terrorists.\n\nUS officials alerted those countries that traveling to the States could be even more severely curtailed if they didn’t beef up those standards.\n\nIt was unclear which countries could be targeted under the new restrictions or how many would be affected.\n\n“The Trump administration will ensure that the people who travel to the United States are properly vetted and those that don’t belong here aren’t allowed to enter,” Jonathan Hoffman, assistant secretary for public affairs at the department, told the Times.\n\nTrump called for tougher measures after the latest terrorist attack in London.\n\n“The travel ban into the United States should be far larger, tougher and more specific,” he tweeted last Friday.\n\nThe original ban blocked all travel to the US by refugees and nationals from seven countries: Iraq, Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nIraq later was taken off the banned list after improving security procedures.\n\nThe changes could affect the Supreme Court case pending on whether the ban passes legal muster.\n\nOral arguments are scheduled to begin Oct. 10.", "authors": ["September"], "publish_date": "2017-09-22", "source": "nypost", "top_words": ["travel", "restrictions", "trump", "ban", "security", "told", "united", "revises", "countries", "tougher", "states"], "summary": "The Trump administration’s travel ban for six majority-Muslim countries will be replaced with narrower restrictions on who can visit the US that will differ by country, according to a new report Friday.\nIt was unclear which countries could be targeted under the new restrictions or how many would be affected.\n“The travel ban into the United States should be far larger, tougher and more specific,” he tweeted last Friday.\nThe original ban blocked all travel to the US by refugees and nationals from seven countries: Iraq, Iran, Libya, Somalia, Sudan, Syria and Yemen.\nThe changes could affect the Supreme Court case pending on whether the ban passes legal muster."}