{"url": "http://nypost.com/2017/01/28/muslim-ex-knick-after-trump-ban-today-i-found-out-im-hated/", "id": "121", "title": "Muslim ex-Knick after Trump ban: Today I found out I’m hated", "text": "The refugee ban that President Donald Trump signed Friday echoed around the NBA, from questions about whether the immigration order would extend to current players to concerns about how Muslims are viewed in the U.S.\n\nMilwaukee’s Thon Maker was born in what today is South Sudan, but was accepted as a refugee in Australia to escape war. He played in Toronto on Friday as the bill was being signed. According to Alex Lasry, the team’s vice president, Maker was able to leave Canada and is safely back in the U.S. But what the halt of immigrants’ visas — even those with dual citizenship from other countries — will mean for players such as Maker still is unknown.\n\nFor Nazr Mohammed, the executive order is less a direct threat on his livelihood and more a statement on how some view his religion. The countries from which Trump suspended entry are Syria, Iran, Iraq, Somalia, Libya, Sudan and Yemen — all predominantly Muslim.\n\n“It’s a tough day when u find out that so many ppl that u thought were fans or friends really hate u and everything u believe in,” Mohammed, an 18-year NBA veteran who retired following last season, tweeted Saturday afternoon.\n\nMohammed, a practicing Muslim, was born in Chicago to a father from Ghana. The center enjoyed a well-traveled and lengthy NBA career, which included a stint with the Knicks in 2004-05.\n\nOn Thursday, Mohammed took a not-so-veiled swipe at Trump’s plan for a wall along the U.S.-Mexico border.", "authors": ["January"], "publish_date": "2017-01-28", "source": "nypost", "top_words": ["trump", "ban", "hated", "mohammed", "nba", "refugee", "players", "maker", "order", "exknick", "president", "signed", "im", "today", "muslim", "sudan"], "summary": "According to Alex Lasry, the team’s vice president, Maker was able to leave Canada and is safely back in the U.S.\nBut what the halt of immigrants’ visas — even those with dual citizenship from other countries — will mean for players such as Maker still is unknown.\nFor Nazr Mohammed, the executive order is less a direct threat on his livelihood and more a statement on how some view his religion.\nThe countries from which Trump suspended entry are Syria, Iran, Iraq, Somalia, Libya, Sudan and Yemen — all predominantly Muslim.\nOn Thursday, Mohammed took a not-so-veiled swipe at Trump’s plan for a wall along the U.S.-Mexico border."}