{"url": "http://nypost.com/2017/06/26/a-supreme-win-for-trump-and-the-rule-of-law/", "id": "178", "title": "A Supreme win for Trump and the rule of law", "text": "The Supreme Court handed a big victory to President Trump and the rule of law Monday, unanimously striking down over-the-top rulings against his travel ban by two US courts of appeals.\n\nThe rulings by Ninth and Fourth Circuit judges had blocked Trump from barring entry to America by people from six majority-Muslim nations (for 90 days) and refugees (for 120 days) while the administration reviewed procedures to vet them.\n\nMost important, the high court plainly doesn’t buy the idea that the travel bans are just efforts to make good on Trump’s talk of a “Muslim ban” early in the 2016 campaign.\n\nThe president says this is an effort to prevent terror attacks on US soil, and the courts are obliged to take him at his word — not venture into speculative mind-reading in search of “bias.” Especially since the law and the Constitution grant the chief executive extremely wide discretion over legal entry into the United States.\n\nThe leaps of imagination got so extreme that one Hawaii judge had actually stopped the administration’s review of vetting procedures. (That’s why Team Trump hasn’t issued the new rules, though it’s more than 120 days since it issued the temporary bans: An appeals court only junked that part of the initial injunction recently.)\n\nSo why are the Supremes forcing Trump to admit folks with ties to people already here? Part of it is that the ruling addressed only the lower courts’ injunctions — and so paid extra heed to possible “hardships” for US citizens, etc., who’d host the travelers.\n\nYet, since “preserving national security is ‘an urgent objective,’ ” the court said, blocking the ban against people with no ties to America would “injure” US interests “without alleviating” hardship to any Americans.\n\nThat said, judges typically strike down injunctions only when they think it highly likely they’ll rule that way after a full hearing and argument, which strongly suggests Trump will see a full triumph later this year.\n\nTechnically, the case could become moot — because the administration should finish its review and issue final rules before the high court hears the actual case in October.\n\nBut that will only trigger fresh litigation that will still wind up with the Supremes — since the left won’t let Trump do anything.", "authors": ["Post Editorial Board", "June"], "publish_date": "2017-06-26", "source": "nypost", "top_words": ["travel", "rulings", "courts", "trump", "supremes", "ban", "supreme", "days", "win", "rules", "court", "rule", "ties", "law"], "summary": "The Supreme Court handed a big victory to President Trump and the rule of law Monday, unanimously striking down over-the-top rulings against his travel ban by two US courts of appeals.\nThe leaps of imagination got so extreme that one Hawaii judge had actually stopped the administration’s review of vetting procedures.\nSo why are the Supremes forcing Trump to admit folks with ties to people already here?\nTechnically, the case could become moot — because the administration should finish its review and issue final rules before the high court hears the actual case in October.\nBut that will only trigger fresh litigation that will still wind up with the Supremes — since the left won’t let Trump do anything."}