{"url": "http://nypost.com/2017/02/14/trump-trudeau-manage-to-find-common-ground-on-a-host-of-issues/", "id": "130", "title": "Trump, Trudeau manage to find common ground on a host of issues", "text": "Despite their striking differences on immigration policy, President Trump and Canadian Prime Minister Justin Trudeau found common ground Monday on a broad range of issues, from trade to creating more opportunities for women in business.\n\nAt a joint press conference after their meeting at the White House, Trudeau took the high road when asked about Trump’s proposed travel ban.\n\n“Canada and the United States have been neighbors a long time. And Canadians and Americans have stood together, worked together, at home and around the world. We have fought and died together,” said Trudeau, a staunch liberal whose nation has taken in 40,000 Syrian refugees.\n\n“But there have been times where we have differed in our approaches,” he continued. “The last thing Canadians expect is for me to come down and lecture another country on how they choose to govern themselves. Our responsibility is to continue to govern in such a way that reflects Canadians’ approach and be a positive example in the world.”\n\nTrump’s plan to temporarily ban all refugees as well as immigration from seven Muslim-majority nations remains tied up in federal courts.\n\nTrudeau has panned the ban and welcomed refugees fleeing Syria’s devastating civil war.\n\nTrump defended the ban, declaring that he was fulfilling a campaign promise while boasting again about the size of his victory.\n\n“I’m just doing what I said I would do when we won by a very, very large Electoral College vote,” the president said.\n\n“And I said we will get the criminals out, the drug lords, the gang members. We are getting them out,” he added, referring to the arrest in recent days of more than 680 illegal immigrants.\n\nTrump reassured Trudeau over NAFTA, which Trump repeatedly ripped on the campaign trail, saying his focus was primarily on Mexico. The trade agreement is crucial for Canada, since more than 75 percent of its exports come to the United States, while only 18 percent of American exports go north of the border.\n\n“We have a very outstanding trade relationship with Canada,” Trump said. “We will be tweaking it. We will be doing certain things that are going to benefit both of our countries.”\n\nIn a joint statement, the pair noted that more than $2 billion in trade crossed the border every day. Both leaders also pledged to invest in infrastructure and cooperate on energy development.\n\n“As the process continues for the Keystone XL pipeline, we remain committed to moving forward on energy infrastructure projects that will create jobs while respecting the environment,” the statement said.\n\nThe statement also mentioned the importance of beefing up border security and said the two nations will step up efforts to stop opioid trafficking.\n\nThe leaders also agreed to boost efforts to strengthen the roles of women in the business community.\n\n“As part of this effort, we are creating a United States-Canada Council for Advancement of Women Entrepreneurs and Business Leaders,” read the statement, which was issued after a White House meeting with female executives, including the president’s daughter Ivanka.", "authors": ["February"], "publish_date": "2017-02-14", "source": "nypost", "top_words": ["host", "women", "trump", "manage", "trade", "issues", "ban", "statement", "united", "trudeau", "leaders", "white", "ground", "canadians", "common"], "summary": "Despite their striking differences on immigration policy, President Trump and Canadian Prime Minister Justin Trudeau found common ground Monday on a broad range of issues, from trade to creating more opportunities for women in business.\nAt a joint press conference after their meeting at the White House, Trudeau took the high road when asked about Trump’s proposed travel ban.\nWe have fought and died together,” said Trudeau, a staunch liberal whose nation has taken in 40,000 Syrian refugees.\nTrump defended the ban, declaring that he was fulfilling a campaign promise while boasting again about the size of his victory.\nTrump reassured Trudeau over NAFTA, which Trump repeatedly ripped on the campaign trail, saying his focus was primarily on Mexico."}