{"url": "http://nypost.com/2017/02/05/travelers-scramble-to-us-before-trumps-ban-is-reinstated/", "id": "109", "title": "Visa holders scramble to US before Trump’s ban is reinstated", "text": "The race is on for travelers from seven predominantly Muslim countries to reach the United States before President Trump seeks to appeal a judge’s order restoring their visas.\n\nAdding to the traveler tension was a notice filed by the Department of Justice, promising that an appeal would be made Saturday night.\n\nThe appeal would be filed with the Ninth Circuit Court in Washington state, where a Seattle federal judge on Friday temporarily halted Trump’s executive order suspending America’s refugee program and halting immigration to the United States of citizens from seven Muslim-majority countries.\n\n“If you are attempting to travel to the US on a valid visa, you should attempt to get on a plane as soon as possible,” the Urban Justice Center advised travelers.\n\nPeople headed to America from Iraq, Iran, Libya, Somalia, Sudan, Syria and Yemen flocked to airports early Saturday in hope of following their US-bound itineraries.\n\nThey were hoping to get across the Atlantic Ocean before any federal judge reinstates Trump’s travel ban.\n\nTrump tapped out a series of tweets Saturday against Seattle federal Judge James Robart, who reversed the ban at the behest of attorneys general in Washington state and Minnesota.\n\n“The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!” the president wrote in an 8:12 a.m. tweet.\n\nEvidently still fum­ing late Saturday afternoon, Trump tweeted again.\n\n“What is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.?” he wrote at 3:44 p.m.\n\n“Because the ban was lifted by a judge, many very bad and dangerous people may be pouring into our country. A terrible decision,” the president tweeted at 4:44 p.m.\n\nThe White House promised an emergency appeal of Robart’s order but had not done so as of late Saturday. It said he was readying one.\n\nThose rushing to finish their travel plans before the appeal was filed was Fordham University law student Farimah Kashkooli, 33, whose ailing daughter was trapped in Tehran, Iran, by Trump’s order.\n\nAlma Kashkooli, 11, who can barely talk or walk and is prone to seizures, was set to undergo eye surgery and other lifesaving procedures in Pittsburgh last week.\n\nMom Farimah Kashkooli had feared that leaving New York to retrieve her daughter would leave her stuck overseas, unable to return.\n\nBut Saturday, she revived her plans. A relative planned to bring the girl to Istanbul, from where Kaskhooli would bring her to New York. She hopes to be back in the United States by Tuesday, before any further legal action is taken on the issue.\n\n“We’re just keeping our fingers crossed and wishing for the best and hoping time is on our side,” said her lawyer, Shaimaa Hussein.\n\nThe visas of about 60,000 foreigners were “provisionally revoked” to comply with Trump’s order. The Jan. 27 order also stopped the processing of refugees from Syria.\n\nWith his ruling Friday, Robart, who was appointed by President George W. Bush in 2004, cleared nearly all those visa holders to travel.\n\nOn Saturday, officials in the State and Homeland Security departments put Robart’s order into effect.\n\nDubai-based Emirates Airline allowed those whose visas were restored to board its US-bound flights. Its main rivals, Qatar Airways and Abu Dhabi-based Etihad Airways, issued similar instructions.\n\nIraqi Airways flights from Baghdad to Istanbul, Cairo and Dubai were booked solid Saturday afternoon, said an airline official. Many of those on the flights are headed to the United States, the official said.\n\nIbrahim Bahr Uloom, a member of Iraq’s parliament, praised ­Robart.\n\n“The US justice system is better than Iraqi diplomacy,” Uloom said. “Today we thank the American judiciary.”\n\nSome airlines warned customers to hurry up. Germany’s Luft­hansa warned that US rules could change “at any time.”\n\nYemeni citizens in Djibouti, a country on the Horn of Africa, were not initially allowed to fly to the United States, according to a report. Also, a group of 140\n\nSomali refugees whose American resettlement was blocked by the travel ban were sent back to their refugee camp in Kenya.\n\nYemeni national Ammar Alnajjar, a green-card holder who attends Southwest Tennesee Community College in Memphis, was visiting his fiancée in Uzbekistan when the judge overturned Trump’s order.\n\nAlnajjar paid $1,000 to return as soon as possible. He arrived at JFK Airport Saturday aboard a Turkish Airlines flight. Officials held him for an hour and checked his phone and e-mail.\n\n“I got to study. I got to do some work,” said Alnajjar, who said he fled civil war in Yemen and moved to the United States from Turkey in 2015. “I’m Muslim. I’m proud of it. ‘Islam’ means peace.”\n\nIranians were allowed on US-bound flights, and by midday, some had made it to Boston’s Logan Airport.\n\n“People are being allowed to board from Tehran,” Sirine Shebaya, a lawyer representing Washington, DC-bound travelers, told The Washington Post.\n\nTrump, on a weekend retreat in Palm Beach, Fla., said Robart’s ­order endangers America.\n\n“When a country is no longer able to say who can, and who cannot, come in & out, especially for reasons of safety & security — big trouble!” he tweeted at 7:59 a.m.\n\n“Interesting that certain Middle-Eastern countries agree with the ban. They know if certain people are allowed in it’s death & destruction!” he said at 8:06 a.m.\n\nA former Iraqi official backed Trump’s sentiment.\n\n“For the first time we have an American president that speaks about these countries and tells the truth about what they are really like,” Kamran Karadaghi, a former chief-of-staff to the Iraqi president, told The Sunday Times of London.\n\nThe stage was set for Robart’s decision when Washington state and Minnesota sued the feds in Seattle last week, claiming Trump’s executive order was an “illegal” action that separated families and damaged the economy.\n\nIn his decision, Robart, 69, noted the importance of America’s three branches of government and the concept of separation of government powers.\n\nAdditional reporting by Mary Kay Linge, Isabel Vincent, Melissa Klein and Post Wire Services", "authors": ["February"], "publish_date": "2017-02-05", "source": "nypost", "top_words": ["travel", "ban", "holders", "scramble", "judge", "united", "states", "trumps", "president", "country", "order", "reinstated", "washington", "visa"], "summary": "They were hoping to get across the Atlantic Ocean before any federal judge reinstates Trump’s travel ban.\nShe hopes to be back in the United States by Tuesday, before any further legal action is taken on the issue.\nThe visas of about 60,000 foreigners were “provisionally revoked” to comply with Trump’s order.\nMany of those on the flights are headed to the United States, the official said.\nAlso, a group of 140Somali refugees whose American resettlement was blocked by the travel ban were sent back to their refugee camp in Kenya."}