{"url": "http://nypost.com/2017/02/26/democrats-invite-immigrants-and-refugees-to-trumps-first-address-to-congress/", "id": "137", "title": "Democrats invite immigrants and refugees to Trump’s first address to Congress", "text": "WASHINGTON – Democrats have invited immigrants, refugees and Muslim Americans to President Trump’s first address to Congress on Tuesday in a political statement against his immigration policies.\n\nMembers of Congress are taking full advantage of their one invite each for presidential speeches by filling their lists with guests who could be harmed by the White House policies or who have made significant contributions despite discrimination.\n\nRep. Nydia Velazquez (D-Brooklyn) invited Hameed Darweesh, an Iraqi refugee who was detained at Kennedy Airport in the chaos of Trump’s initial travel ban issued last month.\n\n“Hameed Darweesh risked his life in dangerous circumstances in Iraq, working alongside the U.S. government. Now that he’s relocated to our nation, his presence Tuesday will send a powerful message about America’s greatness and its diversity,” Velazquez said in a statement to The Post.\n\nHouse Democratic Leader Nancy Pelosi called the decision to bring people affected by the president’s policies “a normal thing to do.”\n\n“I, myself, would bring a guest who is a DREAMer. I would bring a guest who lost her son through gun violence,” Pelosi told ABC’s “This Week.” “And I’ll bring a guest who is a symbol of the freedom of the press, which the president, in his authoritarian manner, is attacking.”\n\nPelosi’s office said the name of her guest will be released on Tuesday.\n\nShe and Senate Democratic Leader Charles Schumer will deliver a pre-buttal to Trump’s speech Monday afternoon.\n\nRep. Dan Kildee (D-Mich.) is bringing Dr. Mona Hanna–Attisha, an Iraqi-American pediatrician who helped to expose the Flint water crisis.\n\nRep. Luis Gutiérrez (D-IL.) invited Fidaa Rashid, a Chicago immigration attorney whose parents were refugees from Gaza.\n\n“I want Trump to see the face of a woman, the face of a Muslim, and the face of someone whose family has enriched and contributed to this country despite starting out as refugees,”Gutiérrez said in statement. “Trump needs to know that real people are hurt by his policies.”", "authors": ["February"], "publish_date": "2017-02-26", "source": "nypost", "top_words": ["address", "invite", "congress", "policies", "immigrants", "trump", "bring", "velazquez", "democrats", "statement", "face", "trumps", "guest", "invited", "refugees"], "summary": "WASHINGTON – Democrats have invited immigrants, refugees and Muslim Americans to President Trump’s first address to Congress on Tuesday in a political statement against his immigration policies.\nRep. Nydia Velazquez (D-Brooklyn) invited Hameed Darweesh, an Iraqi refugee who was detained at Kennedy Airport in the chaos of Trump’s initial travel ban issued last month.\nShe and Senate Democratic Leader Charles Schumer will deliver a pre-buttal to Trump’s speech Monday afternoon.\nRep. Dan Kildee (D-Mich.) is bringing Dr. Mona Hanna–Attisha, an Iraqi-American pediatrician who helped to expose the Flint water crisis.\ninvited Fidaa Rashid, a Chicago immigration attorney whose parents were refugees from Gaza."}