{"url": "http://nypost.com/2017/07/18/grandparents-of-muslim-citizens-can-now-freely-enter-the-us/", "id": "167", "title": "Grandparents of Muslim citizens can now freely enter the US", "text": "Grandparents of American citizens from six Muslim-majority nations who had been banned from coming to the United States under President Trump’s travel ban have gotten the green light to book their flights.\n\nThe State Department sent a memo to US diplomatic posts overseas reflecting a federal court ruling last week modifying the ban.\n\nUS District Judge Derrick Watson in Honolulu found the government cannot bar grandparents and other relatives of US citizens from Iran, Libya, Somalia, Sudan, Syria and Yemen from getting visas under the ban.\n\nWatson declined to put his ruling on hold pending appeal, meaning it went into effect immediately.\n\nThe administration has asked the Supreme Court and the San Francisco-based 9th US Circuit Court of Appeals to block the decision.\n\nThe July 14 State Department cable updated the definition of “close family” exempt from the temporary travel ban in Trump’s March 6 executive order.\n\nThe memo altered the State Department’s narrow definition of close family and stated that “grandparents, grandchildren, brothers-in-law, sisters-in-law, aunts and uncles, nephews and nieces, and cousins” are eligible for visas.\n\nBetween March 10 and March 17, Secretary of State Rex Tillerson issued four cables, originally giving instructions on implementing the travel ban, then rescinding much of his guidance because of court rulings and because it had been issued without approval from the White House Office of Management and Budget.\n\nIn another reversal, the State Department had originally interpreted the Supreme Court’s June 26 ruling to exclude fiancés, saying that brides- and grooms-to-be do not count as a close family relationship eligible for an exemption to the ban.\n\nJust before the 90-day travel ban was to take effect on June 29, the State Department said fiancés would be counted as close family.\n\n“These guys [consular officers] have had enough whiplash over the past six, seven months but they continue to fulfill their role, which is to process visa applications,” said Stephen Pattison, a former State Department consular official now working as an immigration attorney.\n\nA State Department official declined to comment on internal communications.\n\nWith wires", "authors": ["July"], "publish_date": "2017-07-18", "source": "nypost", "top_words": ["ruling", "travel", "citizens", "ban", "enter", "state", "family", "court", "freely", "close", "trumps", "muslim", "department", "grandparents"], "summary": "Grandparents of American citizens from six Muslim-majority nations who had been banned from coming to the United States under President Trump’s travel ban have gotten the green light to book their flights.\nThe State Department sent a memo to US diplomatic posts overseas reflecting a federal court ruling last week modifying the ban.\nThe July 14 State Department cable updated the definition of “close family” exempt from the temporary travel ban in Trump’s March 6 executive order.\nJust before the 90-day travel ban was to take effect on June 29, the State Department said fiancés would be counted as close family.\nA State Department official declined to comment on internal communications."}