{"url": "http://nypost.com/2017/02/04/state-department-reverses-trumps-visa-ban/", "id": "101", "title": "State Department reverses Trump’s visa cancellations", "text": "The State Department on Saturday reversed President Trump’s cancellations of visas from seven predominately Muslim countries, in accord with a judge’s order that the cancellations were illegal.\n\nVisa holders impacted by Trump’s Jan. 27 executive order are now being allowed on US-bound flights. About 60,000 foreigners had their visas “provisionally revoked” to comply with the order.\n\nThe Department of Homeland Security — which runs border protection agencies — also said it would cease implementing the Jan. 27 executive order.\n\nOne Middle Eastern airline, Dubai-based Emirates, said it was allowing those whose visas have been restored to board its US-bound flights. Its main rivals, Qatar Airways and Abu Dhabi-based Etihad, issued similar instructions, according to the Associated Press.\n\nIraqi Airways flights from Baghdad to Istanbul, Cairo and Dubai were booked solid on Saturday afternoon, said an airline official. Many of those on the flights are headed to the US, the official said.\n\nIranians are also being allowed on US-bound flights. “People are being allowed to board from Tehran,” Sirine Shebaya, a civil rights attorney representing Iranian travelers from flying into Dulles airport in Washington, told The Washington Post.\n\nThe Trump administration had ordered a temporary stop on travelers coming to the US from seven predominantly Muslim nations: Iraq, Iraq, Libya, Somalia, Syra, Sudan and Yemen. The ban also indefinitely halted the processing of Syrian refugees.\n\nThe widely criticized travel ban caused chaos in the nation’s airports as hundreds of travelers in the air when the executive order was put into place were detained once they landed in American airports. In some cases, people were sent back to the countries they’d just left.\n\nPresident Trump took to Twitter to slam Seattle-based federal Judge James Robart on Twitter for overturning his ban. Trump vowed to seek reversal of Robart’s decision.", "authors": ["February"], "publish_date": "2017-02-04", "source": "nypost", "top_words": ["executive", "usbound", "trump", "allowed", "ban", "cancellations", "state", "visas", "travelers", "reverses", "trumps", "flights", "order", "department", "washington", "visa"], "summary": "The State Department on Saturday reversed President Trump’s cancellations of visas from seven predominately Muslim countries, in accord with a judge’s order that the cancellations were illegal.\nVisa holders impacted by Trump’s Jan. 27 executive order are now being allowed on US-bound flights.\nThe Department of Homeland Security — which runs border protection agencies — also said it would cease implementing the Jan. 27 executive order.\nOne Middle Eastern airline, Dubai-based Emirates, said it was allowing those whose visas have been restored to board its US-bound flights.\nIranians are also being allowed on US-bound flights."}