{"url": "http://nypost.com/2017/01/28/google-tells-staffers-to-return-to-us-amid-immigration-ban/", "id": "156", "title": "Google tells staffers to return to US amid immigration ban", "text": "Google ordered nearly 200 staffers traveling overseas who may be impacted by President Trump’s controversial immigration ban to return to the U.S. immediately.\n\nThe company asked them to reach out to Google’s security, travel, and immigration teams for assistance, according to a person familiar with the situation, Bloomberg News reported.\n\nGoogle declined to say Saturday whether any employees were detained or blocked from boarding flights.\n\nThe employees in question normally work in the U.S. but were abroad either on work assignments or vacations, Bloomberg said.\n\nGoogle Chief Executive Officer Sundar Pichai blasted Trump’s executive order in a note to employees.\n\n“It’s painful to see the personal cost of this executive order on our colleagues,” Pichai wrote. “We’ve always made our view on immigration issues known publicly and will continue to do so.”\n\nOne employee rushed back from a trip to New Zealand to make it into the U.S. before the order was signed, Pichai wrote in his memo.\n\nThe comments put a spotlight on a growing divide between the Trump administration and several large U.S. technology companies, which include many immigrants in their ranks and have lobbied for fewer immigration restrictions.", "authors": ["January"], "publish_date": "2017-01-28", "source": "nypost", "top_words": ["executive", "return", "wrote", "bloomberg", "amid", "ban", "tells", "immigration", "google", "employees", "zealand", "work", "trumps", "order", "pichai", "staffers"], "summary": "Google ordered nearly 200 staffers traveling overseas who may be impacted by President Trump’s controversial immigration ban to return to the U.S. immediately.\nGoogle declined to say Saturday whether any employees were detained or blocked from boarding flights.\nThe employees in question normally work in the U.S. but were abroad either on work assignments or vacations, Bloomberg said.\nGoogle Chief Executive Officer Sundar Pichai blasted Trump’s executive order in a note to employees.\n“It’s painful to see the personal cost of this executive order on our colleagues,” Pichai wrote."}