{"url": "http://nypost.com/2017/01/29/trump-asked-me-how-to-legally-create-muslim-ban-giuliani/", "id": "131", "title": "Trump asked me how to legally create ‘Muslim ban’: Giuliani", "text": "Rudy Giuliani said Donald Trump asked him to work out how he could legally implement a “Muslim ban.”\n\n“He called me up, he said, ‘Put a commission together, show me the right way to do it legally,’” the former mayor, who has been advising President Trump, said on “Fox News” Saturday.\n\nGiuliani then said he put a panel together that included former federal Judge Michael Mukasey, Rep. Peter King and Texas Rep. Michael McCaul to come up with a plan that placed the emphasis on threats not religion.\n\n“And what we did was we focused on, instead of religion, danger,” Giuliani said.\n\n“The areas of the world that create danger for us, which is a factual basis, not a religious basis. Perfectly legal, perfectly sensible,” he added.\n\nKing, a Republican from Long Island, denied having any role in crafting the ban despite Giuliani’s claim.\n\n“Rudy is actually confusing dates. I was on a security task force that candidate Trump had with Rudy and Mike Mukasey and others and I think they had two meetings. I was only invited to the first one. That one was focused almost entirely on issues like domestic surveillance,” King told Politico.\n\nThe president signed an executive order on Friday that bans indefinitely refugees from Syria from entering the US and for 90 days immigrants from seven predominately Muslim countries – Iran, Iraq, Syria, Yemen, Somalia, Sudan and Libya.\n\nA federal judge in Brooklyn stayed the order.", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["legally", "perfectly", "trump", "create", "ban", "rep", "president", "syria", "rudy", "michael", "asked", "mukasey", "order", "muslim", "giuliani"], "summary": "Rudy Giuliani said Donald Trump asked him to work out how he could legally implement a “Muslim ban.”“He called me up, he said, ‘Put a commission together, show me the right way to do it legally,’” the former mayor, who has been advising President Trump, said on “Fox News” Saturday.\nGiuliani then said he put a panel together that included former federal Judge Michael Mukasey, Rep. Peter King and Texas Rep. Michael McCaul to come up with a plan that placed the emphasis on threats not religion.\n“The areas of the world that create danger for us, which is a factual basis, not a religious basis.\nPerfectly legal, perfectly sensible,” he added.\nI was on a security task force that candidate Trump had with Rudy and Mike Mukasey and others and I think they had two meetings."}