{"url": "http://nypost.com/2017/01/31/mohamed-sanu-not-focused-on-tough-situation-of-trump-ban/", "id": "107", "title": "Mohamed Sanu, a Muslim in Super Bowl: Travel ban is ‘tough’", "text": "Mohamed Sanu knew the topic would come up.\n\n“Of course I know — obviously my name is Mohamed — a lot of people know I’m Muslim, but I’m here because of my football talents, not because I’m Muslim, and I’m here to talk about football,” the Falcons wide receiver said Monday at Super Bowl media night in Houston.\n\nSanu called President Donald Trump’s travel restrictions from seven predominantly Muslim countries “a very tough situation. I just pray us as a country and a world can be united. It’s very hard for me to talk about this right now. It would take a lot of time. I just want to focus on the game and talk about football.”\n\nSanu’s family is from Sierra Leone, which is not one of the seven restricted countries.\n\n“I’m always concerned. When somebody in your family is traveling a long distance like that, you’re always concerned something may go wrong. You never know,” said Sanu, who went to South Brunswick (N.J.) High School and played at Rutgers. “It is what it is. You just got to hope for the best. I can’t really think about that right now. I want to focus on the game and give all I can to my teammates.”\n\nSanu wears a bracelet on his wrist as a tribute to Eric LeGrand, the former Rutgers player who was paralyzed in 2010 while making a tackle.\n\n“It means a lot to me,” Sanu said. “I’ve known him since I was a freshman in high school. We played against each other throughout high school. Me and Eric are really tight. I wear his ‘Believe’ bracelet ever since it happened. I’ll never take it off. He’s near and dear to my heart. I’d do anything for that guy.”", "authors": ["January"], "publish_date": "2017-01-31", "source": "nypost", "top_words": ["bowl", "high", "travel", "seven", "mohamed", "ban", "lot", "know", "tough", "school", "rutgers", "talk", "im", "muslim", "super", "sanu"], "summary": "“Of course I know — obviously my name is Mohamed — a lot of people know I’m Muslim, but I’m here because of my football talents, not because I’m Muslim, and I’m here to talk about football,” the Falcons wide receiver said Monday at Super Bowl media night in Houston.\nSanu called President Donald Trump’s travel restrictions from seven predominantly Muslim countries “a very tough situation.\nYou never know,” said Sanu, who went to South Brunswick (N.J.) High School and played at Rutgers.\n“I’ve known him since I was a freshman in high school.\nWe played against each other throughout high school."}