{"url": "http://nypost.com/2017/01/30/no-trumps-immigration-plan-isnt-un-american/", "id": "146", "title": "No, Trump’s immigration plan isn’t ‘un-American’", "text": "The surefire way to bring the word “un-American” into vogue is to propose a restriction on immigration, no matter how minor.\n\nDemocrats, who have been spending the last half-century since Joe McCarthy objecting to the suggestion that anyone in this country might not be patriotic, can barely mention President Trump’s immigration order without calling it un-American.\n\nJudging by their performance over the last few days, if Democrats ever take back control of Congress, their first act will be to reinstitute the House Un-American Activities Committee to investigate proponents of reduced immigration and their associates (“Are you now or have you ever been an immigration restrictionist?”).\n\nTrump’s immigration order is vulnerable to any number of legitimate criticisms, on its merits and particularly on its shambolic rollout. But it is not true that a months-long pause in immigration from seven Muslim-majorities countries, some of which lack functioning governments, and all of which are either war-torn or hostile to the United States, is a violation of the nation’s creed.\n\nNowhere is it written that the United States can never tap the brakes on immigration. For much of the political class and for an inflamed left, any new restriction is tantamount to melting down the Statue of Liberty. This is an ahistorical attitude that desperately needs a corrective. President Trump, in scattershot fashion, is setting out to provide one.\n\nEveryone knows that we are a “nation of immigrants,” although immigration has been highly contested throughout our history. “America,” the late political scientist Samuel Huntington wrote, “has been a nation of restricted and interrupted immigration as much as it has been a nation of immigration.”\n\nLevels of immigration spiked in the 1880s, dropped in the 1890s, and reached new highs before World War I. They declined precipitously during the war and bounced back afterward.\n\nThen, the 1924 immigration law brought a new phase of lower immigration that didn’t end until the late 1960s. In 1965, fewer than 300,000 immigrants were admitted to the United States.\n\nWe have been at elevated levels for decades since then and now admit about 1 million a year. The proportion of the foreign-born population is set to hit a record in 2025.\n\nThis means there is a lot of room to reduce immigration without shutting our doors entirely. Cutting half legal immigration to the levels of the early 1980s would still mean roughly 500,000 new immigrants a year, a high absolute number compared to almost every other country in the world. Of course, the Trump policy that has caused such a reaction is not close to change of this scale.\n\nTrump has also temporarily suspended the US refugee program and capped it at 50,000 refugees. This is in the same ballpark as the figure for admittances from the last five years or so, when the number of refugees was typically between 50,000 and 70,000 a year.\n\nIf we are using an overall level of refugees to judge our American-ness, 1976, 1977, 1978, 2002, 2003, 2006 and 2007 must have been woefully un-American years because the number of refugees was less than 50,000 in each of them.\n\nAll of this said, the critics are right to sense something different in President Trump. He is going to put much more emphasis on the integrity of our borders and less on humanitarian considerations than his predecessors. This is a direct challenge to the lazy cosmopolitanism that assumes the only correct answer in immigration policy is always “more” and never “less.”\n\nThe rocky rollout of the Trump policy means that the administration is expending political capital on its executive order that would best be preserved for more important immigration-related causes, like getting Congress to pass a mandatory e-verify system to stop employers from hiring illegal labor and to emphasize skills in the legal immigration system.\n\nYou know, other alleged betrayals of America.", "authors": ["Rich Lowry", "January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["trump", "political", "immigration", "policy", "plan", "order", "united", "trumps", "number", "refugees", "president", "unamerican", "isnt"], "summary": "The surefire way to bring the word “un-American” into vogue is to propose a restriction on immigration, no matter how minor.\nDemocrats, who have been spending the last half-century since Joe McCarthy objecting to the suggestion that anyone in this country might not be patriotic, can barely mention President Trump’s immigration order without calling it un-American.\nTrump’s immigration order is vulnerable to any number of legitimate criticisms, on its merits and particularly on its shambolic rollout.\nOf course, the Trump policy that has caused such a reaction is not close to change of this scale.\nAll of this said, the critics are right to sense something different in President Trump."}