{"url": "http://nypost.com/2017/02/06/trumps-travel-ban-was-the-wrong-reason-to-boycott-uber/", "id": "16", "title": "Trump’s travel ban was the wrong reason to boycott Uber", "text": "If you’re one of the 200,000 Uber customers who deleted their accounts last week, you may feel like you stuck up for immigrants and socked it to President Trump. But your cluelessness is precisely why he won.\n\nUber first stumbled into a mess when yellow-cab drivers — rightly — withheld service from JFK for an hour to protest Trump’s immigration order.\n\nThe immigration order was cruel, in that it targeted people who already had demonstrated that they respect our immigration laws, having spent years and money securing valid visas to our country only to be sent back to dangerous places from our airports.\n\nUber unwittingly appeared to take Trump’s side. It announced shortly after the strike that it wouldn’t charge “surge pricing” — higher prices in times of higher demand — at JFK.\n\nWhat Uber was trying to do was show it wasn’t taking advantage of the protest. Consider: If it had allowed surge pricing, people would say it was using the protest to make more money. (Uber had no mechanism to allow drivers to participate in a location-based protest.)\n\nSo, basically, Uber made a mistake and it tried to rectify it by putting up $3 million to help drivers affected by the immigration order. No real harm, and even some good. After all, does anyone think Uber stifled speech by the taxi (or other) protesters?\n\nNo matter: Some of Uber’s customers were out for blood. Journalist Dan O’Sullivan led the charge, tweeting that Uber should “eat sh - - and die” and exhorting people to “delete your account.” Susan Sarandon tweeted, “Goodbye, Uber. Hello Lyft.”\n\nParticipating in this mob only demonstrates how much the new Uber-haters live in a bubble.\n\nUber is a tool of the coastal elite. If you pay someone to drive you around more than twice a year, it’s safe to say that you went to college, that you didn’t lose your manufacturing job, or aren’t worried about losing it. As for the “Uber VIPs” — frequent users, sometimes daily — who reported deleting their accounts: Did they never think, during all of those rides they took yapping on their cellphones, that maybe the fact that Uber has thrived in the past few years is linked to the reason so many people voted for Trump?\n\nYes, some Uber drivers like their set-up. They may have already had a nice car that meets the company’s specifications. They may be in grad school and appreciate the fact that they can work at night and on weekends. They may like the people they meet.\n\nThey don’t mind the fact that Uber offers only contract work, not employment and a chance to move up.\n\nMany Uber drivers, though, drive for Uber because they have no other option — even sleeping in their cars, because they can’t afford to live near Uber’s customers. They would like a job with room for promotion, a job that offers steady full-time hours and benefits.\n\nAnd they’d like a job that doesn’t require them to go into tens of thousands of debt to buy a high-end vehicle — debt that makes them, not Uber, the biggest risk-takers in this venture.\n\nThose facts, no doubt, never entered Uber protesters’ minds before last week. Instead, they just enjoyed taking a sleek black car, something many of them couldn’t afford before, not wondering why it was suddenly so affordable.\n\nUber’s customers never seemed worried that the person driving them couldn’t meet his car payment, or that driving a for-hire car is the only job many immigrants can get.\n\nGood thing Uber has spawned competitors that use the same model — or shunning Uber would hurt these drivers more.\n\nNo, what they’ve thought about instead is, hey, it’s fun to take a car that’s almost as cheap as the subway. Fact is, today’s newfound Uber deleters, and their obliviousness to struggling workers, are the problem — and a big reason why Trump won.\n\nBy the end of the last week, Uber chief Travis Kalanick, in a panic, said he’d quit Trump’s economic-advisory board. (He had signed up to offer advice, not to support Trump.) But Kalanick needn’t worry. Uber’s customers will be back when there’s a crisis, like the next time it rains.\n\nAs one Uber deleter noted, “I ended up reinstalling it since I don’t have another easy method to pay for nanny’s car home.”\n\nNicole Gelinas is a senior fellow at the Manhattan Institute.", "authors": ["Nicole Gelinas", "February"], "publish_date": "2017-02-06", "source": "nypost", "top_words": ["travel", "car", "ban", "job", "immigration", "wrong", "week", "uber", "trumps", "ubers", "reason", "boycott", "fact", "drivers", "customers"], "summary": "Uber first stumbled into a mess when yellow-cab drivers — rightly — withheld service from JFK for an hour to protest Trump’s immigration order.\nYes, some Uber drivers like their set-up.\nMany Uber drivers, though, drive for Uber because they have no other option — even sleeping in their cars, because they can’t afford to live near Uber’s customers.\nBy the end of the last week, Uber chief Travis Kalanick, in a panic, said he’d quit Trump’s economic-advisory board.\nUber’s customers will be back when there’s a crisis, like the next time it rains."}