{"url": "http://nypost.com/2017/02/03/cuomo-offers-to-help-iranian-infant-who-cant-get-into-us-for-transplant/", "id": "155", "title": "Cuomo offers to help Iranian infant who can’t get into US for transplant", "text": "ALBANY – An adorable Iranian infant, whose family says she can’t get into the United States for a heart transplant, can receive care in New York if the Trump administration will allow the 4-month–old into the country, Gov. Cuomo said.\n\nFatemah Taghizadeh’s parents were hoping to meet with doctors in Oregon on Feb. 5 for the emergency surgery and they traveled to Dubai to get a visa, according to a report by the Oregonian.\n\nTheir embassy appointment was cancelled because of the executive order preventing Iranian nationals, among others, from traveling to the United States, the baby’s uncle, who lives in Portland told news reporters.\n\nNew York Gov. Andrew Cuomo expressed outrage and said the Empire State would be glad to help little Fatemah.\n\n“Here’s the consequence of this un-American policy,” Cuomo tweeted Thursdsay night. “An exception should be made. If OR has issue, NY will provide care.”\n\nIn fact, Oregon Sen. Jeff Merkley and immigration lawyers are trying to help the baby’s uncle and grandfather obtain an exception to the travel ban so the family can be united and the tiny girl can get the surgery she needs for a grave condition.\n\nThough New York State has no shortage of respected heart surgeons, it was not immediately clear where Cuomo would refer the pediatric patient but his spokesman said the governor would personally step in to assist.\n\n“The pain and damage of this flawed federal policy is especially repulsive in this case preventing a child from getting life saving treatment,” said Cuomo spokesman Rich Azzopardi.”If the plane lands in New York the Governor will personally make sure the child gets the health care she needs. New York and America does not let children die because we deprived them of healthcare.‎”", "authors": ["February"], "publish_date": "2017-02-03", "source": "nypost", "top_words": ["infant", "spokesman", "transplant", "state", "preventing", "iranian", "cant", "united", "states", "cuomo", "surgery", "uncle", "york", "help", "policy", "offers"], "summary": "ALBANY – An adorable Iranian infant, whose family says she can’t get into the United States for a heart transplant, can receive care in New York if the Trump administration will allow the 4-month–old into the country, Gov.\nCuomo said.\nTheir embassy appointment was cancelled because of the executive order preventing Iranian nationals, among others, from traveling to the United States, the baby’s uncle, who lives in Portland told news reporters.\nAndrew Cuomo expressed outrage and said the Empire State would be glad to help little Fatemah.\n“Here’s the consequence of this un-American policy,” Cuomo tweeted Thursdsay night."}