{"url": "http://nypost.com/2017/01/30/trump-fires-acting-ag-for-defying-immigration-ban/", "id": "117", "title": "Trump fires acting AG for defying immigration ban", "text": "WASHINGTON — President Donald Trump on Monday fired Sally Yates, the acting attorney general and a Democratic appointee, after she refused to defend in court his controversial refugee and immigration ban.\n\nThe extraordinary public clash over Trump’s most consequential policy decision to date laid bare the discord and dissent surrounding the executive order, which temporarily halted the entire U.S. refugee program and banned all entries from seven Muslim-majority nations for 90 days.\n\nThe firing came hours after Yates directed Justice Department attorneys not to defend the executive order, saying she was not convinced it was lawful or consistent with the agency’s “obligation to always seek justice and stand for what is right.”\n\nIn a statement, Trump said Yates had “betrayed the Department of Justice by refusing to enforce a legal order designed to protect the citizens of the United States.” He named longtime federal prosecutor Dana Boente as Yates’ replacement.\n\nYates’ abrupt decision reflected the dissent over the order, with administration officials moving to distance themselves from the policy. As protests erupted at airports over the weekend and confusion disrupted travel around the globe, some of Trump’s top advisers and fellow Republicans privately noted they were not consulted about the policy.\n\nAt least three top national security officials — Defense Secretary Jim Mattis, Homeland Security Secretary John Kelly and Rex Tillerson, who is awaiting confirmation to lead the State Department — have told associates they were not aware of details of the directive until around the time Trump signed it. Leading intelligence officials were also left largely in the dark, according to U.S. officials.\n\nTennessee Sen. Bob Corker, the top Republican on the Senate Foreign Relations committee, said that despite White House assurances that congressional leaders were consulted, he learned about the order in the media.\n\nOther parts of Trump’s administration were voicing dissent Monday. A large group of American diplomats circulated a memo voicing their opposition to the order, which temporarily halted the entire U.S. refugee program and banned all entries from seven Muslim-majority nations for 90 days. In a startlingly combative response, White House spokesman Sean Spicer challenged those opposed to the measure to resign.\n\n“They should either get with the program or they can go,” Spicer said.\n\nThe blowback underscored Trump’s tenuous relationship with his own national security advisers, many of whom he met for the first time during the transition, as well as with the government bureaucracy he now leads. While Trump outlined his plan for temporarily halting entry to the U.S. from countries with terror ties during the campaign, the confusing way in which it finally was crafted stunned some who have joined his team.\n\nMattis, who stood next to Trump during Friday’s signing ceremony, is said to be particularly incensed. A senior U.S. official said Mattis, along with Joint Chiefs Chairman Joseph Dunford, was aware of the general concept of Trump’s order but not the details. Tillerson has told the president’s political advisers that he was baffled over not being consulted on the substance of the order.\n\nU.S. officials and others with knowledge of the Cabinet’s thinking insisted on anonymity in order to disclose the officials’ private views.\n\nTrump’s order pauses America’s entire refugee program for four months and indefinitely bans all those from war-ravaged Syria. Federal judges in New York and several other states issued orders that temporarily block the government from deporting people with valid visas who arrived after Trump’s travel ban took effect.\n\nThe president has privately acknowledged flaws in the rollout, according to a person with knowledge of his thinking. But he’s also blamed the media — his frequent target — for what he believes are reports exaggerating the dissent and the number of people actually affected.\n\nTrump has also said he believes the voters who carried him to victory support the plan as a necessary step to safeguard the nation. And he’s dismissed objectors as attention-seeking rabble-rousers and grandstanding politicians.\n\nAfter a chaotic weekend during which some U.S. legal permanent residents were detained at airports, some agencies were moving swiftly to try to clean up after the White House.\n\nHomeland Security, the agency tasked with implementing much of the refugee ban, clarified that customs and border agents should allow legal residents to enter the country. The Pentagon was trying to exempt Iraqis who worked alongside the U.S. and coalition forces from the 90-day ban on entry from the predominantly Muslim countries.\n\nsee also State Department officers protest immigration ban Several hundred career State Department officers have signed a document...\n\n“There are a number of people in Iraq who have worked for us in a partnership role, whether fighting alongside us or working as translators, often doing so at great peril to themselves,” said Navy Capt. Jeff Davis, a Pentagon spokesman.\n\nPolicies with such broad reach are typically vetted by affected agencies and subject to review by multiple agencies. It’s a process that can be frustratingly slow but is aimed at avoiding unintended consequences.\n\nOn Capitol Hill, lawmakers in Trump’s party sought to distance themselves from the wide-ranging order.\n\nWhile Spicer said “appropriate committees and leadership offices” on Capitol Hill were consulted, GOP lawmakers said their offices had no hand in drafting the order and no briefings from the White House on how it would work.\n\n“I think they know that it could have been done in a better way,” Corker said of the White House.\n\nSome Trump supporters defended the president, saying his actions should not have come as a surprise given his positions during the campaign.\n\n“Nothing he did over the weekend was new,” said Newt Gingrich, the former House speaker and an informal adviser. He conceded that coordination could have been better, but he said Trump’s vow to quickly bring change to Washington will sometimes mean he needs to prioritize fast action over broad consultation.\n\n“If you’re the reformer, you need the momentum,” Gingrich said.", "authors": ["Associated Press", "January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["trump", "ban", "temporarily", "immigration", "security", "refugee", "ag", "officials", "trumps", "department", "acting", "yates", "order", "fires", "white", "defying"], "summary": "WASHINGTON — President Donald Trump on Monday fired Sally Yates, the acting attorney general and a Democratic appointee, after she refused to defend in court his controversial refugee and immigration ban.\nYates’ abrupt decision reflected the dissent over the order, with administration officials moving to distance themselves from the policy.\nA senior U.S. official said Mattis, along with Joint Chiefs Chairman Joseph Dunford, was aware of the general concept of Trump’s order but not the details.\nTrump’s order pauses America’s entire refugee program for four months and indefinitely bans all those from war-ravaged Syria.\nSome Trump supporters defended the president, saying his actions should not have come as a surprise given his positions during the campaign."}