{"url": "http://nypost.com/2017/06/29/team-trump-dodges-questions-on-travel-ban-blocking-family-visits/", "id": "174", "title": "Team Trump dodges questions on travel ban blocking family visits", "text": "The Trump Administration on Thursday declined to explain why grandparents, grandchildren and other close relatives from six Muslim countries would be barred from entering the U.S. and visiting their families under the president’s travel ban.\n\nsee also US issues new visa criteria for 6 Muslim nations The Trump administration on Wednesday set new criteria for visa...\n\nInstead, they would only say that they based their narrow definition of eligible family members on the 1965 Immigration and Nationality Act — which was enacted to ease restrictions on immigration.\n\n“We based that on the definition of family in the Immigration and Nationality Act,” a senior administration official told reporters on a conference call that included reps for the departments of State, Justice and Homeland Security.\n\nUnder President Trump’s temporary travel ban, parents, spouses, children, adult sons or daughters, sons-in-law, daughters-in-law, siblings, and stepfamilies of legal U.S. residents can enter the country after 8 p.m. Thursday, when the ban goes into effect.\n\nBut other relatives — grandparents, grandchildren, aunts, uncles, nieces, nephews, cousins, brothers-in-law and sisters-in-law, fiances and other extended family — are banned.\n\nAsked specifically how barring grandparents from the country makes the U.S. safer — the stated goal of the ban — the administration officials would only repeat that they based their definition on the INA.\n\nImmigration advocates denounced the definition.\n\n“Defining close family to exclude grandparents, cousins, and other relatives defies common sense,” Johnathan Smith, legal director of the civil rights group Muslim\n\nAdvocates, told The Washington Post.\n\nCornell University Law School professor Stephen Yale-Loehr also slammed the exclusion of so many relatives.\n\n“Why can a stepsister visit the United States but not a grandmother? The State Department should vet visa applicants on a case-by-case basis for terrorism\n\nconcerns, not impose overly broad categories that prevent innocent people from coming to this country,” he told the paper.\n\nThe narrow definition of family was included in a cable sent to U.S. consuls and other facilities abroad explaining how the ban would work.\n\nThe travel ban bars people from Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nIt allows people coming to the U.S. for jobs or to study or lecture at U.S. universities.\n\nTrump signed an executive order imposing the ban after the Supreme Court on Monday ruled that parts of it could be put into place until it hears the overall case in the fall.", "authors": ["June"], "publish_date": "2017-06-29", "source": "nypost", "top_words": ["visits", "questions", "travel", "trump", "family", "ban", "told", "blocking", "dodges", "country", "relatives", "definition", "based", "administration", "team", "grandparents"], "summary": "see also US issues new visa criteria for 6 Muslim nations The Trump administration on Wednesday set new criteria for visa...\nUnder President Trump’s temporary travel ban, parents, spouses, children, adult sons or daughters, sons-in-law, daughters-in-law, siblings, and stepfamilies of legal U.S. residents can enter the country after 8 p.m. Thursday, when the ban goes into effect.\nBut other relatives — grandparents, grandchildren, aunts, uncles, nieces, nephews, cousins, brothers-in-law and sisters-in-law, fiances and other extended family — are banned.\nThe narrow definition of family was included in a cable sent to U.S. consuls and other facilities abroad explaining how the ban would work.\nThe travel ban bars people from Iran, Libya, Somalia, Sudan, Syria and Yemen."}