{"url": "http://nypost.com/2017/02/07/more-than-half-of-americans-oppose-trumps-travel-ban-poll/", "id": "294", "title": "More than half of Americans oppose Trump’s travel ban: poll", "text": "American voters oppose President Trump’s executive order that bans travelers from seven mainly Muslim countries, according to a new poll released Tuesday.\n\nVoters reject the order — which bans travelers from Yemen, Syria, Iran, Iraq, Sudan, Somalia and Libya for 90 days — by 51 percent to 46 percent, the Quinnipiac University poll says.\n\nVoters also overwhelmingly oppose, by 70 percent to 26 percent, the president’s decision to indefinitely halt all immigration of Syrian refugees, the poll says.\n\nThey also oppose, by 60 percent to 37 percent, the order that suspends immigration of refugees from all countries for 120 days, the survey shows.\n\nFifty-one percent of those polled say the travel restrictions are really a ban on Muslims, while 45 percent say it isn’t.\n\nOnly 38 percent say the ban will make the country safer, and 39 percent said it will make America less safe.\n\n“Message to President Donald Trump: ‘Give me your tired, your poor, your huddled masses yearning to breathe free’ still has profound resonance with Americans,” said Tim Malloy, assistant director of the Quinnipiac University Poll.\n\nStill, 70 percent of American voters say it is “very likely” or “somewhat likely” that there will be a terrorist attack in the US with a large loss of life.\n\nTrump’s approval rating remains low, now with more than 50 percent of those surveyed disapproving of the job he’s done so far: 42 percent approve and 51 percent disapprove. In the last poll, on Jan. 26, he got a 36 percent approval rating but a 44 percent disapproval rating.\n\nLooking at Trump’s other qualities, the survey, taken between Feb. 2 and Feb. 6, shows:\n\n50 percent to 42 percent say he is not honest.\n\n50 percent to 47 percent say he doesn’t have good leadership skills.\n\n52 percent to 45 percent say he does not care about average Americans.\n\n60 percent to 35 percent say he is not level-headed.\n\nThe poll surveyed 1,155 people, with a 2.9 percentage-point margin of error.", "authors": ["February"], "publish_date": "2017-02-07", "source": "nypost", "top_words": ["travel", "surveyed", "half", "survey", "ban", "university", "travelers", "poll", "trumps", "voters", "order", "oppose", "americans", "say"], "summary": "American voters oppose President Trump’s executive order that bans travelers from seven mainly Muslim countries, according to a new poll released Tuesday.\nVoters also overwhelmingly oppose, by 70 percent to 26 percent, the president’s decision to indefinitely halt all immigration of Syrian refugees, the poll says.\nFifty-one percent of those polled say the travel restrictions are really a ban on Muslims, while 45 percent say it isn’t.\n“Message to President Donald Trump: ‘Give me your tired, your poor, your huddled masses yearning to breathe free’ still has profound resonance with Americans,” said Tim Malloy, assistant director of the Quinnipiac University Poll.\nThe poll surveyed 1,155 people, with a 2.9 percentage-point margin of error."}