{"url": "http://nypost.com/2017/02/21/team-trumps-latest-immigration-orders-are-tough-not-harsh/", "id": "247", "title": "Team Trump’s latest immigration orders are tough — not harsh", "text": "Team Trump’s newest immigration orders definitely toughen enforcement, but they’re a far cry from mass roundups.\n\nIf the administration sticks to this approach — prioritizing the serious criminals for apprehension and deportation, while also making it harder to succeed at immigrating illegally — it’ll have broad public support.\n\nOver-the-top approaches (deporting law-abiding moms) will mean big trouble.\n\nIn that regard, it’s worth noting that President Trump still hasn’t touched former President Barack Obama’s Deferred Action for Childhood Arrivals program, which gives safe harbor and work permits to those brought here illegally as young children, a k a “the dreamers.”\n\nThe Department of Homeland Security also sought to provide instant clarity this time ’round, with background briefings even as DHS chief John Kelly issued his latest orders.\n\nIn a conference call with reporters, one official noted, “We do not have the personnel, time or resources to go into communities and round up people and do all kinds of mass throwing folks on buses. That’s entirely a figment of folks’ imagination.”\n\nYet Trump is moving to actually enforce US law, reversing the across-the-board Obama-era slowdown of enforcement actions. Violent criminals remain the top priority, but are no longer the only priority.\n\nNow plea-bargaining a felony down to a misdemeanor won’t leave you automatically exempt from immigration enforcement, nor will DHS officials wink at an illegal immigrants’ fraudulent filing for welfare benefits.\n\nOverall, DHS is pledging to “treat everyone humanely and with dignity” — while making clear its determination to “execute the laws of the United States” and that everything in Trump’s order “is consistent with what Congress put into law.”\n\nIn short, it’s a promise of vigorous but rationally targeted enforcement, which is what most Americans have long wanted. As long as that’s what it proves in practice, it should be a big political win for Trump.", "authors": ["Post Editorial Board", "February"], "publish_date": "2017-02-21", "source": "nypost", "top_words": ["thats", "long", "mass", "trump", "orders", "immigration", "enforcement", "tough", "making", "trumps", "dhs", "round", "latest", "president", "harsh", "team"], "summary": "Team Trump’s newest immigration orders definitely toughen enforcement, but they’re a far cry from mass roundups.\nIf the administration sticks to this approach — prioritizing the serious criminals for apprehension and deportation, while also making it harder to succeed at immigrating illegally — it’ll have broad public support.\nThat’s entirely a figment of folks’ imagination.”Yet Trump is moving to actually enforce US law, reversing the across-the-board Obama-era slowdown of enforcement actions.\nNow plea-bargaining a felony down to a misdemeanor won’t leave you automatically exempt from immigration enforcement, nor will DHS officials wink at an illegal immigrants’ fraudulent filing for welfare benefits.\nAs long as that’s what it proves in practice, it should be a big political win for Trump."}