{"url": "http://nypost.com/2017/03/01/trump-lays-out-goals-for-immigration-reform/", "id": "234", "title": "Trump lays out ‘goals’ for immigration reform", "text": "President Trump revealed the conditions under which he could support immigration reform, which would be a remarkable policy shift — just as the White House prepares to put out a revised travel ban.\n\nThere was a little-noticed line in Trump’s speech to a joint session of Congress on Tuesday night.\n\n“I believe that real and positive immigration reform is possible,” Trump said at Tuesday’s address, indicating he could be game for some sort of plan that would be less severe toward illegal immigrants than what his prior rhetoric had suggested.\n\nBut, he insisted, “goals” would need to be met before discussions of immigration reform could be enacted: “To improve jobs and wages for Americans; to strengthen our nation’s security; and to restore respect for our laws.”\n\nMeanwhile the White House also postponed a planned executive-order signing Wednesday — which would have reinstituted the travel ban.\n\nTrump’s first travel ban, which temporarily blocked travel of citizens from seven mostly Muslim countries to America, was blocked by a federal court.\n\nWhite House officials are still continuing to debate the particulars of the new ban. There is reportedly a rift over whether to exclude Iraq.", "authors": ["March"], "publish_date": "2017-03-01", "source": "nypost", "top_words": ["travel", "trump", "blocked", "ban", "immigration", "wages", "reform", "tuesdays", "lays", "white", "house", "goals"], "summary": "President Trump revealed the conditions under which he could support immigration reform, which would be a remarkable policy shift — just as the White House prepares to put out a revised travel ban.\nThere was a little-noticed line in Trump’s speech to a joint session of Congress on Tuesday night.\n“I believe that real and positive immigration reform is possible,” Trump said at Tuesday’s address, indicating he could be game for some sort of plan that would be less severe toward illegal immigrants than what his prior rhetoric had suggested.\nTrump’s first travel ban, which temporarily blocked travel of citizens from seven mostly Muslim countries to America, was blocked by a federal court.\nWhite House officials are still continuing to debate the particulars of the new ban."}