{"url": "http://nypost.com/2017/02/28/trump-defends-travel-ban-during-first-speech-to-congress/", "id": "236", "title": "Trump defends travel ban during first speech to Congress", "text": "President Trump defended his travel ban Tuesday at a Joint Session of Congress — and pledged to take new steps soon “to keep out those who would do us harm.”\n\n“We cannot allow a beachhead of terrorism to form inside America — we cannot allow our Nation to become a sanctuary for extremists,” Trump said.\n\n“That is why my Administration has been working on improved vetting procedures, and we will shortly take new steps to keep our Nation safe — and to keep out those who would do us harm,” he added, without mentioning his previously imposed travel ban that was halted by a court.\n\nReports indicate a new travel ban could be coming as soon as Wednesday.\n\nWhite House aide Stephen Miller said earlier this month that new ban would look like the old one. “Fundamentally you’re going to have the same basic policy outcome for the country,” he said last week, indicating that there will only be “technical differences” between the two plans.\n\nTrump defended his travel ban by invoking previous terror attacks that targeted America.\n\n“According to data provided by the Department of Justice, the vast majority of individuals convicted for terrorism-related offenses since 9/11 came here from outside of our country. We have seen the attacks at home -– from Boston to San Bernardino to the Pentagon and yes, even the World Trade Center,” he said.\n\n“It is not compassionate, but reckless, to allow uncontrolled entry from places where proper vetting cannot occur. Those given the high honor of admission to the United States should support this country and love its people and its values,” he added.", "authors": ["February"], "publish_date": "2017-02-28", "source": "nypost", "top_words": ["travel", "congress", "trump", "ban", "defended", "speech", "vetting", "soon", "nation", "country", "defends", "steps", "allow"], "summary": "President Trump defended his travel ban Tuesday at a Joint Session of Congress — and pledged to take new steps soon “to keep out those who would do us harm.”“We cannot allow a beachhead of terrorism to form inside America — we cannot allow our Nation to become a sanctuary for extremists,” Trump said.\nReports indicate a new travel ban could be coming as soon as Wednesday.\nWhite House aide Stephen Miller said earlier this month that new ban would look like the old one.\nTrump defended his travel ban by invoking previous terror attacks that targeted America.\n“It is not compassionate, but reckless, to allow uncontrolled entry from places where proper vetting cannot occur."}