{"url": "http://nypost.com/2017/01/30/trump-admin-travel-ban-wont-trap-people-in-airports-anymore/", "id": "29", "title": "Trump admin: Travel ban won’t trap people in airports anymore", "text": "WASHINGTON – The Trump Administration does not anticipate more people will be trapped in airports in the United States because banned travelers will be blocked from boarding planes in their home countries.\n\n“We are also working closely with airline partners to prevent travelers who would not be granted entry under the executive orders from boarding international flights to the U.S,” the Department of Homeland Security said in a statement Sunday. “Therefore, we do not anticipate that further individuals traveling by air to the United States will be affected.”\n\nPresident Trump’s executive order bars entry to the United States from nationals from seven Muslim majority countries — Iraq, Iran, Syria, Somalia, Sudan, Libya, and Yemen – for 90 days; suspends all refugee admission for 120 days and bars Syrian refugees indefinitely.\n\nThe rollout of the program over the weekend meant some 109 affected travelers in transit were stopped and detained at airports in the US for additional screening, according to the White House. The detentions sparked airport protests in New York and elsewhere over the weekend. A Brooklyn judge barred deportations of those detainees back to their home countries.\n\nIn the future, such travelers would be blocked from getting travel visas in their home country and wouldn’t make it on an international flight.\n\n“We are and will remain in compliance with judicial orders,” the Department of Homeland Security statement said. “We are and will continue to enforce President Trump’s executive order humanely and with professionalism. DHS will continue to protect the homeland.”\n\nsee also Politicians worldwide come out against Trump's travel ban Battle lines were drawn Sunday as Republican and Democratic lawmakers...\n\nAmid confusion, the Trump Administration clarified Sunday the executive order does not bar legal permanent residents — or green card holders – from entering the US.\n\n“As Secretary Kelly previously stated, in applying the provisions of the president’s executive order, the entry of lawful permanent residents is in the national interest,” the Department of Homeland Security said.\n\nA senior Administration official added Sunday evening the US has a right to select which immigrants should be welcome.\n\nThe US is “an independent and sovereign country and we have the right to make extra requirements for people coming in from certain places,” the official said.\n\nThe seriousness of the threat of terrorism necessitates the action, the official said, speaking on background.\n\n“The United States chose not to be rigorous with its immigration laws before September 11th and 3,000 people were murdered,” the official said.", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["executive", "travel", "official", "trump", "airports", "ban", "anymore", "security", "homeland", "travelers", "order", "united", "trumps", "entry", "wont", "trap", "states", "admin"], "summary": "WASHINGTON – The Trump Administration does not anticipate more people will be trapped in airports in the United States because banned travelers will be blocked from boarding planes in their home countries.\n“We are and will remain in compliance with judicial orders,” the Department of Homeland Security statement said.\n“We are and will continue to enforce President Trump’s executive order humanely and with professionalism.\n“As Secretary Kelly previously stated, in applying the provisions of the president’s executive order, the entry of lawful permanent residents is in the national interest,” the Department of Homeland Security said.\n“The United States chose not to be rigorous with its immigration laws before September 11th and 3,000 people were murdered,” the official said."}