{"url": "http://nypost.com/2017/02/10/de-blasio-compares-cuomo-to-trump-in-flap-over-school-funds/", "id": "274", "title": "De Blasio compares Cuomo to Trump in flap over school funds", "text": "Mayor Bill de Blasio took a shot a Gov. Andrew Cuomo on Friday, comparing his inability to fulfill a decade-old court order on school funding to President Trump’s court fight over his refugee and immigration ban.\n\n“We are still fighting for fairness. We are still fighting for a court decision to be implemented,” said de Blasio on his weekly WNYC radio show, referring to the state Court of Appeals ruling in 2006 that found lawmakers had to spend billions more dollars to ensure all students get an equally good education.\n\n“Unfortunately, in some of the budget documents we saw this year from the governor’s office, there was an effort to no longer honor the wording that’s related to the Campaign for Fiscal Equity. That’s a step in the wrong direction.”\n\nThe mayor then added, “It’s an interesting day because we are talking about the president trying to defy a court order.”\n\nWhen told by host Brian Lehrer that Trump was actually planning to fight the ruling by the 9th Circuit Court of Appeals in San Francisco blocking the temporary travel ban — but not defying it — Hizzoner clarified his statement.\n\n“First, it appeared to be open defiance, and then it turned into verbally defiant attitude. But the point I am trying to make is, I think there are people all over this state, all over this country, saying, ‘Wait a minute! You don’t get to make up the rules,'” de Blasio said.\n\n“No president, no one, gets to make up the rules. When the highest court rules, that’s it. I am saying something to you that is astounding … A decade ago, the highest court in New York state ruled [on the Campaign for Fiscal Equity case] — everyone saw it — … [but] it’s been treated as part of a lost civilization now rather than something that happened a decade ago and was black and white.”\n\nDani Lever, a spokeswoman for Gov. Cuomo, responded:\n\n“The mayor needs to stop with the ‘alternative facts’. The truth is that the Campaign for Fiscal Equity case ended 10 years ago. The state has met the funding requirement many times over, and since the mayor took office, we have increased funding to New York City schools at a rate of 38 percent higher than the city. Speaking of court orders – we look forward to the City honoring multiple legal decisions to make police disciplinary proceedings public.”", "authors": ["February"], "publish_date": "2017-02-10", "source": "nypost", "top_words": ["thats", "trump", "blasio", "state", "funds", "rules", "court", "flap", "compares", "funding", "school", "fiscal", "cuomo", "mayor", "city", "equity", "president"], "summary": "Andrew Cuomo on Friday, comparing his inability to fulfill a decade-old court order on school funding to President Trump’s court fight over his refugee and immigration ban.\n“Unfortunately, in some of the budget documents we saw this year from the governor’s office, there was an effort to no longer honor the wording that’s related to the Campaign for Fiscal Equity.\nWhen the highest court rules, that’s it.\nThe truth is that the Campaign for Fiscal Equity case ended 10 years ago.\nSpeaking of court orders – we look forward to the City honoring multiple legal decisions to make police disciplinary proceedings public.”"}