{"url": "http://nypost.com/2017/02/17/trump-considers-deploying-100000-national-guard-troops-for-immigrant-roundup/", "id": "255", "title": "Trump team considers deploying National Guard for immigrant roundup", "text": "President Trump may mobilize as many as 100,000 National Guard troops to round up illegal immigrants, according to a new report — though the White House immediately called it “false.”\n\nThe Associated Press said it obtained a draft memo that outlines a Trump administration proposal under consideration to mobilize troops in 11 states to round up unauthorized immigrants.\n\nAccording to the wire service, the 11-page document calls for the unprecedented militarization of immigration enforcement as far north as Portland, Oregon, and as far east as New Orleans, Louisiana.\n\nIf the proposal is implemented, governors in the affected states would have final approval on whether troops under their control participate, AP said.\n\nBut White House spokesman Sean Spicer branded the report “false” moments after the AP broke the story.\n\n“That is 100 percent not true. It is false. It is irresponsible to be saying this. There is no effort at all to round up, to utilize the National Guard to round up illegal immigrants,” he said, before admonishing the media.\n\n“I wish you guys had asked before you tweeted,” he added, though an AP reporter noted that the wire service had asked multiple times before publishing the news but got no response.\n\nHe hedged when pressed about where the draft statement came from if not the White House.\n\n“I don’t know what could potentially be out there, but I know that there is no effort to do what is potentially suggested. It is not a White House document,” he said.\n\nThe AP said that governors in the affected states would have a choice whether to have their guard troops participate, according to the memo, written by Homeland Security Secretary John Kelly.\n\nWhile National Guard personnel have been used to assist with immigration-related missions on the US-Mexico border before, they have never been used as broadly.\n\nThe memo is addressed to the then-acting heads of US Immigration and Customs Enforcement and US Customs and Border Protection.\n\nIt would serve as guidance to implement the wide-ranging executive order on immigration and border security that Trump signed Jan. 25, the AP said.\n\nSuch memos are routinely issued to supplement executive orders.\n\nThe draft memo says participating troops would be authorized “to perform the functions of an immigration officer in relation to the investigation, apprehension and detention of aliens in the United States.” It describes how the troops would be activated under a revived state-federal partnership program, and states that personnel would be authorized to conduct searches and identify and arrest any unauthorized immigrants.\n\nThe draft document has circulated among Homeland Security staff over the last two weeks. As recently as Friday, staffers in several different offices reported discussions were under way, according to the AP.\n\nIf implemented, the impact could be significant. Nearly half of the 11.1 million people residing in the US without authorization live in the 11 states, according to Pew Research Center estimates based on 2014 Census data.\n\nUnder current rules, even if the proposal is implemented, there would not be immediate mass deportations. Those with existing deportation orders could be sent back to their countries of origin without additional court proceedings. But deportation orders generally would be needed for most other unauthorized immigrants.\n\nSpokespeople for the governors of Arizona, Utah, Nevada, California, Colorado, Oklahoma, Oregon and New Mexico said they were unaware of the proposal, and either declined to comment or said it was premature to discuss whether they would participate.\n\nThe other three states did not immediately respond to the AP.\n\nThe proposal would extend the federal-local partnership program that President Barack Obama’s administration began scaling back in 2012 to address complaints that it promoted racial profiling.\n\nThe 287(g) program, which Trump included in his immigration executive order, gives local police, sheriff’s deputies and state troopers the authority to assist in the detection of immigrants who are in the US illegally as a regular part of their law enforcement duties.\n\nThe draft memo also mentions other items included in Trump’s executive order, including the hiring of an additional 5,000 border agents, which needs financing from Congress, and his campaign promise to build a wall between the US and Mexico.\n\nThe signed order contained no mention of the possible use of state National Guard troops.\n\nAccording to the draft memo, the militarization effort would be proactive, specifically empowering Guard troops to solely carry out immigration enforcement, not as an add-on the way local law enforcement is used in the program.\n\nAllowing Guard troops to operate inside non-border states also would go far beyond past deployments.\n\nTrump’s immigration strategy emerges as detentions at the nation’s southern border are down significantly from levels seen in the late 1990s and early 2000s. Last year, the arrest tally was the fifth-lowest since 1972.\n\nDeportations of people living in the US illegally also increased under the Obama administration, though Republicans criticized Obama for setting prosecution guidelines that spared some groups from the threat of deportation, including those brought to the US illegally as children.\n\nLast week, ICE officers arrested more than 680 people around the country in what Kelly said were routine, targeted operations; advocates called the actions stepped-up enforcement under Trump.\n\nWith AP", "authors": ["February"], "publish_date": "2017-02-17", "source": "nypost", "top_words": ["ap", "immigrant", "draft", "considers", "trump", "national", "deploying", "immigration", "proposal", "memo", "enforcement", "border", "states", "roundup", "guard", "team", "troops"], "summary": "According to the wire service, the 11-page document calls for the unprecedented militarization of immigration enforcement as far north as Portland, Oregon, and as far east as New Orleans, Louisiana.\nWhile National Guard personnel have been used to assist with immigration-related missions on the US-Mexico border before, they have never been used as broadly.\nThe memo is addressed to the then-acting heads of US Immigration and Customs Enforcement and US Customs and Border Protection.\nThe signed order contained no mention of the possible use of state National Guard troops.\nAllowing Guard troops to operate inside non-border states also would go far beyond past deployments."}