{"url": "http://pagesix.com/2017/04/04/bebe-rexha-channels-clueless-to-slam-trump/", "id": "206", "title": "Bebe Rexha channels ‘Clueless’ to slam Trump", "text": "Bebe Rexha has taken a line from Cher Horowitz’s book to bash President Trump.\n\n“Ladies and gentlemen, my name is Bebe Rexha, and it does not say you have to R.S.V.P. on the Statue of Liberty. F–k Donald Trump!” the 27-year-old singer said before dropping the mic and strutting off stage at Zedd’s Welcome! fundraising concert for the ACLU on Monday night in Los Angeles.\n\nMany of the younger audience members attending the star-studded event didn’t realize she was quoting the 1995 flick “Clueless.”\n\n“My father came from Albania. He’s an immigrant and if it wasn’t for him, I probably wouldn’t be in the music business or here right now,” the “Me, Myself & I” singer told Page Six. “I think him being able to come here in the ’80s and be free to start his dream, everyone should be able to do that. Everyone should be able to have an American dream and follow that. That’s why I’m here.”\n\nShe added, “Kids need to know that and I feel like I have a platform to tell my fans these things. You’d be surprised how many of them have no idea what’s going on. It’s a good cause and right now we need music more than ever.”\n\nIn January, after Trump attempted to put a travel ban on visitors from seven countries, the ACLU filed a lawsuit against the order. Since then, the ban and its various revisions have been blocked by federal judges.\n\nWe can only imagine Trump is totally buggin’.", "authors": ["April"], "publish_date": "2017-04-04", "source": "nypost", "top_words": ["rexha", "trump", "right", "ban", "singer", "able", "slam", "need", "music", "clueless", "bebe", "dream", "channels"], "summary": "Bebe Rexha has taken a line from Cher Horowitz’s book to bash President Trump.\n“Ladies and gentlemen, my name is Bebe Rexha, and it does not say you have to R.S.V.P.\nF–k Donald Trump!” the 27-year-old singer said before dropping the mic and strutting off stage at Zedd’s Welcome!\n“I think him being able to come here in the ’80s and be free to start his dream, everyone should be able to do that.\nIt’s a good cause and right now we need music more than ever.”In January, after Trump attempted to put a travel ban on visitors from seven countries, the ACLU filed a lawsuit against the order."}