{"url": "http://nypost.com/2017/02/28/trump-travel-ban-expected-to-hurt-foreign-tourism-in-nyc/", "id": "238", "title": "Trump travel ban expected to hurt foreign tourism in NYC", "text": "The Big Apple’s tourism industry might want to start bracing for a Trump slump.\n\nA travel forecast released by the city Tuesday projects tourists visiting the city from abroad will plummet by an estimated 300,000 in 2017 due to the president’s “recent travel ban and related rhetoric.”\n\nThe forecast — put out by the city’s tourism and marketing arm, NYC & Company — predicted the number of tourists coming from other parts of the US will remain strong though and is projected to hit 49.3 million visitors this year.\n\nOverall, tourism is expected to spike by 1 million visitors from 60.7 million last year to 61.7 million in 2017, but the city warned that the drain on foreign travelers is more likely to hit the tourism industry in the pocketbook.\n\nThe spending power of four domestic visitors are equal to what a single international visitor spends, according to NYC & Company spokesman Chris Heywood.\n\nThe projections have led the agency to launch a new marketing campaign to “reassure” international travelers who may feel turned off by Trump’s rhetoric.\n\n“While projected declines among travelers are concerning, the irrepressible hospitality and welcoming nature of New York City gives us confidence that our destination will continue to appeal to visitors from around the world,” said Fred Dixon, NYC & Company president and CEO. “We will work tirelessly to do all we can to preserve our city’s tourism industry in the months ahead.”", "authors": ["February"], "publish_date": "2017-02-28", "source": "nypost", "top_words": ["hurt", "travel", "foreign", "trump", "visitors", "ban", "million", "industry", "nyc", "travelers", "company", "city", "expected", "tourism", "tourists"], "summary": "The Big Apple’s tourism industry might want to start bracing for a Trump slump.\nOverall, tourism is expected to spike by 1 million visitors from 60.7 million last year to 61.7 million in 2017, but the city warned that the drain on foreign travelers is more likely to hit the tourism industry in the pocketbook.\nThe spending power of four domestic visitors are equal to what a single international visitor spends, according to NYC & Company spokesman Chris Heywood.\nThe projections have led the agency to launch a new marketing campaign to “reassure” international travelers who may feel turned off by Trump’s rhetoric.\n“We will work tirelessly to do all we can to preserve our city’s tourism industry in the months ahead.”"}