{"url": "http://nypost.com/2017/02/21/activists-hang-refugees-welcome-banner-on-statue-of-liberty/", "id": "248", "title": "Activists hang ‘Refugees Welcome’ banner on Statue of Liberty", "text": "A group of activists scaled the base of the Statue of Liberty on Tuesday afternoon to hang a large banner reading “Refugees Welcome” right under the lady’s copper skirt.\n\nThe quartet hung the banner at about 12:45 pm. It was up for more than three hours until the National Parks Service tore it down just before 4 pm.\n\nThe group’s idea man, David, said he wanted to make a statement in response to President Trump’s policies on immigration and the “Muslim ban.”\n\n“This is personal to me — my grandparents met in a refugee camp after World War II, and my mother immigrated,” said David, who lives in Brooklyn. “We wanted to send a reminder about America when we’re at our best — the country that’s a beacon of freedom to the world, built by immigrants. Walling off countries or entire religions is against our values.”\n\nParks Service officials removed the banner as soon as they determined that they could do it without damaging Lady Liberty. They also launched an investigation into the incident, officials said.\n\n“Affixing a banner to the national monument is strictly prohibited, and an investigation is underway by the United States Park Police to identify suspects,” officials said in a statement.", "authors": ["February"], "publish_date": "2017-02-21", "source": "nypost", "top_words": ["david", "wanted", "hang", "world", "national", "statue", "liberty", "activists", "investigation", "statement", "service", "officials", "welcome", "refugees", "banner"], "summary": "A group of activists scaled the base of the Statue of Liberty on Tuesday afternoon to hang a large banner reading “Refugees Welcome” right under the lady’s copper skirt.\nThe quartet hung the banner at about 12:45 pm.\nIt was up for more than three hours until the National Parks Service tore it down just before 4 pm.\nWalling off countries or entire religions is against our values.”Parks Service officials removed the banner as soon as they determined that they could do it without damaging Lady Liberty.\n“Affixing a banner to the national monument is strictly prohibited, and an investigation is underway by the United States Park Police to identify suspects,” officials said in a statement."}