{"url": "http://nypost.com/2017/02/18/trumps-new-travel-ban-wont-affect-green-card-holders/", "id": "27", "title": "Trump’s new travel ban won’t affect green-card holders", "text": "A new version of a Trump administration travel ban will not stop green card residency holders or travelers already on planes from entering the United States, U.S. Secretary for Homeland Security John Kelly said on Saturday.\n\nU.S. President Donald Trump’s initial attempt to clamp down for security reasons on immigration from seven Muslim-majority countries and on refugees snarled to a halt amid a judicial backlash and chaos at airports.\n\n“The president is contemplating releasing a tighter, more streamlined version of the first (order). And I will have opportunity to work (on) a rollout plan, in particular to make sure that there’s no one in a sense caught in the system of moving from overseas to our airports,” Kelly said at the Munich Security Conference.\n\nAsked whether green card residency permit holders would be allowed in, Kelly said: “It’s a good assumption and, as far as the visas go, … if they’re in motion from some distant land to the United States, when they arrive they will be allowed in.”\n\nHe promised “a short phase-in period to make sure that people on the other end don’t get on airplanes. But if they’re on an airplane and inbound, they’ll be allowed to enter the country.”\n\nTrump’s original order, which he said was meant to head off attacks by Islamist militants, barred people from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen from entering for 90 days and excluded all refugees for 120 days, except those from Syria, who were banned indefinitely.\n\nThe abrupt implementation of the order last month plunged the immigration system into chaos, sparking a wave of criticism from the countries affected, and from Western allies and some of America’s leading corporations, especially technology firms.", "authors": ["February"], "publish_date": "2017-02-18", "source": "nypost", "top_words": ["travel", "allowed", "ban", "theyre", "holders", "affect", "security", "version", "united", "sure", "trumps", "syria", "system", "wont", "kelly", "order", "greencard"], "summary": "A new version of a Trump administration travel ban will not stop green card residency holders or travelers already on planes from entering the United States, U.S. Secretary for Homeland Security John Kelly said on Saturday.\nU.S. President Donald Trump’s initial attempt to clamp down for security reasons on immigration from seven Muslim-majority countries and on refugees snarled to a halt amid a judicial backlash and chaos at airports.\n“The president is contemplating releasing a tighter, more streamlined version of the first (order).\nAnd I will have opportunity to work (on) a rollout plan, in particular to make sure that there’s no one in a sense caught in the system of moving from overseas to our airports,” Kelly said at the Munich Security Conference.\nThe abrupt implementation of the order last month plunged the immigration system into chaos, sparking a wave of criticism from the countries affected, and from Western allies and some of America’s leading corporations, especially technology firms."}