{"url": "http://nypost.com/2017/02/07/immigrants-describe-being-detained-during-trumps-travel-ban/", "id": "290", "title": "Immigrants describe being detained during Trump’s travel ban", "text": "A newly released filing in Brooklyn federal court reveals the ordeals of travelers across the country who were detained and then deported following President Trump’s immigration ban.\n\nThe nine men and woman were stopped at Washington-Dulles International Airport, Chicago O’Hare and JFK as they arrived on flights from Jordan, Qatar and other hubs across the Middle East.\n\nAll of them tell a tale of “coercion and deception” at the hands of Border Agents, who took their phones and documents, locked them in rooms, and were repeatedly mocked as lawyers and family in the same terminal attempted to secure their release.\n\nSyrian national Ramez Snober was flying to Dulles from Saudi Arabia, where he lives, with his wife and two young daughters on the way to Disney World when they were stopped on Jan. 28.\n\n“My two daughters love the movie ‘Frozen,’ and we were going to Disney World so they could meet their favorite cast of characters: Anna, Elsa, and Olaf,” Snober writes from Saudi, where his family remains. “We also planned to visit other attractions for the children, including WonderWorks and Sea World.”\n\nA Border Patrol officer pulled Snober aside, and stuck his family in a room, where they were questioned–and the officer told the father if he refused to sign away his visa his family would be “put in jail.”\n\n“After we signed the papers, the CBP officers seized our mobile phones,” the declaration reads. “We were prevented from contacting anybody directly, from watching what was happening around us, and from reading the news.”\n\nIn the room, his young daughters saw hordes of people sleeping on the floor, and were also terrified by the “men with guns” who kept\n\n“Since we have returned, my two daughters have been very agitated. They are nervous and upset. My daughters keep saying to me: “You promised to take us to see the Frozen characters, when we will go?”\n\nThey were put on a plane back to Saudi Arabia at 6 pm on Jan. 28. Brooklyn Federal Court Justice Ann Donnelly issued a partial stay on Trump’s travel ban just before 9:00p.m. that same evening.\n\nSyrian National Yahya Aburomman, flew from Jordan to Chicago to visit his brother, was held at Chicago O’Hare on Jan. 29.\n\n“[The border agent] took my phone and asked me for my password,” the 23-year-old writes. “I gave it to him. He walked away. I assume he went through all my emails, messages, Facebook conversations, SMS texts, and private images on my cell phone because he referenced some things later that he would not know if he had not done this.”\n\nAs Aburomman sat in a crowded room, his brother waited on the other side with an attorney, trying to get him out, but were repeatedly told he was gone.\n\nAs he sat on the airplane back to Jordan at 3:50 p.m. on Jan. 29, texting with his attorney, he realized that the “officer who placed me on the airplane had the same\n\nname as the officer who told my attorney that I had “already left.”\n\nNabila Alhaffar lives in Virginia with her husband, she says, who is a doctor.\n\nThe Syrian National was stopped at Dulles on Jan. 28, and told her papers were “blocked.”\n\nShe was then sat down and ordered to sign papers, but became agitated when she asked for a translator because she doesn’t read English well.\n\nAfter asking for her documents back, she was yelled at by a border agent before being stuck on a plane back to Qatar at 9:55 a.m. on Jan 29.\n\n“You are not American,” he allegedly shrieked. “You cannot say ‘my visa’ because this visa belongs to the United States, not to you! You must go back to your country.”\n\n“I am currently in Qatar, my visa having been cancelled, separated from my husband who is working in the United States as a physician, not knowing when I can see my husband again,” she writes.\n\nTwo of the accounts are from women who have successfully re-entered the U.S.–Sara Yarjani and Suha Abushamma–and whose cases have been covered before.\n\nAbushamma, a Sudanese national and Cleveland Clinic resident who was detained at JFK for nine hours before being sent back to Saudi Arabia, returned to the country Monday.\n\nHer attorneys have since filed a motion to dismiss her suit against Trump, though it remains unclear if she’ll join the proposed class action currently brewing in Brooklyn Federal Court, lead by Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi.\n\nThe first-person accounts were published as part of Darweesh and Alshawi’s lawsuit.", "authors": ["February"], "publish_date": "2017-02-07", "source": "nypost", "top_words": ["stopped", "travel", "national", "ban", "immigrants", "jan", "told", "officer", "family", "saudi", "trumps", "border", "detained", "daughters", "visa"], "summary": "A newly released filing in Brooklyn federal court reveals the ordeals of travelers across the country who were detained and then deported following President Trump’s immigration ban.\nBrooklyn Federal Court Justice Ann Donnelly issued a partial stay on Trump’s travel ban just before 9:00p.m.\nSyrian National Yahya Aburomman, flew from Jordan to Chicago to visit his brother, was held at Chicago O’Hare on Jan. 29.\n“You cannot say ‘my visa’ because this visa belongs to the United States, not to you!\nAbushamma, a Sudanese national and Cleveland Clinic resident who was detained at JFK for nine hours before being sent back to Saudi Arabia, returned to the country Monday."}