{"url": "http://nypost.com/2017/09/24/trump-expands-travel-ban-to-include-north-korea-venezuela-and-chad/", "id": "2", "title": "Trump expands travel ban to include North Korea, Venezuela and Chad", "text": "President Trump issued a new travel ban Sunday evening to restrict visitors and immigrants from eight countries that have “inadequate” vetting procedures.\n\n“Making America Safe is my number one priority. We will not admit those into our country we cannot safely vet,” Trump tweeted Sunday in announcing immigration policy.\n\nTrump’s March 6 executive order that covered travelers from six countries — Iran, Libya, Somalia, Syria, Sudan and Yemen — ​expired Sunday evening.\n\nThe new proclamation will maintain travel restrictions on Iran, Libya, Somalia, Syria and Yemen. Sudan has been dropped from the list.\n\nBut traveling from three new countries will now be suspended and limited: Chad, North Korea and Venezuela.\n\n“These restrictions are both vital to national security and conditions based,” a senior Administration official said Sunday.\n\nThe travel restrictions on the new countries will kick in at 12:01 am on Oct. 18. Guidelines will be sent to embassies and consulates on how to implement the new proclamation. The Supreme Court had already decided under the previous travel ban people with a “bonafide” relationship to the United States would still be welcomed and such waivers are expected to remain in place.\n\nAnyone with a valid visa currently will not have their travel documents revoked, senior Administration officials told reporters Sunday.\n\nThis year, the Trump Administration conducted a worldwide review of immigration and travel procedures to ensure national security. The Administration concluded seven countries don’t meet standards for information sharing and screening to ensure visitors to the US don’t pose a threat: Chad, Iran, Libya, North Korea, Syria, Venezuela, and Yemen.\n\nThe eighth, Somalia, “generally satisfies” the requirements, but restrictions were needed because of the “government’s inability to effectively and consistently cooperate” and the “significant” terror threat emanating from the country, according to the president’s proclamation.\n\nA ninth country – Iraq —was also deemed not to meet the “baseline” standards for vetting but the ally country won’t be subject to the ban because of its unique counterterrorism and diplomatic relationship with the US.\n\nCountries will be removed from the travel ban when they meet the standards for information sharing on identifying their nationals.\n\n“Countries may come off the list as we review them,” another Administration official said.\n\nTrump’s initial travel ban has been subject to a Supreme Court challenge and nationwide protests. He’s stood firm on the need for extreme vetting. Asked Sunday about the new travel restrictions, the president said: “The travel ban: The tougher, the better.”", "authors": ["September"], "publish_date": "2017-09-24", "source": "nypost", "top_words": ["travel", "restrictions", "trump", "ban", "expands", "korea", "venezuela", "vetting", "chad", "syria", "countries", "include", "north", "country", "standards", "administration"], "summary": "President Trump issued a new travel ban Sunday evening to restrict visitors and immigrants from eight countries that have “inadequate” vetting procedures.\nThis year, the Trump Administration conducted a worldwide review of immigration and travel procedures to ensure national security.\nCountries will be removed from the travel ban when they meet the standards for information sharing on identifying their nationals.\nTrump’s initial travel ban has been subject to a Supreme Court challenge and nationwide protests.\nAsked Sunday about the new travel restrictions, the president said: “The travel ban: The tougher, the better.”"}