{"url": "http://nypost.com/2017/04/20/hawaii-reminds-jeff-sessions-theyre-actually-a-state/", "id": "200", "title": "Hawaii reminds Jeff Sessions its actually a state", "text": "HONOLULU — Hawaii’s Democratic lawmakers on Thursday criticized Attorney General Jeff Sessions after he expressed amazement on a radio show that a “judge sitting on an island in the Pacific” could stop the president’s travel ban.\n\nU.S. Sen. Mazie Hirono responded by trying to give Sessions a civics lesson on Twitter, saying Hawaii has been a U.S. state for 58 years.\n\nThe senator said later in a telephone interview the remarks showed a lack of awareness about the separation of powers between the judiciary and executive branches.\n\nU.S. District Judge Derrick Watson last month blocked President Donald Trump’s executive order prohibiting new visas for people from six Muslim-majority countries and temporarily halting the U.S. refugee program. The Trump Administration appealed the ruling.\n\nSessions told the “Mark Levin Show” he’s confident the president will prevail with his administration’s appeal of Watson’s travel ban ruling.\n\nsee also Federal judge extends order blocking Trump's travel ban HONOLULU — A federal judge in Hawaii decided Wednesday to...\n\n“I really am amazed that a judge sitting on an island in the Pacific can issue an order that stops the president of the United States from what appears to be clearly his statutory and constitutional power,” Sessions said.\n\nHirono also said Sessions’ remarks suggested he is prejudiced against Hawaii.\n\n“Why isn’t a federal judge from Hawaii as able as any other judge from anywhere to issue rulings?” Hirono asked.\n\nShe told Session on Twitter “we won’t succumb to your dog whistle politics.”\n\nBoth Hirono and Sen. Brian Schatz emphasized that Sessions voted as a senator to confirm Watson as a judge.\n\nSchatz chided Sessions more on Twitter by telling him the island where Watson made the ruling is named Oahu.\n\nState of Hawaii has many islands, not one island. We have around 1.5 m people. Island of Hawaii has 186,000 people. Please use the google. https://t.co/aoZewx7jzT — Brian Schatz (@brianschatz) April 20, 2017\n\n“It’s my home. Have some respect,” he said.\n\nU.S. Justice Department spokesman Ian Prior said in an email that Sessions was questioning one judge’s ability to block the president’s executive order for the travel ban.\n\n“Hawaii is, in fact, an island in the Pacific — a beautiful one where the Attorney General’s granddaughter was born,” Prior said. “The point, however, is that there is a problem when a flawed opinion by a single judge can block the President’s lawful exercise of authority to keep the entire country safe.”\n\nDouglas Chin, Hawaii’s attorney general, said in a statement it was disappointing Sessions doesn’t acknowledge that the federal courts are “co-equal partners with Congress and the president.”\n\nA clerk for the U.S. District Court in Hawaii said Watson declined to comment.", "authors": ["Associated Press", "April"], "publish_date": "2017-04-20", "source": "nypost", "top_words": ["travel", "hawaii", "island", "reminds", "state", "actually", "judge", "order", "twitter", "sessions", "federal", "jeff", "presidents", "watson"], "summary": "U.S. Sen. Mazie Hirono responded by trying to give Sessions a civics lesson on Twitter, saying Hawaii has been a U.S. state for 58 years.\nSessions told the “Mark Levin Show” he’s confident the president will prevail with his administration’s appeal of Watson’s travel ban ruling.\n“Why isn’t a federal judge from Hawaii as able as any other judge from anywhere to issue rulings?” Hirono asked.\nSchatz chided Sessions more on Twitter by telling him the island where Watson made the ruling is named Oahu.\n“Hawaii is, in fact, an island in the Pacific — a beautiful one where the Attorney General’s granddaughter was born,” Prior said."}