{"url": "http://nypost.com/2017/03/17/canadas-border-officials-detain-record-number-of-mexicans/", "id": "218", "title": "Canada’s border officials detain record number of Mexicans", "text": "Canada’s border authorities detained more Mexicans in the first 67 days of 2017 than they did annually in any of the three previous years, according to statistics obtained by Reuters.\n\nThe spike comes immediately after Canada’s federal government lifted its visa requirement for Mexican citizens in December.\n\nMany Mexicans looking north have shifted their focus from the United States to Canada as President Donald Trump vows to crack down on America’s undocumented immigrants, about half of whom are Mexican. On Friday, Reuters reported, immigration judges were reassigned to 12 U.S. cities to speed up deportation.\n\nThe Canada Border Services Agency (CBSA) said it detained 444 Mexican nationals between Jan. 1 and March 8, compared with 410 for all of 2016, 351 for 2015, and 399 for 2014.\n\nThe CBSA can detain foreign nationals if it is believed they pose a danger to the public, if their identity is unclear or if they are deemed unlikely to appear for removal or for a proceeding.\n\nThe number of Mexicans turned back at the airport has risen, too – to 313 in January, more than any January since 2012 and more than the annual totals for 2012, 2013 and 2014.\n\nWith the visa requirement lifted, all that Mexicans need to come to Canada is an Electronic Travel Authorization (eTA), obtainable online in a matter of minutes. But they cannot work without a work permit, and the eTA does not guarantee entry.\n\nCanada issued 72,450 travel authorizations to Mexican citizens between Dec. 1, 2016, and March 10, 2017 – a significant increase compared with a similar period when visas were required.\n\nCanada’s Immigration and Refugee Minister Ahmed Hussen has said his department is monitoring the situation. His office did not immediately respond to a request for comment Friday afternoon.", "authors": ["March"], "publish_date": "2017-03-17", "source": "nypost", "top_words": ["mexican", "travel", "nationals", "canadas", "requirement", "mexicans", "immigration", "officials", "work", "number", "detain", "border", "lifted", "record", "visa", "canada"], "summary": "Canada’s border authorities detained more Mexicans in the first 67 days of 2017 than they did annually in any of the three previous years, according to statistics obtained by Reuters.\nThe spike comes immediately after Canada’s federal government lifted its visa requirement for Mexican citizens in December.\nThe Canada Border Services Agency (CBSA) said it detained 444 Mexican nationals between Jan. 1 and March 8, compared with 410 for all of 2016, 351 for 2015, and 399 for 2014.\nWith the visa requirement lifted, all that Mexicans need to come to Canada is an Electronic Travel Authorization (eTA), obtainable online in a matter of minutes.\nCanada’s Immigration and Refugee Minister Ahmed Hussen has said his department is monitoring the situation."}