{"url": "http://nypost.com/2017/03/18/trumps-first-two-months-prove-hes-anything-but-a-fascist/", "id": "216", "title": "Trump’s first two months prove he’s anything but a fascist", "text": "When Donald Trump moved into the White House, were you under the impression it was tantamount to either Fifth Avenue Moses coming in to part the filthy waters of the Swamp, or MussoHitler about to bring down the mighty hammer of neo-fascism upon the US?\n\nIf so, the joke’s on you. If there’s any ancient tale that presaged the start of the Trump Era, it’s the Voyage to Lilliput in “Gulliver’s Travels.”\n\nGulliver-like, Trump finds himself tied down by a thousand tiny strings, paralyzed by micro-people he can barely detect. Because of their combined power, he can’t do much of anything. If it’s the system vs. Trump, the system is winning, bigly. But it isn’t Berserkeley radicals or marching feminists in pussy hats who are leading the charge to #resist. Resistance to change is as natural in Washington as cherry blossoms in spring.\n\nSince being promoted from private citizen to president, the only thing Trump has exercised undisputed authoritarian control over has been his Twitter account. And even that mysteriously seems to go silent at the exact times his aides are being badgered with questions about his latest tweet.\n\nThanks to two judges (Derrick K. Watson of Hawaii and Judge Theodore D. Chuang of Maryland) who didn’t star in a hit reality TV show, aren’t the most famous dudes on Earth and don’t have 27 million Twitter followers, Trump’s latest executive order restricting immigration from six countries with major terrorism problems is on hold.\n\nThe judiciary is a check on the president. Trump’s predecessor found that out, too, when the Fifth Circuit court upheld a lower court order that blocked Obama’s immigration plan (which would have shielded 5 million illegal aliens from deportation). There’s no such thing as doing an end-around the system (or, if you like, the Swamp).\n\nEven with his party in control of both houses in Congress, Trump is finding major limits to what he can do legislatively. The American Health Care Act is not going to pass (without major changes) because, as Trump himself so memorably put it, health care is “an unbelievably complex subject.” The Jenga game that is ObamaCare is so wobbly that removing a single block could cause the health-care system to come crashing down. Which is why Republicans can’t agree on whether AHCA leans too far in the direction of the free market, or not far enough.\n\nEven with his party in control of both houses in Congress, Trump is finding major limits to what he can do legislatively.\n\nPassing a budget? Hey, guess what? The president can’t spend a dime without Congress. As Marco Rubio so cruelly, but accurately, put it: “We do the budget here. The administration makes recommendations, but Congress does budgets.” Marco may still be little. But Congress is still big.\n\nLiberals should have had more respect for our national institutions than to think that one man could simply have trashed them all. Yet The New York Review of Books called Trump an autocrat in a Nov. 10 story that warned, “Institutions will not save you” and said Trump was the new Vladimir Putin.\n\nThe Atlantic called Trump an autocrat in its March cover story, imagining that the president would force Jeff Bezos to sell The Washington Post. Instead, the WaPo has been running pieces like “Donald Trump is actually a fascist” (Dec. 9) and “Trump’s Twitter feed is a gateway to authoritarianism” (March 6).\n\nThe New Yorker, having called Trump a fascist many times (May 16, July 14, Nov. 4, etc.), has now turned around and begun portraying him as a helpless naif, the opposite of a strongman. “Trump Is Still Trapped in His Campaign,” read a March 16 piece that gently tsk-tsked Trump for being unable to get anything done. Even more on point was a New Yorker humor piece by Andy Borowitz: “Trump Says He Has Been Treated Very Unfairly By People Who Wrote the Constitution.”\n\nOh, that old thing? It’s been there all along, and it is a lot stronger than any president. Liberals didn’t see that because, up until 10 minutes ago, they thought the Constitution was a bad thing due to its ability to frustrate rapid progressive change.\n\nsee also Trump admits killing ObamaCare is harder than he thought President Trump on Monday admitted that repealing and replacing ObamaCare...\n\nRemember when The New Yorker was running “Our Broken Constitution” (Dec. 9, 2013) and saying, “The compromises, misjudgments and failures of the men in Philadelphia haunt us still today.”? Remember “Let’s Give Up on the Constitution”? (New York Times op-ed, Dec. 30, 2012) and “Let’s Stop Pretending the Constitution is Sacred” (Salon, Jan. 4, 2011)?\n\nStopping someone like Trump (or Obama, or Reagan or FDR) from doing too much with just his pen and his phone is exactly the point of the checks and balances installed by the Framers.\n\nIf Trump wants to get anything done in Washington, he’d better learn that he wasn’t elected dictator. Being an effective president means much more (and less) than grand speeches riffing about Hillary Clinton in front of roaring crowds. It means homework.\n\nIt means recognizing the importance of all the boring stuff like making the right judicial appointments and sub-Cabinet hires. It means getting out of the White House to sell his ideas to Washington insiders, not just to adoring crowds of fans. Trump needs to learn about compromise, negotiation and sweet talk.\n\nTo succeed as president, he needs to study up on what someone once called the art of the deal.", "authors": ["Kyle Smith", "March"], "publish_date": "2017-03-18", "source": "nypost", "top_words": ["hes", "thing", "major", "means", "trump", "congress", "constitution", "trumps", "months", "system", "president", "called", "washington", "fascist", "prove"], "summary": "Since being promoted from private citizen to president, the only thing Trump has exercised undisputed authoritarian control over has been his Twitter account.\nEven with his party in control of both houses in Congress, Trump is finding major limits to what he can do legislatively.\nThe New Yorker, having called Trump a fascist many times (May 16, July 14, Nov. 4, etc.\nsee also Trump admits killing ObamaCare is harder than he thought President Trump on Monday admitted that repealing and replacing ObamaCare...\nBeing an effective president means much more (and less) than grand speeches riffing about Hillary Clinton in front of roaring crowds."}