{"url": "http://nypost.com/2017/02/09/trump-slams-senator-who-made-supreme-court-nominees-criticism-public/", "id": "282", "title": "Trump slams senator who made Supreme Court nominee’s criticism public", "text": "Donald Trump slammed the US senator who disclosed Supreme Court nominee Neil Gorsuch’s criticism of the president, accusing him of misrepresenting the judge’s comments.\n\n“Sen. Richard Blumenthal, who never fought in Vietnam when he said for years he had (major lie), now misrepresents what Judge Gorsuch told him?” Trump tweeted Thursday morning.\n\nThe comment appeared to come after Blumenthal appeared on CNN, which also drew criticism from Trump.\n\n“Chris Cuomo, in his interview with Sen. Blumenthal, never asked him about his long-term lie about his brave ‘service’ in Vietnam. FAKE NEWS!” the president tweeted.\n\nBlumenthal (D-Conn.) disclosed Wednesday that Gorsuch called Trump’s attacks on judges “disheartening” and “demoralizing.”\n\nBlumenthal’s characterization of Gorsuch’s comments was confirmed by spokesman Ron Bonjean, who’s helping handle media relations for the Supreme Court nominee.\n\nIt was also confirmed Thursday morning by another US senator, Republican Ben Sasse of Nebraska, who revealed that Gorsuch got “pretty passionate about it” in a private conversation this week in his Senate office.\n\n“Any attack on brothers or sisters of the robe is an attack on all judges,” Sasse said Gorsuch told him.\n\nBut Trump was right about Blumenthal, who, like Trump, received five deferments to avoid serving in Vietnam.\n\nBlumenthal misrepresented his career and claimed he had served in Vietnam before confessing to reporters in 2010 that he had “misspoken.”", "authors": ["February"], "publish_date": "2017-02-09", "source": "nypost", "top_words": ["judges", "trump", "vietnam", "supreme", "public", "told", "court", "slams", "gorsuch", "senator", "president", "blumenthal", "criticism", "nominees", "sasse"], "summary": "Donald Trump slammed the US senator who disclosed Supreme Court nominee Neil Gorsuch’s criticism of the president, accusing him of misrepresenting the judge’s comments.\nRichard Blumenthal, who never fought in Vietnam when he said for years he had (major lie), now misrepresents what Judge Gorsuch told him?” Trump tweeted Thursday morning.\nThe comment appeared to come after Blumenthal appeared on CNN, which also drew criticism from Trump.\n“Any attack on brothers or sisters of the robe is an attack on all judges,” Sasse said Gorsuch told him.\nBut Trump was right about Blumenthal, who, like Trump, received five deferments to avoid serving in Vietnam."}