{"url": "http://nypost.com/2017/02/06/dozens-of-law-students-welcome-iranian-girl-at-jfk-airport/", "id": "299", "title": "Dozens of law students welcome Iranian girl at JFK airport", "text": "Dozens of Fordham law school students gathered at JFK Airport on Monday night to welcome the 11-year-old daughter of an Iranian classmate who was almost barred from coming into the US as a result of President Trump’s travel ban.\n\nMore than 50 people hunkered down at Terminal 1 — holding signs, flowers and gifts — as little Alma Kashkooli came through customs “smoothly” at around 6:23 p.m.\n\n“I can’t describe. Very happy, just like any other mom,” her mother, Farimah Kashkooli, told reporters just moments after the young girl arrived.\n\n“It went pretty smoothly,” she said. “[Alma] is sleepy right now. She is tired. As soon as possible we are going to go through surgery.”\n\nKashkooli, 33, appeared happy and emotional as she hugged and kissed her daughter in front of her classmates upon her arrival.\n\n“This time she is on F-2 visa dependent on a student visa,” Kashkooli said.\n\nAlma suffers from what is known as a congenital disorder of glycosylation or CDG, which impairs the cells’ ability to communicate with each other. As a result, she can barely walk or talk and is prone to seizures. Her mother said that she was likely to go blind if barred from entering the US for her treatment.\n\nThe child had been scheduled to leave Tehran last week, and had already obtained a US visa — but was delayed when her father was unable to do so. Kashkooli, who was already in the US, was planning on making the 20-hour trip herself, until Friday’s ruling by a Seattle judge lifting Trump’s travel restrictions.\n\nHer daughter is one of countless people from the seven countries whose medical care in the US has been jeopardized by the travel ban, experts said.\n\n“It was pretty uncomfortable,” Kashkooli said of not knowing whether Alma would come back to the US, like she has been doing since 2007.\n\n“I was suffering.”\n\nKashkooli — a Fordham LLM studenth who has a student visa and is on a partial scholarship — was joined by scores of classmates Monday night who wanted to show their support for her and others like Alma.\n\n“She is my good friend. I learned about her troubles from an email the school sent out today,” Zhengyi Wang, 26, told The Post.\n\n“I think we could help,” she said. “I skipped the class tonight to come tonight. It’s the right thing to do. That poor little girl needs medical service. There is no reason to ban her.”\n\nA family friend named Jane, who was traveling with Alma on the Turkish Airways flight, said they came into the country without incident.\n\n“They let us right through,” she said. “She was very good. She listened to some music and then she slept. It went very well with her. Her name translates to apple and I told her mother, ‘I’m going to bring little apple to the big apple.’ It was pretty exhausting, but we did it.”", "authors": ["February"], "publish_date": "2017-02-06", "source": "nypost", "top_words": ["girl", "alma", "travel", "airport", "mother", "right", "little", "told", "visa", "dozens", "iranian", "welcome", "kashkooli", "students", "daughter", "law", "jfk", "pretty"], "summary": "Dozens of Fordham law school students gathered at JFK Airport on Monday night to welcome the 11-year-old daughter of an Iranian classmate who was almost barred from coming into the US as a result of President Trump’s travel ban.\nMore than 50 people hunkered down at Terminal 1 — holding signs, flowers and gifts — as little Alma Kashkooli came through customs “smoothly” at around 6:23 p.m.“I can’t describe.\nVery happy, just like any other mom,” her mother, Farimah Kashkooli, told reporters just moments after the young girl arrived.\n“This time she is on F-2 visa dependent on a student visa,” Kashkooli said.\n“It was pretty uncomfortable,” Kashkooli said of not knowing whether Alma would come back to the US, like she has been doing since 2007."}