{"url": "http://nypost.com/2017/02/10/trump-supporters-say-bowling-green-massacre-justifies-travel-ban/", "id": "275", "title": "Trump supporters say ‘Bowling Green Massacre’ justifies travel ban", "text": "More than half of Donald Trump supporters in a new poll said the “Bowling Green Massacre” — which never happened — justified the president’s attempt to impose a temporary travel ban.\n\nFifty-one percent of people who voted for the president said the non-existent terror attack was reason enough to restrict travel into the US.\n\nTwenty-three percent disagreed and 20 percent weren’t sure, according to the survey by the left-leaning Public Policy Polling.\n\nBy contrast, just 2 percent of Hillary Clinton’s voters said the “massacre” was a reason to support the ban, as opposed to 90 percent who disagreed and 8 percent who were not sure.\n\nOverall, 23 percent of the 712 voters questioned believed the “massacre” cited by Trump adviser Kellyanne Conway justified the ban. Fifty-seven percent did not, with 20 percent unsure.\n\nConway said later she made an “honest mistake” and was referring to two Iraqi nationals from Bowling Green, Kentucky, arrested in 2011 for plotting to provide weapons to al Qaeda.\n\nThe poll, conducted Feb. 7 and 8, also found that three weeks into his administration, voters were evenly divided on whether Trump should be impeached, with 46 percent in favor and the same number opposed.\n\nOverall, 66 percent of Americans think the US is a safe country while just 23 percent consider it unsafe.\n\nAnd voters who feel safe don’t want to pay for a border wall — 56 to 37 percent — and they also don’t support an idea floated by Team Trump to impose a 20 percent tariff on Mexican imports, by a margin of 55 to 32 percent.\n\nBy a 48 to 43 percent spread, voters believed Trump’s executive order to temporarily ban refugees and immigrants from seven Muslim-majority countries was a “Muslim ban.”\n\nThe North Carolina-based polling outfit also found that voters trusted judges more than they trusted Trump by a margin of 53 to 38 percent.\n\nTrump has unloaded on Twitter and in his comments on both a Seattle federal judge and a federal appellate court in San Francisco, calling the jurist a “so-called judge” and the appeals court’s Tuesday hearing on his travel ban “ridiculous.”", "authors": ["February"], "publish_date": "2017-02-10", "source": "nypost", "top_words": ["travel", "trump", "bowling", "ban", "support", "voters", "justifies", "safe", "reason", "green", "trusted", "supporters", "massacre", "20", "say"], "summary": "More than half of Donald Trump supporters in a new poll said the “Bowling Green Massacre” — which never happened — justified the president’s attempt to impose a temporary travel ban.\nFifty-one percent of people who voted for the president said the non-existent terror attack was reason enough to restrict travel into the US.\nTwenty-three percent disagreed and 20 percent weren’t sure, according to the survey by the left-leaning Public Policy Polling.\nOverall, 23 percent of the 712 voters questioned believed the “massacre” cited by Trump adviser Kellyanne Conway justified the ban.\nTrump has unloaded on Twitter and in his comments on both a Seattle federal judge and a federal appellate court in San Francisco, calling the jurist a “so-called judge” and the appeals court’s Tuesday hearing on his travel ban “ridiculous.”"}