{"url": "http://nypost.com/2017/06/05/trump-says-doj-shouldnt-have-sent-politically-correct-travel-ban/", "id": "24", "title": "Trump scolds DOJ for sending ‘politically correct’ travel ban to Supreme Court", "text": "President Trump on Monday described his executive order on immigration as a “travel ban” — lashing out at his Justice Department for submitting a “watered down” version to the Supreme Court.\n\nIn a series of early morning tweets, Trump railed against the “politically correct” version and urged the department to seek an “expedited hearing” by the high court.\n\n“People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!” he wrote.\n\n“The Justice Dept. should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C.,” Trump said.\n\n“The Justice Dept. should ask for an expedited hearing of the watered down Travel Ban before the Supreme Court – & seek much tougher version!” he continued. “In any event we are EXTREME VETTING people coming into the U.S. in order to help keep our country safe. The courts are slow and political!”\n\nThe president’s tweetstorm came on the heels of the terror attack in London that left seven people dead and wounded 48 others. ISIS has claimed responsibility for the attack.\n\nThe White House had rejected the characterization of Trump’s original executive order as a travel ban, describing it instead as a vetting system to keep America safe.\n\nAs a candidate, Trump called for a “total and complete shutdown” of Muslim immigration to the US.\n\nLast week, his administration asked the Supreme Court to allow the ban — which temporarily bars nationals from six mostly Muslim countries — after lower courts rejected his national security justifications for the ban because it showed anti-Muslim prejudice.\n\nThe revised order removed Iraq from the list of banned countries, and an indefinite halt to entry from Syrian refugees was replaced by a temporary pause.\n\nA date for the court to hear arguments in the case was not immediately set.\n\nTrump’s Monday missives came a day after he said he would do whatever was necessary to protect the US from a “vile enemy” that he said has targeted innocents for too long.\n\n“This bloodshed must end, this bloodshed will end,” he vowed.\n\nEarlier Sunday, Trump slammed London Mayor Sadiq Khan for telling Londoners that “there’s no reason to be alarmed” after the terror attack — though Khan was referring to an increased police presence.\n\n“At least 7 dead and 48 wounded in terror attack and Mayor of London says there is ‘no reason to be alarmed!’” he tweeted.\n\nThe mayor’s spokesman said he was too busy to respond to Trump’s “ill-informed” tweet.\n\nOn Saturday, Trump tweeted: “We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!”\n\nAfter more than 20 people were killed in a bombing last month in Manchester, Trump condemned the assault as the act of “evil losers” and called on nations to unite in the fight against terrorism.\n\nJustice Department spokeswoman Sarah Isgur Flores last week said the department had “asked the Supreme Court to hear this important case and [is] confident that President Trump’s executive order is well within his lawful authority to keep the nation safe and protect our communities from terrorism.”\n\n“The president is not required to admit people from countries that sponsor or shelter terrorism,” the statement said, “until he determines that they can be properly vetted and do not pose a security risk to the United States.”\n\nWith Post wires", "authors": ["June"], "publish_date": "2017-06-05", "source": "nypost", "top_words": ["travel", "politically", "trump", "scolds", "correct", "supreme", "sending", "ban", "courts", "court", "version", "doj", "need", "order", "department"], "summary": "President Trump on Monday described his executive order on immigration as a “travel ban” — lashing out at his Justice Department for submitting a “watered down” version to the Supreme Court.\nIn a series of early morning tweets, Trump railed against the “politically correct” version and urged the department to seek an “expedited hearing” by the high court.\nshould have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C.,” Trump said.\nshould ask for an expedited hearing of the watered down Travel Ban before the Supreme Court – & seek much tougher version!” he continued.\nThe White House had rejected the characterization of Trump’s original executive order as a travel ban, describing it instead as a vetting system to keep America safe."}