{"url": "http://nypost.com/2017/03/15/mark-viverito-compares-trumps-handling-of-immigrants-to-ethnic-cleansing/", "id": "223", "title": "Mark-Viverito compares Trump’s handling of immigrants to ‘ethnic cleansing’", "text": "City Council Speaker Melissa Mark-Viverito on Wednesday likened the Trump administration’s handling of immigration enforcement to “ethnic cleansing” — a term frequently associated with genocide.\n\nAt a Council oversight hearing on the city’s response to the Trump’s administration immigration policies, Mark-Viverito echoed a Cardozo Law School professor’s use of the charged term.\n\n“I think you said something that’s very powerful here about ethnic cleansing,” Mark-Viverito said at the hearing. “I think in the last couple of weeks we’ve seen very, very, very clearly what the ultimate goal is of this administration. There clearly is a sense of purging… of implementing policies to purge certain groups of people from this country.”\n\nMark-Viverito pointed to the travel ban targeting majority-Muslim countries, the policies of White House chief strategist Steve Bannon and the comments of Rep. Steve King (R-Iowa).\n\nKing recently tweeted in part that “culture and demographics are our destiny. We can’t restore our civilization with somebody else’s babies.”\n\nHis statement was widely criticized — including some who called it racist — but he has refused to apologize for it.\n\nAsked after the hearing about her use of the term “ethnic cleansing”, Mark-Viverito acknowledged it was “strong” terminology and noted that she was repeating the professor’s language.\n\n“But when we’re looking at the policies and what’s clearly being verbalized and articulated by this administration unapologetically.. there seems to be a real clear intent that certain types of people are being focused on with the express intent of getting them and removing them from this country,” she told reporters.\n\n“It’s very very strong language, but really there is clear intent in what it is that they’re trying to do,” Mark-Viverito added. “And we’re going to push back against that.”\n\nWhite House officials did not immediately respond to a request for comment.", "authors": ["March"], "publish_date": "2017-03-15", "source": "nypost", "top_words": ["clearly", "policies", "immigrants", "cleansing", "ethnic", "intent", "think", "term", "compares", "trumps", "handling", "hearing", "administration", "markviverito"], "summary": "City Council Speaker Melissa Mark-Viverito on Wednesday likened the Trump administration’s handling of immigration enforcement to “ethnic cleansing” — a term frequently associated with genocide.\nAt a Council oversight hearing on the city’s response to the Trump’s administration immigration policies, Mark-Viverito echoed a Cardozo Law School professor’s use of the charged term.\n“I think you said something that’s very powerful here about ethnic cleansing,” Mark-Viverito said at the hearing.\nAsked after the hearing about her use of the term “ethnic cleansing”, Mark-Viverito acknowledged it was “strong” terminology and noted that she was repeating the professor’s language.\n“It’s very very strong language, but really there is clear intent in what it is that they’re trying to do,” Mark-Viverito added."}