{"url": "http://pagesix.com/2017/04/03/bella-hadid-i-am-proud-to-be-a-muslim/", "id": "208", "title": "Bella Hadid: ‘I am proud to be a Muslim’", "text": "Donald Trump‘s “Muslim ban” didn’t sit well with Bella Hadid.\n\n“My dad was a refugee when he first came to America, so it’s actually very close to home for my sister and brother and me,” she said in the summer issue of Porter magazine.\n\nThe 20-year-old model added, “He was always religious, and he always prayed with us. I am proud to be a Muslim.”\n\nHadid’s father, Mohamed Hadid, 68, was born in Nazareth, Israel, and lived in Syria and Lebanon before his family came to America when he was 14 years old. The real estate mogul is now reportedly worth $200 million.\n\nBella and her sister Gigi, 21, marched in a protest against the immigration ban in February.\n\n“I come from a really diverse background,” she told Elle after the march, “I’ve had incredible experiences all over the world … and I’ve learned that we’re all just people, and we all deserve respect and kindness. We shouldn’t treat people as if they don’t deserve kindness just because of their ethnicities. It’s just not right. And that message — to be compassionate whenever possible — that’s so important to me.”", "authors": ["April"], "publish_date": "2017-04-03", "source": "nypost", "top_words": ["kindness", "america", "came", "world", "sister", "ive", "ban", "bella", "worth", "deserve", "trumps", "proud", "muslim", "hadid"], "summary": "Donald Trump‘s “Muslim ban” didn’t sit well with Bella Hadid.\nThe 20-year-old model added, “He was always religious, and he always prayed with us.\nI am proud to be a Muslim.”Hadid’s father, Mohamed Hadid, 68, was born in Nazareth, Israel, and lived in Syria and Lebanon before his family came to America when he was 14 years old.\nBella and her sister Gigi, 21, marched in a protest against the immigration ban in February.\nWe shouldn’t treat people as if they don’t deserve kindness just because of their ethnicities."}