{"url": "http://nypost.com/2017/02/28/muhammad-ali-jr-says-airport-detention-made-him-feel-violated/", "id": "239", "title": "Muhammad Ali Jr. says airport detention made him feel ‘violated’", "text": "Muhammad Ali’s son said Monday he felt “violated” when immigration officials questioned him about his religion at a Florida airport.\n\n“I was just appalled,” Muhammad Ali Jr. told the Associated Press in a phone interview. “I’m a US citizen and they’re asking me, what is my religion?”\n\nAli Jr. and his mother, Khalilah Camacho Ali, said they were pulled aside and separated from each other on Feb. 7 at Fort Lauderdale-Hollywood International Airport as they returned from a trip to Jamaica for a Black History Month event.\n\nAli Jr., 44, said he was detained for about two hours, despite telling customs officials that he’s the boxing great’s son and a native-born U.S. citizen. Ali Jr. showed them his passport and driver’s license, said attorney Chris Mancini, a family friend.\n\n“I felt like I was religiously profiled,” Ali Jr. said. “I felt violated.”\n\nUS Customs and Border Protection spokesman Daniel Hetlage confirmed that Ali Jr. was held for questioning by customs officers, but said “it wasn’t because he’s a Muslim and it wasn’t because of his Arabic-sounding name.”\n\nThe agency said in a statement that its officers process more than 1.2 million international travelers daily with “vigilance and in accordance with the law.” It said it does not discriminate based on religion, race, ethnicity or sexual orientation.\n\n“We treat all travelers with respect and sensitivity,” it said.\n\nAli Jr. and his mother said it was the first time they had been asked if they’re Muslims when re-entering the United States.\n\nHis father, a three-time heavyweight boxing champion, became famous outside the ring as a civil rights champion. After his conversion to Islam, Ali refused to enter the military during the Vietnam War as a conscientious objector. His decision resulted in a draft-evasion conviction, and he was stripped of his heavyweight crown.\n\nAli’s legal fight ended when the US Supreme Court ruled in his favor.\n\nAli died last June at age 74 after a long battle with Parkinson’s disease.\n\nHis son said Monday his treatment by the customs officials is the kind of wrong his father fought against.\n\n“It’s like history is repeating itself,” he said. “We’re having to fight for our humanity all over again. And now they’re sticking the religion on it.”\n\nCamacho Ali said she was detained about a half-hour and questioned about her religion and background.\n\n“I was in a state of shock,” she said Monday. “They started asking me about where did you get your name and where were you born and what religion are you?”\n\nWhile detained, she said, she pulled out a half-century-old photo of her and Ali on their first date.\n\nThe customs officials gave no reason for their detention and no apology when they were released, Ali Jr. and his mother said.\n\n“They said, ‘You’re free to go,'” Ali Jr. said. “I was free to go as soon as I got here.”", "authors": ["Associated Press", "February"], "publish_date": "2017-02-28", "source": "nypost", "top_words": ["jr", "detention", "airport", "mother", "customs", "theyre", "violated", "ali", "officials", "religion", "muhammad", "felt", "feel", "son", "detained"], "summary": "Muhammad Ali’s son said Monday he felt “violated” when immigration officials questioned him about his religion at a Florida airport.\n“I was just appalled,” Muhammad Ali Jr. told the Associated Press in a phone interview.\nAli Jr. showed them his passport and driver’s license, said attorney Chris Mancini, a family friend.\nThe customs officials gave no reason for their detention and no apology when they were released, Ali Jr. and his mother said.\n“They said, ‘You’re free to go,'” Ali Jr. said."}