{"url": "http://nypost.com/2017/02/16/hillary-takes-subtle-digs-at-trump-over-immigration-ban/", "id": "258", "title": "Hillary takes subtle digs at Trump over immigration ban", "text": "Hillary Clinton spoke at the unveiling of a new stamp honoring the late designer Oscar de la Renta at Grand Central Terminal on Thursday — and took indirect swipes at President Trump.\n\n“Oscar de la Renta was an immigrant … and aren’t we proud and grateful that he was,” she said to loud applause as she was joined on the stage by ex-Mayor Mike Bloomberg and fashion diva Anna Wintour.\n\nShe praised the designer, a native of the Dominican Republic, and without mentioning his name slighted the president over his hard-line immigration stance.\n\nThe designer, who died in 2014, was a good choice to be honored on a stamp due to his talent and incredible success, she said.\n\n“But it’s also going with him to Washington Heights, going to a nightclub and watching him dance the salsa with [people] who were just starting out their lives in this great city, in this blessed country,” said Clinton, who was accompanied by longtime aide Huma Abedin.\n\n“He knew what they were hoping for. He gave of his heart and his soul to make sure that his example would live on. What a fitting person to be chosen by our Postal Service — mentioned by the way in the Constitution — something we should all read and re-read in today’s times,” she said to more applause.\n\n“It’s [the] choice of this immigrant who did so much for our country, his country, truly is what it means when we say ‘USA forever.’ Who we are, what we stand for and let there be many, many more immigrants with the love of America that Oscar de la Renta exemplified every single day,” she said.", "authors": ["February"], "publish_date": "2017-02-16", "source": "nypost", "top_words": ["immigrant", "clinton", "trump", "digs", "ban", "renta", "immigration", "stamp", "oscar", "going", "country", "takes", "la", "hillary", "president", "subtle", "designer"], "summary": "Hillary Clinton spoke at the unveiling of a new stamp honoring the late designer Oscar de la Renta at Grand Central Terminal on Thursday — and took indirect swipes at President Trump.\n“Oscar de la Renta was an immigrant … and aren’t we proud and grateful that he was,” she said to loud applause as she was joined on the stage by ex-Mayor Mike Bloomberg and fashion diva Anna Wintour.\nShe praised the designer, a native of the Dominican Republic, and without mentioning his name slighted the president over his hard-line immigration stance.\nThe designer, who died in 2014, was a good choice to be honored on a stamp due to his talent and incredible success, she said.\nHe gave of his heart and his soul to make sure that his example would live on."}