{"url": "http://nypost.com/2017/02/07/iraqi-men-held-at-jfk-file-motion-to-make-trump-release-detainee-list/", "id": "292", "title": "Iraqi men held at JFK file motion to make Trump release detainee list", "text": "Lawyers for two Iraqi men who were among the first detained at JFK under the temporary travel ban filed a motion Tuesday asking a Brooklyn federal judge to order the Trump administration to produce the long-awaited list of travelers held in New York following the Jan. 27 executive order.\n\nBrooklyn federal Court Justice Carol Bagley Amon ordered that lawyers for petitioners Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi file the motion following a hearing last week– where counsel for the proposed class action suit against the ban worried that as many as “hundreds” of people could still being held.\n\nAttorneys for the ACLU and various other watchdog groups are requesting a daily “list of all persons who have been denied entry to or removed from the United States since” Trump’s thinly-veiled Muslim ban, which has been withheld from them since the Department of Justice was first ordered to hand it over by Brooklyn Judge Ann Donnelly during a Jan. 28 hearing.\n\n“Despite repeated written requests for this list, [The DOJ has] yet to provide Petitioners’ counsel with even one name of any person held at\n\nany U.S. airport or returned to a foreign ports,” the papers read.\n\nThe papers–which include daily emails back and forth between Civil Division of Immigration Litigation DOJ lawyer Steven Platt requesting an updated list–also seek to get a list of people who were tricked into signing away their visas, and is asking the court to order their return.\n\nThe Tuesday motion was filed just hours before Justice Department Lawyers were slotted to argue before the 9th Circuit Court of Appeals in San Francisco that Trump’s travel ban should be reinstated.", "authors": ["February"], "publish_date": "2017-02-07", "source": "nypost", "top_words": ["list", "travel", "iraqi", "file", "release", "trump", "men", "ban", "lawyers", "justice", "requesting", "petitioners", "detainee", "court", "trumps", "held", "motion", "jfk"], "summary": "Lawyers for two Iraqi men who were among the first detained at JFK under the temporary travel ban filed a motion Tuesday asking a Brooklyn federal judge to order the Trump administration to produce the long-awaited list of travelers held in New York following the Jan. 27 executive order.\nBrooklyn federal Court Justice Carol Bagley Amon ordered that lawyers for petitioners Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi file the motion following a hearing last week– where counsel for the proposed class action suit against the ban worried that as many as “hundreds” of people could still being held.\n“Despite repeated written requests for this list, [The DOJ has] yet to provide Petitioners’ counsel with even one name of any person held atany U.S. airport or returned to a foreign ports,” the papers read.\nThe papers–which include daily emails back and forth between Civil Division of Immigration Litigation DOJ lawyer Steven Platt requesting an updated list–also seek to get a list of people who were tricked into signing away their visas, and is asking the court to order their return.\nThe Tuesday motion was filed just hours before Justice Department Lawyers were slotted to argue before the 9th Circuit Court of Appeals in San Francisco that Trump’s travel ban should be reinstated."}