{"url": "http://nypost.com/2017/02/12/trump-trash-talks-critics-cnn-and-not-smart-mark-cuban/", "id": "264", "title": "Donald Trump rages about a Mark Cuban POTUS run", "text": "Donald Trump blasted fellow billionaire Mark Cuban on Sunday by claiming he lacks the smarts to become president after the New York Post published a report that floated the Dallas Mavericks owner as a White House challenger in 2020.\n\n“I know Mark Cuban well. He backed me big-time but I wasn’t interested in taking all of his calls,” Trump tweeted early Sunday. “He’s not smart enough to run for president!”\n\nCuban, a frequent Trump critic who backed Hillary Clinton for president, initially responded on Twitter with a simple laugh.\n\n“Lol,” the billionaire tweeted.\n\nBut then Cuban upped his attack, writing “How soon they forget” in a tweet that included comments he made in a May 2016 email criticizing Trump’s pursuit of the presidency.\n\n“You have a real chance to win. But to make it work you have to really dig in on the issues,” Cuban said, adding, “You don’t have to bore people with details.”\n\nThat email included a dare that may yet come true for possible presidential candidate Cuban.\n\n“Everyone else is afraid of you. I like to challenge you,” he said. “And like you said, I may go after that job some day and it could be against you. So it helps to get a head.”\n\nThen, responding to a tweet about what prompted Trump’s sudden Twitter strike, Cuban said: “I don’t know. But isn’t it better for all of us that he is tweeting rather than trying to govern?”\n\nThe Post on Sunday reported that White House chief strategist Steve Bannon has asked for the names of potential Democratic challengers to Trump in 2020.\n\nCuban made the list along with Ohio Sen. Sherrod Brown, Connecticut Sen. Chris Murphy and Colorado Gov. John Hickenlooper.\n\nThe report, citing sources, said the White House’s “biggest fear” was Cuban because he would appeal to Republicans and independents.\n\n“And Mark is the kind of guy who would drop half a billion dollars of his own money on the race,” a source told The Post.\n\nTrump is known to have a fast Twitter finger, posting comments about news articles and interviews on cable news shows.\n\nOn Friday, Cuban made comments in the Star-Telegram of Fort Worth, Texas, warning American CEOs to be careful in their dealings with the president.\n\n“Do what you think is right,” Cuban said. “Be an American citizen first. In the bigger scheme of things, our country benefits from peaceful activism a lot more than it benefits from one more shoe being sold, or one more basketball ticket being sold, for that matter.”\n\nTrump kicked off his Sunday morning tweetstorm from Florida by defending his immigration policies and bashing a federal “court breakdown.”\n\n“The crackdown on illegal criminals is merely the keeping of my campaign promise,” Trump tweeted early in the morning. “Gang members, drug dealers & others are being removed!”\n\nThis weekend, as Trump worked from his Mar-a-Lago resort, immigrant rights groups protested in Arizona, New York and elsewhere against recent deportations and immigration raids under Trump’s crackdown.\n\nTrump has repeatedly questioned the judicial branch after unfavorable rulings on his travel ban, which remains on hold.\n\nThe president also continued to push back against an appeals court’s ruling to continue halting his travel ban on citizens from seven countries and refugees.\n\n“72% of refugees admitted into U.S. (2/3 -2/11) during COURT BREAKDOWN are from 7 countries: SYRIA, IRAQ, SOMALIA, IRAN, SUDAN, LIBYA & YEMEN.”\n\nTrump’s tweet lowered the estimate of refugees entering the country after an analysis from the State Department’s Refugee Processing Center.\n\nOn Saturday, Trump apparently was responding to some news reports that pegged the percentage of refugees coming from the seven banned, mainly Muslim countries at 77 percent.\n\n“Our legal system is broken! ‘77% of refugees allowed into US since travel reprieve hail from seven suspect countries.’ (WT) SO DANGEROUS!” he said.\n\nHe also went after one of his favorite targets and claimed CNN cut off Sen. Bernie Sanders’ interview because the Vermont independent called the cable network “fake news.” Sanders said he was joking and CNN called Trump’s allegations “false.”\n\nIn a busy Twitter morning, Trump also praised his interaction with the Japanese prime minister, who had been visiting him at the “winter White House” this weekend.\n\n“After two days of very productive talks, Prime Minister [Shinzo] Abe is heading back to Japan,” Trump tweeted from his Palm Beach resort.", "authors": ["February"], "publish_date": "2017-02-12", "source": "nypost", "top_words": ["potus", "seven", "travel", "trump", "cuban", "rages", "mark", "donald", "twitter", "trumps", "countries", "tweeted", "run", "refugees", "white"], "summary": "He backed me big-time but I wasn’t interested in taking all of his calls,” Trump tweeted early Sunday.\n“He’s not smart enough to run for president!”Cuban, a frequent Trump critic who backed Hillary Clinton for president, initially responded on Twitter with a simple laugh.\nSo it helps to get a head.”Then, responding to a tweet about what prompted Trump’s sudden Twitter strike, Cuban said: “I don’t know.\n‘77% of refugees allowed into US since travel reprieve hail from seven suspect countries.’ (WT) SO DANGEROUS!” he said.\n“After two days of very productive talks, Prime Minister [Shinzo] Abe is heading back to Japan,” Trump tweeted from his Palm Beach resort."}