{"url": "http://nypost.com/2017/04/01/heres-proof-de-blasio-thinks-his-job-is-to-troll-trump/", "id": "210", "title": "Here’s proof de Blasio thinks his job is to troll Trump", "text": "Coming up on a a re-election season in which he faces about as much meaningful opposition as Godzilla in Smurf Village, Mayor de Blasio is bored. The central purpose of his mayoralty, he has decided, is not ensuring tranquility or trying to nudge some more growth out of the economy or even to stop people from getting killed on the streets. No, de Blasio is focused on one object only: Trump-trolling.\n\nDe Blasio is operating on a gut-level political instinct: The enemy of my enemy is my friend. This is a fairly disastrous way to run a life, much less a city. But BdB figures anyone who irritates Trump must be worthy of his praise and devotion, and therefore your tax dollars, plus a cordon of police and judicial protection.\n\nTrump hates illegal immigrants and other criminals, so de Blasio shows his opposition to the president by supporting the criminal class.\n\nThis week, de Blasio, in the spirit of doing stuff Trump hates, promised to close the Rikers Island jail in 10 years after a blue-ribbon report said it could be replaced with five much smaller jails, one in each borough. The report said the jailed population could be cut in half — but the only way to do that is to let more criminals go free.\n\nDe Blasio also rolled out a $10 million program to give a job to everybody who serves a year or less time at Rikers Island. Jobs-for-criminals is an indicator of upside-down priorities. You could be the best employee at your company for 10 years, get laid off because the company went under, and not be guaranteed another job. You could graduate NYU Law School and not be guaranteed a job.\n\nWhy are criminals suddenly the only people in New York guaranteed a job, and what kind of perverse incentive is that? New York’s tens of thousands of unemployed are thinking, “Should I brush up my résumé or just steal a purse?”\n\nDe Blasio’s war with Trump over illegal immigration also means he is effectively an accomplice to mass law-breaking.\n\nDe Blasio’s war with Trump over illegal immigration also means he is effectively an accomplice to mass law-breaking.\n\nOn Tuesday, De Blasio ordered a memo telling city police on school property that they should not allow federal law-enforcement agents to search for suspects at the schools without a warrant. That’s one government official telling other government officials to block higher-ranking government officials from access to government property.\n\nAll of this, so that illegal immigrants can continue to enjoy your taxpayer-funded public education, regardless of whether they’re guilty of additional crimes on top of being in the country unlawfully. De Blasio told CNN’s Jake Tapper in a January interview that the city even shields illegal immigrants who have been caught drunk driving.\n\nDe Blasio’s New York is interfering with deportation of illegal immigrants in all sorts of ways. Last year, the city evicted Immigration and Customs Enforcement officers from its Rikers Island office. And then last month, The Post reported that de Blasio-appointed judges are granting illegal immigrants’ requests to send them to Rikers instead of letting them go free between court dates so they can avoid the clutches of ICE agents. Hey, come to this country in search of opportunity, right?\n\nRight now Rikers is the only proven path to a job. It’s a sanctuary prison inside a sanctuary city. New York is a crazy enough place on an ordinary day. Now, during de Blasio’s nutty war with Trump, we have law enforcement and criminal justice being run for the convenience of criminals.\n\nWhat’s more, as a tactic for pumping up his vote totals in November, Trump-bashing seems superfluous: de Blasio beat his declared challenger, Paul Massey, by 34 points in a February Quinnipiac poll.\n\nDe Blasio won 73 percent of the vote in 2013, and though New Yorkers don’t particularly like him, it’s hard to imagine a fellow progressive taking him on, while Republicans couldn’t find anyone viable to run against him last time and are faring no better this year.\n\nIf Trump says laws should be enforced, de Blasio says they shouldn’t. If Trump says criminals are bad dudes, de Blasio says they just need a break, and if Trump says rain water is not chardonnay, de Blasio is likely to immediately call a press conference so he can stick his snout in the nearest puddle and start lapping it up.", "authors": ["Kyle Smith", "April"], "publish_date": "2017-04-01", "source": "nypost", "top_words": ["heres", "thinks", "illegal", "trump", "blasio", "rikers", "immigrants", "troll", "job", "criminals", "city", "blasios", "york", "proof"], "summary": "Trump hates illegal immigrants and other criminals, so de Blasio shows his opposition to the president by supporting the criminal class.\nWhy are criminals suddenly the only people in New York guaranteed a job, and what kind of perverse incentive is that?\nDe Blasio’s war with Trump over illegal immigration also means he is effectively an accomplice to mass law-breaking.\nDe Blasio told CNN’s Jake Tapper in a January interview that the city even shields illegal immigrants who have been caught drunk driving.\nDe Blasio’s New York is interfering with deportation of illegal immigrants in all sorts of ways."}