{"url": "http://nypost.com/2017/02/07/irans-supreme-leader-travel-ban-shows-real-face-of-america/", "id": "296", "title": "Iran’s supreme leader: Travel ban shows ‘real face of America’", "text": "Iran’s supreme leader on Tuesday thanked “Mr. Newcomer” President Trump for his immigration ban from seven mainly Muslim countries, saying it reveals the “real face of America.”\n\n“We are thankful to this gentleman… He showed the real face of America,” Supreme Leader Ayatollah Ali Khamenei said.\n\n“We are thankful to Mr. Newcomer, of course, since he has … proved what Iran has said for 38 years about the political, economic, social and moral corruption of the US government,” he told a group of military leaders in Tehran.\n\nKhamenei, who has final say on any Iranian policies, punctuated his point by referring to a 5-year-old Iranian boy who was separated from his family and reportedly handcuffed at Dulles Airport in Washington, DC, the first weekend of the immigration ban.\n\n“By what he does — handcuffing a 5-year-old child — he shows the true meaning of American human rights,” Khamenei said.\n\nThe boy was reunited with his mother and other family members after being held for about 5 hours.\n\nTrump’s immigration ban — which restricts immigrants coming from Iraq, Iran, Syria, Libya, Somalia, Sudan and Yemen — is in legal limbo awaiting a ruling from the 9th Circuit Court of Appeals.\n\nThe court will hear oral arguments at 6 p.m. EST on Tuesday.", "authors": ["February"], "publish_date": "2017-02-07", "source": "nypost", "top_words": ["america", "iran", "travel", "shows", "ban", "supreme", "real", "immigration", "khamenei", "face", "thankful", "iranian", "newcomer", "irans", "leader", "mr"], "summary": "Iran’s supreme leader on Tuesday thanked “Mr.\nNewcomer” President Trump for his immigration ban from seven mainly Muslim countries, saying it reveals the “real face of America.”“We are thankful to this gentleman… He showed the real face of America,” Supreme Leader Ayatollah Ali Khamenei said.\n“We are thankful to Mr.\n“By what he does — handcuffing a 5-year-old child — he shows the true meaning of American human rights,” Khamenei said.\nThe boy was reunited with his mother and other family members after being held for about 5 hours."}