{"url": "http://nypost.com/2017/04/11/this-is-the-trump-era-sessions-takes-aim-at-illegal-immigration/", "id": "203", "title": "‘This is the Trump era’: Sessions takes aim at illegal immigration", "text": "Attorney General Jeff Sessions ​on Tuesday ​announced ​new ​​strict and ​sweeping security regulations governing ​illegal immigration, saying “this is a new era, this is the Trump era.”​\n\n“For those that continue to seek improper and illegal entry into this country, be forewarned:​ ​this is a new era, this is the​ ​Trump era​,” ​​​he said after a tour of the Mexican border in Arizona on Tuesday​.​ ​”The lawlessness, the abdication of duty to​ enforce​ ​ our laws, and the catch-and-release policies of the past are over​.”\n\n​”We mean criminal organizations that turn cities and suburbs into war zones, that rape and kill innocent citizens,” ​he said. “It is here, on this sliver of land, where we first take our stand against this filth.”\n\nPutting into action many of President Trump’s campaign promises on illegal immigration, Sessions ordered federal prosecutors to pursue charges against immigrants who commit crimes, who illegally and repeatedly cross the border and those with drug cartel and gang affiliations or who have criminal histories.\n\nHe also said all adult illegal immigrants caught at the border will be detained and ordered a “surge” of 25 immigration judges to detention centers along the border to support the effort.\n\nSessions also said he will add 125 immigration judges over the next two years to “reduce​ ​the significant​ ​backlog in our immigration​ courts​ -backlogs and​ ​catch -and-release policies​ ​have​ ​undermined the effectiveness of our law officers’ work.”\n\n“The battle is far from over. We must follow up on the successes we’ve had so far, and here on the border, we will do so,” ​Sessions said.\n\n​Trump’s presidency already, he said, has reduced illegal border crossings substantially.\n\nFrom January to February, crossings fell by 40 percent and in March showed a 72 percent drop from the month before, the lowest figure in 17 years, Sessions said.\n\n​”​This is no accident, this is what happens when you have a ​president ​who understands the threat, who is not afraid to ​publicly identify the threat and stand up to it and who makes c​lear​ to law ​enforcement ​that the leadersh​i​p of th​ei​r country finally has their back​ -​ and tells the whole world the illegality is over​,” he said.​", "authors": ["April"], "publish_date": "2017-04-11", "source": "nypost", "top_words": ["illegal", "trump", "policies", "immigration", "era", "stand", "sessions", "takes", "aim", "border", "president", "threat"], "summary": "He also said all adult illegal immigrants caught at the border will be detained and ordered a “surge” of 25 immigration judges to detention centers along the border to support the effort.\nSessions also said he will add 125 immigration judges over the next two years to “reduce​ ​the significant​ ​backlog in our immigration​ courts​ -backlogs and​ ​catch -and-release policies​ ​have​ ​undermined the effectiveness of our law officers’ work.”“The battle is far from over.\nWe must follow up on the successes we’ve had so far, and here on the border, we will do so,” ​Sessions said.\n​Trump’s presidency already, he said, has reduced illegal border crossings substantially.\nFrom January to February, crossings fell by 40 percent and in March showed a 72 percent drop from the month before, the lowest figure in 17 years, Sessions said."}