{"url": "http://nypost.com/2017/02/10/trump-says-he-might-sign-new-executive-order-on-travel-ban/", "id": "271", "title": "Trump says he might sign new executive order on travel ban", "text": "President Trump said on Friday that he might sign a new executive order on immigration amid conflicting reports about whether the White House would seek an emergency ruling at the Supreme Court to restore his suspended travel ban.\n\n“We have a lot of other options, including just filing a brand-new order,” he said on Air Force One.\n\nAsked if he would issue new order, he said, “We need speed for reasons of security, so it very well could be.”\n\nIt was unclear whether Trump was planning appeal to the Supreme Court after lower courts blocked his order restricting travel from seven countries.\n\nTrump would need five votes for a win in the high court. The court is divided 4-4 along ideological lines as his nominee, Neil Gorsuch, awaits confirmation.\n\nCiting White House sources, NBC reported the Supreme Court option was off the table for now.\n\nBut The Washington Post reported that nothing had been ruled out and that the court remained an option.\n\nEarlier Friday, Trump said he had “no doubt” he would win the court case over his travel ban and vowed to take action “next week” to beef up US security.\n\nAsked how he planned to fight an appellate court decision that upheld a Seattle judge’s order blocking the ban, Trump was confident.\n\n“We’ll be doing something very rapidly having to do with additional security for our country. You’ll be seeing that sometime next week,” he said during a White House meeting with Japanese Prime Minister Shinzō Abe. “In addition, we will continue to go through the court process, and I have no doubt we’ll win that particular case.”\n\nsee also Trump rages against court's ruling against travel ban President Trump blasted the Ninth Circuit Court of Appeals’ decision...\n\nMultiple news reports said the new order was already being written.\n\nTrump also alluded to unspecified threats he had learned about in the three weeks of his presidency.\n\n“I have learned tremendous things that you could only learn, frankly, if you were in a certain position, namely president,” he said.\n\n“There are tremendous threats to our country. We will not allow that to happen. We’ll be going forward and continuing to do things to make our country safe. It will happen rapidly.”\n\nTrump repeated that the US would not allow dangerous people into the country but said others would be welcome.\n\nTrump’s original order blocked immigrants from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen from entering for 90 days and barred all refugees for 120 days, except those from Syria, who were banned indefinitely.\n\nMeanwhile, critics on the right took aim at the San Francisco appellate court that ruled against Trump, claiming it had the one of highest reversal rates of any US appellate court.\n\nIn 2012, the Supreme Court overturned 86 percent of the rulings it reviewed from the 9th Circuit Court of Appeals.", "authors": ["February"], "publish_date": "2017-02-10", "source": "nypost", "top_words": ["executive", "travel", "trump", "ban", "supreme", "win", "court", "house", "country", "sign", "order", "president", "white"], "summary": "President Trump said on Friday that he might sign a new executive order on immigration amid conflicting reports about whether the White House would seek an emergency ruling at the Supreme Court to restore his suspended travel ban.\nCiting White House sources, NBC reported the Supreme Court option was off the table for now.\nAsked how he planned to fight an appellate court decision that upheld a Seattle judge’s order blocking the ban, Trump was confident.\nYou’ll be seeing that sometime next week,” he said during a White House meeting with Japanese Prime Minister Shinzō Abe.\nIn 2012, the Supreme Court overturned 86 percent of the rulings it reviewed from the 9th Circuit Court of Appeals."}