{"url": "http://nypost.com/2017/02/09/slamming-the-supremes-like-fdr-and-abe-lincoln/", "id": "279", "title": "Slamming the Supremes — like FDR and Abe Lincoln", "text": "As you might have heard, President Trump tweeted at a judge.\n\nThe commentariat shuddered at the effrontery of it, some worried that the foundations of the separation of powers had been shaken and even Supreme Court nominee Judge Neil Gorsuch reportedly said he was disheartened.\n\nTrump’s slam of Judge James Robart was undeniably crude and ill-considered, but it wasn’t a threat to our republic.\n\nIn fact, it is a symptom of our distorted and overly sanctified view of the judiciary that a criticism of a judge with a lifetime appointment is greeted with such pearl clutching. It is entirely appropriate that the political branches have their own view of the law and the Constitution and robustly contest — and even deny the legitimacy of — court decisions that they consider erroneous.\n\nTrump will have to go considerably further to come close to Andrew Jackson supposedly saying of a Supreme Court decision protecting the Cherokee Indians in Georgia, “John Marshall has made his decision; now let him enforce it.” Or to match the wars waged on uncongenial Supreme Court decisions by Franklin D. Roosevelt and Abraham Lincoln.\n\nTrump’s criticism of Robart, who blocked Trump’s travel ban, as a “so-called judge” was needlessly insulting and counterproductive. That said, Trump is fully within his rights, indeed it should be his responsibility, to defend the legal and constitutional prerogatives of the presidency as he sees them.\n\nLincoln quoted Andrew Jackson for what should be the unassailable proposition that, “Each public officer, who takes an oath to support the Constitution, swears that he will support it as he understands it, and not as it is understood by others.”\n\nIn a notorious fireside chat in 1937, FDR described the American government as a three-horse team, pulled by Congress, the executive and the courts. Guess who was falling down on the job by striking down New Deal legislation? “Two of the horses are pulling in unison today; the third is not.” FDR proposed his court-packing scheme as the remedy (to get “new and younger blood” on the court, you understand).\n\nIf FDR’s court gambit is a blot on his record, Lincoln’s opposition to the Dred Scott decision redounds to his great credit.\n\nTo say that Republicans weren’t deferential to the ruling is an understatement for the ages. They alleged a vast conspiracy of Chief Justice Roger Taney and top Democrats to commit offenses “comparable to the worst villainies of recorded history,” in the words of one historian.\n\nEveryone would soon enough recognize Dred Scott as a disgrace. At the time, though, supporters of the decision considered it a means to peacefully settle a question tearing the country apart.\n\nLincoln allowed that Dred Scott applied to the particular parties to the case; he refused, though, to accept it “as a political rule.”\n\nThis wasn’t Lincoln venting during an idle moment in his bathrobe. As Michael Stokes Paulsen, a professor at the University of St. Thomas School of Law, has written, “Lincoln’s answer to the problem of judicial authority was a hesitant, at first moderate, at times inconsistent, but increasingly radical and complete repudiation of the idea of judicial supremacy in constitutional interpretation.”\n\nLincoln devoted a portion of his first inaugural to developing his argument. “If the policy of the government upon vital questions, affecting the whole people, is to be irrevocably fixed by decisions of the Supreme Court,” he said, “the people will have ceased to be their own rulers.” Lincoln and the wartime Republican Congress proceeded to govern as if the Dred Scott decision didn’t exist.\n\nIt’s an odd disconnect that Lincoln is justly considered perhaps the greatest statesman in the history of our country, yet his rejection of judicial supremacy that was so central to his view of our system is roundly ignored — as it is by Democrats who’ve made opposition to Citizen’s United a long-term cause.\n\nThe fundamental point is that it is not just the executive or Congress that can abuse its power and overstep its bounds. The courts can, too, and no one is obligated to meekly accept their decisions.\n\nThursday, a 9th Circuit panel upheld the temporary stay of Trump’s travel ban. If the courts in the end throw out the order, despite the black-and-white letter of the law giving him the authority to block aliens in the interest of national security, it will be a usurpatory act.\n\nIn that scenario, the courts will have done more violence to our constitutional system than a foolish Trump tweet ever could.", "authors": ["Rich Lowry", "February"], "publish_date": "2017-02-09", "source": "nypost", "top_words": ["slamming", "courts", "trump", "supremes", "lincoln", "abe", "supreme", "judge", "court", "fdr", "dred", "view", "decision", "scott"], "summary": "Trump’s slam of Judge James Robart was undeniably crude and ill-considered, but it wasn’t a threat to our republic.\nIf FDR’s court gambit is a blot on his record, Lincoln’s opposition to the Dred Scott decision redounds to his great credit.\nEveryone would soon enough recognize Dred Scott as a disgrace.\nLincoln allowed that Dred Scott applied to the particular parties to the case; he refused, though, to accept it “as a political rule.”This wasn’t Lincoln venting during an idle moment in his bathrobe.\nIn that scenario, the courts will have done more violence to our constitutional system than a foolish Trump tweet ever could."}