{"url": "http://nypost.com/2017/04/12/trumps-travel-ban-is-hitting-luxury-hotels-the-hardest/", "id": "202", "title": "Trump’s travel ban is hitting luxury hotels the hardest", "text": "Travel to the US from the Middle East and North Africa has fallen 20 percent since President Trump signed his travel ban, a hotel chief executive said this week.\n\nThe effect of the decline by travelers from these areas is outsized, as they spend much more relative to other hotel guests, sources said.\n\nArne Sorenson, CEO of Marriott International, speaking at a company meeting in Dubai, said the ban on travel from six predominately Muslim countries has been hurting his business.\n\nThe ban is “not good, period,” said Sorenson, speaking aloud what most hoteliers have been thinking in private.\n\nBookings at Marriott, the world’s largest hotel operator, from those regions alone during the month of February fell up to 30 percent, Sorenson said at an investor day in March.\n\nSorenson’s disclosures appear to be the first time a hotel CEO has quantified the impact of the travel ban on the hotel industry, say experts.\n\n“We are clearly monitoring this carefully,” said Marriott spokeswoman Connie Kim. The Marriott properties most affected by the order are the swanky St. Regis and the Ritz-Carlton, where suites start at $800-plus a night, according to industry sources.\n\nTravelers from the affected regions account for less than 1 percent of Marriott’s bookings, Kim said. But they are among the biggest spenders, say industry experts.\n\n“It’s a shockingly significant number,” said David Chase, managing director of Omni Berkshire Place. Chase was previously the GM of the Lotte New York Palace, which is among the handful of Big Apple hotels that host these big spenders.\n\n“In a banner year, business from these guests at The Palace contribute up to 10 percent of annual room revenues — or about $12 million,” according to Chase. “They travel in groups of 20 to 80 and they will take entire floors at the hotel for months at a time.”\n\nThe Palace, along with other Big Apple luxury hotels that host these affluent visitors — including the Mandarin Oriental, the Four Seasons and the Peninsula New York — declined to comment.\n\n“Many families in the Middle East recruit personnel from [those banned] countries and these are the royal households that might refuse to travel to the US. They are accustomed to the services of their trusted staff,” said Cynthia Chung, who runs Private Luxury Attaché, a New York City company that makes travel arrangements for the super-wealthy.\n\nAnd it’s not just the hotels that are losing business.\n\nChung has arranged for these delegations to rent out entire department stores, including Saks Fifth Avenue, Bergdorf Goodman and Barneys New York, for private shopping excursions.\n\nHotels where these tourists stay often bend over backward to make them happy — altering floor plans, turning suites into prayer rooms or dining and storage facilities and upgrading their TVs to include hundreds of streamed Arabic channels, Chung said.\n\nA couple of years ago, The Palace hosted a prince who required 180 hotel rooms in the city over a three-month period, according to Chase.\n\nThe prince stayed in an $11,000-a-night suite, forking over $1.2 million to the Palace.\n\nFor entertainment, “he literally bought out a movie theater or Dave & Buster’s every night at midnight even if he didn’t use those venues,” Chase said.", "authors": ["April"], "publish_date": "2017-04-12", "source": "nypost", "top_words": ["travel", "marriott", "industry", "sorenson", "hitting", "ban", "palace", "hardest", "hotels", "trumps", "chase", "luxury", "york", "hotel"], "summary": "Travel to the US from the Middle East and North Africa has fallen 20 percent since President Trump signed his travel ban, a hotel chief executive said this week.\nArne Sorenson, CEO of Marriott International, speaking at a company meeting in Dubai, said the ban on travel from six predominately Muslim countries has been hurting his business.\nThe ban is “not good, period,” said Sorenson, speaking aloud what most hoteliers have been thinking in private.\nSorenson’s disclosures appear to be the first time a hotel CEO has quantified the impact of the travel ban on the hotel industry, say experts.\nChase was previously the GM of the Lotte New York Palace, which is among the handful of Big Apple hotels that host these big spenders."}