{"url": "http://nypost.com/2017/03/23/tillerson-orders-embassies-to-toughen-screenings-for-visa-applicants/", "id": "213", "title": "Tillerson orders embassies to toughen screenings for visa applicants", "text": "​​Secretary of State Rex Tillerson ​ordered US diplomats to identify groups “warranting increased scrutiny” and toughen their screening for visa applications as part of the Trump administration’s goal of “extreme vetting” of foreigners entering the country, a report on Thursday said.\n\n​In a series of diplomatic cables sent over the past couple of weeks, Tillerson ​also directed a broader “mandatory social media check” for all visa applicants who have been in Islamic State-controlled territories, Reuters reported.\n\nThe memos to US diplomatic missions worldwide offer instructions on how to implement President Trump’s immigration ban that was initially rolled out on Jan. 27 and then revised and reissued on March 6 after being blocked by several judges.\n\nThe revised ban calls for restricting immigration from six mainly Muslim countries – Iran, Syria, Libya, Somalia, Sudan and Yemen. Iraq was included in the ban’s first version.\n\nTillerson’s final cable on March 17, which rescinded some instructions challenged by the courts, directed consular heads to assemble groups of law enforcement and intelligence officials to “develop a list of criteria identifying sets of post applicant populations warranting increased scrutiny,” Reuters reported.\n\nAnyone falling into these groups, which could vary from country to country, could come under high-level security screening.\n\nThe State Department declined comment on the cables.\n\nBut Virginia Elliott, a spokeswoman for the department’s Bureau of Consular Affairs, said they were working to execute the president’s ban “in accordance with its terms, in an orderly fashion, and in compliance with any relevant court orders, so as to increase the safety and security of the American people.”\n\nImmigration rights advocates criticized the guidelines, saying it could lead to the profiling of certain applicants over where they come from or who they worship instead of whether they constitute a real threat.\n\n“What this language effectively does is give the consular posts permission to step away from the focused factors they have spent years developing and revising, and instead broaden the search to large groups based on gross factors such as nationality and religion,” Jay Garrison, a Seattle-based immigration attorney, told the news service.\n\nTrump has said the executive orders restricting immigration and involving “extreme vetting” are necessary to keep the country safe from terrorism.\n\nBut the judges who blocked the orders in January and again in March said the ban effectively creates a ban against Muslims.\n\nTrump has called their actions “judicial overreach” and vowed to fight them as far as the Supreme Court if necessary.", "authors": ["March"], "publish_date": "2017-03-23", "source": "nypost", "top_words": ["applicants", "consular", "toughen", "orders", "ban", "immigration", "vetting", "visa", "warranting", "country", "groups", "screenings", "embassies", "tillerson"], "summary": "​In a series of diplomatic cables sent over the past couple of weeks, Tillerson ​also directed a broader “mandatory social media check” for all visa applicants who have been in Islamic State-controlled territories, Reuters reported.\nThe revised ban calls for restricting immigration from six mainly Muslim countries – Iran, Syria, Libya, Somalia, Sudan and Yemen.\nAnyone falling into these groups, which could vary from country to country, could come under high-level security screening.\nTrump has said the executive orders restricting immigration and involving “extreme vetting” are necessary to keep the country safe from terrorism.\nBut the judges who blocked the orders in January and again in March said the ban effectively creates a ban against Muslims."}