{"url": "http://nypost.com/2017/03/19/former-police-chief-says-he-was-detained-at-jfk/", "id": "215", "title": "Former police chief says he was detained at JFK", "text": "A retired top cop from North Carolina detailed his unwarranted detention at JFK in an emotional Facebook post — after he was held for an hour and a half following his return from Paris to celebrate his mother’s 80th birthday.\n\nFormer Police Chief of Greenville, Hassan Aden, claims he was held on March 13 as U.S. Customs and Border Agents attempted to clear the U.S. citizen for entry into his own country.\n\n“My freedoms were restricted, and I cannot be sure it won’t happen again, and that it won’t happen to my family, my children, the next time we travel abroad,” Aden wrote in the lengthy Saturday status.\n\nDespite Adan’s long-running career in law enforcement, customs agents told him he must be vetted because his name “was used as an alias by someone on some watch list.”\n\nThe now senior policy advisor at the Vera Institute of Justice wasn’t even allowed to contact his family as he waited–in what he described as a “back office which looked to be a re-purposed storage facility with three desks and signs stating, “Remain seated at all times” and “Use of telephones strictly prohibited”– as he watched some 25 “foreign nationals” quickly be quickly released.\n\n“I asked several times, ‘How long of a detention do you consider to be reasonable,’ ” Aden says he asked.\n\n“The answer I was given by CBP Officer Chow was that I was not being detained — he said that with a straight face. I then replied, ‘But I’m not free to leave — how is that not a detention?’ ”\n\nLuckily, a new shift officer expedited his release, allowing him to miraculously make his connecting flight.\n\n“As I left the CBP makeshift detention center, I had to go back through security to catch my next flight back to DC, ironically, due to my weekly air travel, I have TSA Pre-check and was whisked through security without a hitch and made my flight by minutes.”\n\n“All that to say that If this can happen to me, it can happen to anyone with attributes that can be ‘profiled,’ ” the veteran police brass wrote. “No one is safe from this type of unlawful government intrusion.”\n\nJFK became a hotspot for protests following president Trump’s initial executive order on immigration — drawing swarms of protesters as travelers from seven Muslim-majority counties were detained.\n\nMore than 700 foreign nationals were detained for questioning nation-wide following the controversial EO, according to figures from the ACLU.\n\nWhile the initial federal court case battling Trump’s original travel ban may be drawing to a close in Brooklyn, a slew of other district courts continue to battle the second so-called “Muslim Ban,” which went into effect on March 16.\n\n“This experience has left me feeling vulnerable and unsure of the future of a country that was once great and that I proudly called my own,” Aden wrote. “This experience makes me question if this is indeed home.”\n\n“Due to the Privacy Act, we cannot comment on specific cases, but all travelers arriving to the U.S. are subject to CBP inspection,” said a Customs and Border Patrol spokesperson.", "authors": ["March"], "publish_date": "2017-03-19", "source": "nypost", "top_words": ["wrote", "detention", "travel", "customs", "cbp", "following", "chief", "aden", "trumps", "wont", "happen", "detained", "jfk"], "summary": "Former Police Chief of Greenville, Hassan Aden, claims he was held on March 13 as U.S. Customs and Border Agents attempted to clear the U.S. citizen for entry into his own country.\n“My freedoms were restricted, and I cannot be sure it won’t happen again, and that it won’t happen to my family, my children, the next time we travel abroad,” Aden wrote in the lengthy Saturday status.\n“The answer I was given by CBP Officer Chow was that I was not being detained — he said that with a straight face.\nMore than 700 foreign nationals were detained for questioning nation-wide following the controversial EO, according to figures from the ACLU.\n“This experience has left me feeling vulnerable and unsure of the future of a country that was once great and that I proudly called my own,” Aden wrote."}