{"url": "http://pagesix.com/2017/04/04/zedd-bypassed-reps-to-recruit-pals-for-aclu-benefit-show/", "id": "205", "title": "Zedd bypassed reps to recruit pals for ACLU concert", "text": "Some A-list agents and managers weren’t on board with their clients dropping everything to perform at Monday night’s fundraising concert for the ACLU, according to event organizer Zedd.\n\n“We had a lot of noes at first because schedules didn’t align and agents/managers weren’t necessarily down,” the DJ/producer told Page Six. “And then I reached out to the artists and immediately everybody was like, ‘Absolutely, we’re going to find a way to fly in and make time.'”\n\nHe added, “So, it was a matter of me having to talk to them directly, and a huge thanks to all the artists because they were all, within a day, committed to do this without even knowing how they would make it work and they did. Some of them are in really complicated situations and still figured out a way to make their way here and show support.”\n\nPerformers at the show included Bebe Rexha, Camila Cabello, Daya, Halsey, Imagine Dragons, Incubus, Machine Gun Kelly, Macklemore, Miguel, Mija, Skrillex and Tinashe.\n\nZedd, whose real name is Anton Zaslavski, is a Russian-born German immigrant.\n\nHe told us at the Staples Center event in Los Angeles that he wanted to spread the message of the American Civil Liberties Union — which fights to preserve individual rights and freedoms — after President Trump’s controversial travel ban.\n\n“Instead of just tweeting something, I decided to make a concert with a lot of my friends and ask them for their help because I thought that would be the biggest platform for everybody to at least start a conversation,” the 27-year-old “Stay” musician said. “I’m not saying that everybody should have the same opinion as I do, but I think as long as everyone can have a healthy conversation, that would be already a success.”\n\nBut it isn’t just about one issue for Zedd, who said, “I think in the next four years, there’s going to be a lot of different things to fight for.”\n\nOne hundred percent of proceeds from the show went to the ACLU.", "authors": ["April"], "publish_date": "2017-04-04", "source": "nypost", "top_words": ["werent", "recruit", "reps", "told", "concert", "lot", "zedd", "bypassed", "think", "everybody", "going", "aclu", "event", "conversation", "pals", "way"], "summary": "Some A-list agents and managers weren’t on board with their clients dropping everything to perform at Monday night’s fundraising concert for the ACLU, according to event organizer Zedd.\n“We had a lot of noes at first because schedules didn’t align and agents/managers weren’t necessarily down,” the DJ/producer told Page Six.\n“And then I reached out to the artists and immediately everybody was like, ‘Absolutely, we’re going to find a way to fly in and make time.\nZedd, whose real name is Anton Zaslavski, is a Russian-born German immigrant.\nHe told us at the Staples Center event in Los Angeles that he wanted to spread the message of the American Civil Liberties Union — which fights to preserve individual rights and freedoms — after President Trump’s controversial travel ban."}