{"url": "http://nypost.com/2017/02/07/appeals-court-hammers-away-at-feds-over-trumps-travel-ban/", "id": "37", "title": "Appeals court hammers away at feds over Trump’s travel ban", "text": "SAN FRANCISCO — A panel of appeals court judges reviewing President Donald Trump’s travel ban hammered away Tuesday at the federal government’s arguments that the ban was motivated by concerns about terrorism, but also questioned an attorney who said it unconstitutionally targeted Muslims.\n\nThe hearing before the San Francisco-based 9th Circuit Court of Appeals judges was the greatest legal challenge yet to the ban, which temporarily suspended the nation’s refugee program and immigration from seven mostly Muslim countries that have raised terrorism concerns.\n\nJudge Michelle T. Friedland, who was appointed by President Barack Obama, asked whether the government has any evidence connecting the seven nations to terrorism.\n\nAugust Flentje, arguing for the Justice Department, told the judges that the case was moving fast and the government had not yet included evidence to support the ban. Flentje cited a number of Somalis in the U.S. who, he said, had been connected to the al-Shabab terrorist group after judges asked for evidence.\n\nJudge Richard Clifton, a George W. Bush nominee, asked an attorney representing Washington state and Minnesota, which are challenging the ban, what evidence he had that it was motivated by religion.\n\n“I have trouble understanding why we’re supposed to infer religious animus when in fact the vast majority of Muslims would not be affected.”\n\nHe said only 15 percent of the world’s Muslims were affected, according to his calculations, and said the “concern for terrorism from those connected to radical Islamic sects is hard to deny.”\n\nNoah Purcell, Washington state’s solicitor general, cited public statements by Trump calling for a ban on the entry of Muslims to the U.S. He said the states did not have to show every Muslim is harmed, only that the ban was motivated by religious discrimination.\n\nUnder questioning from Clifton, a Justice Department lawyer did not dispute that Trump made the statements.\n\nThe ban has upended travel to the U.S. for more than a week and tested the new administration’s use of executive power.\n\nThe government asked the court to restore Trump’s order, contending that the president alone has the power to decide who can enter or stay in the United States. Several states insist that it is unconstitutional.\n\nThe judges — two Democratic appointees and one Republican — repeatedly questioned Flentje on why the states should not be able to sue on behalf of their residents or on behalf of their universities, which have complained about students and faculty getting stranded overseas.\n\nThe states challenging the ban want the appellate court to allow a temporary restraining order blocking the travel ban to stand as their lawsuit moves through the legal system.\n\nPurcell said that restraining order has not harmed the U.S. government.\n\nInstead, he told the panel, Trump’s order had harmed Washington state residents by splitting up families, holding up students trying to travel for their studies and preventing people from visiting family abroad.\n\nA decision was likely to come later this week, court spokesman David Madden said.\n\nWhatever the court eventually decides, either side could ask the Supreme Court to intervene.\n\nTrump said Tuesday that he cannot believe his administration has to fight in the courts to uphold his refugee and immigration ban, a policy he says will protect the country.\n\n“And a lot of people agree with us, believe me,” Trump said at a round table discussion with members of the National Sheriff’s Association. “If those people ever protested, you’d see a real protest. But they want to see our borders secure and our country secure.”\n\nHomeland Security Secretary John Kelly told lawmakers that the order probably should have been delayed at least long enough to brief Congress about it.\n\nIf the case does end up before the Supreme Court, it could prove difficult to find the necessary five votes to undo a lower court order. The Supreme Court has been at less than full strength since Justice Antonin Scalia’s death a year ago. The last immigration case that reached the justices ended in a 4-4 tie.\n\nHow and when a case might get to the Supreme Court is unclear. The travel ban itself is to expire in 90 days, meaning it could run its course before a higher court takes up the issue. Or the administration could change it in any number of ways that would keep the issue alive.", "authors": ["Associated Press", "February"], "publish_date": "2017-02-07", "source": "nypost", "top_words": ["travel", "case", "judges", "ban", "away", "appeals", "supreme", "court", "order", "hammers", "trumps", "asked", "states", "washington", "feds"], "summary": "SAN FRANCISCO — A panel of appeals court judges reviewing President Donald Trump’s travel ban hammered away Tuesday at the federal government’s arguments that the ban was motivated by concerns about terrorism, but also questioned an attorney who said it unconstitutionally targeted Muslims.\nWhatever the court eventually decides, either side could ask the Supreme Court to intervene.\nIf the case does end up before the Supreme Court, it could prove difficult to find the necessary five votes to undo a lower court order.\nThe Supreme Court has been at less than full strength since Justice Antonin Scalia’s death a year ago.\nThe travel ban itself is to expire in 90 days, meaning it could run its course before a higher court takes up the issue."}