{"url": "http://nypost.com/2017/02/03/chelsea-clintons-dig-at-kellyanne-conway-sparks-feud/", "id": "324", "title": "Chelsea Clinton’s dig at Kellyanne Conway sparks Twitter feud", "text": "Is this the start of Clinton 3.0?\n\nChelsea Clinton picked up the family torch on Friday as she traded blows on Twitter with President Trump adviser Kellyanne Conway over the phantom “Bowling Green Massacre.”\n\nThe 36-year-old former first daughter took the first swing with a shot at Conway’s mistaken reference on MSNBC’s “Hardball” Thursday night to a nonexistent terrorist attack.\n\n“Very grateful no one seriously hurt in the Louvre attack . . . or the (completely fake) Bowling Green Massacre. Please don’t make up attacks,” the daughter of Hillary Clinton tweeted Friday, jabbing at Conway’s fictional slaughter while referring to the very real attack earlier that day by a knife-wielding man at the Paris museum.\n\nThe Trump confidante shot back with a low blow, calling Clinton’s mom a loser and citing the then-candidate’s false 2008 claim to have landed “under sniper fire” during a visit to war-torn Bosnia.\n\n“Bosnia lie a Great reminder. And 2 @ChelseaClinton & others, you can’t ‘invent’ quality candidates either,” Conway tweeted. “I misspoke; you lost the election.”\n\nHillary Clinton spun the harrowing gunfire tale in a speech during her 2008 presidential run, but reporters unearthed video of her landing peacefully and greeting children on the tarmac for the 1996 visit.\n\nBy Friday morning, Conway had already caught plenty of heat for her on-air invention of the imaginary massacre.\n\n“I bet it’s brand-new information to people that President Obama had a six-month ban on the Iraqi refugee program after two Iraqis came here to this country, were radicalized and they were the masterminds behind the Bowling Green massacre. It didn’t get covered,” she said on “Hardball.”\n\nConway had cited the “massacre” to justify Trump’s travel ban. But she apologized Friday morning, saying she misspoke and meant to use the word “terrorists” instead of “massacre.”\n\n“On @hardball @NBCNews @MSNBC I meant to say ‘Bowling Green terrorists’ as reported here,” Conway tweeted, with a link to an ABC News report that said two al Qaeda terrorists were found in 2009 living as refugees in Bowling Green, Ky.\n\nThe 2013 report says the two Iraqi citizens, Waad Ramadan Alwan and Mohanad Shareef Hammadi, were indicted as part of an undercover operation for trying to send weapons back to their Iraqi homeland “for the purpose of killing US soldiers.”\n\nBoth men were later convicted on terrorism charges.\n\nBut Conway became the target of online criticism — and some clever spoofs — all day Friday.\n\nThey included a satirical Web page for a “Bowling Green Massacre Victims Fund.”\n\n“As we join together with our thoughts and prayers, we will always remember how our fortitude and compassion unite us all through these difficult times,” the site reads.\n\n“We all still carry the vivid memories of what horrors occurred at Bowling Green, but some still relive those moments everyday as they work to rebuild a community torn apart.”\n\nBut when users click the “donate now” button on the site, they are directed the donation page for the American Civil Liberties Union.\n\nSome Democrats said the Twitter squabble between Clinton and Conway was evidence that the former first daughter is laying the groundwork to eventually run for political office.\n\n“It’s unusual for Chelsea to be so overtly political,” one party insider told The Post.\n\nNew York state Democratic Party Executive Director Basil Smikle said: “Chelsea would get a lot of support if she decides to run. I’m sure she would be a great candidate and a strong leader like her parents have been.”\n\n“She’s had great tutors. If Chelsea has half the commitment to public service that her parents have, she’d be an outstanding candidate and a good representative for the state.”", "authors": ["February"], "publish_date": "2017-02-03", "source": "nypost", "top_words": ["clintons", "sparks", "clinton", "iraqi", "bowling", "dig", "kellyanne", "conway", "twitter", "tweeted", "chelsea", "green", "terrorists", "run", "feud", "massacre", "great"], "summary": "or the (completely fake) Bowling Green Massacre.\nPlease don’t make up attacks,” the daughter of Hillary Clinton tweeted Friday, jabbing at Conway’s fictional slaughter while referring to the very real attack earlier that day by a knife-wielding man at the Paris museum.\nAnd 2 @ChelseaClinton & others, you can’t ‘invent’ quality candidates either,” Conway tweeted.\nSome Democrats said the Twitter squabble between Clinton and Conway was evidence that the former first daughter is laying the groundwork to eventually run for political office.\nNew York state Democratic Party Executive Director Basil Smikle said: “Chelsea would get a lot of support if she decides to run."}