{"url": "http://nypost.com/2017/01/30/stocks-take-hit-as-tech-giants-condemn-immigration-ban/", "id": "376", "title": "Stocks take hit as tech giants condemn immigration ban", "text": "Corporate America’s backlash against President Trump’s immigration ban is widening, as shares of the largest US companies take a hit on uncertainty surrounding the moves.\n\nA rash of chief executives at top tech firms including Apple, Twitter and Netflix blasted the temporary ban over the weekend, with some calling it “un-American” and others claiming it will stifle the competitiveness of US firms worldwide.\n\n“We’re a nation of immigrants whose diverse backgrounds, ideas, and points of view have helped us build and invent as a nation for over 240 years,” Amazon Chief Executive Jeff Bezos said in a Monday statement. “It’s a distinctive competitive advantage for our country—one we should not weaken.”\n\nThe hard-charging billionaire — who locked horns with Trump during the presidential campaign, joking he’d like to launch him into space on a rocket — said Amazon also reached out to the Trump administration, congressional leaders and state officials.\n\nOn Sunday night, Dallas Mavericks owner Mark Cuban added his voice into the mix, noting that the four-month ban on travelers from seven Middle Eastern countries entering the US had “disrupted” the businesses of tech giants like Google and Microsoft.\n\n“How many other businesses, large and small are having to deal with disruptions to the lives of employees and their families?” Cuban tweeted. “Let’s not forget the disruptions and costs to airports, airlines and police depts that had no idea this was coming.”\n\nUS stocks opened lower on Monday, with the Dow Jones industrial average recently off 203.34 points at 19,890.44.\n\nThe order resulted in mass protests, and a taxicab stay-away caused chaos for arriving visitors and resulted in 12 people being detained at JFK.\n\nAlphabet president Sergey Brin even showed up to Saturday protests at San Francisco International Airport, saying he himself came to the US as a “refugee.”\n\nStarbucks CEO Howard Schultz said this weekend the coffee chain will hire 10,000 refugees globally over a five-year period.\n\n“We will neither stand by, nor stand silent, as the uncertainty around the new administration’s actions grows with each passing day.”\n\nSchultz’s statement came on the heels of similar remarks from Twitter CEO Jack Dorsey, Netflix CEO Reed Hastings, Facebook CEO Mark Zuckerberg and Apple’s Tim Cook.\n\n“The Executive Order’s humanitarian and economic impact is real and upsetting,” Dorsey tweeted. “We benefit from what refugees and immigrants bring to the US.”\n\nCNN ran a segment on Saturday evening about Dorsey’s friendship with a Syrian refugee, which Dorsey had described on his Twitter account.\n\nSome of the most pointed commentary came from Netflix’s Hastings, who wrote on his Facebook page: “Trump’s actions … are so un-American it pains us all. Worse the actions will make America less safe (through hatred and loss of allies) rather than more safe.”\n\nZuckerberg penned a long letter Friday saying his great-grandparents were immigrants and that his wife Priscilla’s parents were refugees from China and Vietnam.\n\n“We should also keep our doors open to refugees and those who need help,” Zuckerbeg wrote. “That’s who we are.”\n\nHe also praised Trump’s comments that the president would “work something out” for the so-called Dreamer youngsters, who were brought here by immigrant parents. The post attracted 28,000 comments.\n\nCook noted that Apple was created by Steve Jobs, the son of a Syrian immigrant. In a memo he said: “I’ve heard from many of you who are deeply concerned about the executive order issued yesterday restricting immigration from seven Muslim majority countries. I share your concerns. It is not a policy we support.”\n\nPierre Omidyar, the vocal eBay billionaire, who is an Iranian-American, said on Twitter: “Trump’s order is simple bigotry.”\n\nIt is rare for corporations, let alone their leaders, to speak out about legal issues, although Disney and other media outfits including AMC and Time Warner, CBS and Viacom protested laws viewed as anti-gay in Georgia and North Carolina in March 2016.\n\nThe executive order bans around 134 million people from entering the US. Google issued a memo warning its staff, some of whom are from banned countries, to cancel travel outside of the US.\n\nThose countries include Yemen, Iraq, Iran, Somalia, Sudan, Syria and Libya.", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["executive", "ban", "tech", "immigration", "immigrants", "hit", "condemn", "twitter", "order", "trumps", "countries", "ceo", "refugees", "president", "giants", "stocks", "dorsey"], "summary": "Corporate America’s backlash against President Trump’s immigration ban is widening, as shares of the largest US companies take a hit on uncertainty surrounding the moves.\n“How many other businesses, large and small are having to deal with disruptions to the lives of employees and their families?” Cuban tweeted.\nIn a memo he said: “I’ve heard from many of you who are deeply concerned about the executive order issued yesterday restricting immigration from seven Muslim majority countries.\nThe executive order bans around 134 million people from entering the US.\nGoogle issued a memo warning its staff, some of whom are from banned countries, to cancel travel outside of the US."}