{"url": "http://nypost.com/2017/01/30/iraq-hits-back-with-tit-for-tat-measure-against-trumps-travel-ban/", "id": "375", "title": "Iraq hits back with tit-for-tat measure against Trump’s travel ban", "text": "Iraq’s lawmakers are already striking back against President Trump’s travel ban — approving a “reciprocity measure” for Americans trying to enter the country.\n\nDeputy Parliament Speaker Sheik Humam Hamoudi said he was hopeful it would “pressure the American administration to reconsider.”\n\nThe measure was approved Monday by a majority of the country’s parliament members, though it was unclear whether it would extend to American military members, aid workers and oil companies.\n\nIraq’s Foreign Ministry also slammed the executive order, which prohibits immigrants and refugees from seven countries from coming to the US.\n\n“It is a surprise that Iraq is covered under this order because it is not among the countries that exports terrorists,” it said in a statement released Monday. “The Iraqi community inside the US enjoys a good reputation and its members have not been involved in any terrorist acts.”\n\nThe retaliation could strain the US relationship with Iraq and their joint fight against ISIS to retake Mosul, the second-largest city in the country, which was overtaken by the terrorist group last October.\n\nWith Post wires", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["measure", "travel", "ban", "iraq", "members", "terrorist", "workers", "trumps", "parliament", "countries", "wires", "order", "hits", "titfortat", "american"], "summary": "Iraq’s lawmakers are already striking back against President Trump’s travel ban — approving a “reciprocity measure” for Americans trying to enter the country.\nDeputy Parliament Speaker Sheik Humam Hamoudi said he was hopeful it would “pressure the American administration to reconsider.”The measure was approved Monday by a majority of the country’s parliament members, though it was unclear whether it would extend to American military members, aid workers and oil companies.\nIraq’s Foreign Ministry also slammed the executive order, which prohibits immigrants and refugees from seven countries from coming to the US.\n“It is a surprise that Iraq is covered under this order because it is not among the countries that exports terrorists,” it said in a statement released Monday.\nWith Post wires"}