{"url": "http://nypost.com/2017/02/05/trump-blasted-for-discrediting-judge-who-blocked-ban/", "id": "308", "title": "Trump blasted for discrediting judge who blocked ban", "text": "WASHINGTON – President Trump is getting some blow-back for discrediting a “so-called judge” the federal jurist who blocked his immigration ban over the weekend.\n\n“I think it’s best not to single out judges for criticism,” Senate Majority Leader Mitch McConnell told CNN’s “State of the Union.” “We all get disappointed from time to time.”\n\nFellow GOP Senator Ben Sasse (R-Neb.) also pushed back on Trump’s condemnation of Seattle, Wash. federal judge James Robart.\n\n“We don’t have any so-called judges, we have real judges,” Sasse told ABC’s “This Week.”\n\nRobart blocked Trump’s executive order Friday that barred Syrian refugees and citizens for seven Muslim majority countries from entering the United States.\n\nTrump lashed out against the ruling on Twitter Saturday by taking issue with judge, much like he targeted a federal judge of Mexican-American heritage who was presiding over his Trump University case.\n\n“The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!,” Trump tweeted Saturday.\n\nSenate Democratic Leader Chuck Schumer said Trump’s personal attacks on judges raise the bar the vetting of Supreme Court pick Judge Neil Gorsuch.\n\n“The President’s attack on Judge James Robart, a Bush appointee who passed with 99 votes, shows a disdain for an independent judiciary that doesn’t always bend to his wishes and a continued lack of respect for the Constitution, making it more important that the Supreme Court serve as an independent check on the administration,” Schumer said in statement Saturday.\n\nMcConnell also expressed caution about Trump’s travel ban, which is now in legal limbo. He suggested Congress won’t come to Trump’s aid to revive the immigration ban.\n\n“I don’t know that that’s necessary,” McConnell told CNN’s “State of the Union” Sunday. “I mean, the courts are going to decide whether the executive order the President issued is valid or not, and we all follow court orders.”\n\n“We need to be careful about this,” McConnell added.\n\n“There’s a fine line here between proper vetting and interfering with the kind of travel or suggesting some kind of religious test, and we need to avoid doing that kind of thing.”", "authors": ["February"], "publish_date": "2017-02-05", "source": "nypost", "top_words": ["socalled", "judges", "trump", "ban", "told", "judge", "discrediting", "court", "kind", "trumps", "federal", "blasted", "blocked", "mcconnell"], "summary": "WASHINGTON – President Trump is getting some blow-back for discrediting a “so-called judge” the federal jurist who blocked his immigration ban over the weekend.\nalso pushed back on Trump’s condemnation of Seattle, Wash. federal judge James Robart.\nTrump lashed out against the ruling on Twitter Saturday by taking issue with judge, much like he targeted a federal judge of Mexican-American heritage who was presiding over his Trump University case.\n“The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!,” Trump tweeted Saturday.\n“I don’t know that that’s necessary,” McConnell told CNN’s “State of the Union” Sunday."}