{"url": "http://nypost.com/2017/01/30/aclu-gets-record-donations-after-trumps-immigration-ban/", "id": "378", "title": "ACLU gets record donations after Trump’s immigration ban", "text": "The American Civil Liberties Union has broken its fundraising records after receiving millions in donations in response to backlash over President Trump’s executive order banning people from seven majority-Muslim countries from entering the US, according to reports.\n\nThe nonprofit organization raked in a total of $24 million from more than 350,000 donations since Saturday, USA Today reported.\n\n“It’s really clear that this is a different type of moment,” ACLU Executive Director Anthony Romero told the newspaper. “People want to know what they can do. They want to be deployed as protagonists in this fight. It’s not a spectator sport.”\n\nOn average, the ACLU raises about $4 million online per year, said Romero, whose organization and other legal groups sued the White House on behalf of two Iraqi men who were detained at JFK Airport after arriving Friday.\n\nTrump signed the executive order Friday, sparking mass protests at airports across the country, including JFK and Dulles International Airport in Washington, DC.\n\nThe order bars the admission of nationals from seven Muslim-majority countries — Iraq, Iran, Syria, Somalia, Sudan, Libya and Yemen — for 90 days; suspends all refugee admission for 120 days; and bars Syrian refugees indefinitely.\n\nThe order, Romero said, did not consider the “legal or policy implications, or the practical implications of people traveling to the country.”\n\nAs a result of the ACLU lawsuit, Brooklyn federal Judge Ann Donnelly blocked part of Trump’s controversial order by granting a nationwide emergency stay, temporarily halting deportations of all detainees.\n\nThe Trump administration said Monday that all of the 109 travelers detained and questioned in US airports over the weekend under the ban have been released.\n\nValid green card and US visa holders were among those detained, according to civil rights activists.\n\nOn Sunday, the administration reversed itself, saying green card holders won’t be prevented from legally returning to the US.\n\n“The executive order doesn’t affect green card holders moving forward,” White House chief of staff Reince Priebus told NBC’s “Meet the Press.”\n\nPriebus noted that anyone traveling from the affected countries will be subject to further vetting, including US citizens.", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["executive", "ban", "romero", "immigration", "holders", "card", "gets", "trumps", "countries", "aclu", "donations", "green", "order", "white", "detained", "record"], "summary": "The nonprofit organization raked in a total of $24 million from more than 350,000 donations since Saturday, USA Today reported.\n“It’s really clear that this is a different type of moment,” ACLU Executive Director Anthony Romero told the newspaper.\nTrump signed the executive order Friday, sparking mass protests at airports across the country, including JFK and Dulles International Airport in Washington, DC.\nValid green card and US visa holders were among those detained, according to civil rights activists.\nOn Sunday, the administration reversed itself, saying green card holders won’t be prevented from legally returning to the US."}