{"url": "http://nypost.com/2017/01/30/trump-mocks-schumer-for-crying-over-travel-ban/", "id": "379", "title": "Trump mocks Schumer for crying over travel ban", "text": "President Trump mocked Senate Democratic leader Chuck Schumer on Monday for crying during a news conference about the immigration ban, accusing him of raining “fake tears.”\n\nsee also Schumer vows to fight Trump's immigration order Senate Minority Leader Chuck Schumer vowed Sunday to challenge President...\n\n“I noticed Chuck Schumer yesterday with fake tears. I’m going to ask him who is his acting coach because I know him very well. I don’t see him as a crier,” the president said at the White House during a meeting with small business leaders.\n\nAt a news conference Sunday, the New York senator became visibly emotional and teared up as he called on the Senate to block Trump’s executive order from Friday that restricts immigration from seven mainly Muslim countries.\n\n“There’s about a 5 percent chance it was real,” Trump said.", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["travel", "mocks", "trump", "ban", "immigration", "chuck", "crying", "trumps", "fake", "leader", "order", "president", "senate", "schumer"], "summary": "President Trump mocked Senate Democratic leader Chuck Schumer on Monday for crying during a news conference about the immigration ban, accusing him of raining “fake tears.”see also Schumer vows to fight Trump's immigration order Senate Minority Leader Chuck Schumer vowed Sunday to challenge President...“I noticed Chuck Schumer yesterday with fake tears.\nI’m going to ask him who is his acting coach because I know him very well.\nI don’t see him as a crier,” the president said at the White House during a meeting with small business leaders.\nAt a news conference Sunday, the New York senator became visibly emotional and teared up as he called on the Senate to block Trump’s executive order from Friday that restricts immigration from seven mainly Muslim countries.\n“There’s about a 5 percent chance it was real,” Trump said."}