{"url": "http://nypost.com/2017/02/05/trump-says-blame-immigration-ban-judge-if-something-bad-happens/", "id": "305", "title": "Trump says blame immigration ban judge if something bad happens", "text": "President Trump took to Twitter just before his interview aired on Fox Sunday to blast the federal judge who halted his immigration ban and to encourage Homeland Security officials to “check people coming into our country VERY CAREFULLY.”\n\n“Just cannot believe a judge would put our country in such peril. If something happens, blame him and court system, People pouring in. Bad,” Trump tweeted.\n\nThe president issued an executive order on Jan. 27 that barred US entry by nationals from seven Muslim-majority countries — Iraq, Iran, Syria, Somalia, Sudan, Libya and Yemen — for 90 days; suspended all refugee admission for 120 days; and barred Syrian refugees indefinitely.\n\nBut the decision Friday in Washington state by federal judge James Robart put the order on hold.\n\n“I have instructed Homeland Security to check people coming into our country VERY CAREFULLY,” Trump wrote on Sunday. “The courts are making the job very difficult.”\n\nOn Saturday, Trump blasted Robart as a “so-called judge” and predicted his opinion would be overturned.\n\nThe travel ban is on hold until legal arguments are heard in the 9th U.S. Circuit Court of Appeals in San Francisco, where the Justice Department will file a response by Monday afternoon.", "authors": ["February"], "publish_date": "2017-02-05", "source": "nypost", "top_words": ["trump", "bad", "blame", "ban", "immigration", "security", "judge", "homeland", "days", "happens", "country", "federal", "order", "president", "robart"], "summary": "President Trump took to Twitter just before his interview aired on Fox Sunday to blast the federal judge who halted his immigration ban and to encourage Homeland Security officials to “check people coming into our country VERY CAREFULLY.”“Just cannot believe a judge would put our country in such peril.\nIf something happens, blame him and court system, People pouring in.\nBut the decision Friday in Washington state by federal judge James Robart put the order on hold.\n“I have instructed Homeland Security to check people coming into our country VERY CAREFULLY,” Trump wrote on Sunday.\n“The courts are making the job very difficult.”On Saturday, Trump blasted Robart as a “so-called judge” and predicted his opinion would be overturned."}