{"url": "http://nypost.com/2017/02/02/bodega-owners-dont-care-about-money-in-protest-lockdown/", "id": "337", "title": "Bodega owners don’t care about money in protest lockdown", "text": "Scores of Yemeni-American owned businesses closed up shop across the Big Apple on Thursday, in protest over President Trump’s travel ban on immigrants from Muslim-majority countries.\n\nAbout 1,000 bodegas and grocery stores slammed their doors shut at noon — and will remain closed until 8 p.m.\n\n“Even if I lose money, I will achieve democracy,” said Coney Island resident Nader Muharram, 34, the owner of Metro Finest Deli on Schermerhorn Street in downtown Brooklyn.\n\nHe expects to lose at least $2,000 from the closure — but said it’s something he is compelled to do.\n\n“We have to close, otherwise no one is going to listen to us. Unconstitutional orders are being placed on us. We have to go out and let the people know that this is not acceptable,” he said.\n\nMuharram, who has lived in the US for nearly 5 years, said he wants to bring his siblings from Yemen to the Big Apple, but feels stymied by Trump.\n\n“I am an American citizen. I have the right to bring them here. Under these orders I’m not going to be able to,” he said.\n\nYemen is among of the seven countries affected by Trump’s controversial immigration ban, which has sparked mass protests all over the country since it took effect last week.\n\nBesides Yemen, the executive order bars admission of nationals from Iraq, Iran, Syria, Somalia, Sudan, Libya for 90 days; suspends all refugee admission for 120 days; and bars Syrian refugees indefinitely.\n\n“We are in support of our Yemeni brothers in this strike,” said a spokesperson for the Bodega Association of the United States.\n\nAccording to the Bodega Association of the United States, there are about 13,000 bodegas in total in New York City.\n\nThe association did not have figures on how many Yemeni-owned bodegas there are, however, the office of Brooklyn Borough President Eric Adams said there are an estimated 4,000 to 6,000 small businesses owned by Yemeni-Americans citywide.\n\nA rally “for religious freedom” organized by Adams is slated for 5 p.m. outside of Brooklyn Borough Hall where Yemeni-Americans will share personal stories about how they’ve been affected by Trump’s travel ban.", "authors": ["February"], "publish_date": "2017-02-02", "source": "nypost", "top_words": ["bodegas", "yemeniamericans", "travel", "yemen", "ban", "dont", "association", "united", "protest", "care", "lockdown", "trumps", "bodega", "owned", "president", "owners", "money"], "summary": "Scores of Yemeni-American owned businesses closed up shop across the Big Apple on Thursday, in protest over President Trump’s travel ban on immigrants from Muslim-majority countries.\nHe expects to lose at least $2,000 from the closure — but said it’s something he is compelled to do.\n“We are in support of our Yemeni brothers in this strike,” said a spokesperson for the Bodega Association of the United States.\nAccording to the Bodega Association of the United States, there are about 13,000 bodegas in total in New York City.\nA rally “for religious freedom” organized by Adams is slated for 5 p.m. outside of Brooklyn Borough Hall where Yemeni-Americans will share personal stories about how they’ve been affected by Trump’s travel ban."}