{"url": "http://nypost.com/2017/01/29/pences-old-tweet-completely-contradicts-immigration-ban/", "id": "395", "title": "Pence’s old tweet completely contradicts immigration ban", "text": "An old assertion of Vice President Mike Pence’s raised eyebrows over the weekend as it emerged from the annals of Twitter — and stood as a direct contradiction to President Donald Trump’s new executive order banning immigration from Muslim-majority countries.\n\n“Calls to ban Muslims from entering the U.S. are offensive and unconstitutional,” Pence, then governor of Indiana, tweeted at 7:30 a.m. Dec. 8, 2015.\n\nPence even went so far as to double down on those comments later that same day in northwest Indiana, telling reporters: “The United States cannot, and should not discriminate on the basis of religion.”\n\n“The free exercise of religion is at the very heart of our constitutional guarantees for all persons in this country,” he concluded.\n\nWhile some outlets have reported that Pence deleted the tweet amid Trump’s current agenda, it remains archived on his gubernatorial Twitter page.\n\nThe irony of the more than year-old statement was not lost on the internet, where the hypocrite was hung out to dry.\n\n“Governor Mike Pence with some strong words for Vice President Mike Pence,” wrote user Josh Jordan.\n\n“Breaking: VP Pence highly critical of @POTUS Muslim ban!! Oh wait, that was a year ago before he sold his soul to the devil,” tweeted Steve.\n\nPence’s surprising declaration was unearthed mere hours after the new VP stood behind Trump, smiling and clapping as the POTUS signed an executive order barring travelers from seven Muslim-majority countries from coming into the US for 90 days.", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["completely", "vp", "vice", "potus", "ban", "immigration", "contradicts", "stood", "twitter", "tweeted", "trumps", "pence", "mike", "president", "old", "pences"], "summary": "An old assertion of Vice President Mike Pence’s raised eyebrows over the weekend as it emerged from the annals of Twitter — and stood as a direct contradiction to President Donald Trump’s new executive order banning immigration from Muslim-majority countries.\n“Calls to ban Muslims from entering the U.S. are offensive and unconstitutional,” Pence, then governor of Indiana, tweeted at 7:30 a.m. Dec. 8, 2015.\nWhile some outlets have reported that Pence deleted the tweet amid Trump’s current agenda, it remains archived on his gubernatorial Twitter page.\n“Governor Mike Pence with some strong words for Vice President Mike Pence,” wrote user Josh Jordan.\n“Breaking: VP Pence highly critical of @POTUS Muslim ban!!"}