{"url": "http://nypost.com/2017/02/01/imam-man-lied-about-mom-dying-abroad-after-trumps-travel-ban/", "id": "342", "title": "Imam: Man lied about mom dying abroad after Trump’s travel ban", "text": "A man who claimed his mom died abroad after she was denied entry to the United States under President Trump’s travel ban has lied about the details surrounding her death, according to a mosque leader close to the family.\n\nMike Hager told a news station WJBK on Tuesday that his sick mother died in Iraq on Saturday after being barred from entering the U.S., but Imam Husham Al-Hussainy denied the story, claiming the woman died five days before the ban was enacted.\n\nTrump has denied admission to citizens from seven majority Muslim countries, including Iraq, for 90 days, while Syrians are banned indefinitely.\n\nHager, who lives in Michigan, said that he was able to enter the country because he has American citizenship, but that his mother and other family members were refused.\n\nHager had previously contacted Al-Hussainy, who leads the Karbalaa Islamic Educational Center in Dearborn. He told the Imam that his mom was suffering from kidney disease, and he planned a trip to Iraq to see her.\n\n“The 22nd of January, his mom died,” Al-Hussainy said. “She did die but that was a couple weeks ago – before the ban.”\n\nAl-Hussainy spoke out about the woman’s death after questions were raised about Hager’s claims.\n\n“Since I lost my mom, [I’ve] been on heavy medication – I can’t even sleep. I did not make anything up,” Hager wrote in a text to WJBK.", "authors": ["February"], "publish_date": "2017-02-01", "source": "nypost", "top_words": ["lied", "travel", "mother", "abroad", "mom", "ban", "wjbk", "denied", "imam", "man", "iraq", "alhussainy", "told", "trumps", "died", "hager", "dying"], "summary": "A man who claimed his mom died abroad after she was denied entry to the United States under President Trump’s travel ban has lied about the details surrounding her death, according to a mosque leader close to the family.\nMike Hager told a news station WJBK on Tuesday that his sick mother died in Iraq on Saturday after being barred from entering the U.S., but Imam Husham Al-Hussainy denied the story, claiming the woman died five days before the ban was enacted.\nTrump has denied admission to citizens from seven majority Muslim countries, including Iraq, for 90 days, while Syrians are banned indefinitely.\nHe told the Imam that his mom was suffering from kidney disease, and he planned a trip to Iraq to see her.\n“The 22nd of January, his mom died,” Al-Hussainy said."}