{"url": "http://nypost.com/2017/01/31/schneiderman-joining-federal-suit-against-trumps-travel-ban/", "id": "354", "title": "Schneiderman joining federal suit against Trump’s travel ban", "text": "New York Attorney General Eric Schneiderman announced Tuesday he would be joining the growing lawsuit filed against President Donald Trump’s executive order on immigration restrictions.\n\n“As I’ve made clear: President Trump’s executive action is unconstitutional, unlawful, and fundamentally un-American,” the AG said in a statement.\n\nThe announcement comes just a day after the Department of Homeland Security ignored Schneiderman’s orders to hand over a list of travelers detained in New York.\n\n“That is why my office will be filing to join the federal lawsuit against President Trump and his administration. I’m proud to partner with these organizations to fight to permanently strike down this dangerous and discriminatory order.”\n\nSchneiderman will officially file paperwork later this week in Brooklyn federal court as part of the pioneering case of Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi–whose petitions prompted Justice Ann Donnelly to order a stay on Trump’s Jan. 27 executive order barring travelers from Muslim-majority countries.\n\nSince then, Donnelly’s order has secured the release of at least 15 visa and green-card holders from JFK.\n\nThe proposed class action was initially brought by the American Civil Liberties Union Foundation, the Jerome N. Frank Legal Services Organization at Yale University, the Urban Justice Center, and the National Immigration Law Center.\n\n“I will continue to do everything in my power to not just fight this executive order, but to protect the families caught in the chaos sown by President Trump’s hasty and irresponsible implementation,” The AG said. “Including pressing DHS and CBP to provide a full list of those still detained and allow them access to legal service providers.”\n\nTrump on Monday fired Acting U.S. Attorney General Sally Yates for questioning the legality of his immigration action.", "authors": ["January"], "publish_date": "2017-01-31", "source": "nypost", "top_words": ["executive", "list", "travel", "joining", "ban", "immigration", "travelers", "lawsuit", "trumps", "schneiderman", "federal", "action", "order", "president", "suit", "legal"], "summary": "New York Attorney General Eric Schneiderman announced Tuesday he would be joining the growing lawsuit filed against President Donald Trump’s executive order on immigration restrictions.\n“As I’ve made clear: President Trump’s executive action is unconstitutional, unlawful, and fundamentally un-American,” the AG said in a statement.\nThe announcement comes just a day after the Department of Homeland Security ignored Schneiderman’s orders to hand over a list of travelers detained in New York.\n“That is why my office will be filing to join the federal lawsuit against President Trump and his administration.\n“I will continue to do everything in my power to not just fight this executive order, but to protect the families caught in the chaos sown by President Trump’s hasty and irresponsible implementation,” The AG said."}