{"url": "http://nypost.com/2017/02/02/schneiderman-officially-in-on-immigration-ban-lawsuit/", "id": "339", "title": "Schneiderman officially in on immigration ban lawsuit", "text": "New York Attorney General Eric Schneiderman on Thursday joined the lawsuit in Brooklyn federal court against President Trump’s executive order temporarily banning travel from seven Muslim-majority countries.\n\nThe AG’s motion to join the ever-growing proposed class action comes as lawyers for the Justice Department and lead plaintiffs Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi are slotted to face off in the same courthouse later Thursday.\n\n“Our proposed complaint describes how President Trump’s executive order is not only unconstitutional and fundamentally un-American, but also how it does profound harm to our families, our economy, and our educational and health care institutions,” Schneiderman said a statement.\n\n“President Trump’s intent to discriminate against Muslims is clear,” he continued. “We will continue to use every tool at our disposal to fight this discriminatory ban and protect all those caught in the crossfire of its chaotic implementation.”\n\nSchneiderman’s motion asks the court to declare that the executive order in its entirety violates federal law and is fundamentally unconstitutional–and to prevent the Trump administration “detaining, barring, or removing” any individual under the order.", "authors": ["February"], "publish_date": "2017-02-02", "source": "nypost", "top_words": ["executive", "ban", "immigration", "officially", "court", "schneiderman", "trumps", "proposed", "fundamentally", "federal", "lawsuit", "order", "president", "motion"], "summary": "New York Attorney General Eric Schneiderman on Thursday joined the lawsuit in Brooklyn federal court against President Trump’s executive order temporarily banning travel from seven Muslim-majority countries.\nThe AG’s motion to join the ever-growing proposed class action comes as lawyers for the Justice Department and lead plaintiffs Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi are slotted to face off in the same courthouse later Thursday.\n“Our proposed complaint describes how President Trump’s executive order is not only unconstitutional and fundamentally un-American, but also how it does profound harm to our families, our economy, and our educational and health care institutions,” Schneiderman said a statement.\n“President Trump’s intent to discriminate against Muslims is clear,” he continued.\n“We will continue to use every tool at our disposal to fight this discriminatory ban and protect all those caught in the crossfire of its chaotic implementation.”Schneiderman’s motion asks the court to declare that the executive order in its entirety violates federal law and is fundamentally unconstitutional–and to prevent the Trump administration “detaining, barring, or removing” any individual under the order."}