{"url": "http://nypost.com/2017/02/04/trump-slams-so-called-judge-who-blocked-travel-ban/", "id": "317", "title": "Trump slams ‘so-called’ judge who blocked travel ban", "text": "President Trump vowed Saturday to get his controversial travel ban reinstated after a federal judge struck it down.\n\n“The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!” he thundered in an 8:12 a.m.tweet.\n\nJudge James Robart, a federal judge in Seattle appointed by President George W. Bush, on Friday overturned the restrictions Trump imposed Jan. 27 on travelers from seven predominately Muslim nations.\n\nTrump said Robart’s order endangers Americans.\n\n“When a country is no longer able to say who can, and who cannot , come in & out, especially for reasons of safety &.security – big trouble!” he wrote in an earlier Twitter missive. “Interesting that certain Middle-Eastern countries agree with the ban. They know if certain people are allowed in it’s death & destruction!”\n\nNews reports have described the public response from Middle Eastern countries not covered by the ban as muted.\n\nTrump’s controversial executive order temporarily barred citizens Iraq, Iran, Libya, Somalia, Syria, Sudan and Yemen, from entering the United States.\n\nThe order also indefinitely stopped the processing of Syrian refugees.\n\nThe ban quickly created chaos at the nation’s airports as travelers who were in transit were detained after they landed.\n\nTrump’s tweets were his first comments on Robart’s decision, which the White House promised to fight in court.\n\nLater on Saturday morning, Trump took to Twitter again to rail against The New York Times.\n\n“After being forced to apologize for its bad and inaccurate coverage of me after winning the election, the FAKE NEWS @nytimes is still lost!” said the 8:39 a.m. tweet.\n\nIt was unclear why Trump believes The Times is “still lost.”", "authors": ["February"], "publish_date": "2017-02-04", "source": "nypost", "top_words": ["socalled", "travel", "trump", "robarts", "ban", "overturned", "judge", "travelers", "slams", "twitter", "blocked", "order", "president", "lost"], "summary": "President Trump vowed Saturday to get his controversial travel ban reinstated after a federal judge struck it down.\n“The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!” he thundered in an 8:12 a.m.tweet.\nJudge James Robart, a federal judge in Seattle appointed by President George W. Bush, on Friday overturned the restrictions Trump imposed Jan. 27 on travelers from seven predominately Muslim nations.\nTrump said Robart’s order endangers Americans.\nThe ban quickly created chaos at the nation’s airports as travelers who were in transit were detained after they landed."}