{"url": "http://nypost.com/2017/02/03/conway-tries-to-play-off-making-up-a-massacre/", "id": "329", "title": "Conway tries to play off making up a massacre", "text": "A top aide to President Trump said she misspoke when she referred to a “massacre” in Kentucky that never occurred.\n\n“On @hardball @NBCNews @MSNBC I meant to say “Bowling Green terrorists” as reported here,” Kellyann Conway, counselor to the president, said in a Friday morning tweet.\n\nConway linked to an ABC News report from November, 2013 that referred to the discovery of two al-Qaeda terrorists living as refugees in Bowling Green who were later indicted for trying to send weapons to Iraq “for the purpose of killing US soldiers” in an undercover operation.\n\nThe weapons were rendered inert before being sent.\n\nThe top White House official lit up social media Thursday night when she said on MSNBC:\n\n“I bet it’s brand new information to people that President Obama had a six-month ban on the Iraqi refugee program after two Iraqis came here to this country, were radicalized and they were the masterminds behind the Bowling Green massacre.”\n\nChelsea Clinton, the daughter of Trump’s presidential rival Hillary Clinton, joined the attacks Friday morning:\n\n“Very grateful no one seriously hurt in the Louvre attack …or the (completely fake) Bowling Green Massacre. Please don’t make up attacks,” she tweeted.\n\nConway used the made up terror attack to justify her boss’s travel ban.", "authors": ["February"], "publish_date": "2017-02-03", "source": "nypost", "top_words": ["referred", "clinton", "play", "attacks", "bowling", "ban", "conway", "weapons", "making", "tries", "green", "terrorists", "president", "massacre"], "summary": "A top aide to President Trump said she misspoke when she referred to a “massacre” in Kentucky that never occurred.\n“On @hardball @NBCNews @MSNBC I meant to say “Bowling Green terrorists” as reported here,” Kellyann Conway, counselor to the president, said in a Friday morning tweet.\nThe weapons were rendered inert before being sent.\nPlease don’t make up attacks,” she tweeted.\nConway used the made up terror attack to justify her boss’s travel ban."}