{"url": "http://nypost.com/2017/01/30/koch-brothers-slam-trump-travel-ban-as-wrong-approach/", "id": "382", "title": "Koch brothers slam Trump travel ban as ‘wrong approach’", "text": "Conservative kingmakers the Koch brothers blasted President Trump’s strict immigration ban as the “wrong approach” that violates their dedication to “free and open societies” and put him on notice they will work to kill an import tax being floated to pay for a wall on the Mexican border.\n\n“The travel ban is the wrong approach and will likely be counterproductive,” Koch network co-chair Brian Hooks said Sunday, the Associated Press reported.\n\n“Our country has benefited tremendously from a history of welcoming people from all cultures and backgrounds,” he said. “This is a hallmark of free and open societies.”\n\nThe billionaire Koch brothers did not support Trump’s candidacy, and in April Charles Koch called Trump’s support of a Muslim registry “reminiscent of Nazi Germany.”\n\nBut Charles and his brother David have been rallying other conservatives in an effort to influence the White House and the GOP-controlled Congress.\n\nThe Koch network held a rally this weekend in California with supporters who donated at least $100,000 each year to conservative groups backed by the brothers.\n\nOne proposal their political advocacy group, Americans for Prosperity, has targeted is the proposal to institute a 20 percent tax on goods coming across the southern border to fund the building of a Mexican wall.\n\nLuke Hilgemann, the chief executive of the Prosperity group, said the proposal amounts to “a massive tax increase.”\n\nThe tax, floated by White house spokesman Sean Spicer and supported by House Speaker Paul Ryan, would raise $1.2 trillion over 10 years and would pay for Trump’s much-touted plan to build a wall on the Mexican border.\n\nHilgemann suggested in an interview with Reuters that Ryan “go back to the drawing board.”\n\nDuring his presidential campaign, Trump promised roaring crowds that he would build a wall and have Mexico pay for it. But Mexican President Pena Nieto went on television last week to say the country would not pay for it and canceled a scheduled meeting with Trump.\n\nAt the weekend meeting, Charles Koch, without mentioning Trump by name, said the nation is at a point of “tremendous danger,” adding that America can “go the authoritarian route … or we can move toward a free and open society. So this is our opportunity.”\n\nWith Post wires", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["approach", "travel", "mexican", "trump", "brothers", "ban", "proposal", "koch", "wrong", "wall", "free", "slam", "trumps", "open", "pay", "house", "tax"], "summary": "Conservative kingmakers the Koch brothers blasted President Trump’s strict immigration ban as the “wrong approach” that violates their dedication to “free and open societies” and put him on notice they will work to kill an import tax being floated to pay for a wall on the Mexican border.\n“The travel ban is the wrong approach and will likely be counterproductive,” Koch network co-chair Brian Hooks said Sunday, the Associated Press reported.\n“Our country has benefited tremendously from a history of welcoming people from all cultures and backgrounds,” he said.\nThe Koch network held a rally this weekend in California with supporters who donated at least $100,000 each year to conservative groups backed by the brothers.\nBut Mexican President Pena Nieto went on television last week to say the country would not pay for it and canceled a scheduled meeting with Trump."}