{"url": "http://nypost.com/2017/02/01/trumps-visit-to-harley-davidson-cancelled-because-of-protests/", "id": "347", "title": "Trump’s visit to Harley-Davidson canceled because of protests", "text": "President Trump’s visit to a Harley-Davidson factory in Milwaukee has been canceled because the company wasn’t comfortable with protests against him planned outside its facility, according to a report.\n\nTrump had been scheduled to visit the motorcycle manufacturer Thursday and was slated to sign more executive orders during the visit, but Harley scuttled the event, CNN reported, citing an administration source.\n\nThe visit wasn’t publicly announced, but staffers were already in the city prepping for Trump’s arrival, the network reported.\n\nWhite House aide Stephanie Grisham confirmed to CNN that the president would no longer be traveling to Milwaukee.\n\nBut Harley-Davidson denied the president was slated for a visit this week, claiming, “[We] don’t have, nor did we have, a scheduled visit from the president this week at any of our facilities.”\n\n“We are proud to have hosted presidential visits at our facilities. Three of the last five presidents — Ronald Reagan, George W. Bush and Bill Clinton — have visited us at our facilities. These visits are a testament to the pride and passion of our employees and their great work building Harley-Davidson motorcycles,” a Harley rep told CNN. “We look forward to hosting the president in the future.”\n\nThe cancellation drew sneers from Trump’s Democratic opponents.\n\n“Donald Trump is a real tough guy when it comes to locking up a scared 5-year-old boy trying to find his mother,” Democratic National Committee senior adviser Zac Petkanas told the New York Times.\n\n“But as soon as he has to face the American people to defend his illegal anti-Muslim ban, he chickens out. What a profile in courage,” he added.\n\nTrump has faced widespread protests since the day after his inauguration, beginning with the Women’s March in Washington, DC, and cities around the world.", "authors": ["February"], "publish_date": "2017-02-01", "source": "nypost", "top_words": ["protests", "canceled", "harleydavidson", "cnn", "wasnt", "told", "visit", "week", "trumps", "president", "visits", "slated"], "summary": "President Trump’s visit to a Harley-Davidson factory in Milwaukee has been canceled because the company wasn’t comfortable with protests against him planned outside its facility, according to a report.\nTrump had been scheduled to visit the motorcycle manufacturer Thursday and was slated to sign more executive orders during the visit, but Harley scuttled the event, CNN reported, citing an administration source.\nThe visit wasn’t publicly announced, but staffers were already in the city prepping for Trump’s arrival, the network reported.\nThese visits are a testament to the pride and passion of our employees and their great work building Harley-Davidson motorcycles,” a Harley rep told CNN.\n“We look forward to hosting the president in the future.”The cancellation drew sneers from Trump’s Democratic opponents."}