{"url": "http://nypost.com/2017/01/30/sean-spicer-defends-trumps-immigration-ban/", "id": "370", "title": "Sean Spicer defends Trump’s immigration ban", "text": "President Trump signed the executive order to restrict immigration from seven predominately Muslim countries because his priority was the safety of the American people, his White House spokesman said on Monday.\n\n“We’re going to put the safety of Americans first. We’re not going to wait until we get attacked and figure out how it’s going to happen again,” Sean Spicer said during a news briefing at the White House, adding, “That’s the key point in this: How do we keep ahead of threats.”\n\nHe dismissed suggestions that intelligence about an impending attack may have prompted Trump’s signing of the executive order that restricts immigrants from seven countries — Iraq, Iran, Syria, Sudan, Libya, Somalia and Yemen.\n\nHe said it wasn’t implemented because of a “specific threat” but you “never know when the threat will come.”\n\n“This is why the majority of Americans agree with the president. … These steps are frankly common-sense steps to make sure we’re never looking at the rear-view mirror asking, ‘We should have done something,'” he said.\n\nSpicer continued: “His view is not to wait to get ahead of the curve. We don’t know when that hour comes. We don’t know when the individual comes to do us harm.”\n\nAsked whether Trump has a message for the people who were detained, Spicer said they were only “temporarily detained.”\n\n“I think it’s a shame that people were inconvenienced, obviously, but at the end of the day, we’re talking about a couple of hours,” he said.\n\n“Being able to come to America is a privilege, not a right,” Spicer emphasized. “We have to wait in lines, too.”\n\nHe said after all, 325,000 immigrants came to the country over the weekend and 109 were detained.", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["seven", "safety", "spicer", "trump", "ban", "immigration", "sean", "wait", "know", "going", "trumps", "defends", "white", "steps", "threat"], "summary": "President Trump signed the executive order to restrict immigration from seven predominately Muslim countries because his priority was the safety of the American people, his White House spokesman said on Monday.\n… These steps are frankly common-sense steps to make sure we’re never looking at the rear-view mirror asking, ‘We should have done something,'” he said.\nSpicer continued: “His view is not to wait to get ahead of the curve.\n“Being able to come to America is a privilege, not a right,” Spicer emphasized.\n“We have to wait in lines, too.”He said after all, 325,000 immigrants came to the country over the weekend and 109 were detained."}