{"url": "http://nypost.com/2017/01/31/gop-leaders-kept-in-the-dark-about-trumps-immigration-ban/", "id": "357", "title": "GOP leaders kept in the dark about Trump’s immigration ban", "text": "Top GOP congressional leaders were kept in the dark about President Trump’s immigration ban — only finding out about the controversial executive order through the media.\n\nHouse Speaker Paul Ryan (R-Wis.) and Senate Majority Leader Mitch McConnell (R-Ky.) were among the Republicans never briefed about the plan, and only saw the final details when it was released Friday night, Politico reported, citing sources on Capitol Hill.\n\n“Their coordination with the Hill was terrible. We didn’t see the final language until it was finally out,” a source told Politico, adding that some leaders didn’t get talking points about the order for another 24 hours.\n\n“No one was given a heads-up and no one had a chance to weigh in on it,” a source told Politico.\n\nSen. Bob Corker (R-Tenn.) thanked the press for the heads-up.\n\n“I guess one of you guys probably told me about it. Thank you for that,” Corker, who chairs the Foreign Relations Committee, told reporters Monday.\n\nAs lawmakers scrambled for information, Sen. Marco Rubio (R-Fla.) learned that the State Department had been told not to communicate with Congress.\n\n“There’s not a lot of answers as of today. In fact, my staff was told the State Department as of today was ordered not to talk to Congress about this issue,” said Rubio, a presidential candidate in 2016. “That cannot be a permanent position. We expect answers here fairly soon.”\n\nThe ban restricting immigrants from seven Muslim-majority nations — Iran, Iraq, Syria, Sudan, Libya, Yemen and Somalia — created chaos over the weekend as some green card holders were delayed at airports for hours and a flurry of lawsuits were filed to stop the ban.\n\nWith Post wires\n\n", "authors": ["January"], "publish_date": "2017-01-31", "source": "nypost", "top_words": ["today", "final", "politico", "gop", "dark", "immigration", "ban", "told", "state", "rubio", "order", "didnt", "trumps", "leaders", "kept", "source"], "summary": "Top GOP congressional leaders were kept in the dark about President Trump’s immigration ban — only finding out about the controversial executive order through the media.\nWe didn’t see the final language until it was finally out,” a source told Politico, adding that some leaders didn’t get talking points about the order for another 24 hours.\n“No one was given a heads-up and no one had a chance to weigh in on it,” a source told Politico.\nAs lawmakers scrambled for information, Sen. Marco Rubio (R-Fla.) learned that the State Department had been told not to communicate with Congress.\nIn fact, my staff was told the State Department as of today was ordered not to talk to Congress about this issue,” said Rubio, a presidential candidate in 2016."}