{"url": "http://nypost.com/2017/02/05/pence-vows-to-use-all-legal-means-to-overturn-judges-travel-ban-block/", "id": "307", "title": "Pence vows to use ‘all legal means’ to overturn judge’s travel ban block", "text": "Watch the latest video at video.foxnews.com\n\nWASHINGTON — Vice President Mike Pence vowed to use “all legal means” to overturn a judge’s “wrong decision” that put President Trump’s immigration and refugee executive order on hold.\n\n“It is quite clear that president has the ability to determine who has access to the country when it comes to national security,” Pence told “Fox News Sunday. “…We believe the judge made the wrong decision.”\n\n“We’re going to continue to use all legal means at our disposal to stay that order and move forward to take the steps necessary to protect our country,” Pence added.\n\nPresident Trump’s executive order Jan. 27 barred US entry by nationals from seven Muslim-majority country — Iraq, Iran, Syria, Somalia, Sudan, Libya and Yemen — for 90 days; suspended all refugee admission for 120 days; and barred Syrian refugees indefinitely. But the decision Friday in Washington state by federal judge James Robart put the order on hold.\n\n“We don’t appoint judges to the district courts to make foreign policy or to make decisions about the our national security,” Pence said. “Under statutory law and under the Constitution, that authority belongs to the President of the United States.”\n\nPence said the executive order was designed to put the safety first of the American people.\n\n“We are going to win this argument,” Pence vowed.\n\nThe travel ban is on hold until legal arguments are heard in the 9th U.S. Circuit Court of Appeals in San Francisco, where the Justice Department will file a response by Monday afternoon.\n\nSen. Dianne Feinstein (D-Calif.) expects the legal fight will head to the highest court.\n\n“I have no doubt that it will go to the Supreme Court,” said Feinstein, the top Democrat on the Senate Judiciary Committee, “and probably some judgement will be made whether this president had exceeded his authority or not.”", "authors": ["February"], "publish_date": "2017-02-05", "source": "nypost", "top_words": ["executive", "travel", "means", "judges", "ban", "security", "overturn", "block", "wrong", "refugee", "trumps", "pence", "country", "order", "president", "vows", "legal"], "summary": "Watch the latest video at video.foxnews.comWASHINGTON — Vice President Mike Pence vowed to use “all legal means” to overturn a judge’s “wrong decision” that put President Trump’s immigration and refugee executive order on hold.\n“It is quite clear that president has the ability to determine who has access to the country when it comes to national security,” Pence told “Fox News Sunday.\n“…We believe the judge made the wrong decision.”“We’re going to continue to use all legal means at our disposal to stay that order and move forward to take the steps necessary to protect our country,” Pence added.\n“We don’t appoint judges to the district courts to make foreign policy or to make decisions about the our national security,” Pence said.\nThe travel ban is on hold until legal arguments are heard in the 9th U.S."}