{"url": "http://nypost.com/2017/02/03/former-norwegian-pm-stopped-at-us-airport-thanks-to-obama/", "id": "330", "title": "Former Norwegian PM stopped at US airport — thanks to Obama", "text": "The former prime minister of Norway was delayed entering the US this week because of a law signed by … President Obama.\n\nKjell Magne Bondevik was held up by a customs official when he arrived at Dulles International Airport outside of Washington, DC Tuesday on a flight from Europe, local affiliate ABC7 reported.\n\nThe hold-up was because Bondevik, Norway’s prime minister from 1997-2000 and 2001-2005, had visited Iran in 2014 to attend a human rights conference.\n\nIn 2015, Obama signed a law that restricts the US Visa Waiver Program from people who have recently visited Iran, Iraq, Sudan Syria, Libya, Somalia or Yemen, the same countries affected by President Trump’s recent travel ban.\n\n“I was surprised, and I was provoked,” Bondevik whined. “What will the reputation of the U.S. be if this happens not only to me, but also to other international leaders?”\n\nThe former prime minister’s passport reveals his former top governmental position, which he believes should’ve been enough for authorities to have given him a pass.\n\n“Of course I fully understand the fear of letting terrorists come into this country,” Bondevik said.\n\n“It should be enough when they found that I have a diplomatic passport, [that I’m a] former prime minister,” he complained.\n\n“That should be enough for them to understand that I don’t represent any problem or threat to this country and [to] let me go immediately, but they didn’t,” he added.\n\nHe was questioned by authorities for a mere 20 minutes, and his entire delay was about an hour.", "authors": ["February"], "publish_date": "2017-02-03", "source": "nypost", "top_words": ["stopped", "iran", "airport", "understand", "bondevik", "passport", "law", "thanks", "obama", "signed", "prime", "president", "norwegian", "visited", "minister"], "summary": "The former prime minister of Norway was delayed entering the US this week because of a law signed by … President Obama.\nKjell Magne Bondevik was held up by a customs official when he arrived at Dulles International Airport outside of Washington, DC Tuesday on a flight from Europe, local affiliate ABC7 reported.\nThe hold-up was because Bondevik, Norway’s prime minister from 1997-2000 and 2001-2005, had visited Iran in 2014 to attend a human rights conference.\n“It should be enough when they found that I have a diplomatic passport, [that I’m a] former prime minister,” he complained.\nHe was questioned by authorities for a mere 20 minutes, and his entire delay was about an hour."}