{"url": "http://nypost.com/2017/01/30/trump-blames-delta-for-nationwide-detainments/", "id": "386", "title": "Trump blames Delta for nationwide detainments", "text": "President Trump said it wasn’t his executive order on immigration that caused more than 100 people to be detained at airports across the country over the weekend — instead blaming Delta’s computer outage, Sen. Chuck Schumer and protesters.\n\n“Only 109 people out of 325,000 were detained and held for questioning. Big problems at airports were caused by Delta computer outage,….” Trump tweeted Monday morning. “Protesters and the tears of Senator Schumer. Secretary Kelly said that all is going well with very few problems. MAKE AMERICA SAFE AGAIN!”\n\nBut Delta’s computer problems, which led to at least 250 flight cancellations, only took place overnight Sunday — while refugees and immigrants from seven predominantly Muslim countries have been detained since Trump issued the executive order Friday.\n\n“There is nothing nice about searching for terrorists before they can enter our country. This was a big part of my campaign. Study the world!” Trump added.\n\nHis statements come as the Department of Homeland Security said all detainees from across the country have been released.\n\nTrump’s executive order — which bars refugees from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen from coming to the US for at least three months — caused a constitutional crisis over the weekend.\n\nAmerican Civil Liberties Union lawyers went to Brooklyn federal court Saturday night on behalf of two Iraqi refugees detained at JFK Airport.\n\nJudge Ann Donnelly issued a nationwide emergency stay that temporarily halted foreign travelers affected by the order from being booted from the country.", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["executive", "schumer", "trump", "problems", "caused", "refugees", "delta", "nationwide", "detainments", "country", "blames", "computer", "order", "detained"], "summary": "President Trump said it wasn’t his executive order on immigration that caused more than 100 people to be detained at airports across the country over the weekend — instead blaming Delta’s computer outage, Sen. Chuck Schumer and protesters.\nBig problems at airports were caused by Delta computer outage,….” Trump tweeted Monday morning.\nHis statements come as the Department of Homeland Security said all detainees from across the country have been released.\nAmerican Civil Liberties Union lawyers went to Brooklyn federal court Saturday night on behalf of two Iraqi refugees detained at JFK Airport.\nJudge Ann Donnelly issued a nationwide emergency stay that temporarily halted foreign travelers affected by the order from being booted from the country."}