{"url": "http://nypost.com/2017/02/10/amazon-takes-victory-lap-for-its-role-in-halting-trumps-travel-ban/", "id": "39", "title": "Amazon takes victory lap for its role in halting Trump’s travel ban", "text": "A top lawyer for internet retailer Amazon is taking a victory lap for the company’s role in the Ninth Circuit Court’s decision to retain the temporary restraining order halting President Trump’s travel ban.\n\n“Proud of @AGOWA, the Amazon legal team that helped on the case, and amici — who all made today’s 9th Circuit ruling possible,” David Zapolsky, Amazon general counsel, wrote Thursday night on Twitter.\n\nIt’s unknown what precise role, if any, Zapolsky’s team played in the appeals court decision.\n\nBut there has been bad blood between Trump and Amazon owner Jeff Bezos for over a year.\n\nOn the campaign trail, Trump said the internet entrepreneur and newspaper owner would have “problems” if Trump was elected.\n\n“I have respect for Jeff Bezos, but he bought the Washington Post to have political influence, and I got to tell you, we have a different country than we used to have,” said Trump at a campaign stop in February 2016.\n\n“He owns Amazon. He wants political influence so that Amazon will benefit from it. That’s not right. And believe me, if I become president, oh, do they have problems. They’re going to have such problems,” Trump said of Bezos.\n\nBezos replied by offering to send the then-presidential candidate to outer space.", "authors": ["February"], "publish_date": "2017-02-10", "source": "nypost", "top_words": ["travel", "internet", "role", "trump", "ban", "problems", "political", "owner", "lap", "halting", "trumps", "victory", "takes", "amazon", "jeff", "president", "team"], "summary": "A top lawyer for internet retailer Amazon is taking a victory lap for the company’s role in the Ninth Circuit Court’s decision to retain the temporary restraining order halting President Trump’s travel ban.\n“Proud of @AGOWA, the Amazon legal team that helped on the case, and amici — who all made today’s 9th Circuit ruling possible,” David Zapolsky, Amazon general counsel, wrote Thursday night on Twitter.\nBut there has been bad blood between Trump and Amazon owner Jeff Bezos for over a year.\nOn the campaign trail, Trump said the internet entrepreneur and newspaper owner would have “problems” if Trump was elected.\nThey’re going to have such problems,” Trump said of Bezos."}