{"url": "http://nypost.com/2017/06/29/hawaii-throws-wrench-in-trumps-revised-travel-ban/", "id": "38", "title": "Hawaii throws wrench in Trump’s revised travel ban", "text": "The state of Hawaii tried to throw a monkey-wrench into President Trump’s latest anti-terror travel ban — less than an hour before it was set to go into effect Thursday.\n\nIn an emergency motion filed at 1:07 p.m. local time, lawyers for the state and a Honolulu imam asked a federal judge to decide whether the ban violates terms of a US Supreme Court ruling issued Monday.\n\nThat ruling allowed elements of Trump’s second travel ban — which applies to visitors from six predominantly Muslim countries in the Middle East and Africa — to go into effect at 8 p.m. EDT, or 2 p.m. in Hawaii.\n\nLegal papers say the Supreme Court ruling “protects any foreign national with a ‘close familial relationship’ with a person in the United States.”\n\nBut Trump’s latest ban bars a host of people “with a ‘close familial relationship’ to US persons, including grandparents and grandchildren, brothers- and sisters-in-law, fiancés, aunts, uncles, nieces, nephews, and cousins,” the papers say.\n\n“This Court should clarify as soon as possible that the Supreme Court meant what it said, and that foreign nationals that credibly claim connections with this country cannot be denied entry under the President’s illegal Order,” according to the filing.\n\nHawaii — which in March won a stay of Trump’s second travel ban on grounds it discriminated against Muslims — also accused the Trump Administration of “stonewalling” for days before revealing the parameters of the new version.\n\nHawaii says it got official notice at 4:43 p.m. local time — along with “the transcript of a teleconference it had previously held with the media describing its plans in detail.”", "authors": ["June"], "publish_date": "2017-06-29", "source": "nypost", "top_words": ["ruling", "travel", "relationship", "hawaii", "throws", "wrench", "revised", "ban", "supreme", "state", "second", "papers", "court", "trumps"], "summary": "The state of Hawaii tried to throw a monkey-wrench into President Trump’s latest anti-terror travel ban — less than an hour before it was set to go into effect Thursday.\nIn an emergency motion filed at 1:07 p.m. local time, lawyers for the state and a Honolulu imam asked a federal judge to decide whether the ban violates terms of a US Supreme Court ruling issued Monday.\nThat ruling allowed elements of Trump’s second travel ban — which applies to visitors from six predominantly Muslim countries in the Middle East and Africa — to go into effect at 8 p.m. EDT, or 2 p.m. in Hawaii.\n“This Court should clarify as soon as possible that the Supreme Court meant what it said, and that foreign nationals that credibly claim connections with this country cannot be denied entry under the President’s illegal Order,” according to the filing.\nHawaii — which in March won a stay of Trump’s second travel ban on grounds it discriminated against Muslims — also accused the Trump Administration of “stonewalling” for days before revealing the parameters of the new version."}