{"url": "http://nypost.com/2017/01/31/trump-makes-fun-of-schumer-for-using-broken-mic-at-rally/", "id": "358", "title": "Trump makes fun of Schumer for using broken mic at rally", "text": "President Trump continued to mock Sen. Chuck Schumer on Tuesday, making fun of the minority leader for using a broken microphone during a rally the night before.\n\n“Nancy Pelosi and Fake Tears Chuck Schumer held a rally at the steps of The Supreme Court and mic did not work (a mess)-just like Dem party!” Trump said in an early morning tweet.\n\nThe rally, coming the evening before Trump was to name his Supreme Court pick, went awry when Democratic pols, including Sens. Elizabeth Warren (D-Mass.), Al Franken (D-Minn.) and Cory Booker (D-NJ), couldn’t be heard by hundreds of assembled protesters because of a busted mic.\n\nProtesters chanted “Impeach” and “Lock him up,” according to the Daily Caller, and later broke into song, belting out Woody Guthrie’s hippie anthem “This Land Is Your Land.”\n\nTrump ridiculed Schumer on Monday for crying at a press conference, saying his tears were “fake.”", "authors": ["January"], "publish_date": "2017-01-31", "source": "nypost", "top_words": ["trump", "fun", "supreme", "makes", "broken", "court", "chuck", "rally", "work", "fake", "tears", "woody", "mic", "using", "schumer"], "summary": "President Trump continued to mock Sen. Chuck Schumer on Tuesday, making fun of the minority leader for using a broken microphone during a rally the night before.\n“Nancy Pelosi and Fake Tears Chuck Schumer held a rally at the steps of The Supreme Court and mic did not work (a mess)-just like Dem party!” Trump said in an early morning tweet.\nThe rally, coming the evening before Trump was to name his Supreme Court pick, went awry when Democratic pols, including Sens.\n), Al Franken (D-Minn.) and Cory Booker (D-NJ), couldn’t be heard by hundreds of assembled protesters because of a busted mic.\nProtesters chanted “Impeach” and “Lock him up,” according to the Daily Caller, and later broke into song, belting out Woody Guthrie’s hippie anthem “This Land Is Your Land.”Trump ridiculed Schumer on Monday for crying at a press conference, saying his tears were “fake.”"}