{"url": "http://nypost.com/2017/01/29/anti-trump-protesters-are-refusing-to-use-uber/", "id": "398", "title": "Anti-Trump protesters are refusing to use Uber", "text": "Disgusted Uber customers are deleting the ride-sharing app in droves after learning that the company defied Saturday’s taxi strike at JFK Airport, which was aimed at protesting President Trump’s newest controversial immigration policy.\n\nThe New York Taxi Workers Alliance had asked drivers to protest Trump’s agenda — effectively a ban on Muslims entering the US — by not picking up fares at the airport Saturday night.\n\nYet Uber continued to not only send its drivers, it turned off its surge pricing in an attempt to drum up more business.\n\n“Taxis striking at JFK against Muslim ban. Uber, whose CEO advises Trump, breaking the strike, supporting the ban. Delete delete delete,’’ Meredith Whittaker tweeted last night, referencing Uber head honcho Travis Kalanick, who sits on Trump’s board.\n\nsee also Transportation nightmare at JFK after cabbies join protest JFK was a transportation nightmare Saturday night — thanks to...\n\n“Just deleted #uber. Going 2 be using #Lyft, since I like their integrity,” Twitter user Rapunzel chimed in Sunday morning. “If you take Trump’s money, u support the fascist pig. #deleteuber.”\n\nThe livery app Lyft also remained operational during the period.\n\nCo-founder and director of “House of Yes” Kae Burke told The Post that she used to use Uber to transport her performers but deleted the app Sunday morning and will now use Lyft.\n\n“One of the strongest ways for us to be heard is with our dollars. We have to be very careful about where we spend our money,” Burke said. “The Uber people are watching. It’s going to hurt them, and they are going to regret it.”\n\nWhile Uber directed its cars to the airport Saturday, CEO Kalanick sang a different tune on his Facebook page, acknowledging that a number of his drivers come from affected countries and “take long breaks to go back home to see their extended family.”\n\nHe added that the company is “working out a process to identify and compensate” drivers currently stuck outside the US and who may be unable to return due to the ban, in the hopes they can “help mitigate some of the financial stress and complications with supporting their families and putting food on the table.”\n\nKalanick then announced Sunday his company had created a “$3 million legal defense fund to help drivers with immigration and translation services,” in addition to providing 24/7 legal and immigration help to affected employees.\n\nA spokesperson for Uber said Sunday that the whole thing was just a big misunderstanding.\n\n“We’re sorry for any confusion about our earlier tweet, it was not meant to break up any strike,” the rep said. “We wanted people to know they could use Uber to get to and from JFK at normal prices, especially tonight.”\n\nBy Sunday, the Taxi Workers Alliance had halted the ban on JFK pickups and was instead protesting in Battery Park, a rep said.\n\n“I’m not shocked that uber put its greed above its principles, it does that every day with its drivers,” said NYTWA spokesperson Bhairavi Desai. “This is a mass movement. You can feel it. And the people are not going to be silent.”\n\nAdditional reporting by Elizabeth Rosner", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["taxi", "antitrump", "ban", "immigration", "refusing", "strike", "uber", "trumps", "going", "help", "protesters", "drivers", "jfk"], "summary": "Disgusted Uber customers are deleting the ride-sharing app in droves after learning that the company defied Saturday’s taxi strike at JFK Airport, which was aimed at protesting President Trump’s newest controversial immigration policy.\nYet Uber continued to not only send its drivers, it turned off its surge pricing in an attempt to drum up more business.\nUber, whose CEO advises Trump, breaking the strike, supporting the ban.\nDelete delete delete,’’ Meredith Whittaker tweeted last night, referencing Uber head honcho Travis Kalanick, who sits on Trump’s board.\nsee also Transportation nightmare at JFK after cabbies join protest JFK was a transportation nightmare Saturday night — thanks to...“Just deleted #uber."}