{"url": "http://nypost.com/2017/01/29/us-and-saudi-arabia-agree-to-support-safe-zones/", "id": "393", "title": "US and Saudi Arabia agree to support ‘safe zones’", "text": "WASHINGTON – President Trump and Saudi Arabia’s king agreed to support “safe zones” in Syria and Yemen, according to the White House, signaling a potential policy shift in the Middle East.\n\nThe agreement was reached during a phone call Sunday between Trump and King Salman bin Abd al-Aziz Al Saud.\n\n“The President requested and the King agreed to support safe zones in Syria and Yemen, as well as supporting other ideas to help the many refugees who are displaced by the ongoing conflicts,” a White House readout of the call said.\n\nTrump had campaigned on creating safe zones in Syria to allow relief for families hurt by the ongoing war as an alternative to them fleeing to the United States and elsewhere. Trump on Friday issued an executive ban on accepting Syrian refugees in the US.\n\nTrump had accused the Obama Administration of not doing enough vetting of Syrian refugees, while Obama declined to set up a no-fly safe zone as it could require more US military intervention to enforce it and sought—unsuccessfully—to find a diplomatic solution to the civil war.\n\nTrump also pitched the idea of safe zones on a second phone call Sunday with the Crown Prince of the United Arab Emirates, Mohammed bin Zayed.\n\n“The President also raised the idea of supporting safe zones for the refugees displaced by the conflict in the region, and the Crown Prince agreed to support this initiative,” the White House readout of the call said.\n\nDuring the call with Saudi Arabia’s king, the leaders also spoke of economic and energy cooperation, “agreed on the importance of strengthening joint efforts to fight the spread of radical Islamic terrorism” and working jointly on enforcing the Iran nuclear deal and addressing “Iran’s destabilizing regional activities,” the readout said.\n\n“The two leaders also discussed an invitation from the King for President Trump to lead a Middle East effort to defeat terrorism and to help build a new future, economically and socially, for the people of the Kingdom of Saudi Arabia and the region,” the White House statement said.", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["arabia", "trump", "agree", "zones", "support", "king", "refugees", "house", "syria", "safe", "president", "white", "saudi", "agreed"], "summary": "WASHINGTON – President Trump and Saudi Arabia’s king agreed to support “safe zones” in Syria and Yemen, according to the White House, signaling a potential policy shift in the Middle East.\nThe agreement was reached during a phone call Sunday between Trump and King Salman bin Abd al-Aziz Al Saud.\nTrump had campaigned on creating safe zones in Syria to allow relief for families hurt by the ongoing war as an alternative to them fleeing to the United States and elsewhere.\nTrump also pitched the idea of safe zones on a second phone call Sunday with the Crown Prince of the United Arab Emirates, Mohammed bin Zayed.\n“The President also raised the idea of supporting safe zones for the refugees displaced by the conflict in the region, and the Crown Prince agreed to support this initiative,” the White House readout of the call said."}