{"url": "http://nypost.com/2017/02/01/uber-paying-the-price-for-not-supporting-driver-strike/", "id": "344", "title": "Uber paying the price for not supporting driver strike", "text": "Uber drivers have seen a big dropoff in business since a #deleteUber campaign began Saturday night — sparked by the company continuing to send drivers to JFK on Saturday during a taxi strike to support immigrants detained at the airport.\n\nMohsin Alvi, who has been driving for the company for more than two years, said he was easily making $300 a day before Sunday and is down to $120.\n\n“It has definitely impacted drivers,” said Alvi, 30. “It’s the beauty of this country that people have the right to choose, but drivers are suffering because of something the company did.”\n\nsee also Anti-Trump protesters are refusing to use Uber Disgusted Uber customers are deleting the ride-sharing app in droves...\n\nDisgusted customers started the #DeleteUber campaign and have been deleting the app in droves after learning that the company defied a taxi strike that was taking place at JFK Airport — where numerous refugees were being detained over the weekend — by failing to turn off its app to prevent dropoffs and pickups there.\n\nDespite the anger aimed at Uber, individual drivers had the choice to join the strike. Uber also didn’t actively stop drivers from picking up at the airport, and the company didn’t tweet out that it was suspending surge pricing at the airport until after the strike was over.\n\nFormer customers say they are also upset that Uber chief executive officer Travis Kalanick has been acting as an adviser to President Trump.\n\nUber declined to say how many customers around the world have deleted the app. But company officials said they were committed to fighting for its workers.\n\n“We are making sure that riders know that our CEO strongly opposes the president’s immigration ban,” said a company spokesperson. “New York continues to be one of our fastest growing markets in the world and we are committed to making Uber the best option for New Yorker drivers. This includes standing with any drivers who have been impacted by this ban by creating a $3 million legal defense fund, providing 24/7 legal support and offering compensation for lost earnings.”\n\nsee also Lyft surpasses Uber in downloads after protest controversy Lyft surpassed Uber in daily app store downloads for the...\n\nMany riders vowed to switch to Lyft, which donated $1 million to the American Civil Liberties Union this weekend. Lyft, which also sent drivers to the airport during the strike, has also declined to say how many users it gained.\n\nDrivers who are signed up with more than one company say customers are still using ridesharing apps, but they’ve switched to Lyft and Juno.\n\n“Uber is dead,” said Inder Parmar, who drives for three ridersharing apps. “Before, I was getting two Uber jobs in an hour, yesterday, I only got two jobs on Uber all day. The other apps are still busy.”\n\nJuno officials said there has been a “clear uptick” in the amount of people who downloaded its app since Saturday, but they declined to say exactly how many more users they have now.\n\nUber is scrambling to keep what customers it still has.\n\nWhen riders attempt to delete, they said, the company sends them a message stating: “We wanted to let you know that Uber shares your views on the immigration ban: it’s unjust, wrong and against everything we stand for as a company.”\n\nIt then sends them to a link describing the legal defense fund that the company set up Sunday after the uproar started.", "authors": ["February"], "publish_date": "2017-02-01", "source": "nypost", "top_words": ["app", "lyft", "price", "airport", "strike", "riders", "company", "uber", "paying", "say", "supporting", "driver", "drivers", "customers"], "summary": "Despite the anger aimed at Uber, individual drivers had the choice to join the strike.\nFormer customers say they are also upset that Uber chief executive officer Travis Kalanick has been acting as an adviser to President Trump.\nLyft, which also sent drivers to the airport during the strike, has also declined to say how many users it gained.\nDrivers who are signed up with more than one company say customers are still using ridesharing apps, but they’ve switched to Lyft and Juno.\n“Before, I was getting two Uber jobs in an hour, yesterday, I only got two jobs on Uber all day."}