{"url": "http://nypost.com/2017/01/31/trump-had-to-fire-sally-yates-hillary-blames-obama-and-other-notable-comments/", "id": "353", "title": "Trump had to fire Sally Yates and other notable comments", "text": "Law prof: Why Trump Had To Fire Sally Yates\n\nDemocrats are hailing Sally Yates, a career prosecutor appointed by Barack Obama, “for standing up to a supposedly ‘tyrannical’ ” President Trump on his immigration order, only to be fired for doing so, notes Josh Blackman, a constitutional law professor, in Politico. But he says that’s all wrong: “If Yates truly felt this way, she should have told the president her conclusions in confidence. If he disagreed, she had one option: resign.” Instead, she chose to become “a political martyr and refused to comply.” This wasn’t a Nixon-like “massacre,” he asserts — it’s “a textbook case of insubordination, and the president was well within his constitutional powers to fire her.” And her ploy will “unfortunately inhibit dissent within an already skittish agency.”\n\nPolitical analyst: Team Hillary Blames Obama\n\nIt’s “the worst-kept secret inside Democratic circles,” says Mike Allen at Axios: Hillary Clinton’s team is not only “bitter” at Barack Obama, they blame him — “more than [Vladimir] Putin, FBI Director James Comey or, um, Hillary herself” for her defeat. According to Allen, “Clintonites feel that if Obama had come out early and forcefully with evidence of Russian interference in the campaign, and perhaps quicker sanctions, she might be president today.” But Obama’s people say he “was very deliberate about not being seen as politicizing the hacks.” The ex-president also “has let it be known that he remains befuddled on how she missed what to him was an easy layup of a win, given his own popularity . . . and Trump’s vulgarity.”\n\nSecurity analyst: Is This the Bannon Administration?\n\nDuring their confirmation hearings, many of President Trump’s national-security choices disagreed with his public positions. Meanwhile, notes Max Boot at Commentary, “Trump was staffing the White House with hardline aides . . . who appeared much more simpatico” with his stated views. And early indications suggest the two Steves — political operative Bannon and policy adviser Miller — are in control. “Bannon’s ascendancy has been crowned by his inclusion in the high-level Principals Committee of the National Security Council,” even “while the chairman of the Joint Chiefs of Staff and the director of national intelligence have been excluded.” That’s “ominous and troubling,” says Boot, given that Bannon “is not a conservative but a populist rabble-rouser.” Then again, “Trump is so volatile and has such a proclivity for firing employees that the current status quo may not last.”\n\nFrom the right: Union Leaders for Trump\n\nIt’s been a good two weeks for blue-collar unions, says Steven Malanga at City Journal, with President Trump withdrawing from the Trans-Pacific Partnership, reviving the Keystone and Dakota pipelines and discussing with union leaders his massive infrastructure program. And those leaders, “whose membership once constituted the core of the Democratic Party, were effusive in their praise of a president who knows their business perhaps better than anyone who’s ever held the office.” Another way Trump “continues to scramble assumptions about American political allegiances,” because the Democratic Party “no longer resembles the one that nurtured the union movement when it was largely composed of blue-collar, private-sector workers.”\n\nWonk: O’Care Fix Must Focus on Avg. American\n\nOne reason ObamaCare is so unpopular is that, says Jeffrey Anderson at The Weekly Standard, it’s “bad for the typical — or median — American for a wide variety of reasons,” including the individual mandate, its centralization of power and its handling of pre-existing conditions. But its biggest problem is “the tax inequity that gives open-ended tax breaks to millions of Americans with job-based insurance, while denying tax breaks altogether for millions of Americans who buy health insurance on their own.” This “provides a huge opening” for the GOP: “Rather that fearing a political backlash from passing an alternative, Republicans should be eager to pass a plan for which the typical American will reward them.”\n\n— Compiled by Eric Fettmann", "authors": ["Post Editorial Board", "January"], "publish_date": "2017-01-31", "source": "nypost", "top_words": ["trump", "bannon", "political", "sally", "comments", "union", "democratic", "obama", "hillary", "notable", "yates", "leaders", "president", "tax"], "summary": "Law prof: Why Trump Had To Fire Sally YatesDemocrats are hailing Sally Yates, a career prosecutor appointed by Barack Obama, “for standing up to a supposedly ‘tyrannical’ ” President Trump on his immigration order, only to be fired for doing so, notes Josh Blackman, a constitutional law professor, in Politico.\nBut he says that’s all wrong: “If Yates truly felt this way, she should have told the president her conclusions in confidence.\nDuring their confirmation hearings, many of President Trump’s national-security choices disagreed with his public positions.\nMeanwhile, notes Max Boot at Commentary, “Trump was staffing the White House with hardline aides .\nAnd early indications suggest the two Steves — political operative Bannon and policy adviser Miller — are in control."}