{"url": "http://nypost.com/2017/02/05/conway-blames-haters-for-bowling-green-massacre-backlash/", "id": "306", "title": "Conway blames ‘haters’ for ‘Bowling Green Massacre’ backlash", "text": "WASHINGTON – Top Trump adviser Kellyanne Conway on Sunday said ‘haters” are to blame for blowing up her comments about the “Bowling Green massacre” when she simply “misspoke.”\n\n“It was a plot. Well, they’re masterminds. I had said that before, they’re masterminds. I should’ve just said plot, or I should’ve just called them terrorists,” Conway said on Fox News’ “Media Buzz.”\n\nConway said she made a mistake when she cited the “Bowling Green massacre” to defend Trump’s needs for an immigration travel ban on MSNBC on Thursday. There was never a massacre in Bowling Green, Ky.\n\n“I misspoke one word,” continued Conway, who also called the dust-up “massacre nonsense.” She walked back the comment on Friday.\n\n“The corrections in the newspapers who are attacking me are three paragraphs long every day. Corrections, like major corrections I mean,” she said.\n\nConway, Trump’s campaign manager during he presidential election, also thinks former first daughter Chelsea Clinton should mind her own – and her mother’s – business.\n\n“Chelsea Clinton attacking me, really Chels?” Conway said. “Because your mom said Texas and Georgia and Arizona were turning blue so you went and spent all this money there and you ignored Wisconsin and Michigan and we did not, and we won them and Donald Trump won.”\n\nThe 36-year-old Clinton took to Twitter to condemn Conway’s statements last week.\n\n“Very grateful no one seriously hurt in the Louvre attack …or the (completely fake) Bowling Green Massacre,” Clinton tweeted. “Please don’t make up attacks.”\n\nConway also mocked Clinton’s former contract with NBC News where she reportedly made a $600,000 annual salary as a special correspondent. She was hired in 2011 and parted ways with the network in 2014 before her mom’s presidential bid.\n\n“$600,000 a year, woah!,” Conway said. “I don’t remember one report she did – if you do, please help me. But I have nothing against Chelsea Clinton, I always treated her like a fabergé egg when she was in the White House as teenager, we’ll see if Barron Trump gets the same respect, so far he hasn’t.”\n\n“She should leave me out of it,” Conway said.", "authors": ["February"], "publish_date": "2017-02-05", "source": "nypost", "top_words": ["backlash", "clinton", "shouldve", "trump", "bowling", "corrections", "theyre", "haters", "conway", "trumps", "green", "blames", "massacre"], "summary": "WASHINGTON – Top Trump adviser Kellyanne Conway on Sunday said ‘haters” are to blame for blowing up her comments about the “Bowling Green massacre” when she simply “misspoke.”“It was a plot.\nI should’ve just said plot, or I should’ve just called them terrorists,” Conway said on Fox News’ “Media Buzz.”Conway said she made a mistake when she cited the “Bowling Green massacre” to defend Trump’s needs for an immigration travel ban on MSNBC on Thursday.\nThere was never a massacre in Bowling Green, Ky.“I misspoke one word,” continued Conway, who also called the dust-up “massacre nonsense.” She walked back the comment on Friday.\nConway, Trump’s campaign manager during he presidential election, also thinks former first daughter Chelsea Clinton should mind her own – and her mother’s – business.\n“Very grateful no one seriously hurt in the Louvre attack …or the (completely fake) Bowling Green Massacre,” Clinton tweeted."}