{"url": "http://nypost.com/2017/01/31/the-press-wont-stop-pestering-tom-brady-about-his-trump-ties/", "id": "352", "title": "The press should stop pestering Tom Brady about his Trump ties", "text": "For all the bluster that the Trump presidency is going to be the Fourth Reich, it’s his opponents who are the ones demanding creepy loyalty oaths for anyone in public life.\n\nTom Brady, quarterback of the New England Patriots, is set to play in the Super Bowl this Sunday. But all the media wants to talk to him about is how he feels about President Trump.\n\nBrady and New England coach Bill Belichick, who have supported Trump in the past, would prefer to focus on beating the Atlanta Falcons. Instead they’re pestered with questions about the president’s immigration program. Why? Did Obama-loving sports figures get taken to task when the ObamaCare rollout was an unmitigated disaster or when drone strikes approved by the ex-president killed guests at a wedding in Yemen?\n\nThis coercion — defend your friend! — only seems to come from one direction. And it’s part of the reason Trump won. When every issue is only allowed to have one possible viewpoint, people rebel and turn to an outsider candidate.\n\nOn ESPN’s “First Take,” Max Kellerman “defended” Brady pushing off questions about Trump. Only, that is, until after the Super Bowl. Kellerman said it’s important to have an “excuse” for Trump support, such as the one offered by Patriots owner Robert Kraft that Trump was there for him after his wife passed away, though he ultimately argued that Kraft’s excuse is insufficient.\n\nBut why should an excuse be necessary? ESPN contributor Will Cain argued back to Kellerman that only people who haven’t had to defend their views under eight years of Obama can believe it’s normal to flog a quarterback because of whom they supported for president.\n\nIn a debate with ESPN senior writer Mina Kimes and ESPN personality Domonique Foxworth, Cain tweeted that the “63 million people who voted for Trump should be debated, persuaded. Not ‘called to account.’ Same for Brady.”\n\nBut debate isn’t good enough for Trump’s opponents. No, you must recant, apologize, disavow. You must be punished. No one imagines Tom Brady will launch into a defense of refugee policy during his press conference. They want to hear him say he no longer supports Trump.\n\nPerformers who dared play music at the inauguration were attacked. Casey Patten, co-founder of Taylor Gourmet, a small chain of hoagie shops in Washington, DC, was photographed shaking hands with the president; online, there were calls to destroy Patten’s business.\n\nPatten said he had been “invited by The White House to participate in a discussion surrounding issues facing small businesses.” Patten had also attended a similar meeting with President Obama, but hadn’t faced calls to have his business boycotted because of it.\n\nThe Trump presidency has proved less divisive than the administration’s opponents.\n\nLeave Tom Brady alone.", "authors": ["Karol Markowicz", "January"], "publish_date": "2017-01-31", "source": "nypost", "top_words": ["tom", "excuse", "trump", "pestering", "supported", "stop", "small", "espn", "ties", "brady", "press", "president", "super", "kellerman"], "summary": "Tom Brady, quarterback of the New England Patriots, is set to play in the Super Bowl this Sunday.\nBut all the media wants to talk to him about is how he feels about President Trump.\nBrady and New England coach Bill Belichick, who have supported Trump in the past, would prefer to focus on beating the Atlanta Falcons.\nNo one imagines Tom Brady will launch into a defense of refugee policy during his press conference.\nLeave Tom Brady alone."}