{"url": "http://nypost.com/2017/02/06/wtf-was-84-lumber-thinking-with-its-super-bowl-ad/", "id": "301", "title": "What was 84 Lumber thinking with its Super Bowl ad?", "text": "Uplifting and patriotic ads are a staple of the Super Bowl, so last night the astonishing cynicism of that 84 Lumber ad really stood out. “Come on, illegal immigrants: Risk your lives, drag yourself across the harshest terrain and endure the most agonizing hardships. We need the cheap labor!”\n\nIn the 90-second spot for the construction-materials company, a Latino mother and daughter who are apparently sneaking across the southern border of the U.S. rise in the dark, walk along a barbed-wire fence, clamber aboard the boxcar of a moving train and wade across a river.\n\n\n\nIn the full-length, six-minute version , which the company said was rejected by Fox for being too political, the mother and daughter are despondent when they encounter an enormous wall in the desert. Then the little girl presents the mom with a crude American flag she has assembled from scraps of plastic bags, and the pair discover a gigantic set of doors in the wall. They proceed to stroll right through.\n\nThe ad is an unmistakable invitation to lawbreaking from a building-supplies company that, because of the industry it represents, is strongly associated with illegal immigrants. A Pew survey conducted between 2007 and 2012 found that construction was the sector that employed the second-largest number of illegal immigrants, after the service industry.\n\nThe guy who made the ad all but admitted the purpose of the ad was to draw illegal immigrants to work for the company. Michael Brunner, the CEO of Brunnerworks, the agency that created the spot, said its purpose was threefold: To generate awareness of the company, create pride in its workforce and fill jobs. “We’ve got over 400 positions that we’re looking to fill at all levels, at all capacities,” Brunner told KDKA, the CBS affiliate in Pittsburgh.\n\nPride in the workforce? Why would the workforce of 84 Lumber be proud of prospective illegal immigrants unless a lot of illegal immigrants worked there? If it were staffed by legal residents of the U.S., wouldn’t its staffers be kind of resentful of people jumping the queue and breaking the law to get jobs there? And if the company is hiring, why skip over all of the Americans and green-card holders and reach out to unauthorized immigrants?\n\nThe owner of the firm, Maggie Hardy Magerko, made it clear that Brunner was taking his cues from her when she told KDKA, “We’re casting a wider net. We want the world to know 84 Lumber is the place for people who don’t always fit nicely into a box.”\n\nThat sounds sort of like recruiting. But according to 8 U.S. Code § 1324a, it is unlawful to “hire, or to recruit or refer for a fee, for employment in the United States an alien knowing the alien is an unauthorized alien.”\n\nTrue, the company doesn’t explicitly say it is looking for illegal immigrants and it isn’t recruiting any specific person, but 84 Lumber seems blase about the law. The company began covering its tracks during the game last night with a Tweet reading, “See a mother & daughter’s symbolic journey toward becoming legal American citizens” and encouraging people to watch the full, uncensored ad on the Web. But there is nothing in that longer film to suggest that the mother and daughter are entering the country legally. They don’t go through border controls or submit to immigration paperwork.\n\nBuilding and construction firms, feel free to post ads for legal workers. But when you encourage people to risk their lives to come here, you aren’t actually being compassionate. You’re being rapacious and callous, encouraging others to submit to grave dangers at no risk to you, because it is in your economic interest to find the cheapest workers available.\n\nMany of the legal workers you are bypassing in search of illegal immigrants are themselves Mexican green-card holders or Mexican-American. Or are you promising to compensate anyone who dies trying to cross the desert because he saw a TV commercial implying that 84 Lumber will hire him if he manages to sneak into the U.S.?", "authors": ["Kyle Smith", "February"], "publish_date": "2017-02-06", "source": "nypost", "top_words": ["bowl", "illegal", "mother", "thinking", "ad", "immigrants", "84", "workers", "lumber", "company", "workforce", "super", "legal"], "summary": "Uplifting and patriotic ads are a staple of the Super Bowl, so last night the astonishing cynicism of that 84 Lumber ad really stood out.\n“Come on, illegal immigrants: Risk your lives, drag yourself across the harshest terrain and endure the most agonizing hardships.\nWhy would the workforce of 84 Lumber be proud of prospective illegal immigrants unless a lot of illegal immigrants worked there?\nWe want the world to know 84 Lumber is the place for people who don’t always fit nicely into a box.”That sounds sort of like recruiting.\nMany of the legal workers you are bypassing in search of illegal immigrants are themselves Mexican green-card holders or Mexican-American."}