{"url": "http://nypost.com/2017/02/06/doj-files-brief-in-federal-appeals-court-supporting-trumps-travel-ban/", "id": "34", "title": "DOJ files brief in federal appeals court supporting Trump’s travel ban", "text": "Justice Department lawyers filed court papers Monday night arguing that only President Trump — not the judiciary — has the power to set national security and immigration policies.\n\nTheir 15-page motion sought to have Trump’s travel ban reinstated on refugees as well as immigrants from seven Muslim-majority countries.\n\nIt was filed in the 9th Circuit Court of Appeals in San Francisco, which scheduled one hour of oral arguments in the case for 6 p.m. Eastern time on Tuesday.\n\n“The Executive Order is a lawful exercise of the President’s authority over the entry of aliens into the United States and the admission of refugees,” the department’s brief said, adding that the Obama Administration and Congress had already identified the seven countries affected by the ban as hotbeds of terrorism.\n\n“Those countries were identified by Congress and the Executive Branch as being associated with a heightened risk of terrorism. Congress itself identified Iraq and Syria, where ‘the Islamic State of Iraq and the Levant [ISIS] maintain a formidable force.”\n\nThe federal government lawyers said the ruling by Seattle Federal Judge James Robart on Friday that stopped implementation of the ban was overly broad and should be overruled.\n\nEarlier, White House spokesman Sean Spicer said that Robart had gone “rogue.”\n\n“The law is very clear that the president has broad powers to keep this country safe and to limit access to people that could come in to this country and do us harm,” Spicer told Fox News.\n\nTwo Democrat-appointed judges and one Republican appointee on the 9th Circuit will decide the case, which could wind up in the Supreme Court.\n\nsee also Appeals court denies request to immediately reinstate travel ban WASHINGTON — A federal appeals court denied early Sunday the...\n\nAlso Monday, a group of ex-national security officials, two states and dozens of top tech companies came out against the ban.\n\nFormer secretaries of state John Kerry and Madeleine Albright joined the officials — most but not all of whom served under President Obama — in asking the courts to continue blocking the immigration order.\n\nThey said the travel restrictions on the seven Muslim-majority nations would help ISIS recruitment and put US troops in peril.\n\nLawyers for Washington state and Minnesota told the appellate court it would “unleash chaos again” if it restored the travel restrictions.\n\nSixteen Attorneys General — including New York’s Eric Schneiderman — filed an amicus brief in support of Washington and Minnesota in the lawsuit against the executive order.\n\nDozens of tech companies, including Apple, Google, and Uber, are siding with Washington state as it fights the ban and also filed briefs opposing the ban, saying it would make it harder to recruit employees and lead companies to build facilities offshore.", "authors": ["February"], "publish_date": "2017-02-06", "source": "nypost", "top_words": ["seven", "travel", "ban", "brief", "appeals", "state", "court", "files", "doj", "trumps", "identified", "federal", "filed", "supporting", "president", "washington"], "summary": "Justice Department lawyers filed court papers Monday night arguing that only President Trump — not the judiciary — has the power to set national security and immigration policies.\nTheir 15-page motion sought to have Trump’s travel ban reinstated on refugees as well as immigrants from seven Muslim-majority countries.\nsee also Appeals court denies request to immediately reinstate travel ban WASHINGTON — A federal appeals court denied early Sunday the...Also Monday, a group of ex-national security officials, two states and dozens of top tech companies came out against the ban.\nThey said the travel restrictions on the seven Muslim-majority nations would help ISIS recruitment and put US troops in peril.\nLawyers for Washington state and Minnesota told the appellate court it would “unleash chaos again” if it restored the travel restrictions."}