{"url": "http://nypost.com/2017/02/06/tech-giants-file-legal-brief-opposing-immigration-ban/", "id": "302", "title": "Tech giants file legal brief opposing immigration ban", "text": "Several technology giants, including Apple, Google and Microsoft, banded together on Sunday to file a legal brief opposing President Donald Trump’s temporary immigration ban, arguing that it “inflicts significant harm on American business.”\n\nThe brief, filed in the U.S. Court of Appeals for the 9th Circuit, included other top tech firms including Facebook, Twitter and Intel, as well as non-tech companies such as Levi Strauss and Chobani. In all nearly 100 firms, including eBay, Netflix and Uber signed onto the brief.\n\nTrump’s temporary immigration ban, the most contentious policy move of his first two weeks in offices, faces crucial legal hurdles.\n\nHis administration has a deadline on Monday to justify the executive order temporarily barring immigrants from seven mostly Muslim countries and the entry of refugees, after a federal judge in Seattle blocked it with a temporary restraining order on Friday.\n\n“The Order represents a significant departure from the principles of fairness and predictability that have governed the immigration system of the United States for more than fifty years,” the brief stated.\n\n“The Order inflicts significant harm on American business, innovation, and growth as a result,” it added.\n\n“Immigrants or their children founded more than 200 of the companies on the Fortune 500 list.”\n\nU.S. tech firms have been among the more vocal sectors speaking out against the policy, with many of its staff made up of foreign-born nationals.\n\nThe 9th U.S. Circuit Court of Appeals in San Francisco over the weekend denied the Trump administration’s request for an immediate stay of the federal judge’s temporary restraining order that blocked nationwide the implementation of key parts of the travel ban.\n\nBut the court said it would reconsider the government’s request after receiving more information.", "authors": ["February"], "publish_date": "2017-02-06", "source": "nypost", "top_words": ["opposing", "file", "significant", "restraining", "firms", "ban", "tech", "immigration", "including", "order", "court", "brief", "temporary", "giants", "legal"], "summary": "In all nearly 100 firms, including eBay, Netflix and Uber signed onto the brief.\nTrump’s temporary immigration ban, the most contentious policy move of his first two weeks in offices, faces crucial legal hurdles.\nHis administration has a deadline on Monday to justify the executive order temporarily barring immigrants from seven mostly Muslim countries and the entry of refugees, after a federal judge in Seattle blocked it with a temporary restraining order on Friday.\n“The Order inflicts significant harm on American business, innovation, and growth as a result,” it added.\n“Immigrants or their children founded more than 200 of the companies on the Fortune 500 list.”U.S. tech firms have been among the more vocal sectors speaking out against the policy, with many of its staff made up of foreign-born nationals."}