{"url": "http://nypost.com/2017/01/31/democrats-praise-patriot-sally-yates-for-defying-donald-trump/", "id": "359", "title": "Democrats praise ‘patriot’ Sally Yates for defying Donald Trump", "text": "The Democratic National Committee heralded former Acting Attorney General Sally Yates for her defiance of President Trump’s immigration ban.\n\n“Donald Trump can try to silence heroic patriots like Sally Yates who dare to speak truth to power about his illegal anti-Muslim ban that emboldens terrorists around the globe,” DNC senior adviser Zac Petkanas said in a statement Monday night.\n\nsee also Trump fires acting AG for defying immigration ban WASHINGTON — President Donald Trump on Monday fired Sally Yates,...\n\n“But he cannot silence the growing voices of an American people now wide awake to his tyrannical presidency,” the Democratic official said.\n\nYates was jettisoned when she told the Justice Department she wouldn’t defend the president’s executive order suspending immigration from seven majority-Muslim countries.\n\n“The acting Attorney General, Sally Yates, has betrayed the Department of Justice by refusing to enforce a legal order designed to protect the citizens of the United States,” a Monday night statement from the White House said.\n\n“Ms. Yates is an Obama Administration appointee who is weak on borders and very weak on illegal immigration,” the statement continued.\n\nYates was filling in as America’s top cop until Trump’s selection for attorney general, Sen. Jeff Sessions (R-Ala.), received Senate confirmation.\n\nTrump has named Dana Boente acting attorney general. A Senate vote on Sessions is expected as early as this week.", "authors": ["January"], "publish_date": "2017-01-31", "source": "nypost", "top_words": ["trump", "sally", "immigration", "democrats", "statement", "weak", "donald", "trumps", "general", "attorney", "praise", "acting", "yates", "patriot", "defying"], "summary": "The Democratic National Committee heralded former Acting Attorney General Sally Yates for her defiance of President Trump’s immigration ban.\n“The acting Attorney General, Sally Yates, has betrayed the Department of Justice by refusing to enforce a legal order designed to protect the citizens of the United States,” a Monday night statement from the White House said.\nYates is an Obama Administration appointee who is weak on borders and very weak on illegal immigration,” the statement continued.\nYates was filling in as America’s top cop until Trump’s selection for attorney general, Sen. Jeff Sessions (R-Ala.), received Senate confirmation.\nTrump has named Dana Boente acting attorney general."}