{"url": "http://nypost.com/2017/04/26/trump-goes-after-ridiculous-rulings-blocking-executive-orders/", "id": "416", "title": "Trump goes after ‘ridiculous rulings’ blocking executive orders", "text": "President Trump lashed out early Wednesday against a federal judge’s ruling blocking an executive order that could deny billions of dollars to “sanctuary cities” – vowing to take his fight to the Supreme Court.\n\nsee also Judge blocks Trump's sanctuary city order A federal judge on Tuesday dealt another blow to President...\n\n“First the Ninth Circuit rules against the ban & now it hits again on sanctuary cities-both ridiculous rulings. See you in the Supreme Court!” Trump said during a morning tweetstorm.\n\n“Out of our very big country, with many choices, does everyone notice that both the ‘ban’ case and now the ‘sanctuary’ case is brought in the Ninth Circuit, which has a terrible record of being overturned (close to 80%). They used to call this ‘judge shopping!’ Messy system,” he continued.\n\nCalifornia US District Judge William Orrick on Tuesday issued a preliminary injunction barring any attempt to implement Trump’s Jan. 25 executive order.\n\nOrrick quoted Trump to support his decision to block the executive order, which calls for withholding funding from “sanctuary cities” like the Big Apple that do not cooperate with US immigration officials.\n\nTrump called his order a “weapon” against communities that disagree with his preferred immigration policy, Orrick said.\n\nThe judge also cited a February interview in which he said the Trump threatened to cut off funding to California, saying the state “in many ways is out of control.”\n\nThe first comment was proof that the administration intended the executive order to apply broadly to all sorts of federal funding, not just a relatively small amount of grant money as the Department of Justice had argued, Orrick said.\n\nThe second statement showed the two California governments that sued to block the order — San Francisco and Santa Clara County — had good reason to believe they would be targeted, Orrick said.\n\nOrrick’s ruling was another immigration policy setback for the embattled administration as it approaches its 100th day in office Saturday amid Trump’s lowest approval ratings in modern presidential history.\n\nThe sanctuary city order was among a slew of immigration measures Trump signed in January — including a ban on travelers from seven Muslim-majority countries and a directive calling for a wall along the Mexican border.\n\nTrump’s words also were cited by federal judges in Maryland and Hawaii, who last month blocked his revised ban on new visas for people from six Muslim-majority countries.\n\nUS District Judge Derrick Watson in Hawaii and US District Judge Theodore Chuang in Maryland said his comments supported the allegation that the ban was aimed at Muslims.\n\nOrrick’s preliminary injunction against the sanctuary cities order will stay in place while the lawsuits by San Francisco and Santa Clara wend their way through court.\n\nThe government hasn’t cut off any funding yet or declared any communities sanctuary cities. But the Justice Department sent letters last week advising communities to prove they are in compliance.\n\nWhite House chief of staff Reince Priebus described the ruling as another example of the “9th Circuit going bananas.”\n\nThe administration has often criticized the 9th US Circuit Court of Appeals. Orrick does not sit on that court but his district is in the territory of the appeals court, which has ruled against one version of Trump’s travel ban.\n\n“The idea that an agency can’t put in some reasonable restriction on how some of these moneys are spent is something that will be overturned eventually, and we will win at the Supreme Court level at some point,” Priebus said.\n\nWith Post Wires", "authors": ["April"], "publish_date": "2017-04-26", "source": "nypost", "top_words": ["executive", "rulings", "trump", "orders", "ban", "ridiculous", "goes", "blocking", "judge", "court", "immigration", "sanctuary", "funding", "trumps", "order", "orrick"], "summary": "President Trump lashed out early Wednesday against a federal judge’s ruling blocking an executive order that could deny billions of dollars to “sanctuary cities” – vowing to take his fight to the Supreme Court.\nsee also Judge blocks Trump's sanctuary city order A federal judge on Tuesday dealt another blow to President...“First the Ninth Circuit rules against the ban & now it hits again on sanctuary cities-both ridiculous rulings.\nSee you in the Supreme Court!” Trump said during a morning tweetstorm.\nCalifornia US District Judge William Orrick on Tuesday issued a preliminary injunction barring any attempt to implement Trump’s Jan. 25 executive order.\nTrump called his order a “weapon” against communities that disagree with his preferred immigration policy, Orrick said."}