{"url": "http://nypost.com/2017/01/28/canadian-pm-to-refugees-we-will-welcome-you/", "id": "443", "title": "Canadian PM to refugees: We will welcome you", "text": "TORONTO — Canadian Prime Minister Justin Trudeau has a message for refugees rejected by President Donald Trump: Canada will take you.\n\nHe also intends to talk to Trump about the success of Canada’s refugee policy.\n\nTrudeau reacted to Trump’s ban of Muslims from certain countries by tweeting Saturday: “To those fleeing persecution, terror & war, Canadians will welcome you, regardless of your faith. Diversity is our strength #WelcomeToCanada.”\n\nTrudeau also posted a picture of him greeting a Syrian child at Toronto’s airport in late 2015. Trudeau oversaw the arrival of more than 39,000 Syrian refugees soon after he was elected.\n\nA spokeswoman for Trudeau said Trudeau has a message for Trump.\n\n“The Prime Minister is looking forward to discussing the successes of Canada’s immigration and refugee policy with the President when they next speak,” Trudeau spokeswoman Kate Purchase told The Associated Press.\n\nTrudeau is expected to the visit the White House soon.\n\nThe prime minister has refrained from criticizing Trump to avoid offending the new president. More than 75 percent of Canada’s exports go to the U.S.\n\nToronto Mayor John Tory also weighed in, noting that the city is the most diverse in the world.\n\n“We understand that as Canadians we are almost all immigrants, and that no one should be excluded on the basis of their ethnicity or nationality,” Tory said in a statement.\n\nTrump signed a sweeping executive order Friday that he billed as a necessary step to stop “radical Islamic terrorists” from coming to the U.S. Included is a 90-day ban on travel to the U.S. by citizens of Iraq, Syria, Iran, Sudan, Libya, Somalia or Yemen and a 120-day suspension of the U.S. refugee program.\n\nTrump’s order singled out Syrians for the most aggressive ban, ordering that anyone from that country, including those fleeing civil war, are indefinitely blocked from coming to the United States.\n\nThe Syrian refugee crisis became a major issue in Canada’s election in late 2015 because of the haunting image of a drowned 3-year-old Syrian boy washed up on a Turkish beach. The boy had relatives in Canada.\n\nTrudeau’s tweet quickly received more than 150,000 likes. “Welcome to Canada” trended in Canada.", "authors": ["Associated Press", "January"], "publish_date": "2017-01-28", "source": "nypost", "top_words": ["syrian", "canadas", "trump", "ban", "refugee", "president", "trudeau", "welcome", "prime", "refugees", "canadian", "minister", "canada"], "summary": "TORONTO — Canadian Prime Minister Justin Trudeau has a message for refugees rejected by President Donald Trump: Canada will take you.\nHe also intends to talk to Trump about the success of Canada’s refugee policy.\nTrudeau reacted to Trump’s ban of Muslims from certain countries by tweeting Saturday: “To those fleeing persecution, terror & war, Canadians will welcome you, regardless of your faith.\nTrudeau oversaw the arrival of more than 39,000 Syrian refugees soon after he was elected.\n“Welcome to Canada” trended in Canada."}