{"url": "http://nypost.com/2017/09/15/federal-judge-rules-doj-cant-block-funds-to-sanctuary-cities/", "id": "462", "title": "Federal judge rules DOJ can’t block funds to sanctuary cities", "text": "A federal judge dealt the Trump administration’s tough immigration stance another blow Friday, ruling that the feds can’t withhold funds from sanctuary cities like the Big Apple that don’t play ball with its crackdown on illegal immigrants.\n\nsee also DOJ threatens major crackdown on funds to sanctuary cities The Trump administration issued a double threat Monday to sanctuary...\n\nJudge Harry Leinenweber of Chicago said the Justice Department can’t refuse to dole out millions of dollars in grants supporting public safety from cities that decline to share the immigration status of suspects in custody with immigration authorities, Bloomberg reported.\n\nThe limited restrictions on funding challenged by Chicago were imposed by Justice after the administration was blocked by a San Francisco judge in April from making much broader cuts in jurisdictions that don’t help its efforts to deport undocumented immigrants.\n\n“The court finds that the city has established that it would suffer irreparable harm if a preliminary injunction is not entered,” the judge said in his ruling.\n\nThe injunction is “nationwide in scope,” Leinenweber added, “there being no reason to think that the legal issues present in this case are restricted to Chicago.”\n\nForcing reluctant cities to help round up undocumented immigrants was a key component of the president’s campaign vow to rid the US of “bad hombres” entering from Mexico.\n\nThe ruling further frustrates an administration mired in litigation over immigration policy since Trump took office in January.\n\nStill unresolved are legal fights over the president’s travel ban targeting travelers from six Muslim-majority countries and a budget showdown in Congress over funding for his promised border wall with Mexico.\n\nThe rules at issue would have required police to provide the Department of Homeland Security with unlimited access to police stations to interrogate civilians who are arrested, and give at least a 48-hour notice before the release of someone suspected of immigration violations.\n\nChicago argued in court that the federal regulation ran afoul of the Constitution’s separation of powers principles and also violates a criminal suspect’s Fourth Amendment right not to be held in custody without being charged.\n\nLike New York and other sanctuary cities, Chicago has a longstanding policy of not sharing information with federal immigration authorities unless a suspect is charged or convicted of a serious crime.\n\nThe policy “promotes cooperation between local law enforcement and immigrant communities,” Chicago said in its complaint.\n\nAttorney General Jeff Sessions called Chicago’s Aug. 7 lawsuit “astounding,” saying the city has gone through an unprecedented violent crime surge, “with the number of murders in 2016 surpassing both New York and Los Angeles combined.”\n\nThe White House did not immediately respond to a request for comment.\n\nWith Bloomberg", "authors": ["September"], "publish_date": "2017-09-15", "source": "nypost", "top_words": ["administration", "trump", "immigration", "funds", "judge", "rules", "block", "sanctuary", "doj", "cities", "federal", "chicago", "york", "cant", "policy"], "summary": "A federal judge dealt the Trump administration’s tough immigration stance another blow Friday, ruling that the feds can’t withhold funds from sanctuary cities like the Big Apple that don’t play ball with its crackdown on illegal immigrants.\n“The court finds that the city has established that it would suffer irreparable harm if a preliminary injunction is not entered,” the judge said in his ruling.\nThe ruling further frustrates an administration mired in litigation over immigration policy since Trump took office in January.\nLike New York and other sanctuary cities, Chicago has a longstanding policy of not sharing information with federal immigration authorities unless a suspect is charged or convicted of a serious crime.\nThe policy “promotes cooperation between local law enforcement and immigrant communities,” Chicago said in its complaint."}