{"url": "http://nypost.com/2017/09/18/refugees-rent-trumps-childhood-home-to-send-message-to-un-leaders/", "id": "460", "title": "Refugees rent Trump’s childhood home to send message to UN leaders", "text": "President Donald Trump’s childhood home in New York had some new occupants over the weekend — refugees who shared their stories as a way to draw attention to the refugee crisis as the United Nations General Assembly convenes this week with Trump in attendance.\n\nThe three-story Tudor-style home in Queens that Trump’s father, Fred, built in 1940 is now a rental available on Airbnb that anyone can stay in for $725 a night. It was auctioned off to an unidentified buyer in March for $2.14 million, its second time going up for auction.\n\nThe international anti-poverty organization Oxfam rented it Saturday and invited four refugees to talk with journalists. The Republican president’s administration issued travel bans on people from six Muslim-majority countries and all refugees. After various court challenges, the Supreme Court last week allowed the restrictive policy on refugees to remain temporarily. The justices will hear arguments on the bans Oct. 10.\n\n“We wanted to send a strong message to Trump and world leaders that they must do more to welcome refugees,” said Shannon Scribner, acting director for the humanitarian department of Oxfam America.\n\nTrump lived in the house on a tree-lined street of single-family dwellings until he was about 4, when his family moved to another home his father had built nearby.\n\nIn an upstairs bedroom, Eiman Ali, 22, looked around at the dark wood floors and a copy of the book “Trump: The Art of the Deal” on a nearby table and wondered about the home’s previous resident.\n\n“Knowing Donald Trump was here at the age of four makes me think about where I was at the age of four,” said Ali, her smiling face framed by a dark gray hijab. “We’re all kids who are raised to be productive citizens, who have all these dreams and hopes.”\n\nAli was three when she arrived in the United States from Yemen, where her parents had fled when war broke out in their native Somalia. Ali said she remembered Trump as an entertaining character on “The Celebrity Apprentice,” but has since changed her opinion.\n\n“To have someone so outspoken against my community become the president of the United States was very eye-opening and hurtful because I have invested a lot in this country,” she said.\n\nDown the hall, Ghassan al-Chahada, 41, a Syrian refugee who arrived in the United States with his wife and three children in 2012, sat in a room with bunk beds and a sign on the wall that said it likely was Trump’s childhood bedroom.\n\n“Before the conflict began in Syria we had dreams of coming to America,” al-Chahada said. “For us, it was a dream come true.”\n\nAl-Chahada said his life changed when Trump signed the ban that barred people from Syria and five other countries, from entering the United States.\n\n“I had hopes I would get my green card and be able to visit my country,” al-Chahada said. “But since Trump was elected I don’t dare, I don’t dare leave this country and not be able to come back.”\n\nHe looked out the window into the front yard and thought about what he would say to the president.\n\n“I would advise him to remember, to think about how he felt when he slept in this bedroom,” al-Chahada said. “If he can stay in tune with who he was as a child, the compassion children have and the mercy, I would say he’s a great person.”", "authors": ["Associated Press", "September"], "publish_date": "2017-09-18", "source": "nypost", "top_words": ["alchahada", "message", "rent", "trump", "think", "united", "states", "trumps", "country", "ali", "childhood", "week", "refugees", "leaders", "send"], "summary": "The international anti-poverty organization Oxfam rented it Saturday and invited four refugees to talk with journalists.\nAfter various court challenges, the Supreme Court last week allowed the restrictive policy on refugees to remain temporarily.\n“We wanted to send a strong message to Trump and world leaders that they must do more to welcome refugees,” said Shannon Scribner, acting director for the humanitarian department of Oxfam America.\n“I had hopes I would get my green card and be able to visit my country,” al-Chahada said.\n“I would advise him to remember, to think about how he felt when he slept in this bedroom,” al-Chahada said."}