{"url": "http://nypost.com/2017/01/29/airbnb-offers-housing-to-travelers-stranded-by-immigration-ban/", "id": "402", "title": "Airbnb offers housing to travelers stranded by immigration ban", "text": "Airbnb isn’t letting displaced refugees go homeless — offering free housing for travelers who were left with nowhere to go following President Trump’s immigration ban.\n\nThe home-sharing company extended the offer to anyone who was blocked from boarding a US-bound flight and aren’t in their home country or city.\n\n“We have 3 million homes, so we can definitely find people a place to stay,” CEO Brian Chesky said in a statement.\n\nHe is one of many Silicon Valley head honchos who have taken action against Trump’s executive order, which bars immigrants from seven predominantly Muslim countries from coming to America for the next three months. It indefinitely halts Syrian refugees from entering the U.S.\n\nsee also Lawyers back in court after judge's immigration order ignored Another legal fight was brewing in Brooklyn on Sunday following...\n\nThe ride-sharing app Lyft is donating $1 million to the ACLU “to defend our constitution” following the organization’s legal victory Saturday that temporarily halted the presidential directive.\n\nGoogle CEO Sundar Pichai immediately sent a company-wide email Friday, the day the executive order was signed, and pulled back traveling members of his team.\n\n“It’s painful to see the personal cost of this executive order on our colleagues,” he wrote. “We’ve always made our view on immigration issues known publicly and will continue to do so.”\n\nTim Cook, the CEO of Apple, also called out the order, which he said in an email to the company’s staff was “not a policy we support.”\n\n“Apple would not exist without immigration, let alone thrive and innovate the way we do,” he wrote, adding in a quote from Dr. Martin Luther King Jr.\n\nEven Trump’s allies in Silicon Valley — including Tesla CEO Elon Musk, who serves as an advisor to the president — were critical of the policy.\n\n“The blanket entry ban on citizens from certain primarily Muslim countries is not the best way to address the country’s challenges,” Musk tweeted. “Many people negatively affected by this policy are strong supporters of the US. They’ve done right,not wrong & don’t deserve to be rejected.”", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["executive", "wrote", "ban", "immigration", "housing", "travelers", "way", "valley", "stranded", "refugees", "ceo", "trumps", "order", "silicon", "offers", "airbnb"], "summary": "Airbnb isn’t letting displaced refugees go homeless — offering free housing for travelers who were left with nowhere to go following President Trump’s immigration ban.\nIt indefinitely halts Syrian refugees from entering the U.S.see also Lawyers back in court after judge's immigration order ignored Another legal fight was brewing in Brooklyn on Sunday following...\nGoogle CEO Sundar Pichai immediately sent a company-wide email Friday, the day the executive order was signed, and pulled back traveling members of his team.\n“It’s painful to see the personal cost of this executive order on our colleagues,” he wrote.\nEven Trump’s allies in Silicon Valley — including Tesla CEO Elon Musk, who serves as an advisor to the president — were critical of the policy."}