{"url": "http://nypost.com/2017/09/24/nfl-team-owners-blast-trump-in-solidarity-with-players-protests/", "id": "424", "title": "NFL team owners blast Trump in solidarity with players’ protests", "text": "A slew of NFL team owners — including several million-dollar donors to President Trump — blasted the commander-in-chief Sunday for bashing their players’ anti-racism protests.\n\nThe owners’ defiance was surprisingly led by New England Patriots boss Robert Kraft, typically a Trump loyalist, who said he couldn’t stand by while the president labeled any player who kneels during the national anthem a “son of a bitch.”\n\n“I am deeply disappointed by the tone of the comments made by the president,” Kraft said in a statement.\n\n“Our players are intelligent, thoughtful and care deeply about our community, and I support their right to peacefully affect social change and raise awareness in a manner that they feel is most impactful.”\n\nTrump, asked for comment later, danced around the slap in the face.\n\n“He’s a good friend of mine, and I want him to do what he wants to do,” Trump said of Kraft. “[But] we have great people representing our country . . . and when you get on your knee and you don’t respect the American flag or the anthem, that’s not being treated with respect.’’\n\nJacksonville Jaguars boss Shahid Khan and Houston Texans owner Robert McNair — both buddies of and $1 million donors to Trump — echoed Kraft’s disdain. Khan stood on the field, his arms linked with his players, during his team’s game Sunday.\n\nMcNair said Trump’s “divisive and counterproductive’’ words couldn’t have come at a worse time for the country.\n\nOwners of the New York Giants and eight other teams made similar comments.", "authors": ["September"], "publish_date": "2017-09-24", "source": "nypost", "top_words": ["protests", "solidarity", "trump", "nfl", "players", "blast", "robert", "teams", "donors", "deeply", "kraft", "president", "owners", "team", "khan"], "summary": "A slew of NFL team owners — including several million-dollar donors to President Trump — blasted the commander-in-chief Sunday for bashing their players’ anti-racism protests.\n“He’s a good friend of mine, and I want him to do what he wants to do,” Trump said of Kraft.\nKhan stood on the field, his arms linked with his players, during his team’s game Sunday.\nMcNair said Trump’s “divisive and counterproductive’’ words couldn’t have come at a worse time for the country.\nOwners of the New York Giants and eight other teams made similar comments."}