{"url": "http://nypost.com/2017/01/31/rangers-mika-zibanejad-hit-close-to-home-by-trump-ban/", "id": "434", "title": "Rangers’ Mika Zibanejad worried about seeing his family in Iran", "text": "Mika Zibanejad’s father, Mehrdad, was born in Iran, but the Rangers’ center was born in Huddinge, Sweden on April 18, 1993, after his dad emigrated in the early 1980s in the wake of the revolution in which the Shah was overthrown and Ayatollah Khomeini gained control of the government.\n\n“I am only a Swedish citizen; not dual,” Zibanejad, whose father now lives in the U.S., said Monday when asked if President Trump’s executive order regarding travel from seven predominantly Muslim countries, including Iran, would have an impact on his ability to travel freely between the U.S. and Canada.\n\n“It’s frustrating that so many ‘experts’ seem to know more about my situation than I do and assume that I’m dual, I don’t know where they get that from, but I can clear that up now. I travel on a Swedish passport with a [work visa] that the Rangers took care of after I was traded here.\n\n“And I actually came back into the country [Sunday] night and had no problem,” said No. 93, who took an All-Star break vacation to Turks and Caicos with Henrik Lundqvist and Mats Zuccarello.\n\nZibanejad, whose team faces the Blue Jackets on Tuesday night at the Garden, has family — including his grandmother, aunts and cousins — and friends living in Iran. His mother, Ritva, is a native of Finland.\n\n“It’s not fun to know that it isn’t easy for them to travel here and could be harder for me to see them. It’s not good,” Zibanejad said. “[The policy] is still hard for me to grasp. It seems straightforward, but it isn’t. It’s a little confusing, so as far expressing my opinion, I’d like to know more about it before I say more.”\n\nThe Blueshirts expect to have both Marc Staal and Jesper Fast in against the Blue Jackets, the second-place team in the Metropolitan Division who lead the fourth-place Rangers by five points while holding a game in hand.\n\nStaal, who left the lineup after “not feeling well at all” following the Jan. 3 home defeat to the Sabres, is due back after missing nine games with the third recorded concussion of his NHL career. Fast missed the final four before the break with an upper body injured he sustained against Dallas on Jan. 17.\n\n“It was a lot longer than I thought, and plus the break, but I’m good to go; 100 percent,” said Staal, who apparently suffered symptoms in a delayed reaction to a hit/hits he took in Arizona and/or Colorado the last week of December. “I feel good. I’m just going to go out and play. I’m not worrying about protecting myself or anything like that. If you play that way, you just put yourself in danger, anyway.”\n\nAntti Raanta, sidelined since leaving the Blueshirts’ 5-4 loss in Montreal on Jan. 14 after suffering a first-period lower-body injury, pronounced himself good to go following Monday’s practice.\n\n“When they need me, I’m ready,” said Raanta, who sustained the injury on what he called, “a misstep,” and not as a result of the contact he absorbed when Andrew Shaw collided with the netminder in the crease 4:00 into the match.\n\nRaanta, 10-4/.923/2.23, would seem in line for the start Thursday when the Blueshirts face the Sabres in Buffalo.\n\nKevin Hayes, sidelined with a suspected left knee injury, has not skated since going down in Detroit on Jan. 22. The center is expected to be out for another couple of weeks.", "authors": ["January"], "publish_date": "2017-01-31", "source": "nypost", "top_words": ["iran", "travel", "break", "rangers", "zibanejad", "good", "worried", "family", "jan", "took", "know", "injury", "im", "mika", "seeing"], "summary": "I travel on a Swedish passport with a [work visa] that the Rangers took care of after I was traded here.\n93, who took an All-Star break vacation to Turks and Caicos with Henrik Lundqvist and Mats Zuccarello.\nZibanejad, whose team faces the Blue Jackets on Tuesday night at the Garden, has family — including his grandmother, aunts and cousins — and friends living in Iran.\nFast missed the final four before the break with an upper body injured he sustained against Dallas on Jan. 17.\nKevin Hayes, sidelined with a suspected left knee injury, has not skated since going down in Detroit on Jan. 22."}