{"url": "http://nypost.com/2017/03/22/more-and-more-americans-are-trying-to-pack-heat-while-flying/", "id": "455", "title": "More and more Americans are trying to pack heat while flying", "text": "The Department of Homeland Security banned passengers from carrying most electronics larger than a smartphone on flights arriving from Egypt, Jordan, Kuwait, Morocco, Saudi Arabia, Turkey, Qatar and the United Arab Emirates, citing “evaluated intelligence.” Travelers on U.S. flights, however, might want to be extra careful when flying from American airports this year because guns are becoming a popular travel companion. What’s more, 83% of those firearms were loaded.\n\nA record number of guns — 3,391 — were discovered in passengers’ carry-on bags at American airports in 2016, up 28% from the year before, and a jump from just 821 in 2006. For 2016, that’s an average of nine firearms per day, according to a report recently published on the Transportation Security Administration’s (TSA) blog. The number of TSA gun discoveries has continued to increase for more than a decade. Firearms intercepted by TSA today are over five times more than 10 years ago, data show.\n\nAmong the 238 airports where firearms were spotted, Hartsfield-Jackson Atlanta International Airport topped the list with 198 items, followed by Dallas/Fort Worth International with 192. Most of the top 10 airports are located in the South and Southwest region of the country.\n\nBesides guns, passengers attempted to bring many other hazardous items onto flights. According to data acquired by Max Galka last year via a Freedom of Information request, a total number of 22,044 “dangerous items” were confiscated by TSA in 2015, covering 16 categories including explosive device, flares, chemical agent and martial art items.\n\nThe airport traffic volume doesn’t always coincide with the number of dangerous items found. For instance, the TSA confiscated 434 dangerous items at Anchorage International Airport in Alaska, the 55th busiest U.S. airport by number of boarding passengers, while at LAX (Los Angeles International Airport), the second busiest U.S. airport, the number is only 199, according to Galka.\n\nFirearm replicas and inert grenades are also on the banned items list for carry-on baggages, even though they technically pose no danger to others. “The problem with these types of items is that we don’t know if they are real, toys or replicas until TSA explosives experts are called upon,” according to the TSA blog. These items can lead to disruption, closed terminals and checkpoints, and possibly even canceled or delayed flights.", "authors": ["Evie Liu", "March"], "publish_date": "2017-03-22", "source": "nypost", "top_words": ["passengers", "international", "airport", "firearms", "airports", "tsa", "heat", "flights", "trying", "items", "number", "according", "flying", "pack", "americans"], "summary": "For 2016, that’s an average of nine firearms per day, according to a report recently published on the Transportation Security Administration’s (TSA) blog.\nThe number of TSA gun discoveries has continued to increase for more than a decade.\nFirearms intercepted by TSA today are over five times more than 10 years ago, data show.\nAmong the 238 airports where firearms were spotted, Hartsfield-Jackson Atlanta International Airport topped the list with 198 items, followed by Dallas/Fort Worth International with 192.\nThese items can lead to disruption, closed terminals and checkpoints, and possibly even canceled or delayed flights."}