{"url": "http://nypost.com/2017/01/29/mccain-says-trump-adding-bannon-to-security-council-is-concerning/", "id": "400", "title": "McCain says Trump adding Bannon to Security Council is concerning", "text": "WASHINGTON – President Trump’s decision to shake up his National Security Council by removing a prominent military leader in favor of political adviser Steve Bannon is worrisome and a “radical departure,” Sen. John McCain said Sunday.\n\nTrump signed executive action Saturday adding Bannon, who headed the alt-right Breitbart web site before joining the campaign, to his core security council while removing the Director of National Intelligence and chairman of the Joint Chiefs of Staffs.\n\n“The appointment of Mr. Bannon is something which is a radical departure from any National Security Council in history,” McCain (R-Ariz.) told CBS’s “Face the Nation.”\n\n“The role of the chairman of the Joint Chiefs of Staff has been diminished, I understand, with this reorganization. One person who is indispensable would be the chairman of the Joint Chiefs of Staff, in my view. So it’s of concern.”\n\nFormer Defense Secretary Robert Gates told ABC’s “This Week” it was “big mistake” to exclude the chairman of the Joint Chiefs of Staff and the Director of National Intelligence from National Security Council meetings.\n\nTrump picked former Indiana Sen. Dan Coats as Director of National Intelligence earlier this month, but he awaits Senate confirmation.\n\nMeanwhile, former President Obama’s national security adviser Susan Rice blasted Trump’s security council shake-up as “stone cold crazy.” Rice also shared an offensive tweet calling Bannon is a “Nazi.”\n\n“That’s clearly inappropriate language from a former ambassador,” White House Press Secretary Sean Spicer responded on ABC’s “This Week.”\n\nSpicer defended giving Bannon a seat at the council’s meeting, saying his role is “crucial,” adding that Bannon is a former Naval officer who has “a tremendous understanding of the world and the geopolitical landscape that we have now.”\n\n“Having the chief strategist for the president in those meetings who has a significant military background to guide what the president’s final analysis is going to be is crucial,” Spicer said.", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["council", "adding", "trump", "bannon", "national", "intelligence", "security", "mccain", "chairman", "concerning", "chiefs", "staff", "joint", "president"], "summary": "WASHINGTON – President Trump’s decision to shake up his National Security Council by removing a prominent military leader in favor of political adviser Steve Bannon is worrisome and a “radical departure,” Sen. John McCain said Sunday.\nTrump signed executive action Saturday adding Bannon, who headed the alt-right Breitbart web site before joining the campaign, to his core security council while removing the Director of National Intelligence and chairman of the Joint Chiefs of Staffs.\nOne person who is indispensable would be the chairman of the Joint Chiefs of Staff, in my view.\nSo it’s of concern.”Former Defense Secretary Robert Gates told ABC’s “This Week” it was “big mistake” to exclude the chairman of the Joint Chiefs of Staff and the Director of National Intelligence from National Security Council meetings.\nTrump picked former Indiana Sen. Dan Coats as Director of National Intelligence earlier this month, but he awaits Senate confirmation."}