{"url": "http://nypost.com/2017/02/10/trump-says-additional-immigration-security-steps-coming-rapidly/", "id": "417", "title": "Trump says additional immigration security steps will come ‘rapidly’", "text": "President Trump said Friday he had “no doubt” that he would ultimately win the federal court case over his stalled executive order that would temporarily ban all refugees as well as immigrants from seven Muslim-majority countries.\n\nAsked how he planned to fight an appellate court decision that kept in place a Seattle judge’s restraining order blocking the ban, the president offered a confident vision but was vague on details.\n\n“We are going to keep our country safe. We are going to do whatever is necessary to keep our country safe. We had a [court] decision [and] we think [we] will be very successful with and shouldn’t have taken this much time because safety is a primary reason,” Trump said.\n\n“We’ll be doing something very rapidly having to do with additional security for our country. You’ll be seeing that sometime next week. In addition, we will continue to go through the court process, and I have no doubt we’ll win that particular case.”\n\nTrump also alluded to unspecified threats he had learned about in the three weeks of his presidency — and vowed to prevent any attacks on the US.\n\n“While I’ve been president, which is just for a very short period of time, I have learned tremendous things that you could only learn, frankly, if you were in a certain position, namely president,” Trump said during an appearance in the East Wing of the White House with Japanese Prime Minister Shinzō Abe.\n\n“There are tremendous threats to our country. We will not allow that to happen. I can tell you that right now. We will not allow that to happen. We’ll be going forward and continuing to do things to make our country safe. It will happen rapidly.”\n\nThe president also repeated that the US would not allow dangerous people into the country, but that others would be welcome.\n\n“We will not allow people into our country who are looking to do harm to our people. We will allow lots of people into our country that will love our people and do good for our country. It will remain that way during my administration.”\n\nTrump and Abe were heading later Friday to Trump’s Palm Beach resort, Mar-a-Lago, for a weekend of meetings and golf.", "authors": ["February"], "publish_date": "2017-02-10", "source": "nypost", "top_words": ["trump", "additional", "security", "immigration", "win", "tremendous", "court", "rapidly", "going", "country", "safe", "come", "president", "happen", "steps", "allow"], "summary": "“We are going to keep our country safe.\nWe are going to do whatever is necessary to keep our country safe.\n“We’ll be doing something very rapidly having to do with additional security for our country.\nWe’ll be going forward and continuing to do things to make our country safe.\nWe will allow lots of people into our country that will love our people and do good for our country."}