{"url": "http://nypost.com/2017/09/12/supreme-court-allows-trumps-travel-ban-to-remain-for-most-refugees/", "id": "463", "title": "Supreme Court allows Trump’s travel ban to remain for most refugees", "text": "WASHINGTON — The Supreme Court is allowing the Trump administration to maintain its restrictive policy on refugees.\n\nThe justices on Tuesday agreed to an administration request to block a lower court ruling that would have eased the refugee ban and allowed up to 24,000 refugees to enter the country before the end of October.\n\nThe order was not the court’s last word on the travel policy that President Donald Trump first rolled out in January. The justices are scheduled to hear arguments on Oct. 10 on the legality of the bans on travelers from six mostly Muslim countries and refugees anywhere in the world.\n\nIt’s unclear, though, what will be left for the court to decide. The 90-day travel ban lapses in late September and the 120-day refugee ban will expire a month later.\n\nThe administration has yet to say whether it will seek to renew the bans, make them permanent or expand the travel ban to other countries.\n\nLower courts have ruled that the bans violate the Constitution and federal immigration law. The high court has agreed to review those rulings. Its intervention so far has been to evaluate what parts of the policy can take effect in the meantime.\n\nThe justices said in June that the administration could not enforce the bans against people who have a “bona fide” relationship with people or entities in the United States. The justices declined to define the required relationships more precisely.\n\nA panel of the San Francisco-based 9th U.S. Circuit Court of Appeals upheld a district judge’s order that would have allowed refugees to enter the United States if a resettlement agency in the U.S. had agreed to take them in.\n\nThe administration objected, saying the relationship between refugees and resettlement agencies shouldn’t count. The high court’s unsigned, one-sentence order agreed with the administration, at least for now.\n\nThe appeals court also upheld another part of the judge’s ruling that applies to the ban on visitors from Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nGrandparents and cousins of people already in the U.S. can’t be excluded from the country under the travel ban, as the Trump administration had wanted. The administration did not ask the Supreme Court to block that part of the ruling.", "authors": ["Associated Press", "September"], "publish_date": "2017-09-12", "source": "nypost", "top_words": ["ruling", "travel", "trump", "ban", "supreme", "agreed", "court", "trumps", "refugees", "bans", "justices", "administration", "allows", "remain"], "summary": "WASHINGTON — The Supreme Court is allowing the Trump administration to maintain its restrictive policy on refugees.\nThe 90-day travel ban lapses in late September and the 120-day refugee ban will expire a month later.\nThe administration has yet to say whether it will seek to renew the bans, make them permanent or expand the travel ban to other countries.\nGrandparents and cousins of people already in the U.S. can’t be excluded from the country under the travel ban, as the Trump administration had wanted.\nThe administration did not ask the Supreme Court to block that part of the ruling."}