{"url": "http://nypost.com/2017/01/29/conway-airport-chaos-a-small-price-to-pay-for-security/", "id": "454", "title": "Conway: Airport chaos a ‘small price to pay’ for security", "text": "A top White House adviser said the chaos at airports across the country after President Trump signed an executive order tightening immigration from predominately Muslim countries was a “small price to pay” for added security.\n\nSenior adviser Kellyane Conway said about 300 people had been detained — a minuscule percentage of foreign travelers who have recently entered the US.\n\n‘You’re talking about 325,000 people from overseas came into this country just yesterday through our airports,” Kellyanne Conway said on “Fox News Sunday.” “You’re talking about 300 and some who have been detained or are prevented from gaining access to an aircraft in their home countries and must stay for now.”\n\n“That’s 1 percent,” she added. “And I think in terms of the upside being greater protection of our borders, of our people, it’s a small price to pay.”\n\nShe also downplayed reports that families have been separated since the executive action.\n\n“The whole idea they’re being separated and ripped from their families, it’s temporary,” Conway said.\n\nLater, White House Chief of Staff Reince Priebus seemed to cloud the issue by saying Trump’s order doesn’t affect green card holders.\n\n“We didn’t overrule the Department of Homeland Security,” he said on NBC’s “Meet the Press.” As far as green card holders moving forward, it doesn’t affect them.”\n\nPressed further about, he tried to clarify their status.\n\n“If you’re traveling back and forth, you’re going to be subjected to further screening.”", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["airport", "price", "separated", "security", "conway", "chaos", "small", "talking", "house", "youre", "green", "order", "pay", "white"], "summary": "A top White House adviser said the chaos at airports across the country after President Trump signed an executive order tightening immigration from predominately Muslim countries was a “small price to pay” for added security.\nSenior adviser Kellyane Conway said about 300 people had been detained — a minuscule percentage of foreign travelers who have recently entered the US.\n“And I think in terms of the upside being greater protection of our borders, of our people, it’s a small price to pay.”She also downplayed reports that families have been separated since the executive action.\n“The whole idea they’re being separated and ripped from their families, it’s temporary,” Conway said.\nLater, White House Chief of Staff Reince Priebus seemed to cloud the issue by saying Trump’s order doesn’t affect green card holders."}