{"url": "http://nypost.com/2017/01/30/lyft-surpasses-uber-in-downloads-after-protest-controversy/", "id": "418", "title": "Lyft surpasses Uber in downloads after protest controversy", "text": "Lyft surpassed Uber in daily app store downloads for the first time ever this weekend in the midst of the “#DeleteUber” social media campaign, reports said.\n\nThe ride-hailing company has been trying to keep up with its San Francisco-based rival for years — and had suffered from a 10-to-1 margin in terms of valuation in 2016, according to SFist.\n\nBut that all changed Sunday, thanks in large part to the sweeping, #DeleteUber campaign that has been launched in response to President Trump’s travel ban on refugees from certain Muslim nations.\n\nDisgusted Uber customers have been deleting the app in droves after learning how the company defied a taxi strike that was supposed to be taking place at JFK Airport — where numerous refugees were being detained over the weekend.\n\nThe New York Taxi Workers Alliance had urged drivers to protest Trump’s executive order by not picking up fares at the airport on Saturday night. Uber not only continued to send its drivers, it turned off its surge pricing in an attempt to drum up more business.\n\nThe move didn’t sit well with riders — and while Lyft also remained operational during the period, numbers showed that many were turning to the second-tier livery service as a result.\n\nAccording to App Annie, Lyft saw more daily downloads on iOS than Uber on Sunday — jumping from a ranking of #39 in the free apps charts to #4 by 4 p.m. Monday, TechCrunch reports.\n\nA spokesperson for the San Francisco-based analytics firm told the Verge that Lyft managed to more than double its daily average from the previous two weeks. On Monday, they were sitting ahead of Instagram, Snapchat, Youtube and Facebook on the free apps list.\n\nsee also Anti-Trump protesters are refusing to use Uber Disgusted Uber customers are deleting the ride-sharing app in droves...\n\nSince its inception, Lyft has marketed itself as a friendlier, more casual alternative to Uber.\n\nThe company tried to take this stance yet again Sunday, by pledging to donate $1 million to the American Civil Liberties Union (ACLU) as the #DeleteUber campaign continued to gain traction.\n\n“Banning people of a particular faith or creed, race or identity, sexuality or ethnicity, from entering the U.S. is antithetical to both Lyft’s and our nation’s core values,” Lyft co-founders John Zimmer and Logan Green said in a joint statement. “We stand firmly against these actions, and will not be silent on issues that threaten the values of our community.\n\nWhile Uber did later announce that they also would be providing three months of compensation to drivers who may be stranded overseas due to Trump’s travel ban, their decision to not join in on the protest at JFK was apparently too much to bear.\n\nThousands joined in on the #DeleteUber campaign throughout the weekend, including celebrities from all walks of entertainment.\n\n“Goodbye @Uber. Hello @lyft.” Susan Sarandon tweeted Monday.\n\n“DELETING @UBER RIGHT THE F–K NOW!!!” wrote Taraji P. Henson, star of Empire.\n\n“If you support HATE YO ASS GETS DELETED #BYEB—H,” she added.\n\nThe fact that Uber CEO Travis Kalanick is set to serve as an economic adviser to President Trump hasn’t been helping matters, either.\n\n“We must be mindful of where we spend our $ & the people we’re making rich [sic],” tweeted comedian Billy Eichner. “I’ve used @UBER constantly & loved it. Using @Lyft as of today.”", "authors": ["January"], "publish_date": "2017-01-30", "source": "nypost", "top_words": ["lyft", "weekend", "company", "uber", "protest", "trumps", "daily", "drivers", "controversy", "surpasses", "downloads", "deleteuber", "campaign", "app"], "summary": "Lyft surpassed Uber in daily app store downloads for the first time ever this weekend in the midst of the “#DeleteUber” social media campaign, reports said.\nThe New York Taxi Workers Alliance had urged drivers to protest Trump’s executive order by not picking up fares at the airport on Saturday night.\nsee also Anti-Trump protesters are refusing to use Uber Disgusted Uber customers are deleting the ride-sharing app in droves...\nSince its inception, Lyft has marketed itself as a friendlier, more casual alternative to Uber.\nThousands joined in on the #DeleteUber campaign throughout the weekend, including celebrities from all walks of entertainment."}