{"url": "http://nypost.com/2017/06/24/number-of-refugees-admitted-into-us-drops-by-50-percent/", "id": "449", "title": "US is taking in half as many refugees under Trump", "text": "The number of refugees who entered the U.S. during President Trump’s first three months compared to the last months of President Obama’s term was cut nearly in half, according to statistics released Friday by the Department of Homeland Security.\n\nAccording to the statistics, a total of 13,000 refugees were admitted to the U.S. in the past three months, compared to 25,000 under Obama, The Los Angeles Times reported. The most popular countries of origins remained the same: Democratic Republic of the Congo, Syria, Iraq, Somalia and Myanmar.\n\nObama set the ceiling of 110,000 refugee arrivals across the U.S. President Trump cut that number to 50,000 this year. Congress has approved a budget for only 75,000 for this fiscal year. A U.S. State Department spokesman said the country is now resettling 900 refugee arrivals weekly, to remain within that budget.\n\nTrump was praised by many supporters and criticized by others. Erol Kekic, executive director of the Immigration and Refugee Program for Church World Service, said at the time, “This program simply can’t be turned on and off like a faucet.”\n\nFederal court rulings have blocked Trump’s executive orders suspending arrivals from certain majority Muslim nations. But the lower U.S. admissions numbers have disrupted a finely tuned, federally funded process that begins with exhaustive 18-month security screenings abroad.\n\nTrump is moving to significantly reduce the number of refugees allowed to enter the United States, even as his bid to temporarily suspend admissions is stalled in the courts.\n\nThe statistics show that the Obama administration made an effort to increase the number of refugees before Trump by 86 percent.\n\nThere are more than 63 million refugees worldwide, according to the U.N. High Commissioner for Refugees.", "authors": ["Fox News", "June"], "publish_date": "2017-06-24", "source": "nypost", "top_words": ["trump", "half", "taking", "refugee", "trumps", "number", "months", "refugees", "president", "arrivals", "statistics", "program"], "summary": "Obama set the ceiling of 110,000 refugee arrivals across the U.S. President Trump cut that number to 50,000 this year.\nA U.S. State Department spokesman said the country is now resettling 900 refugee arrivals weekly, to remain within that budget.\nTrump is moving to significantly reduce the number of refugees allowed to enter the United States, even as his bid to temporarily suspend admissions is stalled in the courts.\nThe statistics show that the Obama administration made an effort to increase the number of refugees before Trump by 86 percent.\nThere are more than 63 million refugees worldwide, according to the U.N. High Commissioner for Refugees."}