{"url": "http://nypost.com/2017/08/31/blocked-immigrants-in-travel-ban-can-reapply-for-visas-doj/", "id": "467", "title": "Blocked immigrants in travel ban can reapply for visas: DOJ", "text": "The first lawsuit challenging President Trump’s original travel ban has officially settled, with the Department of Justice agreeing to alert all immigrants barred from entering the country in January they are now eligible to reapply for visas.\n\nsee also ACLU, DOJ settle legal challenge against Trump travel ban The legal challenge launched by the American Civil Liberties Union...\n\nThe DOJ will notify all those blocked from entering the country via letter, to be posted in the next 14 days, it was revealed in Brooklyn federal court Thursday. The letter, which will be written in English, Farsi, and Arabic, will also include a list of three legal service providers to help immigrants complete their applications.\n\nThe administration has also consented to appointing a DOJ liaison to help process the applications.\n\nThose hoping to apply for visas have 90 days to begin the reapplication process.\n\nThursday’s resolution marks the settlement of the first legal response to the Trump ​administration’s original executive order banning travel from seven Muslim-majority countries. The agreement was first reached Tuesday, and the terms were announced Thursday.\n\nThe proposed class action was filed in Jan. on behalf of Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi, who were among the first detained at the airport in the wake of the order, which blocked refugees and other travelers entering the U.S. from seven countries– including Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nNeither Darweesh nor Alshawi were in court Thursday–where it was mentioned that one of the men was in Houston.\n\n“It means a lot to me to be in America,” Darweesh, an Iraqi citizen who works as an interpreter for the U.S. government, said in a statement. “The United States is a great country because of its people. I’m glad that the lawsuit is over. Me and my family are safe; my kids go to school, we can now live a normal life. I suffered back home, but I have my rights now. I’m a human.”\n\nThe American Civil Liberties Union and other organizations have been negotiating with the Department of Justice since March, when the initial ban was deemed unconstitutional by a circuit court. Trump later unveiled a second, revised ban, which is still being challenged in other district courts across the county.\n\n“It’s a complete victory for us, this is a very satisfactory resolution,” said attorney Lee Gelernt of the ACLU. “Those excluded form the first Muslim travel ban will now know how to reapply. this shouldn’t have taken this long, but we are happy it is resolved.”\n\nIt still remains unclear how many people were held at airports in the wake of the order, though the ACLU has estimated the more than 700 people were detained or sent back to other countries.", "authors": ["August"], "publish_date": "2017-08-31", "source": "nypost", "top_words": ["travel", "trump", "immigrants", "visas", "ban", "court", "doj", "entering", "darweesh", "country", "blocked", "order", "reapply", "legal"], "summary": "The first lawsuit challenging President Trump’s original travel ban has officially settled, with the Department of Justice agreeing to alert all immigrants barred from entering the country in January they are now eligible to reapply for visas.\nsee also ACLU, DOJ settle legal challenge against Trump travel ban The legal challenge launched by the American Civil Liberties Union...\nThe DOJ will notify all those blocked from entering the country via letter, to be posted in the next 14 days, it was revealed in Brooklyn federal court Thursday.\nThursday’s resolution marks the settlement of the first legal response to the Trump ​administration’s original executive order banning travel from seven Muslim-majority countries.\n“Those excluded form the first Muslim travel ban will now know how to reapply."}