{"url": "http://nypost.com/2017/01/29/iranian-phd-student-detained-at-jfk-amid-immigration-chaos/", "id": "426", "title": "Iranian PhD student released after detainment at JFK", "text": "A Fulbright Scholar from Long Island spent more than 25 hours detained at JFK Airport — and was put on a plane twice under threat of being deported back to Iran — before finally being released Sunday.\n\nStony Brook University linguistics student Vahideh Rasekhi was just one of scores of people across the country targeted by President Trump’s ban on immigrants from seven Muslim countries.\n\nAt JFK alone, there were 48 people detained as of Sunday, with 30 eventually freed and two deported, said lawyers at the airport. Sixteen people were still being held.\n\n“I’m exhausted,’’ said Rasekhi, who has lived in the US for about 12 years and was returning from visiting her family in Iran, after being released.\n\n“It’s so embarrassing.’’\n\nA noted Syrian musician who lives in Brooklyn and recently toured with cellist Yo-Yo-Ma said he is now worried about trying to return home to the US.\n\nKinan Azmeh, a clarinet player who received a green card three years ago for demonstrating “extraordinary” abilities in science, business or art, said his tour is set to end in Beirut this week.\n\n“I have my apartment [in Brooklyn]. You know, 16 years is not a short time, you accumulate lots of stuff. But what is not replaceable is all the friends who are incredibly supportive,” the 40-year-old told AP.\n\nThe Iraqi mother of an active-duty US serviceman had her own horror story: She was held at Kennedy for 30 hours over the weekend before being released.\n\nHer son “was sleeping at the airport waiting for her to be freed,’’ said his lawyer Kayla Green, who went to the airport to represent detainees pro bono.\n\nUS Rep. Hakeem Jeffries (D-Brooklyn), who was at the airport meeting with federal officials and lawyers representing the detainees, said the unidentified woman has a legal visa to be here.\n\n“The visa was signed off on by the government,” he said. There was “no reason for her to be detained.”\n\nShe was supposed to travel to the US two weeks ago — but had to postpone the trip because her husband died.\n\n“They were both supposed to come, and then [the solider’s] father unfortunately passed,’’ Green said. “When [his mom] arrived was exactly when the order was enacted.”\n\nAnother immigrant affected by the ban was Hameed Khalid Darweesh, who worked as an interpreter for the US military in Iraq for more than a decade. He was in the air when Trump’s order took effect Friday.\n\nWhen he arrived at JFK, US Customs and Border Protection agents detained him for 17 hours.\n\n“I supported the government from the other side. But when I came here, they said, ‘No,’ they treat me as if I break the rules or did something wrong,’’ he said.\n\nJeffries said the detainees were being fed, but they were offered fast food, which isn’t halal, or according to the Muslim faith.\n\nLawyers assisting the travelers from the seven targeted countries — Iran, Iraq, Syria, Libya, Sudan, Somalia and Yemen — said the fallout from President Trump’s executive order was pure chaos.\n\nAnd they didn’t expect it to get better soon.\n\n“We just simply don’t know how many people there are and where they are,” Lee Gelernt, deputy director of the American Civil Liberties Union’s Immigrants’ Rights Project, told the AP.\n\nGov. Cuomo said he has set up a special hot line — 1-888-769-7243 — for detained refugees.\n\nElsewhere in the nation, there were similar tales of trauma as Muslim travelers found themselves being stopped with little information about why.\n\nAt Dulles International Airport in Washington, DC, a 5-year-old Iranian boy had a joyous reunion with his mother and family after he was detained for several hours following a trip to the US with a family member.\n\nAn 88-year-old Iraqi man and his 83-year-old wife in wheelchairs were detained after their flight to Dulles even though they had their green cards.\n\nTheir granddaughter, Pegan Rahmani, told the Daily Beast that her grandmother had recently had a stroke and her grandfather was legally blind.\n\n“They really weren’t treating them very nicely,” Rahmani said.\n\nAdditional reporting by Michael Gartland", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["iran", "airport", "phd", "released", "told", "detainment", "iranian", "trumps", "green", "student", "order", "muslim", "hours", "detained", "jfk"], "summary": "A Fulbright Scholar from Long Island spent more than 25 hours detained at JFK Airport — and was put on a plane twice under threat of being deported back to Iran — before finally being released Sunday.\nAt JFK alone, there were 48 people detained as of Sunday, with 30 eventually freed and two deported, said lawyers at the airport.\n“I’m exhausted,’’ said Rasekhi, who has lived in the US for about 12 years and was returning from visiting her family in Iran, after being released.\nHe was in the air when Trump’s order took effect Friday.\nWhen he arrived at JFK, US Customs and Border Protection agents detained him for 17 hours."}