{"url": "http://nypost.com/2017/09/11/supreme-court-blocks-appeals-court-ruling-that-limits-trumps-travel-ban/", "id": "464", "title": "Supreme Court temporarily restores Trump’s travel ban", "text": "The Supreme Court on Monday granted a request from the Trump administration and temporarily blocked a federal appeals court’s ruling that placed restrictions on the president’s travel ban.\n\nIn a one-page decision signed by Justice Anthony Kennedy, the high court halted a ruling by the 9th Circuit Court of Appeals last week that prohibited the government from barring entrance to refugees who had been offered help by a US-based resettlement agency.\n\nsee also Trump wants Supreme Court to restore refugee travel ban The Trump administration on Monday asked the Supreme Court to...\n\nKennedy’s order puts the San Francisco-based appeals court’s ruling on hold until the parties challenging the ban can submit written arguments to the court by Tuesday afternoon.\n\nIn its emergency request to the Supreme Court, the Justice Department said the appeals court’s decision “will disrupt the status quo and frustrate orderly implementation of the order’s refugee provisions.”\n\nThe lower court’s decision, which would apply to about 24,000 refugees, could have taken effect as early as Tuesday.\n\nThis interim order is separate from President Trump’s temporary ban on visitors from six mostly Muslim countries — Iran, Syria, Libya, Somalia, Sudan and Yemen.\n\nThe Supreme Court in June allowed that ban to continue while it considers arguments over whether the action is constitutional. A hearing is scheduled for Oct. 10.\n\nBut the justices said the ban couldn’t include people who have a “bona fide relationship with a person or entity in the United States.” They did not specify which relationships qualified.\n\nThe Trump administration interpreted it to mean parents, children, spouses, siblings, parents-in-law and sons- and daughters-in-law but not grandparents, grandchildren, aunts, uncles, nephews, nieces and cousins.\n\nA federal judge in Hawaii found the administration had defined the relationship too narrowly.\n\n“Common sense, for instance, dictates that close family members be defined to include grandparents,” Judge Derrick Watson wrote in July. “Indeed, grandparents are the epitome of close family members. The government’s definition excludes them. That simply cannot be.”\n\nThe 9th Circuit Court upheld that decision.\n\nThe administration did not challenge that aspect of the ban.\n\nTrump’s travel restrictions from the mainly Muslim countries has been caught up in the courts since he implemented his first executive order in January.\n\nAirports erupted in chaos as visitors to the United States were detained and some even pulled from planes as immigration advocates led protests across the country.\n\nOpponents challenged the order in court, saying that it was unconstitutional and that the president overstepped his executive authority.\n\nWith Wire Services", "authors": ["September"], "publish_date": "2017-09-11", "source": "nypost", "top_words": ["ruling", "travel", "courts", "trump", "restores", "temporarily", "supreme", "ban", "appeals", "court", "trumps", "order", "administration"], "summary": "The Supreme Court on Monday granted a request from the Trump administration and temporarily blocked a federal appeals court’s ruling that placed restrictions on the president’s travel ban.\nsee also Trump wants Supreme Court to restore refugee travel ban The Trump administration on Monday asked the Supreme Court to...Kennedy’s order puts the San Francisco-based appeals court’s ruling on hold until the parties challenging the ban can submit written arguments to the court by Tuesday afternoon.\nThe Supreme Court in June allowed that ban to continue while it considers arguments over whether the action is constitutional.\nThe Trump administration interpreted it to mean parents, children, spouses, siblings, parents-in-law and sons- and daughters-in-law but not grandparents, grandchildren, aunts, uncles, nephews, nieces and cousins.\nOpponents challenged the order in court, saying that it was unconstitutional and that the president overstepped his executive authority."}