{"url": "http://nypost.com/2017/01/29/green-card-holders-wont-be-subject-to-travel-ban/", "id": "405", "title": "Green card holders won’t be subject to travel ban", "text": "WASHINGTON – The Trump Administration reversed itself Sunday on a key element of its executive travel ban from Muslim countries, saying green card holders won’t be prevented from legally returning to the United States.\n\nAmid raucous protests at airports due to President Trump’s executive order to temporarily restrict travel from seven Muslim countries, White House Chief of Staff Reince Priebus said legal residents won’t be subject to the ban.\n\n“The executive order doesn’t affect green card holders moving forward,” Priebus told NBC’s “Meet the Press.”\n\nBut he also said border officials may use their “discretion” to question legal residents and US citizens in the future regarding suspicious travel activity to make sure they are not “up to no good.”\n\nPriebus stood by the presidents executive order saying it was necessary to protect Americans and was rolled out effectively with the awareness of homeland security officials.\n\n“They knew full well what was going on,” Priebus said.\n\nPriebus said “a couple dozen” people remained detained at airports as of Sunday morning.\n\n“The fact of the matter is 325,000 people from foreign countries came into the United States yesterday and 109 people were detained for further questioning, most of those people were moved out,” Priebus said.\n\n“We’ve got a couple dozen more that remain and I would suspect as long as they’re not awful people that they will move through before another half a day today. Perhaps some of these people should be detained further.”\n\n“Apologize for nothing here,” he added.\n\nOn CBS’s “Face the Nation,” Priebus added the White House may “expand” the travel ban beyond seven countries, if needed.\n\nCivil rights activists said over the weekend that legal permanent residents were targeted and detained at the first day of the executive order.\n\nTrita Parsi, head of the National Iranian American Council, said Sunday on MSNBC’s “Politics Nation” that green card holders were detained at airports, handcuffed, their social media accounts reviewed, interrogated and “also asked their view on Donald Trump.”\n\n“This is pretty scary,” Parsi said.\n\nDems pledged to “battle” the ban legislatively and with public pressure.\n\n“We think this administration poses a real threat to our reputation, our values and our people,” said Sen. Tim Kaine [D-Va.] on NBC’s “Meet the Press.” “And we’re going to battle.”\n\nKaine called out the White House for issuing the ban the same day it eliminated reference to Jews from its statement Friday on Holocaust Remembrance Day.\n\n“The irony is not lost on me that it was issued the same day as the White House issued their Holocaust Remembrance Day proclamation that unlike any previous administration removed all reference to Jews,” Kaine said. “So you put a religious test on Muslims and you try to scrub reference to Jews in the Holocaust Remembrance. This was horribly, horribly mishandled…. This is what Holocaust denial is.”\n\nPriebus said he doesn’t regret the statement, but meant no ill-will.\n\nThe White House, he said, “certainly will never forget the Jewish people that suffered in World War II. He added: “….There was no harm or ill-will or offense intended.”", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["executive", "travel", "day", "ban", "priebus", "holders", "holocaust", "card", "subject", "countries", "green", "wont", "house", "white", "detained"], "summary": "WASHINGTON – The Trump Administration reversed itself Sunday on a key element of its executive travel ban from Muslim countries, saying green card holders won’t be prevented from legally returning to the United States.\nAmid raucous protests at airports due to President Trump’s executive order to temporarily restrict travel from seven Muslim countries, White House Chief of Staff Reince Priebus said legal residents won’t be subject to the ban.\nOn CBS’s “Face the Nation,” Priebus added the White House may “expand” the travel ban beyond seven countries, if needed.\nCivil rights activists said over the weekend that legal permanent residents were targeted and detained at the first day of the executive order.\nThe White House, he said, “certainly will never forget the Jewish people that suffered in World War II."}