{"url": "http://nypost.com/2017/03/10/homeland-security-plans-to-feed-detained-immigrants/", "id": "451", "title": "Homeland Security wants to feed detained immigrants tacos", "text": "The Department of Homeland Security is looking to cater to detainees.\n\nThe agency has filed documents soliciting bids from food service companies to whip up meals for illegal immigrants being held at the Customs and Border Patrol area of Brownsville, TX, TMZ reported Friday.\n\nDHS plans to serve up to 600 meals a day for detainees for five years, according to the documents.\n\nMeals, distributed by Customs and Border Patrol, must be “nutritionally balanced,” produce must be washed thoroughly, and employees must pass a strict background check.\n\nBreakfast options include potato and egg in a flour tortilla, ham and egg in a flour tortilla, bean and cheese tacos. Lunch and dinner will include burgers, turkey sandwiches, and chicken fajitas.\n\nDetainees may be eating well, but they may not be breaking bread with their family.\n\nHomeland Security Secretary John Kelly confirmed earlier this week that he may be separating children from their parents who cross illegally from Mexico into the US.", "authors": ["March"], "publish_date": "2017-03-10", "source": "nypost", "top_words": ["wants", "meals", "homeland", "immigrants", "tacos", "security", "patrol", "tortilla", "flour", "egg", "customs", "include", "border", "whip", "feed", "detained"], "summary": "The Department of Homeland Security is looking to cater to detainees.\nThe agency has filed documents soliciting bids from food service companies to whip up meals for illegal immigrants being held at the Customs and Border Patrol area of Brownsville, TX, TMZ reported Friday.\nMeals, distributed by Customs and Border Patrol, must be “nutritionally balanced,” produce must be washed thoroughly, and employees must pass a strict background check.\nBreakfast options include potato and egg in a flour tortilla, ham and egg in a flour tortilla, bean and cheese tacos.\nHomeland Security Secretary John Kelly confirmed earlier this week that he may be separating children from their parents who cross illegally from Mexico into the US."}