{"url": "http://nypost.com/2017/06/27/trump-is-tanking-the-worlds-opinion-of-america/", "id": "430", "title": "Trump is tanking the world’s opinion of America", "text": "The image of the United States has deteriorated sharply across the globe under President Donald Trump and an overwhelming majority of people in other countries have no confidence in his ability to lead, a survey from the Pew Research Center showed.\n\nFive months into Trump’s presidency, the survey spanning 37 nations showed US favorability ratings in the rest of the world slumping to 49 percent from 64 percent at the end of Barack Obama’s eight years in the White House.\n\nBut the falls were far steeper in some of America’s closest allies, including US neighbors Mexico and Canada, and European partners like Germany and Spain.\n\nTrump took office in January pledging to put “America first.” Since then he has pressed ahead with plans to build a wall along the US border with Mexico, announced he will pull out of the Paris climate accord, and accused countries including Canada, Germany and China of unfair trade practices.\n\nOn his first foreign trip as president in early June, Trump received warm welcomes in Saudi Arabia and Israel, but a cool reception from European partners, with whom he clashed over NATO spending, climate and trade.\n\nJust 30 percent of Mexicans now say they have a favorable view of the United States, down from 66 percent at the end of the Obama era. In Canada and Germany, favorability ratings slid by 22 points, to 43 percent and 35 percent, respectively.\n\nIn many European countries, the ratings were comparable to those seen at the end of the presidency of George W. Bush, whose 2003 invasion of Iraq was deeply unpopular.\n\n“The drop in favorability ratings for the United States is widespread,” the Pew report said. “The share of the public with a positive view of the US has plummeted in a diverse set of countries from Latin America, North America, Europe, Asia and Africa.”\n\nThe survey, based on the responses of 40,447 people and conducted between Feb. 16 and May 8 this year, showed even deeper mistrust of Trump himself, with only 22 percent of those surveyed saying they had confidence he would do the right thing in world affairs, compared to 64 percent who trusted Obama.\n\nBoth Russian President Vladimir Putin and Chinese President Xi Jinping, with confidence ratings of 27 percent and 28 percent, respectively, scored higher than Trump. German Chancellor Angela Merkel, with a confidence rating of 42 percent, scored highest among the four leaders in the survey.\n\nThe countries with the lowest confidence in Trump were Mexico at 5 percent and Spain at 7 percent. The only two countries where ratings improved compared to Obama were Russia, where confidence in the US president surged to 53 percent from 11 percent, and Israel, where it rose 7 points to 56 percent.\n\nGlobally, 75 percent of respondents described Trump as “arrogant,” 65 percent as “intolerant” and 62 percent as “dangerous.” A majority of 55 percent also described him as a “strong leader.”\n\nThe survey showed widespread disapproval of Trump’s signature policy proposals, with 76 percent unhappy with his plan to build the wall on the border with Mexico, 72 percent against his withdrawal from major trade agreements and 62 percent opposed to his plans to restrict travel to the US from some majority-Muslim countries.\n\nOn the positive side, the survey showed that 58 percent of respondents had a positive view of Americans in general. And in many regions of the world, a majority or plurality of respondents said they expected relations with the United States to stay roughly the same in spite of Trump.", "authors": ["June"], "publish_date": "2017-06-27", "source": "nypost", "top_words": ["america", "showed", "ratings", "trump", "tanking", "survey", "mexico", "opinion", "united", "countries", "confidence", "states", "president", "worlds"], "summary": "Just 30 percent of Mexicans now say they have a favorable view of the United States, down from 66 percent at the end of the Obama era.\nBoth Russian President Vladimir Putin and Chinese President Xi Jinping, with confidence ratings of 27 percent and 28 percent, respectively, scored higher than Trump.\nThe countries with the lowest confidence in Trump were Mexico at 5 percent and Spain at 7 percent.\nOn the positive side, the survey showed that 58 percent of respondents had a positive view of Americans in general.\nAnd in many regions of the world, a majority or plurality of respondents said they expected relations with the United States to stay roughly the same in spite of Trump."}