{"url": "http://nypost.com/2017/03/21/gorsuch-declines-to-weigh-in-on-trumps-travel-ban/", "id": "48", "title": "Gorsuch declines to weigh in on Trump’s travel ban", "text": "Supreme Court nominee Neil Gorsuch said Tuesday that no one knows how he’d rule on President Trump’s travel ban but noted that the Constitution protects religious freedom.\n\n“We have a free exercise clause that protects the free exercise of religious liberty by all persons in this country,” Gorsuch said during the second day of confirmation hearings before the Senate Judiciary Committee.\n\nSen. Patrick Leahy (D-Vt.) then asked about comments from a Republican lawmaker that Trump’s immigration ban would be safe if Gorsuch, 49, was confirmed.\n\n“Senator, he has no idea how I’d rule in that case and, Senator, I’m not going to say anything here that would give anybody any idea how I’d rule in any case like that that could come before the Supreme Court,” Gorsuch said.\n\n“It would be a violation of the separation of powers and judicial independence if someone sitting at this table in order to get confirmed had to make promises or commitments about how they would rule in a case that’s currently pending and likely to make its way to the Supreme Court,” Gorsuch added.\n\nOn travel ban, Neil Gorsuch says: “I’m not going to say anything here that would give anybody any idea how I’d rule in any case like that.” pic.twitter.com/qUrS6ebfbk — ABC News Politics (@ABCPolitics) March 21, 2017\n\nPushed by Leahy about White House claims that Trump’s orders on immigration were above judicial review because they deal with national security, Gorsuch said, “No man is above the law. No man.” He also shot down suggestions there should be a “religious test” in the United States.\n\n“That would be inappropriate,” Gorsuch said. “It’s against the law.”\n\nTrump’s travel ban, which severely restricts immigration from six Muslim-majority countries, has been blocked by several judges who said it was essentially a Muslim ban.\n\nTrump has called the courts’ action an “overreach” and vowed to take the matter to the Supreme Court.\n\nEarlier at the hearing, Gorsuch, who has been nominated to fill the seat left vacant after Justice Antonin Scalia’s death in February 2016, said he would remain impartial when it comes to Trump.\n\n“That’s a softball, Mr. Chairman,” said Gorsuch, responding to a question from Sen. Chuck Grassley ​​(R-Iowa)​. “I have no difficulty ruling for or against any party, based on what the laws and facts in the particular case require.”\n\nsee also Gorsuch says he'd have no problem ruling against Trump Supreme Court nominee Neil Gorsuch on Tuesday said he could...\n\nG​rassley, the committee chairman, asked if anyone in the Trump administration sought promises on how he’d rule in certain cases in exchange for putting him on a list of nominees to the High Court.\n\n“I don’t believe in litmus tests for judges​,” the federal judge from Colorado said.\n\nGrilled about Roe v. Wade, the 1973 case that legalized abortion, and Bush v. Gore, which gave the 2000 presidential election to George W. Bush, Gorsuch said case law has to be respected.\n\n“​But as a judge, it’s [both cases] a precedent of the United States Supreme Court and it deserves the same respect as other precedents of the United States Supreme Court when you’re coming to it as a judge, and it has to be analyzed under the law of precedents,” he ​said​.\n\nSen. Dianne Feinstein, ​the ranking Democrat on the panel, pressed him further, mentioning that Trump has promised he would nominate someone who would overturn the landmark abortion law.\n\n“Once a case is settled, that adds to the determinacy of the law,” Gorsuch said. “What was once a hotly contested issue is no longer a hotly contested issue. We move forward.”\n\nGorsuch was even more adamant when Sen. Lindsey Graham (R-SC) asked whether Trump had broached the abortion issue.\n\n“No . . . I would have walked out the door,” Gorsuch said. “That’s not what judges do.”\n\nThe confirmation hearings are scheduled to continue through Thursday.", "authors": ["March"], "publish_date": "2017-03-21", "source": "nypost", "top_words": ["travel", "case", "declines", "trump", "ban", "supreme", "court", "united", "trumps", "gorsuch", "rule", "weigh", "law"], "summary": "Supreme Court nominee Neil Gorsuch said Tuesday that no one knows how he’d rule on President Trump’s travel ban but noted that the Constitution protects religious freedom.\nSen. Patrick Leahy (D-Vt.) then asked about comments from a Republican lawmaker that Trump’s immigration ban would be safe if Gorsuch, 49, was confirmed.\n“It’s against the law.”Trump’s travel ban, which severely restricts immigration from six Muslim-majority countries, has been blocked by several judges who said it was essentially a Muslim ban.\nTrump has called the courts’ action an “overreach” and vowed to take the matter to the Supreme Court.\n“Once a case is settled, that adds to the determinacy of the law,” Gorsuch said."}