{"url": "http://nypost.com/2017/02/18/obama-linked-activists-have-a-training-manual-for-protesting-trump/", "id": "423", "title": "Obama-linked activists have a ‘training manual’ for protesting Trump", "text": "An Obama-tied activist group training tens of thousands of agitators to protest President Trump’s policies plans to hit Republican lawmakers supporting those policies even harder this week, when they return home for the congressional recess and hold town hall meetings and other functions.\n\nOrganizing for Action, a group founded by former President Barack Obama and featured prominently on his new post-presidency website, is distributing a training manual to anti-Trump activists that advises them to bully GOP lawmakers into backing off support for repealing ObamaCare, curbing immigration from high-risk Islamic nations and building a border wall.\n\nIn a new Facebook post, OFA calls on activists to mobilize against Republicans from now until Feb. 26, when “representatives are going to be in their home districts.”\n\nThe protesters disrupted town halls earlier this month, including one held in Utah by House Oversight Committee Chairman Jason Chaffetz, who was confronted by hundreds of angry demonstrators claiming to be his constituents.\n\nThe manual, published with OFA partner “Indivisible,” advises protesters to go into halls quietly so as not to raise alarms, and “grab seats at the front of the room but do not all sit together.” Rather, spread out in pairs to make it seem like the whole room opposes the Republican host’s positions. “This will help reinforce the impression of broad consensus.” It also urges them to ask “hostile” questions — while keeping “a firm hold on the mic” — and loudly boo the GOP politician if he isn’t “giving you real answers.”\n\n“Express your concern [to the event’s hosts] they are giving a platform to pro-Trump authoritarianism, racism, and corruption,” it says.\n\nThe goal is to make Republicans, even from safe districts, second-guess their support for the Trump agenda, and to prime “the ground for the 2018 midterms when Democrats retake power.”\n\nThe goal is to make Republicans, even from safe districts, second-guess their support for the Trump agenda.\n\n“Even the safest [Republican] will be deeply alarmed by signs of organized opposition,” the document states, “because these actions create the impression that they’re not connected to their district and not listening to their constituents.”\n\nAfter the event, protesters are advised to feed video footage to local and national media.\n\n“Unfavorable exchanges caught on video can be devastating” for Republican lawmakers, it says, when “shared through social media and picked up by local and national media.” After protesters gave MSNBC, CNN and the networks footage of their dust-up with Chaffetz, for example, the outlets ran them continuously, forcing Chaffetz to issue statements defending himself.\n\nThe manual also advises protesters to flood “Trump-friendly” lawmakers’ Hill offices with angry phone calls and emails demanding the resignation of top White House adviser Steve Bannon.\n\nA script advises callers to complain: “I’m honestly scared that a known racist and anti-Semite will be working just feet from the Oval Office … It is everyone’s business if a man who promoted white supremacy is serving as an adviser to the president.”\n\nThe document provides no evidence to support such accusations.\n\nProtesters, who may or may not be affiliated with OFA, are also storming district offices. Last week, GOP Rep. Dana Rohrabacher blamed a “mob” of anti-Trump activists for knocking unconscious a 71-year-old female staffer at his Southern California office. A video of the incident, showing a small crowd around an opening door, was less conclusive.\n\nSeparately, OFA, which is run by ex-Obama officials and staffers, plans to stage 400 rallies across 42 states this year to attack Trump and Republicans over ObamaCare’s repeal.\n\n“This is a fight we can win,” OFA recently told its foot soldiers. “They’re starting to waver.”\n\nOn Thursday, Trump insisted he’s moving ahead with plans to repeal and replace the Affordable Care Act, which has ballooned health insurance premiums and deductibles. “ObamaCare is a disaster, folks,” he said, adding that activists protesting its repeal are hijacking GOP town halls and other events.\n\n“They fill up our rallies with people that you wonder how they get there,” the president said. “But they’re not the Republican people that our representatives are representing.”\n\nAs The Post reported, OFA boasts more than 250 offices nationwide and more than 32,000 organizers, with another 25,000 actively under training. Since November, it’s beefed up staff and fundraising, though as a “social welfare” nonprofit, it does not have to reveal its donors.\n\nThese aren’t typical Black Lives Matter or Occupy Wall Street marchers, but rather professionally trained organizers who go through a six-week training program similar to the training — steeped in Alinsky agitation tactics — Obama received in Chicago when he was a community organizer.\n\nChicago socialist Saul Alinsky, known by the left as “the father of community organizing,” taught radicals to “rub raw the sores of discontent” and create the conditions for a “revolution.” He dedicated his book, “Rules for Radicals,” to “Lucifer.” Michelle Obama quoted from the book when she helped launch OFA in 2013.\n\nObama appears to be behind the anti-Trump protests. He praised recent demonstrations against Trump’s travel ban. And last year, after Trump’s upset victory, he personally rallied OFA troops to “protect” his legacy in a conference call. “Now is the time for some organizing,” he said. “So don’t mope” over the election results.\n\nHe promised OFA activists he would soon join them in the fray.\n\n“Understand that I’m going to be constrained in what I do with all of you until I am again a private citizen, but that’s not so far off,” he said. “You’re going to see me early next year, and we’re going to be in a position where we can start cooking up all kinds of great stuff.”\n\nAdded the ex-president: “I promise you that next year Michelle and I are going to be right there with you, and the clouds are going to start parting, and we’re going to be busy. I’ve got all kinds of thoughts and ideas about it, but this isn’t the best time to share them.\n\n“Point is, I’m still fired up and ready to go, and I hope that all of you are, as well.”", "authors": ["Paul Sperry", "February"], "publish_date": "2017-02-18", "source": "nypost", "top_words": ["ofa", "training", "republican", "trump", "manual", "activists", "protesting", "obamalinked", "support", "republicans", "going", "lawmakers", "protesters"], "summary": "The manual also advises protesters to flood “Trump-friendly” lawmakers’ Hill offices with angry phone calls and emails demanding the resignation of top White House adviser Steve Bannon.\nLast week, GOP Rep. Dana Rohrabacher blamed a “mob” of anti-Trump activists for knocking unconscious a 71-year-old female staffer at his Southern California office.\n“ObamaCare is a disaster, folks,” he said, adding that activists protesting its repeal are hijacking GOP town halls and other events.\nHe promised OFA activists he would soon join them in the fray.\n“Point is, I’m still fired up and ready to go, and I hope that all of you are, as well.”"}