{"url": "http://nypost.com/2017/07/13/iranian-doctor-denied-us-entry-was-iranian-militia-fighter/", "id": "422", "title": "Iranian doctor denied US entry was militia fighter", "text": "An Iranian cancer researcher who was denied entry to the US this week in the wake of President Trump’s revised travel ban previously led a branch of a paramilitary volunteer militia, according to a Thursday report on Iranian state TV.\n\nsee also Iranian cancer researcher detained under travel ban An Iranian cancer researcher coming to the US to help...\n\nMohsen Dehnavi was detained, along with his wife and three young children, after landing at Boston’s Logan Airport on Monday, disrupting his plans to work as a scholar at Boston Children’s Hospital.\n\nThe US Customs and Border Patrol has said Dehnavi and his family’s detention was for “reasons unrelated” to Trump’s revised executive order banning migrants from six Muslim-majority countries,\n\nincluding Iran, from entering the US.\n\nDuring the report on Iranian state TV showing Dehnavi, his wife, and children, ages 6, 3 and 7 months, arriving back in Tehran, the footage featured an old report by the Fars News Agency on Dehnavi being named the head of the student branch of the Basij at Iran’s Sharif University in September 2007.\n\nThe Basij, Iran’s notorious volunteer military force, is linked to Iran’s Revolutionary Guard.\n\nIn 2013, Dehnavi served on the unsuccessful presidential campaign of ex-Iran nuclear chief negotiator, Saeed Jalili, according to The Associated Press.\n\nDehnavi, who holds a J-1 visa designated for researchers and other academics partaking in visiting scholar programs, said on his arrival in Tehran that he was detained for up to 30 hours in Boston.\n\n“The topic of our research was health and saving ill people fighting cancer from this dangerous disease, but they didn’t allow us entry, despite, as I mentioned, all the efforts made by the American academic community,” he said.\n\nSourena Sattari, Iran’s vice president for science and technology, said Dehnavi and his family were denied US entry under “under unconventional pretexts.”\n\nBoston Children’s Hospital spokesman Rob Graham told The Post that Dehnavi never previously worked for the hospital and that he was due to come to the facility as a visiting scholar.\n\n“His visa had been approved by the State Department prior to travel,” Graham said.\n\nWith Post wires", "authors": ["Associated Press", "July"], "publish_date": "2017-07-13", "source": "nypost", "top_words": ["doctor", "travel", "fighter", "militia", "state", "denied", "researcher", "report", "cancer", "iranian", "entry", "irans", "detained", "dehnavi"], "summary": "An Iranian cancer researcher who was denied entry to the US this week in the wake of President Trump’s revised travel ban previously led a branch of a paramilitary volunteer militia, according to a Thursday report on Iranian state TV.\nsee also Iranian cancer researcher detained under travel ban An Iranian cancer researcher coming to the US to help...Mohsen Dehnavi was detained, along with his wife and three young children, after landing at Boston’s Logan Airport on Monday, disrupting his plans to work as a scholar at Boston Children’s Hospital.\nThe Basij, Iran’s notorious volunteer military force, is linked to Iran’s Revolutionary Guard.\nIn 2013, Dehnavi served on the unsuccessful presidential campaign of ex-Iran nuclear chief negotiator, Saeed Jalili, according to The Associated Press.\n“His visa had been approved by the State Department prior to travel,” Graham said."}