{"url": "http://nypost.com/2017/01/31/doubting-democrats-newfound-passion-on-refugees/", "id": "433", "title": "Doubting Democrats’ newfound ‘passion’ on refugees", "text": "There’s a new Chuck Schumer in town — one who no longer talks optimistically about working with President Trump.\n\nNo, Schumer is now tearing up in public over Trump’s executive order on immigration — just like the Statue of Liberty, he says — and vowing to oppose all of Trump’s remaining Cabinet choices.\n\nOn Tuesday, he even cast one of just six votes against confirming Elaine Chao, wife of Majority Leader Mitch McConnell, to run the Department of Transportation.\n\nClearly, Schumer has heard the furor of the Democrats’ hard-left base, which was horrified by his early conciliatory tones as Senate minority leader. He’s suffered regular pickets outside his home and a barrage of denunciation on social media demanding he not only join but lead the “resistance.”\n\nsee also Trump mocks Schumer for crying over travel ban President Trump mocked Senate Democratic leader Chuck Schumer on Monday...\n\nAnd so New York’s senior senator caved.\n\nYet Schumer was a lot more . . . nuanced on these issues not so long ago. In 2015, he infuriated many of his Democratic colleagues by declaring that “a pause may be necessary” in admitting Syrian refugees. No tears from Miss Liberty back then.\n\nYes, Schumer reversed course two days later, saying a government briefing had convinced him no pause was needed. But he was hardly the only doubter.\n\nIndeed, several of the Democrats now denouncing Trump’s order were also leery of letting Syrian refugees in.\n\nLike Sen. Dianne Feinstein (D-Calif.), who hailed (now ex-) acting Attorney General Sally Yates for ordering Justice Department lawyers not to defend Trump’s order in court. Back in 2015, DiFi was warning that “we need to be very careful about Syrian refugee admissions.”\n\nOr Sen. Maggie Hassan (D-NH), who called Trump’s order “counter to our American values.” Funny: In 2015, as governor, she banned Syrian refugees from settling in her state.\n\nWe won’t go so far as to suggest, as Trump did, that Chuck Schumer’s tears were “fake.” But it’s certainly fair to ask how much of Democrats’ newfound passion is just posing.", "authors": ["Post Editorial Board", "January"], "publish_date": "2017-01-31", "source": "nypost", "top_words": ["syrian", "trump", "passion", "democrats", "newfound", "order", "doubting", "chuck", "trumps", "leader", "refugees", "2015", "schumer"], "summary": "There’s a new Chuck Schumer in town — one who no longer talks optimistically about working with President Trump.\nIn 2015, he infuriated many of his Democratic colleagues by declaring that “a pause may be necessary” in admitting Syrian refugees.\nIndeed, several of the Democrats now denouncing Trump’s order were also leery of letting Syrian refugees in.\nLike Sen. Dianne Feinstein (D-Calif.), who hailed (now ex-) acting Attorney General Sally Yates for ordering Justice Department lawyers not to defend Trump’s order in court.\nWe won’t go so far as to suggest, as Trump did, that Chuck Schumer’s tears were “fake.” But it’s certainly fair to ask how much of Democrats’ newfound passion is just posing."}