{"url": "http://nypost.com/2017/01/29/schumer-vows-to-fight-trumps-immigration-order/", "id": "403", "title": "Schumer vows to fight Trump’s immigration order", "text": "Senate Minority Leader Chuck Schumer vowed Sunday to challenge President Trump’s executive order banning citizens from seven majority-Muslim countries from entering America in a bid to keep out terrorists.\n\nSchumer (D-N.Y.) called Trump’s action “misguided” and “bad for national security,” and said Democrats would seek to reverse it in Congress.\n\n“If we get a few more Republicans, I think we might be able to pass legislation to overturn it,” Schumer told a news conference at his Midtown Manhattan office.\n\n“It will be up to getting more Republicans.”\n\nSchumer also said he spoke earlier with Homeland Security Secretary John Kelly, who assured him that 42 Americans being detained across the country — including six at JFK International Airport in Queens — “will be processed” and released from custody.\n\nHe called that “one little bit of small good news amidst all of this.”\n\nBrooklyn federal Judge Ann Donnelly on Saturday night issued a temporary stay that prevents the government from deporting anyone blocked from entering the country under terms of Trump’s Friday order.\n\nTrump’s order bars admission of citizens from seven majority-Muslim “countries of concern” for at least 90 days, with people from Syrian banned indefinitely.\n\n“Deteriorating conditions in certain countries due to war, strife, disaster, and civil unrest increase the likelihood that terrorists will use any means possible to enter the United States,” the order says.", "authors": ["January"], "publish_date": "2017-01-29", "source": "nypost", "top_words": ["seven", "citizens", "fight", "immigration", "security", "entering", "trumps", "countries", "country", "majoritymuslim", "order", "vows", "schumer"], "summary": "Senate Minority Leader Chuck Schumer vowed Sunday to challenge President Trump’s executive order banning citizens from seven majority-Muslim countries from entering America in a bid to keep out terrorists.\nSchumer (D-N.Y.) called Trump’s action “misguided” and “bad for national security,” and said Democrats would seek to reverse it in Congress.\n“If we get a few more Republicans, I think we might be able to pass legislation to overturn it,” Schumer told a news conference at his Midtown Manhattan office.\nTrump’s order bars admission of citizens from seven majority-Muslim “countries of concern” for at least 90 days, with people from Syrian banned indefinitely.\n“Deteriorating conditions in certain countries due to war, strife, disaster, and civil unrest increase the likelihood that terrorists will use any means possible to enter the United States,” the order says."}