{"url": "http://nypost.com/2017/03/06/trump-signs-revised-immigration-ban/", "id": "58", "title": "Trump signs revised immigration ban", "text": "WASHINGTON — President Trump on Monday signed a new executive order that removes Iraq from the list of countries targeted by his earlier travel ban, while allowing all current visa holders to enter the US.\n\n“It is the president’s solemn duty to protect the American people and with this order President Trump is exercising his rightful authority to keep our people safe,” Secretary of State Rex Tillerson said in announcing the revised ban.\n\n“As threats continue to evolve and change, common sense [dictates] that we continually re-evaluate and reassess the systems we rely upon to protect our country.”\n\nAttorney General Jeff Sessions said the order gives the US the ability to control who crosses its borders and to keep out those who wish to do harm.\n\n“This executive order protects the American people — as well as lawful permanent residents — by putting in place an enhanced screening and vetting process for visitors from six nations,” Sessions said.\n\nThe revised order also ends an indefinite ban on Syrian refugees and instead treats them like all other refugees.\n\nThe new order is scheduled to take effect March 16.\n\nThe delayed start date is an attempt to avoid a repeat of the mass confusion that occurred at airports across the world when the first order was put in place without warning.\n\nIraq welcomed the change in its status, saying it sent a “positive message” when Washington and Baghdad are working together against the Islamic State.\n\nThousands of Iraqis have fought alongside US troops for years or worked as translators since the US-led invasion in 2003.\n\nMany have resettled here after being threatened for working with American troops. And US-backed Iraqi troops are involved in trying to root out Islamic State militants in Mosul.\n\nTillerson said the State Department reviewed the original executive order with Iraq in mind.\n\n“Iraq is an important ally in the fight to defeat ISIS with their brave soldiers fighting in close coordination with America’s men and women in uniform,” he said.\n\nMore than two dozen lawsuits were filed in federal courts against the original ban, and Washington state succeeded in having it suspended by the 9th Circuit Court of Appeals by arguing it violated constitutional protections against religious discrimination.\n\nSessions reaffirmed that the Department of Justice stands behind the legality of the revamped executive order and Trump’s ability to authorize it.\n\n“This Department of Justice will defend and enforce lawful orders of the president consistent with core principles of our Constitution,” he said.\n\n“The executive is empowered under the Constitution and by Congress to make national security judgments and to enforce our immigration policies in order to safeguard the American public.”\n\nThe original executive order, signed Jan. 27, covered seven countries: Sudan, Syria, Iran, Libya, Somalia, Yemen and Iraq.\n\nSessions said the new order will enhance the screening and vetting processes for visitors from the six remaining nations.\n\n“Three of these nations are state sponsors of terrorism. The other three have served as safe havens for terrorists — countries where the government has lost control of territory to terrorist groups like ISIL or al Qaeda and its affiliates,” Sessions said. “This increases the risk that people admitted here from these countries may belong to terrorist groups, or may have been radicalized by them.”\n\nHe said those countries are unwilling or unable to help vet visitors coming to the US, compromising “our nation’s security.”\n\n“This executive order provides a needed pause, so we can carefully review how we scrutinize people coming here from these countries of concern,” he said.\n\nThe revised order will not apply to people who had a valid visa as 5 p.m. Jan. 27, 2017, around the time the first travel ban was signed by Trump.\n\nThe new order launches a 90-day period for the Department of Homeland Security to define a new series of requirements for countries to have full participation in US entry programs.\n\nFor countries that do not comply, the State Department, DHS and intelligence agencies can make recommendations on what, if any, restrictions should be imposed.\n\nThe new order spells out detailed categories of people eligible to enter the United States, such as for business or medical travel, or people with family connections or who support the US.\n\nTwo other major changes from the initial immigration order: The new order will no longer give preference to individuals from a “minority religion,” such as Christianity. That distinction gave more fodder to critics who said the initial order was targeting Muslims.\n\nSenate Democratic leader Chuck Schumer repeated those criticisms Monday, saying the new order does nothing for national security.\n\n“A watered-down ban is still a ban. Despite the administration’s changes, this dangerous executive order makes us less safe, not more. It is mean-spirited, and un-American. It must be repealed,” Schumer said in a statement.\n\nNow, all refugee visas from all countries will be suspended for 120 days. When the program resumes, the order caps refugee admissions to the US at 50,000 for the 2017 fiscal year, down from 110,000 in 2016.\n\nHomeland Security chief John Kelly stressed that the ban is being implemented to bolster national security.\n\n“It is important to note that nothing in this executive order affects current lawful permanent residents or persons with current authorization to enter our country,” he said. “If you have a current valid visa to travel, we welcome you. But unregulated, unvetted travel is not a universal privilege, especially when national security is at stake.”\n\nIn addition to 1,000 ongoing investigations into terrorists by the FBI, officials said the FBI is examining for “potential terrorism-related activity” 300 individuals who were admitted to the US as refugees.\n\nThe Justice Department declined to offer details on how many refugees were from the six targeted countries or how many of the individuals are current refugees or green card holders.", "authors": ["March"], "publish_date": "2017-03-06", "source": "nypost", "top_words": ["executive", "travel", "current", "trump", "revised", "ban", "national", "immigration", "state", "security", "order", "countries", "signs", "department"], "summary": "The revised order also ends an indefinite ban on Syrian refugees and instead treats them like all other refugees.\nTillerson said the State Department reviewed the original executive order with Iraq in mind.\nThe revised order will not apply to people who had a valid visa as 5 p.m. Jan. 27, 2017, around the time the first travel ban was signed by Trump.\nDespite the administration’s changes, this dangerous executive order makes us less safe, not more.\nHomeland Security chief John Kelly stressed that the ban is being implemented to bolster national security."}