{"url": "http://nypost.com/2017/02/08/isis-fighters-call-trumps-travel-order-a-blessed-ban/", "id": "73", "title": "ISIS fighters call Trump’s travel order a ‘blessed ban’", "text": "ISIS fighters are reportedly hailing President Trump’s executive order on immigration as “the Blessed Ban” — saying it proves to their followers that America really does “hate” Islam.\n\nA resident in the Iraqi city of Mosul, which is still considered an Islamic State stronghold, told New York Times terror correspondent Rukmini Callimachi that the jihadists have been openly celebrating the ban ever since Trump singed it into effect on Jan. 27.\n\n“They’ve even coined a phrase for it,” she tweeted Wednesday. “‘The Blessed Ban.'”\n\nIraq is one of the seven predominantly Muslim countries — along with Iran, Libya, Somalia, Sudan, Syria and Yemen — from which refugees and citizens are temporarily barred from entering.\n\nCallimachi claimed residents in Mosul had been up in arms about Trump’s executive order, while the Islamic State was praising it.\n\n“Everywhere I go, Iraqis want to ask about the visa ban,” she said. “But here’s the best part. Guess who else is talking about it? ISIS is.”\n\nDescribing why the extremists were calling the order the “Blessed Ban,” Callimachi said her source told her it was because “ISIS sees this as their doing.”\n\n“They succeeded in scaring the daylight out of America,” she explained. “ISIS, according to this resident of Western Mosul, thinks their terror tactic worked. They frightened the most powerful man in the world…And they are celebrating, he says, because it proves to their followers that America really does ‘hate’ Islam.”\n\nWhile the terror group has remained quit on social media since Trump’s travel ban was implemented, experts have said that they are likely in favor of the ban because it will ultimately drive their message home to recruits.\n\n“The [ISIS] chatrooms have been abuzz about how this shows that there is a clash of civilizations, that Muslims are not welcome in America,” terrorism expert Mia Bloom, of Georgia State University, told Business Insider.", "authors": ["February"], "publish_date": "2017-02-08", "source": "nypost", "top_words": ["america", "travel", "isis", "ban", "state", "told", "mosul", "fighters", "trumps", "order", "terror", "blessed"], "summary": "ISIS fighters are reportedly hailing President Trump’s executive order on immigration as “the Blessed Ban” — saying it proves to their followers that America really does “hate” Islam.\n“‘The Blessed Ban.\nCallimachi claimed residents in Mosul had been up in arms about Trump’s executive order, while the Islamic State was praising it.\nISIS is.”Describing why the extremists were calling the order the “Blessed Ban,” Callimachi said her source told her it was because “ISIS sees this as their doing.”“They succeeded in scaring the daylight out of America,” she explained.\n“ISIS, according to this resident of Western Mosul, thinks their terror tactic worked."}