{"url": "http://nypost.com/2017/03/06/its-not-trumps-travel-bans-that-are-critical-but-what-comes-next/", "id": "77", "title": "It’s not Trump’s travel bans that are critical – but what comes next", "text": "President Trump’s revisions to his travel and immigration bans didn’t stop Democrats from ripping them just as fiercely as they did the earlier ones.\n\nYet all the arguing misses a key point: Trump’s restrictions are temporary: The bans last 90 days for travelers from six specific countries, and 120 days for refugees.\n\nWhich makes the Dems’ fury seems a bit overblown. But it also raises a key question: What happens after the bans expire?\n\nAlas, it’s far from clear the White House has made much (if any) progress crafting a permanent policy for “extreme vetting” of refugees and immigrants from risky nations. And it’s been 38 days since the first order was issued (42 percent of the way through the original 90-day period).\n\nWhen The Post asked the White House about progress Monday, a spokesman said only, “When we have an announcement to make on that front, we will let you know.”\n\nIt’s not terribly reassuring. Remember, the order isn’t supposed to be an end in itself but only a way to provide time to improve the vetting process.\n\nTrue, under the new order, Homeland Security will have 20 days to do a “country-by-country review of the identity and security information that each country provides” in support of visa and applications. Those found lacking get another 50 days to improve the quality of their data.\n\nThe new order also addresses legal challenges that derailed the initial bans: It phases in over two weeks instead of taking effect immediately and won’t affect green-card holders or those with valid visas as of Jan. 27. And it removes Iraq from the list of affected countries after officials said they’re satisfied with Baghdad’s screening.\n\nStill, as Secretary of State Rex Tillerson says, the point is to permanently eliminate “vulnerabilities” that terrorists can exploit.\n\nLet’s hope Trump & Co. are working on a plan for that.", "authors": ["Post Editorial Board", "March"], "publish_date": "2017-03-06", "source": "nypost", "top_words": ["travel", "days", "vetting", "security", "point", "order", "trumps", "progress", "bans", "white", "critical", "comes", "way"], "summary": "President Trump’s revisions to his travel and immigration bans didn’t stop Democrats from ripping them just as fiercely as they did the earlier ones.\nYet all the arguing misses a key point: Trump’s restrictions are temporary: The bans last 90 days for travelers from six specific countries, and 120 days for refugees.\nBut it also raises a key question: What happens after the bans expire?\nAnd it’s been 38 days since the first order was issued (42 percent of the way through the original 90-day period).\nStill, as Secretary of State Rex Tillerson says, the point is to permanently eliminate “vulnerabilities” that terrorists can exploit."}