{"url": "http://nypost.com/2017/09/25/supreme-court-cancels-arguments-over-trumps-travel-ban/", "id": "7", "title": "Supreme Court cancels arguments over Trump’s travel ban", "text": "The Supreme Court on Monday canceled arguments set for Oct. 10 in the dispute over President Trump’s travel ban after he announced a revised policy Sunday.\n\nThe unsigned order from the justices Monday asked the administration and plaintiffs who sued the president to weigh in by Oct. 5 about what to do with the case.\n\nThe court had been ready to hear argument about the legality of a 90-day ban on travelers from six mostly Muslim countries and a 120-day ban on refugees from around the world.\n\nThe ban expired Sunday and was replaced by a new policy that affects eight counties and has no expiration date.\n\nThe countries are Chad, Iran, Libya, North Korea, Somalia, Syria, Venezuela and Yemen. Chad, North Korea and Venezuela were not covered by the earlier ban.\n\nChad’s government said it learned “with astonishment” of the decision by the US that its country was on a list whose nationals will be banned from entering the US.\n\nThe government expressed incomprehension about the “official reasons for this decision; which contrasts with Chad’s constant efforts and commitments in the fight against terrorism at regional and global levels.”\n\nChad’s government called for a better appreciation of the situation and for Trump to reconsider the decision.\n\nChad is the headquarters for a multinational force set up to fight Nigeria-based Boko Haram Islamic extremists.\n\nVenezuelan President Nicolas Maduro said the administration’s decision to include Venezuelan officials on a travel ban is a form of “political and psychological terrorism.”\n\nHis foreign ministry issued a statement Monday saying that the travel restrictions violate the values of the United Nations charter and international law and are part of a continuing effort by the US to oust Maduro from power.\n\nThe ministry said it is considering “all necessary measures” to defend Venezuela’s sovereignty and national interest.", "authors": ["September"], "publish_date": "2017-09-25", "source": "nypost", "top_words": ["cancels", "travel", "ban", "supreme", "policy", "venezuela", "oct", "ministry", "court", "president", "trumps", "north", "arguments", "set", "decision"], "summary": "The Supreme Court on Monday canceled arguments set for Oct. 10 in the dispute over President Trump’s travel ban after he announced a revised policy Sunday.\nThe court had been ready to hear argument about the legality of a 90-day ban on travelers from six mostly Muslim countries and a 120-day ban on refugees from around the world.\nThe ban expired Sunday and was replaced by a new policy that affects eight counties and has no expiration date.\nChad, North Korea and Venezuela were not covered by the earlier ban.\nThe ministry said it is considering “all necessary measures” to defend Venezuela’s sovereignty and national interest."}