{"url": "http://nypost.com/2017/07/06/federal-judge-denies-hawaiis-motion-on-trump-travel-ban/", "id": "8", "title": "Federal judge denies Hawaii’s motion on Trump travel ban", "text": "A federal judge on Thursday denied a motion filed by the state of Hawaii to exempt grandparents and other extended family members from President Trump’s controversial travel ban on six Muslim-majority countries.\n\nsee also Hawaii throws wrench in Trump's revised travel ban The state of Hawaii tried to throw a monkey-wrench into...\n\nU.S. District Judge Derrick Watson in Honolulu rejected the emergency motion, which asked him to clarify what constitutes a “bona fide” relationship as described by the Supreme Court in its ruling last month.\n\nThe Supreme Court gave the Trump administration the green light to enforce most aspects of the travel ban, but said people “with a credible claim of a bona fide relationship with a person or entity in the United States” could still enter the US.\n\nIn his order, Watson said it should be up to the Supreme Court to clarify the ruling.\n\n“This court will not upset the Supreme Court’s careful balancing and ‘equitable judgment,'” he wrote.\n\nThe six affected countries include Iran, Syria, Libya, Somalia, Sudan and Yemen. Currently, the travel ban bars grandparents, grandchildren, aunts, uncles and other extended relatives from entering the US for 90 days.\n\nWith Post Wires", "authors": ["July"], "publish_date": "2017-07-06", "source": "nypost", "top_words": ["travel", "denies", "hawaii", "trump", "relationship", "ban", "supreme", "state", "judge", "hawaiis", "court", "trumps", "federal", "watson", "motion"], "summary": "A federal judge on Thursday denied a motion filed by the state of Hawaii to exempt grandparents and other extended family members from President Trump’s controversial travel ban on six Muslim-majority countries.\nThe Supreme Court gave the Trump administration the green light to enforce most aspects of the travel ban, but said people “with a credible claim of a bona fide relationship with a person or entity in the United States” could still enter the US.\nIn his order, Watson said it should be up to the Supreme Court to clarify the ruling.\n“This court will not upset the Supreme Court’s careful balancing and ‘equitable judgment,'” he wrote.\nCurrently, the travel ban bars grandparents, grandchildren, aunts, uncles and other extended relatives from entering the US for 90 days."}