{"url": "http://nypost.com/2017/02/13/trump-will-appeal-court-ruling-suspending-immigration-ban/", "id": "86", "title": "Trump appealing 9th Circuit Court ruling on his immigration ban", "text": "President Trump plans to allow the legal process to play out after a federal appeals court halted his travel ban, according to legal papers filed by the Department of Justice on Monday.\n\nThe Ninth Circuit Court of Appeals last Thursday continued a stay on Trump’s executive order that banned travel from seven countries: Iran, Iraq, Syria, Libya, Sudan, Somalia and Yemen.\n\nTrump’s lawyers disclosed Monday that they will follow a suggestion by one of the circuit’s judges for an “en banc” hearing — allowing 11 of the 25 active judges on the Ninth Circuit Court to vote on whether the court should reconsider its decision.\n\nOnly three of the Ninth Circuit judges heard the case and all ruled against the administration.\n\nThe judge who made the “en banc” request wasn’t identified in court papers, but news reports identified Chief Judge Sidney Thomas, an appointee of former President Bill Clinton, as the one making the suggestion.\n\n“Further proceedings in the Ninth Circuit will likely inform what additional proceedings on a preliminary injunction motion are necessary in district court,” the Department of Justice wrote in papers filed Monday in federal court in Seattle.\n\n“Accordingly, at this time, defendants believe the appropriate course is to postpone any further proceedings in the district court.”\n\nThe Seattle court is where Judge James Robart on Feb. 3 issued a temporary halt to the immigration order. Government lawyers then appealed Robart’s ruling to the Ninth Circuit.\n\nLawyers for Washington and Minnesota who sued over Trump’s order in Seattle also filed legal papers Monday asking for the case to continue so the court can decide on the constitutionality of the travel ban.", "authors": ["February"], "publish_date": "2017-02-13", "source": "nypost", "top_words": ["ruling", "ninth", "travel", "judges", "trump", "ban", "circuit", "immigration", "appealing", "papers", "judge", "court", "9th", "order", "proceedings", "legal"], "summary": "President Trump plans to allow the legal process to play out after a federal appeals court halted his travel ban, according to legal papers filed by the Department of Justice on Monday.\nThe Ninth Circuit Court of Appeals last Thursday continued a stay on Trump’s executive order that banned travel from seven countries: Iran, Iraq, Syria, Libya, Sudan, Somalia and Yemen.\nTrump’s lawyers disclosed Monday that they will follow a suggestion by one of the circuit’s judges for an “en banc” hearing — allowing 11 of the 25 active judges on the Ninth Circuit Court to vote on whether the court should reconsider its decision.\nOnly three of the Ninth Circuit judges heard the case and all ruled against the administration.\nGovernment lawyers then appealed Robart’s ruling to the Ninth Circuit."}