{"url": "http://nypost.com/2017/02/20/a-travel-ban-is-too-harsh-but-dems-need-to-think-of-an-alternative/", "id": "83", "title": "A travel ban is too harsh — but Dems need to think of an alternative", "text": "Immigration.\n\nJust starting a column with that word sets people off nowadays. And that’s why I did it. But whom am I about to set off?\n\nEveryone — a little bit. But Democrats are the ones who might want to pay special attention.\n\nFirst off, immigration has served America well. The “melting pot” has made ours the world’s greatest country.\n\nThere are practical issues supporting a pro-immigration stance.\n\nNewcomers to this country have always filled many jobs that second- and third-generation folks don’t want. Think about who cuts your lawn, picks your food on the farm or washes your car and you can’t be against immigration.\n\nA more significant issue is America’s finances.\n\nThis country will need to increase its workforce if it is to fix some of its major money problems. Social Security, for instance, will fail over the next few decades if the US doesn’t add significantly to the number of workers who are paying into that retirement system.\n\nAnd Americans just aren’t producing enough babies to do the job. Immigration will have to fill the gap.\n\nNobody should be against welcoming good immigrants — those who contribute to this country, who work hard, pay their own way and help us move forward. The next great mind or the next best job creator might still be waiting to come to America.\n\nAnd, it goes without saying, we only want people who are here legally.\n\nBut the opposite is also true — nobody should be in favor of welcoming bad immigrants to this country.\n\nBy “bad” I mean people who want to hurt Americans and our country. Nobody — Democrat or Republican — would intentionally allow people who want to spread pain or terror into our country. So who can argue that all immigrants — Muslim or not — shouldn’t be extremely vetted.\n\nPresident Trump recently banned immigration from seven majority-Muslim countries. Trump also started deporting people who are in this country illegally, even though many have been in America for many years.\n\nAnd, of course, Trump has stood fast on his stance that a wall needs to be built between the US and Mexico.\n\nSupport for these moves seems pretty strong among the president’s backers.\n\nBut protests have erupted mainly on the two coasts, where Democrats are heavily in the majority.\n\nI doubt Trump did this on purpose, but his hard-line stance on immigration — too hard, in my opinion — has created an incredible predicament for the Democrats.\n\nWhy? Because the party’s tizzy, while playing well in New York and the West Coast, is merely the Dems “preaching to the choir” — telling supporters what they want to hear.\n\nBut by sounding like they are against a temporary travel ban and not for a review of the already careful vetting of immigrants, Democrats will fail to expand their base.\n\nIf they hadn’t noticed, they lost the last election. Are they really going to change the hearts and minds of the tens of thousands of voters in the three surprisingly red states by being against vetting immigrants?\n\nIf the Democrats keep it up, they risk losing more seats in Congress — or worse.", "authors": ["John Crudele", "February"], "publish_date": "2017-02-20", "source": "nypost", "top_words": ["travel", "trump", "ban", "dems", "immigration", "immigrants", "democrats", "vetting", "job", "think", "alternative", "stance", "need", "country", "harsh", "pay", "welcoming"], "summary": "Think about who cuts your lawn, picks your food on the farm or washes your car and you can’t be against immigration.\nThis country will need to increase its workforce if it is to fix some of its major money problems.\nBut the opposite is also true — nobody should be in favor of welcoming bad immigrants to this country.\nBut by sounding like they are against a temporary travel ban and not for a review of the already careful vetting of immigrants, Democrats will fail to expand their base.\nAre they really going to change the hearts and minds of the tens of thousands of voters in the three surprisingly red states by being against vetting immigrants?"}