{"url": "http://nypost.com/2017/05/26/us-slashes-number-of-visas-issued-to-visitors-from-travel-ban-countries/", "id": "92", "title": "US slashes visas issued to visitors from travel-ban countries", "text": "The Trump administration in April gave out about half the number of visas to visitors from countries included in the president’s temporary travel ban as it did in a typical month last year.\n\nThat trend was also evident in March, when citizens of the seven countries under the first ban — Sudan, Iran, Iraq, Libya, Somalia, Yemen and Syria — received about 40 percent fewer visas than the monthly average last year, State Department data shows.\n\nOverall, the number of US non-immigrant visas issued in April was down by about 15 percent compared to last year.\n\nThe data released by the State Department didn’t include the number of visa applications, so it’s unclear if the decline is due to fewer applicants or more visa rejections.\n\nTrump signed an executive order on Jan. 27 preventing people from the seven Muslim-majority countries from coming to the US for 90 days — but the ban was blocked by the courts.\n\nA revised order was then issued, dropping Iraq from the list of countries.\n\nBut courts have blocked parts of the second order as well.\n\nImmigration lawyer Stephen Pattison told Politico he believes Trump’s policies have had a “chilling effect” on travel from Muslim countries.\n\n“Some people may have canceled trips,” Pattison said. “Some people may have traveled last year but not this year. But I think it would be naive to assume that what’s going on in Washington isn’t having an effect on consular adjudications.”\n\nWith Post wires", "authors": ["May"], "publish_date": "2017-05-26", "source": "nypost", "top_words": ["seven", "travel", "visitors", "ban", "visas", "travelban", "state", "slashes", "issued", "countries", "number", "order", "pattison", "visa"], "summary": "The Trump administration in April gave out about half the number of visas to visitors from countries included in the president’s temporary travel ban as it did in a typical month last year.\nThat trend was also evident in March, when citizens of the seven countries under the first ban — Sudan, Iran, Iraq, Libya, Somalia, Yemen and Syria — received about 40 percent fewer visas than the monthly average last year, State Department data shows.\nOverall, the number of US non-immigrant visas issued in April was down by about 15 percent compared to last year.\nA revised order was then issued, dropping Iraq from the list of countries.\nImmigration lawyer Stephen Pattison told Politico he believes Trump’s policies have had a “chilling effect” on travel from Muslim countries."}