{"url": "https://www.washingtonpost.com/news/worldviews/wp/2017/09/25/why-did-the-u-s-travel-ban-add-counterterrorism-partner-chad-no-one-seems-quite-sure/", "id": "142", "title": "Why did the new travel ban add Chad? No one seems quite sure.", "text": "President Trump added North Korea, Chad and Venezuela to his administration's existing travel ban. (The Washington Post)\n\nNAIROBI — For years, the United States and its European allies have praised the central African nation of Chad as a helpful partner in the fight against terrorism.\n\nBut on Sunday — shocking both Chadians and regional analysts — the Trump administration announced that Chad's citizens would be included in the newest American travel ban. In a statement, the U.S. government cited the presence of terrorist groups in the country and said Chad “does not adequately share public safety and terrorism related information.”\n\nIndeed, Chad does face a number of terrorist threats, most notably from Boko Haram along its western border with Nigeria. But many other countries in the region are not included in the U.S. travel restrictions, including Nigeria, Mali and Niger are considered far more vulnerable to terrorism.\n\n“The reaction has been astonishment and then indignation,” said Nour Ibedou, director of the Chadian Human Rights Association. “We do not understand how our country achieved this lack of trust from the United States.”\n\nA statement from Chad's government asked Trump to reconsider a decision that “seriously undermines the image of Chad and the good relations between the two countries.”\n\n“The Chadian Government expresses its incomprehension in the face of the official reasons behind this decision,” the statement added, “reasons that contrast with the efforts and the ongoing commitments of Chad in the fight against terrorism.”\n\nUnder the new U.S. order, North Korea also was added, as well as more targeted restrictions on Venezuela’s leaders and their families. Citizens from Somalia, Libya, Yemen and Syria remained on the list.\n\nAccording to the Institute for Security Studies, Boko Haram waged more than 120 attacks in Nigeria last year, but only four in Chad. In its statement, the White House said al-Qaeda in the Islamic Maghreb (AQIM) was also active “within Chad or in the surrounding region.” But AQIM has a much more substantial presence in Mali, where militants frequently attack United Nations peacekeepers.\n\n“We don’t have any significant indications of other violent extremist activity [aside from Boko Haram], so in that respect, this is completely baffling,” said Richard Moncrieff, central Africa director at the International Crisis Group.\n\nPerhaps even more mystifying, Chad has proved to be one of the United States’ most willing counterterrorism partners in the region. In March, about 2,000 U.S. troops staged a military exercise in Chad aimed at bolstering regional security forces. In recent years, Air Force personnel have used the country as a staging ground for Boko Haram surveillance missions.\n\n“Our nations are working together to build a better future, not just in Chad, but across the entire region,” Ambassador Alexander M. Laskaris, the deputy to the commander for civil-military engagement at the U.S. Africa Command, said during a visit last year.\n\nChad’s capital, Ndjamena, is also used as the headquarters for France’s 4,000-person regional counterterrorism mission, called Operation Barkhane. Chad’s own military has intervened across borders, in the Central African Republic, Mali and Nigeria. In 2013, forces reportedly killed an al-Qaeda commander in Mali. In 2014 and 2015, during major battles against Boko Haram, Chadian troops were considered by many to be more effective than Nigerian soldiers, even though Chad is a much poorer nation.\n\n“The E.U., France and the U.S. in particular today consider Déby as their principal partner in the fight against terrorism in the Sahel,” wrote Moncrieff of Chad's president, Idriss Déby, earlier this month.\n\nSo why Chad's sudden inclusion in the travel ban?\n\nFor now, that's largely a mystery, particularly to Chadians. But the decision seems to hinge on problems with information sharing, according to the U.S. statement. Administration officials said they removed neighboring Sudan from the list of banned countries because cooperation had improved in recent months.\n\nIt is also unclear whether Chad has the administrative capacity to share information about visa applicants, or whether the U.S. moves reflect a growing strains in relations.\n\nChad's economy has struggled as the price of oil, its biggest source of income, has fallen in recent years. In a report last year, the State Department suggested that economic problems had led to a deterioration in the country's security forces.\n\n“The Government of Chad continued to prioritize counterterrorism efforts at the highest level; however, the worsening financial crisis affected its ability to meet even basic financial commitments, such as paying police and military salaries,” said a State Department report last year.\n\nMoncrieff said that any lack of cooperation with the U.S. was likely due to a lack of bureaucratic capacity rather than a refusal to assist on terrorism issues.\n\n“It has a very, very weak state capacity, and that’s not helped by a massive financial crunch at the moment,” he said.\n\nChad has emerged as one of the most important hosts of refugees in the region, with nearly 400,000 refugees living in the country, including many who have fled from the Darfur region of Sudan.\n\nRead more:\n\nAlmost no North Koreans travel to the U.S., so why ban them?", "authors": [], "publish_date": "2017-09-25", "source": "washingtonpost", "top_words": ["travel", "ban", "statement", "chad", "mali", "sure", "united", "chads", "haram", "region", "quite", "boko", "nigeria", "add"], "summary": "President Trump added North Korea, Chad and Venezuela to his administration's existing travel ban.\nBut on Sunday — shocking both Chadians and regional analysts — the Trump administration announced that Chad's citizens would be included in the newest American travel ban.\nBut many other countries in the region are not included in the U.S. travel restrictions, including Nigeria, Mali and Niger are considered far more vulnerable to terrorism.\nAccording to the Institute for Security Studies, Boko Haram waged more than 120 attacks in Nigeria last year, but only four in Chad.\nIn recent years, Air Force personnel have used the country as a staging ground for Boko Haram surveillance missions."}