{"url": "https://www.washingtonpost.com/news/post-politics/wp/2017/02/27/george-w-bush-critiques-trump-on-travel-ban-free-press/", "id": "120", "title": "George W. Bush critiques Trump on travel ban, free press", "text": "\n\nFormer president George W. Bush and wife Laura Bush arrive at the U.S. Capitol before Donald Trump is sworn in as president on Jan. 20. (John Angelillo/European Pressphoto Agency)\n\nFormer president George W. Bush rarely weighs in on current political events, but on Monday, he offered some of his most pointed critiques of President Trump's statements and policies in an interview with NBC News' “Today” show.\n\nAsked about Trump's claim that the media is the “enemy of the people,” Bush warned that an independent press is essential to democracy and that denouncing the press at home makes it difficult for the United States to preach democratic values abroad.\n\n“I consider the media to be indispensable to democracy,” Bush said. “We need an independent media to hold people like me to account.\n\n“Power can be very addictive and it can be corrosive and it's important for the media to call to account people who abuse power, whether it be here or elsewhere,” he added.\n\nBush noted that during his presidency, he sought to persuade people like Russian President Vladimir Putin to respect a free press.\n\n“It's kind of hard to tell others to have an independent free press when we're not willing to have one ourselves,” Bush said.\n\nOn Russia, Bush added that “we all need answers” about whether Trump campaign officials had contact with Russian officials in the election. But he did not endorse the idea that an independent prosecutor was necessary. Bush said that Senate Intelligence Committee Chairman Richard Burr was an “independent thinker” capable of handling the inquiry.\n\n“If he were to recommend a special prosecutor, then it'd have a lot more credibility with me,” Bush said of Burr.\n\nDemocrats and Republicans on Feb. 26 reacted to comments by Rep. Darrell Issa (R-Calif.) that a special prosecutor should investigate apparent Russian meddling in the 2016 election. (Bastien Inzaurralde/The Washington Post)\n\nBush's interview was pegged to the release of his new book of oil paintings of wounded veterans. But the former president seemed unusually willing to offer criticism of the sitting president from his own party, a departure from his longtime practice of staying out of the fray.\n\nBush even chuckled as host Matt Lauer reminded him of Trump's colorful description of “American carnage” during his inaugural address, which Bush attended.\n\nLauer sought to pin Bush down on his position on Trump's travel ban, which Bush refused to endorse.\n\nInstead, he offered a defense of religious freedom, warning that the terror threat is not a religious war but an ideological one.\n\n“I think it's very important for all of us to recognize one of our great strengths is for people to be able to worship the way they want to or to not worship at all,” Bush said. “A bedrock of our freedom is the right to worship freely.”\n\n“I understood right off the bat that this was an ideological conflict and people who murder the innocent are not religious people — they want to advance an ideology and we have faced those kinds of ideologues in the past,” he added.\n\nPressed to state clearly whether he supports or opposes the ban, Bush would only say “I am for an immigration policy that's welcoming and upholds the law.”", "authors": [], "publish_date": "2017-02-27", "source": "washingtonpost", "top_words": ["critiques", "travel", "trump", "george", "ban", "worship", "free", "prosecutor", "trumps", "media", "religious", "press", "w", "president", "russian", "independent", "bush"], "summary": "Former president George W. Bush and wife Laura Bush arrive at the U.S. Capitol before Donald Trump is sworn in as president on Jan. 20.\n“We need an independent media to hold people like me to account.\nBush noted that during his presidency, he sought to persuade people like Russian President Vladimir Putin to respect a free press.\nBut he did not endorse the idea that an independent prosecutor was necessary.\nLauer sought to pin Bush down on his position on Trump's travel ban, which Bush refused to endorse."}