{"url": "https://www.washingtonpost.com/news/acts-of-faith/wp/2017/01/30/some-of-the-u-s-s-most-important-catholic-leaders-are-condemning-trumps-travel-ban/", "id": "149", "title": "Some of the U.S.’s most important Catholic leaders are condemning Trump’s travel ban", "text": "\n\nProtesters rally during a demonstration against President Trump’s refugee executive order at John F. Kennedy International Airport on Jan. 28 in New York. (Stephanie Keith/Getty Images)\n\nPresident Trump, who won the majority of Catholic votes, is facing fierce opposition from Catholic bishops and nonprofit leaders who are issuing strongly worded statements condemning his executive order on refugees.\n\n“We believe in assisting all those who are vulnerable and fleeing persecution, regardless of their religion,” said Bishop Joe Vásquez of Austin, in a statement on behalf of the U.S. Conference of Catholic Bishops after the order was issued Friday.\n\nTrump’s actions have startled many Catholic leaders, said John Carr, a longtime policy director for the bishops’ group.\n\n“It’s so stunning, the scale of it, the immediacy of it, the bluntness of it,” said Carr, who is now director of the Initiative on Catholic Social Thought and Public Life at Georgetown University. “This will remind people there were times when people who were Catholic were not welcome because of where they came from and what they believed.”\n\nThe executive order blocks Syrian refugees from the United States indefinitely and prohibits admitting any refugees from other nations in the world for 120 days. For 90 days, no citizen of seven majority-Muslim countries — even those who hold American green cards and have been living in the United States for years — will be admitted without a waiver.\n\nThe Catholic Church has a long history of helping refugees settle in the United States. Eighty-three Catholic dioceses out of 196 in the country are involved in resettling refugees in some way, according to a spokeswoman for the U.S. Conference of Catholic Bishops. Leaders of several Catholic agencies helping to resettle refugees denounced the order.\n\nCatholic leaders point to the many remarks of Pope Francis in support of refugees. Francis said in the fall that people can’t defend Christianity by being “against refugees and other religions,” noting that the sin Jesus condemns the most is hypocrisy.\n\n“It’s hypocrisy to call yourself a Christian and chase away a refugee or someone seeking help, someone who is hungry or thirsty, toss out someone who is in need of my help,” he said when he met with Catholics and Lutherans in Germany in October. “If I say I am Christian, but do these things, I’m a hypocrite.”\n\nSome leaders characterized Trump’s order as harking back to a time when Catholic immigrants from countries such as Ireland and Italy experienced discrimination, and when distrust of Catholics famously affected President John F. Kennedy’s 1960 campaign.\n\nThe historic tensions between Protestants and Catholics have faded since the 1980s, when socially conservative Catholics and evangelicals joined on causes, such as opposition to abortion and same-sex marriage.\n\nAttitudes and political priorities have also shifted generationally, Carr said. He believes Catholics who voted for Trump 52 to 45 percent were motivated by promises Trump made to revive the economy and to appoint an antiabortion Supreme Court justice.\n\nUnderlying the tensions over refugees is another debate over whether or how the government should show preference to religious groups. In an interview with the Christian Broadcasting Network, he said persecuted Christians would be given priority in applying for refugee status once the new vetting system is up and running.\n\nThe question of whether the United States works too hard or not hard enough for persecuted Christians overseas has been a widely debated question as conditions for religious minorities in the Middle East have deteriorated in recent years.\n\nUnder the Obama administration, some international religious freedom advocates say Christians and Yizidis who were targeted by the Islamic State were marginalized in key U.S.-supported United Nations aid programs.\n\n“Pope Francis was among the first to decry ISIS’ genocide against religious minorities, so the fact that the executive order gives refugee priority to individual claims from persecuted religious minorities, whether Christian, Yizidi or Muslim, is welcome news,” Nina Shea, who is Catholic and a senior fellow at the Hudson Institute, said in an email. ISIS is another name for the Islamic State.\n\nBut many Catholic leaders said that they are opposed to anything that would prioritize Christians over Muslim refugees.\n\n“Any proposal that preferences Christians over Muslims as refugees makes Catholic leaders nervous because it feeds that narrative that this is a war between the Christian West and the Muslims,” said the Rev. Thomas Reese, a Jesuit who sits on the U.S. Commission on International Religious Freedom — an independent government commission.\n\nBishops across the country expressed concern over Trump’s executive order.\n\nCardinal Blase Cupich, archbishop of Chicago, called Trump’s order a “dark moment in U.S. history.” “We Catholics know that history well, for, like others, we have been on the other side of such decisions,” he said in a statement.\n\nWhen he was archbishop of Indianapolis, Cardinal Joseph Tobin in 2015 defied then-Indiana Gov. Mike Pence, who is Trump’s vice president, stance against settling Syrian refugees in the state.\n\nTobin, now archbishop of Newark, issued a statement decrying Trump’s order last week on withholding federal funds for sanctuary cities. He said such actions “do not show the United States to be an open and welcoming nation. They are the opposite of what it means to be an American.”\n\nOn Monday, Bishop Michael F. Burbidge of Arlington, released a statement calling for Catholics to “to contact our elected officials to make our voices heard: our communities have been and will continue to be hospitable to refugees, in keeping with our legacy of welcoming the stranger.” Vasquez’s statement on behalf of the bishops, he said, “highlighted our nation’s long and proud tradition of welcoming newcomers and refugees in a humane manner, even as we have pursued a strong vetting system to ensure our safety and security.”\n\nHowever, not all Catholic leaders were quick to condemn Trump.\n\nArchbishop Charles Chaput of Philadelphia, who hosted Pope Francis’s U.S. visit in 2015, suggested in column Friday that the University of Notre Dame could invite Trump to speak at commencement. Bestowing honorary degrees on presidents as a tradition for the university and caused a stir when the Catholic universeity issued one to President Barack Obama when he spoke at commencement, given his support for abortion rights.\n\n“The archbishop will be writing about immigration this week and will probably touch on it, but he does not think it wise to engage in some of [the] frantic protests so far,” Francis Maier, who is senior adviser to Chaput, wrote in an email. “This requires a reasoned response, not an anxiety attack.”\n\nCatholics are more likely than other Americans to be immigrants or children of immigrants, according to the Pew Research Center. The growth of the U.S. Catholic Church has been largely fueled by Hispanic immigrants. According to 2014 Pew data, the share of U.S. Catholics who are Hispanic had grown by 5 percentage points since 2007 (from 29 percent to 34 percent), while the percentage of all U.S. adults who are Hispanic had grown by 3 points (from 12 percent to 15 percent). And the Hispanic share of Catholics is likely to continue to grow; among Catholic millennials, as many are Hispanic (46 percent) as are white (43 percent).\n\nAt St. Rose of Lima Catholic Church, an inner city parish in New Haven, Conn., where about 90 percent of parishioners are immigrants or first-generation Americans, Trump’s order produced alarm and determination on Sunday.\n\nThe parish hosted a “solidarity rally” on Tuesday that drew over 500 people from a variety of faiths and ethnic backgrounds, an event in which parishioners expressed empathy for Muslims particularly affected by the president’s order.\n\nThe parish, which attracts 1,200 people on a Sunday, is particularly sensitive to the risks facing immigrants: In 2007, 30 parishioners were deported during immigration raids in the city, according to the Rev. James Manship, pastor of the church.\n\n“We’ve been frightened since the election — since the campaign, really,” Manship said. “A nation has to have secure borders, but you can’t treat people as a problem.”\n\nSome Catholic leaders have pointed out that the timing of Trump’s Friday order coincided with the March for Life, which they interpret as a march for all lives, including those of refugees.\n\n“Refugees and immigrants continue to believe that this nation is still a sanctuary, as they arrive with relief and thanksgiving. We pray they are never let down!” Cardinal Timothy Dolan of New York said at Mass the night before the march, according to the Atlantic. Dolan prayed at Trump’s inauguration and praised his reinstatement of a policy blocking aid to foreign organizations that use funds from other sources to perform or discuss abortions.\n\nDolan told reporters on Sunday he had not had time to review Trump’s executive order yet. “At first blush, it causes us some apprehension,” he said. He noted that the Catholic Church has been working on refugee issues since its inception “because we are an immigrant church, so don’t be surprised that our strong bias is always in favor of the immigrants.”\n\nTom Breen contributed to this report.\n\nCorrection: This story has been updated to reflect Archbishop Charles Chaput’s column, which suggested Trump should be invited to commencement where they often confer honorary degrees.", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["executive", "travel", "ban", "immigrants", "catholic", "condemning", "refugees", "order", "catholics", "trumps", "uss", "united", "religious", "leaders", "important"], "summary": "Trump’s actions have startled many Catholic leaders, said John Carr, a longtime policy director for the bishops’ group.\nBut many Catholic leaders said that they are opposed to anything that would prioritize Christians over Muslim refugees.\nBishops across the country expressed concern over Trump’s executive order.\nTobin, now archbishop of Newark, issued a statement decrying Trump’s order last week on withholding federal funds for sanctuary cities.\nDolan told reporters on Sunday he had not had time to review Trump’s executive order yet."}