{"url": "https://www.washingtonpost.com/posteverything/wp/2017/02/09/im-a-rabbi-who-was-arrested-protesting-trumps-travel-ban-it-was-a-holy-act/", "id": "177", "title": "I'm a rabbi who was arrested protesting Trump's travel ban. It was a holy act.", "text": "\n\nPresident Trump signs an executive order banning refugees and most travelers from seven mostly Muslim nations from entering the country. (Carlos Barria/Reuters)\n\nNEW YORK — On Monday night, I was arrested along with 18 of my fellow rabbis in protest of the Trump administration’s policies targeting refugees and immigrants — including the ban on travel from seven mostly Muslim nations. The Jewish tradition commands us to speak out against injustice, and Jewish history teaches us how imperative it is that those not targeted by hate stand up for those who are. It was, we believe, the largest mass arrest of rabbis in U.S. history.\n\nIt was a profoundly holy experience for me, marching down Broadway and over to the Trump International Hotel and Tower singing with hundreds of my colleagues and community members, sitting in the street with my teachers and colleagues, and then the arrest itself — offering myself up to the state, fully vulnerable. But it was always abundantly clear to me what our action was, and what it wasn’t.\n\nIn the ancient Temple in Jerusalem, my ancestors offered animal sacrifices to God. That ritual was both an assertion that life is the most profound thing that we can give over and a statement that we could not — should not — offer our own lives. Other ancient cultures engaged in human sacrifice, but it was brutal, immoral; the move to animal sacrifice was an attempt to recognize the sanctity of human life. And yet, animal sacrifice was still deeply embodied — visceral, bloody. Sacrificing an animal was not the same as giving up our own lives, but it was a powerful symbolic substitute.\n\nI can’t actually offer my body to the refugees fleeing war or the undocumented people increasingly powerless against deportation: It’s not possible for me to offer my citizenship and status to those whose lives might depend on it. I can’t hand over my passport for their protection and safety.\n\nSo the offering I made Monday night was symbolic, if no less physical. I chose to allow my hands to be cuffed, my body to be put into a jail cell. I chose to use my privilege and my position as a clergyperson — regarded in our society as having a special kind of moral authority — to send a message to the public and those with institutional power that this assault on human safety and dignity is unacceptable.\n\n[ Why Jews have a special obligation to resist Trump ]\n\nNot everyone can engage in civil disobedience safely, but I can. My skin color, ability, gender identity and class offer me a wealth of protections not afforded to many other people. I did not fear for my safety. I did not worry that I would be placed in an environment discordant with my gender identity. I knew in advance that there were lawyers on the outside who were tasked with taking care of us, as part of the organization of the protest by Truah, a human rights group.\n\nThose of us who can use our bodies in service of those under attack have an obligation to do so. If we do not leverage our social access on behalf of those who are most vulnerable, who will? If we don’t protest, we are complicit in whatever happens next.\n\nWhile in the holding cell, we rabbis sang, meditated, taught Torah and spoke of the work that lies ahead. Rabbi Sharon Kleinbaum, a nonviolent activist with decades of arrests under her belt, told us, “I fear the time is coming when we will need to fill all the jails.”\n\nBy that, she meant: At a certain point, perhaps not long from now, one of the only means that available for stopping unjust actions may be to create such social disturbance, so much institutional and bureaucratic overload that those with power would find it no longer expedient to maintain injustice.\n\nThose of us who can afford to do so must prepare for that moment now. We must begin to train, en masse, in civil disobedience, to seek out those who can mentor us and understand how and when it can be best deployed as a strategic tactic. Those of us with social privilege must begin to get more and more accustomed to putting ourselves on the line. We must begin to get clear on the risks needed to create a United States that truly offers liberty and justice to all.\n\nWe must make of our bodies an offering. That the act is in many ways symbolic doesn’t make it any less holy.\n\nRead more:\n\nWhat the Hanukkah story teaches us about the Trump administration\n\nDonald Trump is wicked. As a rabbi, I had to protest his AIPAC speech.\n\nI was asked to join Trump’s inaugural service as a rabbi. I had to turn it down.", "authors": ["Danya Ruttenberg Is Rabbi-In-Residence At"], "publish_date": "2017-02-09", "source": "washingtonpost", "top_words": ["sacrifice", "travel", "arrested", "rabbi", "trump", "ban", "symbolic", "holy", "protesting", "offer", "act", "social", "rabbis", "trumps", "protest", "animal", "im", "refugees", "human"], "summary": "President Trump signs an executive order banning refugees and most travelers from seven mostly Muslim nations from entering the country.\nOther ancient cultures engaged in human sacrifice, but it was brutal, immoral; the move to animal sacrifice was an attempt to recognize the sanctity of human life.\nAnd yet, animal sacrifice was still deeply embodied — visceral, bloody.\nSacrificing an animal was not the same as giving up our own lives, but it was a powerful symbolic substitute.\nRead more:What the Hanukkah story teaches us about the Trump administrationDonald Trump is wicked."}