{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/01/30/why-most-congressional-republicans-probably-wont-be-speaking-out-against-trumps-travel-ban/", "id": "193", "title": "Why most congressional Republicans probably won’t be speaking out against Trump’s travel ban", "text": "President Trump signed an executive order to halt U.S. entry for refugees, migrants and foreign nationals for 120 days starting Jan. 27. Fiery protests and lawsuits made for a tumultuous weekend. Here's what you need to know. (Dalton Bennett,Erin Patrick O'Connor,Katherine Shaver,Monica Akhtar,McKenna Ewen/The Washington Post)\n\nOn the face of it, there are plenty of reasons for congressional Republicans to oppose President Trump's travel ban for people from seven predominately Muslim countries.\n\nYou could argue that Trump may just have implemented a version of a religious test for refugees that many Republicans criticized during the campaign. As jihadist groups hail Trump's move, national security experts warn it could actually make our country less safe. Top GOP political groups affiliated with the Koch brothers condemned it. Protests against and individuals affected by it dominated the news this weekend.\n\nBut the vast majority of Republicans seem to have weighed the cost of being identified with this position against the cost of publicly breaking with the new president -- and calculated that the latter would cost them more.\n\n[Trump says ‘all is going well’ on immigration order amid questions and confusion]\n\nOver the weekend, dozens of Republican members of Congress expressed reservations or outright opposition to Trump's travel ban for people from seven predominantly Muslim countries. Others, like House Speaker Paul D. Ryan (R-Wis.), said the temporary ban \"is right.\" But the overwhelming majority of Republicans haven't said anything at all.\n\nThe mixed messages from some Republicans on Capitol Hill, and the silence from most, speaks volumes about how they're approaching the Trump administration in its first major controversy: with fingers crossed that the whole thing blows over soon.\n\n\"I think most members' top priority is getting as much legislation passed this year as possible, and so picking fights with the White House does not help,\" said Alex Conant, a GOP strategist and former communications director for Sen. Marco Rubio's (R-Fla.) presidential campaign.\n\n[Jihadist groups hail Trump’s travel ban as a victory]\n\nThis is the first time in a decade Republicans have had control of both Congress and the White House, and they're eager to use their newfound power to reform health care and the tax code. Those are heavy policy lifts -- not to mention politically tricky -- that will require a working relationship with the White House to execute. In other words, many Republicans have calculated the greater good is best served by staying silent, or offering nominal opposition, to Trump's travel ban.\n\nAnother reason for many Republicans' silence: They're just as confused as the rest of the world about what it is the travel ban does and whom it affects. By most accounts, the White House's rollout of this executive order was poorly communicated.\n\nThe New York Times reported that John Kelly, the new chief of the Department of Homeland Security, got briefed on a Coast Guard plane about how his department should implement the order after it was announced. Reince Priebus, Trump's chief of staff, went on TV on Sunday and said the ban didn't include green-card holders, only to have the White House clarify that green-card holders would be reviewed on a case-by-case basis.\n\n[Koch network could serve as potent resistance in Trump era]\n\nEven supporters of the executive action urged the Trump administration to tailor it. Rep. Michael McCaul (R-Tex.), the chair of the Homeland Security Committee, readjusted his statement Sunday: \"In light of the confusion and uncertainty created in the wake of the president’s executive order, it is clear adjustments are needed.\"\n\nSen. Bob Corker (R-Tenn.), the chair of the Senate Foreign Relation Committee and once under consideration to be Trump's running mate, said in a statement, \"This executive order has been poorly implemented, especially with respect to green card holders.\"\n\nIf the Trump administration had given Republican leaders a heads up this was coming and worked with them on talking points, then perhaps, GOP strategists say, Republican lawmakers would have been quicker to come to the president's defense.\n\n[Unnamed White House official on implementing travel ban: ‘It really is a massive success story.’]\n\nInstead, the Trump administration was left pushing back on its own against the Democratic charge that this constituted an unconstitutional Muslim ban or religious test -- without the help of a majority of Republicans in Congress.\n\nWhich brings us to the political calculations of Republicans' mixed messages. GOP strategists The Fix spoke to didn't think Hill Republicans were wary to speak out because they didn't want to upset Trump supporters in their state. It's possible that, had Trump's team engaged his base, many voters in red states would be as vocal in support of the temporary ban as progressives have been opposed to it. Recall that Republican governors led the call in 2015 not to accept Syrian refugees in the wake of the Paris terrorist attacks.\n\nOthers warn that trying to game out political impact in the era of Trump is a waste of time and energy. If there's one thing 2016 taught us, it's that how Americans will react to Trump and his controversies is almost always a surprise.\n\n\"My advice to Republicans in Congress is: Don't worry about the politics,\" Conant said. \"Just do what you think is right, because nobody knows how this will play out over the long term politically.\"\n\nIt seems a majority of of Republicans on Capitol Hill have decided the right thing is to just stay quiet for now.", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["executive", "travel", "republican", "trump", "ban", "congressional", "republicans", "speaking", "trumps", "wont", "order", "house", "white", "probably"], "summary": "President Trump signed an executive order to halt U.S. entry for refugees, migrants and foreign nationals for 120 days starting Jan. 27.\n(Dalton Bennett,Erin Patrick O'Connor,Katherine Shaver,Monica Akhtar,McKenna Ewen/The Washington Post)On the face of it, there are plenty of reasons for congressional Republicans to oppose President Trump's travel ban for people from seven predominately Muslim countries.\nThose are heavy policy lifts -- not to mention politically tricky -- that will require a working relationship with the White House to execute.\nIn other words, many Republicans have calculated the greater good is best served by staying silent, or offering nominal opposition, to Trump's travel ban.\nAnother reason for many Republicans' silence: They're just as confused as the rest of the world about what it is the travel ban does and whom it affects."}