{"url": "https://www.washingtonpost.com/news/politics/wp/2017/07/13/travel-ban-or-no-trumps-first-six-months-saw-a-sharp-drop-in-muslim-refugees-entering-the-u-s/", "id": "190", "title": "Travel ban or no, Trump’s first six months saw a sharp drop in Muslim refugees entering the U.S.", "text": "\n\nSyrian refugee Baraa Haj Khalaf attends a news conference with her mother, Fattoum Haj Khalaf, right, after arriving at Chicago’s O’Hare International Airport on Feb. 7. (Joshua Lott/AFP via Getty Images)\n\nThe Trump administration insists that the restrictions on immigration it proposed shortly after the president took office was not meant to be an implementation of his infamous campaign-trail call for a “complete ban” on Muslims entering the United States. That insistence is necessary for legal purposes, mind you; so far, court decisions blocking President Trump’s ban have cited his prior demand for a religion-based screening process as a reason for their doing so.\n\nBut even with much of that ban tabled by the courts, the administration has had success in at least one area in its push to limit immigration from Muslim countries. According to data from the Pew Research Center, the number of refugees entering the country in the first six months of 2017 is down 34 percent from January to June 2016. The number of Muslim refugees entering the country over that period is down 40 percent.\n\nThe vertical dashed line indicates the presidential election.\n\nThose figures include January, during most of which Barack Obama was still president. Comparing February to June of each year, the drop is more stark. The number of refugees entering the country fell by 46 percent in that period — and the number who were Muslim fell by 56 percent.\n\n2016 was a record year for Muslim refugees entering the country, but that increase was most significant in the latter half of the year. So far this year, the number of Muslim refugees who have entered the country is one-fifth of 2016’s total, with the State Department announcing Wednesday that the annual cap of 50,000 refugees imposed under Trump had been reached.\n\nPew also found that the number of Christian refugees to the United States had declined — but less sharply. Compared with January to June 2016, the number of Christian refugees dropped only 30 percent.\n\nSo far, the No. 1 country of origin for refugees admitted under the Trump administration is one you might not guess: Congo.\n\nAs a result of that shift in focus, the percentage of refugees entering the country this year who are Christian has increased sharply. In May and June, the percentage of refugees who were Christian was 57 percent — higher than at any point in 2016.\n\nThis is not a “complete ban” on Muslim refugees entering the country, obviously. But true to Trump’s campaign themes, it is a substantial drop.", "authors": [], "publish_date": "2017-07-13", "source": "washingtonpost", "top_words": ["travel", "sharp", "trump", "saw", "ban", "entering", "trumps", "months", "drop", "country", "number", "president", "refugees", "muslim", "far", "christian"], "summary": "The number of Muslim refugees entering the country over that period is down 40 percent.\nThe number of refugees entering the country fell by 46 percent in that period — and the number who were Muslim fell by 56 percent.\n2016 was a record year for Muslim refugees entering the country, but that increase was most significant in the latter half of the year.\nPew also found that the number of Christian refugees to the United States had declined — but less sharply.\nThis is not a “complete ban” on Muslim refugees entering the country, obviously."}