{"url": "https://www.washingtonpost.com/opinions/what-trumps-travel-ban-ignores-radicalized-us-citizens-pose-the-greatest-threat/2017/02/27/4f928eb4-fc91-11e6-8ebe-6e0dbe4f2bca_story.html", "id": "146", "title": "What Trump’s travel ban ignores: Radicalized U.S. citizens pose the greatest threat", "text": "Michael Morell is the former acting director and deputy director of the Central Intelligence Agency. Robert Pape is a professor of political science at the University of Chicago and the director of the Chicago Project on Security and Threats.\n\nGood facts and good analysis make good policy. They guide decision-makers toward effective policies and prevent us from acting on ideology or singular events. This is why every meeting of the National Security Council, across multiple administrations, has begun with an intelligence briefing.\n\nWhat should the intelligence briefing look like at a hypothetical NSC discussion on President Trump’s travel ban? It should address the current terrorist threat to the U.S. homeland as well as the implications of the travel ban.\n\nOn the threat, the briefing should draw on something like the detailed analysis being done by the Chicago Project on Security and Threats (CPOST), a research program associated with the University of Chicago. CPOST has studied the 125 individuals who in the past 36 months either were indicted by the Justice Department for Islamic State-related crimes or who would have been indicted had they not died perpetrating a terrorist attack in the United States or fighting for Islamic State on the battlefield in Iraq and Syria.\n\n[The new immigration order: A disaster in the making]\n\nThe first point from the CPOST analysis that we would highlight at our hypothetical NSC meeting would be that the greatest terrorist threat comes from our own citizens who have been radicalized by the Islamic State’s recruiting narrative. Of those studied, 81 percent are U.S. citizens, with 78 percent of them born in the United States. Another 11 percent are green-card holders — permanent residents. Only 8 percent are not U.S. citizens or permanent residents.\n\nThe judgment that the greatest terrorist threat to the United States now comes from homegrown jihadists is not new. It is a point that many terrorism experts have made over the past several years. Senior officials from the National Counterterrorism Center have repeatedly made this observation in congressional testimonies. The data from CPOST drive this point home.\n\nWhy is the terrorist threat not greater from foreign nationals traveling to the United States? The answer is that, since 9/11, the homeland and national security agencies have worked diligently to keep terrorists out of the United States. The extreme vetting that Trump talks about is already occurring. The travel ban would do little to further mitigate the threat.\n\nSecond, there is no rationale in the data to focus on the seven countries the president’s executive order targeted.\n\nA look at the countries of birth for the small share of those committing terrorist acts who were not born in the United States shows that 37 percent are from the seven countries. The other 63 percent came from six other countries in the Middle East and Africa, five nations in South and Central Asia, and three in Europe. So the travel ban, even if necessary to protect the homeland — which it is not — would be focusing on only a little more than a third of the problem from outside our borders.\n\n(Reuters)\n\nThird, there is often a significant time lag between those who enter the United States and the terrorist-related actions that they take. This means that these individuals do not come to the United States with the intent to commit terrorism but are radicalized by the same process that creates American-born jihadists. The hard truth is that there is no evidence that those born abroad are any more susceptible to radicalization than those born here.\n\n[What ‘President Promise-Keeper’ should say on Tuesday night]\n\nOn the implications of the executive order, we would make two points: First, that our relationship with one of our most important allies in the fight against the Islamic State — Iraq — will be undermined by the order and second, that the ban will be used by jihadist groups as a recruiting and radicalization tool.\n\nThese groups tell their followers that the West, led by the United States, is a threat to Islam as a religion and even that the United States is working to destroy Islam. The ban plays into that narrative. In the past year, terrorist videos have included clips of candidate Trump calling for a “total and complete shutdown” of Muslims entering the United States. In this way, the ban may, ironically, make the threat worse, as it may lead to more U.S. citizens being radicalized.\n\nWe applaud the Trump administration’s focus on keeping Americans safe. But the facts show that the travel ban is bad policy. They also show that better policy would be to focus on defeating the Islamic State narrative that is infecting those already in this country.", "authors": [], "publish_date": "2017-02-27", "source": "washingtonpost", "top_words": ["radicalized", "travel", "citizens", "ban", "cpost", "security", "terrorist", "order", "united", "states", "trumps", "pose", "greatest", "islamic", "ignores", "threat"], "summary": "What should the intelligence briefing look like at a hypothetical NSC discussion on President Trump’s travel ban?\nIt should address the current terrorist threat to the U.S. homeland as well as the implications of the travel ban.\nOf those studied, 81 percent are U.S. citizens, with 78 percent of them born in the United States.\nThe judgment that the greatest terrorist threat to the United States now comes from homegrown jihadists is not new.\nBut the facts show that the travel ban is bad policy."}