{"url": "https://www.washingtonpost.com/blogs/plum-line/wp/2017/02/07/a-new-poll-shows-a-surprisingly-big-public-swing-against-trumps-muslim-ban/", "id": "109", "title": "A new poll shows a surprisingly big public swing against Trump’s travel ban", "text": "A new Quinnipiac poll finds — as other polls have — that majorities oppose all of President Trump’s recent immigration moves. Americans oppose the ban on travel from select Muslim-majority nations by 51-46; they oppose the ban on refugees from all nations by 60-37; and they oppose the ban on Syrian refugees in particular by 70-26.\n\nBut here’s perhaps the most striking data point of all: There has been a 12 point net swing against the general idea of the travel ban in the last month.\n\nQuinnipiac polled on a version of question in early January, before the details of the proposal were known. The question was asked this way: “Do you support or oppose suspending immigration from ‘terror prone’ regions, even if it means turning away refugees from those regions?” Quinnipiac found that Americans supported this by 48-42.\n\nQuinnipiac asked this same question this time, and now finds those numbers are reversed, with Americans opposing it by 50-44. Here’s the trend (click to enlarge):\n\nAs you can see, since January, support has dropped four points, while opposition has risen by eight — a net swing of 12 points. Since just after the election, the net swing has also been 12 points against it.\n\nNow, in fairness, the addition of “refugees” to that question might tilt the findings a bit against it. But still, that’s not an unreasonable description of the overall idea of the ban, and indeed, the new Quinnpiac poll finds Americans are opposed by 51-46 when the question is asked about travel from specific countries with no mention of refugees.\n\n“The 12 point swing is significant,” Tim Malloy, assistant director of the Quinnipiac poll, told me today. “It may signal that Americans’ hearts have softened towards people who want to come here.”\n\nThe big difference between before and now, of course, is that before, the specifics of Trump’s policies were not known. Trump was just talking tough about keeping people from dangerous regions out of America, and about the need for “extreme vetting” of them. Since then, not only has the policy been announced; aggressive media coverage has dramatized the real world reality of it, capturing scenes of chaos and anguish across the country. And there has been extensive coverage of the global protests that have greeted the proposal and of the plight of people kept out.\n\n“This is an issue that hits you in the gut, especially when you consider who the potential victims are,” Malloy said. It’s also worth noting that other quality polls — from Gallup and CBS — have recently found majority opposition to Trump’s new immigration moves.\n\nBy the way, the new Quinnipiac poll also finds:\n\n— Only 40 percent of Americans think Trump’s policies will make the country safer from terrorism, versus 41 percent who say they will make us less safe and 16 percent who say they will make no difference, a total of 57 percent who don’t accept the story Trump is telling.\n\n— Only 44 percent approve of the way Trump is handling terrorism, versus 49 percent who disapprove.\n\n— 56 percent disapprove of the way Trump is handling foreign policy, versus only 38 percent who approve.\n\n— 51 percent say that Trump’s executive order is intended as a ban on Muslim immigration — which the White House flatly denies, despite the trail of Trump statements that leave little doubt as to his real intent — while 45 percent say it isn’t.\n\nAll of this adds up to a fairly clear public repudiation of the most visible first round of efforts to translate Trumpism into policy reality.", "authors": [], "publish_date": "2017-02-07", "source": "washingtonpost", "top_words": ["travel", "trump", "shows", "ban", "oppose", "public", "big", "poll", "say", "trumps", "surprisingly", "refugees", "americans", "swing", "way", "question"], "summary": "A new Quinnipiac poll finds — as other polls have — that majorities oppose all of President Trump’s recent immigration moves.\nAmericans oppose the ban on travel from select Muslim-majority nations by 51-46; they oppose the ban on refugees from all nations by 60-37; and they oppose the ban on Syrian refugees in particular by 70-26.\nBut here’s perhaps the most striking data point of all: There has been a 12 point net swing against the general idea of the travel ban in the last month.\n— Only 44 percent approve of the way Trump is handling terrorism, versus 49 percent who disapprove.\n— 56 percent disapprove of the way Trump is handling foreign policy, versus only 38 percent who approve."}