{"url": "https://www.washingtonpost.com/world/national-security/judge-rejects-hawaii-bid-to-exempt-grandparents-from-trumps-travel-ban/2017/07/06/8e3a3252-625d-11e7-8adc-fea80e32bf47_story.html", "id": "137", "title": "Judge rejects Hawaii bid to exempt grandparents from Trump’s travel ban", "text": "Grandparents and other extended relatives of people in the United States are not exempt from President Trump’s travel ban, a federal judge effectively decided Thursday as he denied a bid to curtail enforcement of the executive order meant to keep out citizens of six Muslim-majority countries.\n\nU.S. District Judge Derrick K. Watson wrote that he would not “usurp the prerogative of the Supreme Court,” and if those suing over the ban wanted relief, they should take their claims there.\n\nThat means the government, at least for now, can use the travel ban to block citizens of the affected countries if they are the grandparents, grandchildren, aunts, uncles, nieces, nephews, cousins, brothers-in-law or sisters-in-law of people in the United States. Officials can also block refugees with a formal assurance from a resettlement agency.\n\nThe administration had wanted to keep such people out, and thought a recent Supreme Court ruling partially lifting lower courts’ freezes on the travel ban allowed them to do so. But those who had sued over the ban disagreed, and they asked Watson to intervene — which he declined to do.\n\n[Travel ban takes effect as State Department defines ‘close family’]\n\n“Because Plaintiffs seek clarification of the June 26, 2017 injunction modifications authored by the Supreme Court, clarification should be sought there, not here,” Watson wrote.\n\nNeal Katyal, a lawyer for those challenging the ban, noted on Twitter the ruling offered no decision on the “merits of dispute,” but simply said it was the Supreme Court’s place to decide.\n\nThe Supreme Court had ruled late last month that the government could begin enforcing the measure, but not on those with “a credible claim of a bona fide relationship” with a person or entity in the United States.\n\nThe court offered only limited guidance on what type of relationship would qualify. “Close familial” relationships would count, the court said, as would ties such as a job offer or school acceptance letter that were “formal, documented, and formed in the ordinary course.”\n\nThe government put the measure into effect on June 29, suspending the refu­gee program and barring the issuance of new visas to residents of Iran, Somalia, Sudan, Libya, Yemen and Syria without U.S. connections. But for opponents of the ban, the administration’s interpretation of who had a connection was too narrow.\n\nThe administration said it would let into the United States from the six affected countries parents, parents-in-law, siblings, spouses, children, sons and daughters and sons-in-law and daughters-in-law of those already here. (Officials initially wanted to keep out fiances, but later relented.)\n\nStill banned, though, were grandparents, grandchildren, aunts, uncles, nieces, nephews, cousins, brothers-in-law and sisters-in-law. And the administration also said it would keep out refugees that had a formal assurance from a resettlement agency.\n\n[What the Supreme Court’s travel ban ruling means]\n\nHawaii, which had initially sued over the ban, objected in court, asking Watson to clarify that such people could not be blocked.\n\n“The Government does not have discretion to ignore the Court’s injunction as it sees fit,” lawyers representing the state wrote.\n\nThe government shot back that it was drawing lines on who counted as a close family member based on its interpretation of the Immigration and Nationality Act. Justice Department lawyers asserted that the Supreme Court had made clear not all people with U.S. connections should be allowed in.\n\n“As the Supreme Court instructed, not all relationships with a person in the United States suffice to fall outside the stay and within the injunction,” Justice Department lawyers wrote. “Indeed, not even all familial relationships suffice; rather, a ‘close familial relationship’ is required.”\n\nThe matter is likely bound for higher courts. The government had asked Watson to put his ruling on hold pending “an immediate request to the Supreme Court for clarification of its ruling,” and even those suing agreed that any disputes remaining after Watson’s order “should be dealt with through expedited appellate review.”\n\nThe Supreme Court is scheduled to hear arguments in the fall on whether Trump’s travel ban can pass legal muster. So far, it has only temporarily blocked lower courts’ injunctions. Some of the justices predicted there might be problems before that.\n\nJustice Clarence Thomas, in an opinion joined by justices Samuel A. Alito Jr. and Neil M. Gorsuch, wrote that he would have restored Trump’s travel ban in full, in part because he felt the court’s move to restore it only partially would prove “unworkable”\n\n“Today’s compromise will burden executive officials with the task of deciding — on peril of contempt — whether individuals from the six affected nations who wish to enter the United States have a sufficient connection to a person or entity in this country,” Thomas wrote. “The compromise also will invite a flood of litigation until this case is finally resolved on the merits, as parties and courts struggle to determine what exactly constitutes a ‘bona fide relationship,’ who precisely has a ‘credible claim’ to that relationship, and whether the claimed relationship was formed ‘simply to avoid’ the executive order, he wrote.\n\nThis story has been updated.", "authors": [], "publish_date": "2017-07-06", "source": "washingtonpost", "top_words": ["ruling", "travel", "relationship", "hawaii", "exempt", "courts", "ban", "supreme", "judge", "court", "united", "states", "trumps", "bid", "rejects", "watson", "grandparents"], "summary": "Grandparents and other extended relatives of people in the United States are not exempt from President Trump’s travel ban, a federal judge effectively decided Thursday as he denied a bid to curtail enforcement of the executive order meant to keep out citizens of six Muslim-majority countries.\nThat means the government, at least for now, can use the travel ban to block citizens of the affected countries if they are the grandparents, grandchildren, aunts, uncles, nieces, nephews, cousins, brothers-in-law or sisters-in-law of people in the United States.\nThe administration had wanted to keep such people out, and thought a recent Supreme Court ruling partially lifting lower courts’ freezes on the travel ban allowed them to do so.\n[What the Supreme Court’s travel ban ruling means]Hawaii, which had initially sued over the ban, objected in court, asking Watson to clarify that such people could not be blocked.\nJustice Department lawyers asserted that the Supreme Court had made clear not all people with U.S. connections should be allowed in."}