{"url": "https://www.washingtonpost.com/news/powerpost/wp/2017/02/12/trumps-first-100-days-white-house-adviser-defends-travel-ban-but-not-flynn/", "id": "122", "title": "Trump’s First 100 Days: White House adviser defends travel ban — but not Flynn", "text": "Here’s where things stand heading into day 25 of the Trump administration:\n\n“Beyond question.”\n\nThat’s how one senior adviser describes President Trump’s powers to issue orders like his controversial travel ban.\n\nStephen Miller, an author of the policy at least temporarily barring entry to the United States for refugees and travelers from seven Muslim-majority countries, used several combative interviews Sunday to outline a broad vision of Trump’s power as president.\n\n\n\nKellyanne Conway, counselor to the president, and senior adviser for policy Stephen Miller at the White House on Jan. 31. (Chip Somodevilla/Getty Images)\n\nMiller also denounced the federal appeals court that ruled last week to keep the travel ban on hold, accusing it of ideological bias and saying the decision represents a “usurpation of power” by the judicial branch.\n\n“It is a violation of judges’ proper roles in litigating disputes,” Miller said on “Fox News Sunday.”\n\n“We have a judiciary that has taken far too much power and become in many cases a supreme branch of government,” he said on CBS’s “Face the Nation.”\n\nAfter the U.S. Court of Appeals for the 9th Circuit ruled against reinstating President Trump's travel ban, White House senior policy adviser Stephen Miller on Feb. 12 defended the policy while Democratic senators continued to oppose it. (Bastien Inzaurralde/The Washington Post)\n\nThe harsh language not only echoes Trump’s unusually strong criticism of the courts. It also suggests the White House considers itself on a collision course with the judicial branch over the limits of presidential power.\n\nAs for the travel ban, Miller said the White House is weighing what to do next. But whatever course it takes, there’s no question about its intention toward the latest ruling.\n\n“We will fight it,” Miller said in an interview on “Fox News Sunday.”\n\nMILLER REPEATS FALSE CLAIM OF VOTER FRAUD\n\nLike Trump himself, the president’s aides cannot seem to let go of the false claim that voter fraud undermined their boss’s performance in the election.\n\nIn an interview with ABC News, Miller said “massive voter fraud” took place Nov. 8 and alluded to Trump’s own belief, shared recently with senators, that thousands of Massachusetts residents were bused into New Hampshire to illegally vote there.\n\nThere is no evidence that this happened, nor that voter fraud took place on a wide scale, which ABC anchor George Stephanopoulos noted during the interview.\n\n“For the record, you have provided zero evidence that the president was the victim of massive voter fraud in New Hampshire. You provided zero evidence that the president’s claim that he would have won the popular vote if 3 million to 5 million illegal immigrants hadn’t voted — zero evidence for either one of those claims,” Stephanopoulos said.\n\nINSIDE TRUMP’S INNER CIRCLE\n\nMiller, at 31, is one of the youngest and most powerful members of the White House staff. But he is not the only senior aide whose status in Trump’s world is drawing attention.\n\nThe figure who is now the center of controversy is national security adviser Michael Flynn, who, according to interviews with nine current and former U.S. officials, discussed U.S. sanctions against Russia with that country’s ambassador before Trump took office.\n\n\n\nMichael Flynn in the White House briefing room on Feb. 1. (Jabin Botsford/The Washington Post)\n\nAs our colleagues wrote, some officials interpreted this contact as an “inappropriate and potentially illegal signal to the Kremlin that it could expect a reprieve” under Trump from sanctions imposed by the Obama administration. But more crucial to Flynn’s future at the White House was this: He allowed other members of Trump’s team, including Vice President Pence, to publicly deny that discussions of sanctions with the ambassador had taken place.\n\nWhite House senior policy adviser Stephen Miller on Feb. 12 declined to say if President Trump still trusts national security adviser Michael Flynn. Meanwhile, Democrats scolded Flynn after The Washington Post reported that Flynn discussed sanctions with Russia's ambassador to the U.S. during the transition of power. (Bastien Inzaurralde/The Washington Post)\n\nFlynn called Pence on Friday in an apparent attempt to contain the fallout. On Sunday, Miller refused to comment on Flynn’s status when asked on several Sunday television shows. It’s unclear what the future holds for him.\n\nThe other top Trump aide facing questions about his future is Reince Priebus, the president’s chief of staff, after a longtime Trump friend took the dramatic step of publicly calling for his replacement.\n\n“It’s my view that Reince is the problem,” Newsmax Media chief executive Christopher Ruddy told The Post. “I think on paper Reince looked good as the chief of staff — and Donald trusted him — but it’s pretty clear the guy is in way over his head.”\n\nRuddy said there are several sitting Cabinet secretaries who agree with him, but he declined to name them.\n\nIMMIGRATION RAIDS RAISE CONCERNS OF TRUMP CRACKDOWN\n\nOn Jan. 25, Trump signed an executive order to crack down on the estimated 11 million undocumented immigrants living in the United States. And last week, hundreds of those immigrants were arrested in a wave of raids by U.S. authorities across at least six states.\n\nThe details of Trump’s immigration enforcement campaign are still coming into focus. But the predominantly daytime raids were enough to raise alarms among immigration advocates, who said the arrests swept up law-abiding people as well as those with criminal records, whom Trump is ostensibly targeting.\n\nAs our colleagues reported, immigration officials “acknowledged that as a result of Trump’s executive order, authorities had cast a wider net than they would have last year.” It is unclear how many of the arrests would have taken place under former President Obama, who was aggressive in deporting undocumented immigrants but prioritized convicted criminals in his second term.\n\nTrump defended the raids on Sunday as the fulfillment of his promise to voters:\n\nThe crackdown on illegal criminals is merely the keeping of my campaign promise. Gang members, drug dealers & others are being removed! — Donald J. Trump (@realDonaldTrump) February 12, 2017\n\nFollow the author @eliseviebeck.", "authors": [], "publish_date": "2017-02-12", "source": "washingtonpost", "top_words": ["100", "travel", "trump", "flynn", "ban", "days", "adviser", "senior", "voter", "president", "trumps", "miller", "defends", "house", "white", "policy"], "summary": "Kellyanne Conway, counselor to the president, and senior adviser for policy Stephen Miller at the White House on Jan. 31.\nIt also suggests the White House considers itself on a collision course with the judicial branch over the limits of presidential power.\nAs for the travel ban, Miller said the White House is weighing what to do next.\nINSIDE TRUMP’S INNER CIRCLEMiller, at 31, is one of the youngest and most powerful members of the White House staff.\nWhite House senior policy adviser Stephen Miller on Feb. 12 declined to say if President Trump still trusts national security adviser Michael Flynn."}