{"url": "https://www.washingtonpost.com/news/worldviews/wp/2017/06/27/trumps-travel-ban-still-doesnt-make-any-sense/", "id": "18", "title": "Trump’s travel ban still doesn’t make any sense", "text": "Want smart analysis of the most important news in your inbox every weekday along with other global reads, interesting ideas and opinions to know? Sign up for the Today's WorldView newsletter.\n\nIt's not surprising that President Trump was \"very pleased\" following the Supreme Court's decision on Monday to partially reinstate the White House's travel ban on refugees and citizens of six Muslim-majority countries. Two iterations of the controversial executive order prompted protests at airports and legal challenges, and both were thwarted by injunctions issued by federal courts. For a president short of significant political victories and surrounded by scandal, the high court's announcement felt like a win.\n\nVery grateful for the 9-O decision from the U. S. Supreme Court. We must keep America SAFE! — Donald J. Trump (@realDonaldTrump) June 26, 2017\n\nBut it's hardly a triumph. The Supreme Court decided to allow a limited version of the ban to come into effect — targeting the supposedly \"terror-prone\" countries of Iran, Syria, Yemen, Somalia, Libya and Sudan — but it will hear arguments in the case in the fall.\n\nGiven that the executive order was framed as a temporary stopgap while the Trump administration revamped vetting procedures, the court may very well rule there is no longer a need for such a blanket ban. Other observers counter that the nature of the court's unsigned opinion suggests its justices are seeking compromise and will be loath to take such a politically provocative act as scrapping the ban outright.\n\nMoreover, the court made a significant exemption: It said the ban \"may not be enforced against foreign nationals who have a credible claim of a bona fide relationship with a person or entity in the United States.\"\n\nWhat does this mean in practice? \"For now, if you have a relative here, have been hired by a U.S. employer or admitted to a U.S. university, you can still probably get a visa,\" explained my colleague Matt Zapotosky. \"But if you’re applying cold as a visitor or through the diversity visa program, you probably can’t.\"\n\nIt is already extremely difficult to get a visa to the United States from most developing countries without the right family connections or justification, such as enrollment in an American university. As a result, the pool of people likely blocked by the current ban has shrunk drastically. Of course, refugees still remain frozen out — unfairly so, as I explained earlier.\n\nUndoubtedly, the new status quo will throw up its own wrinkles and challenges. Who, for example, decides what a \"bona fide relationship\" is?\n\nBut whatever the case, it's important to remember that the travel ban on its face makes very little sense. The two federal appeals courts that ruled against it said separately that Trump's order was both discriminatory toward Muslims and not necessary for national security, despite the White House's continued insistence.\n\n\"There is no finding that present vetting standards are inadequate, and no finding that absent the improved vetting procedures there likely will be harm to our national interests,\" the judges of the 9th Circuit wrote. \"These identified reasons do not support the conclusion that the entry of nationals from the six designated countries would be harmful to our national interests.\"\n\nNot a single person has died in a terrorist attack on American soil carried out by a citizen from one of the six nations covered by the ban. Since the Refugee Act of 1980 set up a system for vetting refugees to the United States, no person accepted as a refugee has been implicated in a fatal terrorist attack. Critics of the order have also nitpicked in the past about the absence of other \"terror-prone\" nations in the ban's purview, such as Pakistan, Afghanistan or even Saudi Arabia, whence 15 of the 9/11 attackers came. And, while Trump voices fear over foreign threats, he has been conspicuously quiet about the scourge of domestic terrorism within the United States.\n\n\n\nMourners at a memorial for the victims of the 2016 Pulse nightclub shooting in Orlando. (Amanda Voisard)\n\nThe broader point the ban's opponents make is that singling out immigrants, tourists and refugees based on their country of origin will do little to keep the United States safe, while badly damaging the nation's reputation abroad.\n\n\"Far from being foreign infiltrators, the large majority of jihadist terrorists in the United States have been American citizens or legal residents. Moreover, while a range of citizenship statuses are represented, every jihadist who conducted a lethal attack inside the United States since 9/11 was a citizen or legal resident,\" concluded a recent report by the New America Foundation. \"In addition about a quarter of the extremists are converts, further confirming that the challenge cannot be reduced to one of immigration.\"\n\nThe judges of the 9th Circuit added that simply emphasizing the imperatives of national security can't be a \" 'talismanic incantation' that, once invoked, can support any and all exercise of executive power.\"\n\nThe White House repeatedly points to the efforts of the Obama administration, which originally drew up this list of seven countries that required further scrutiny when vetting visa applications. But President Barack Obama never called for citizenship-based immigration bans and actively pushed for Syrian refugee resettlement in the face of heated domestic opposition.\n\nThe underlying impetus has always been Trump's desire to make real a campaign promise for some kind of Muslim ban — \"a total and complete shutdown of Muslims entering the United States,\" as he put it in 2015. Taking into account the statements of both Trump and his allies before and after last year's election, the 4th Circuit court had ruled that the executive order \"in context drips with religious intolerance, animus and discrimination.\"\n\nThe Supreme Court's decision on Monday doesn't strip away the moral validity of the arguments posed by the ban's critics. And the court's justices wrote \"the relief we grant today\" should enable the White House \"to conclude its internal work and provide adequate notice to foreign governments within the 90-day life of [the order].\" If the Trump administration seeks to extend the ban well beyond the summer, it will be all the more clear that its motives aren't quite as benign as it claims.\n\nWant smart analysis of the most important news in your inbox every weekday along with other global reads, interesting ideas and opinions to know? Sign up for the Today's WorldView newsletter.", "authors": [], "publish_date": "2017-06-27", "source": "washingtonpost", "top_words": ["sense", "travel", "courts", "trump", "ban", "vetting", "order", "court", "united", "trumps", "countries", "states", "white", "doesnt"], "summary": "But whatever the case, it's important to remember that the travel ban on its face makes very little sense.\nAnd, while Trump voices fear over foreign threats, he has been conspicuously quiet about the scourge of domestic terrorism within the United States.\n\"Far from being foreign infiltrators, the large majority of jihadist terrorists in the United States have been American citizens or legal residents.\nThe underlying impetus has always been Trump's desire to make real a campaign promise for some kind of Muslim ban — \"a total and complete shutdown of Muslims entering the United States,\" as he put it in 2015.\nThe Supreme Court's decision on Monday doesn't strip away the moral validity of the arguments posed by the ban's critics."}