{"url": "https://www.washingtonpost.com/news/volokh-conspiracy/wp/2017/03/10/states-challenge-trumps-revised-travel-ban-in-court/", "id": "103", "title": "States challenge Trump’s revised travel ban in court", "text": "State seal of Hawaii, the state that filed the first lawsuit challenging Trump’s revised travel ban.\n\nSeveral states have now filed legal challenges to Donald Trump’s revised travel order temporarily banning citizens of six Muslim-majority nations from entering the United States. The first of the new lawsuits was filed by Hawaii, and now Washington, Oregon, and other states have also challenged the order. Hawaii’s legal team challenging the order is led by Georgetown law professor Neal Katyal, a well-known and widely respected constitutional law scholar, and former deputy solicitor general in the Obama administration. Hawaii’s complaint and other documents related to the case are available here.\n\nIn my view, the new order is unconstitutional for some of the same reasons as the original version. It continues to be driven by hostility to Muslims, and the security rationale for it remains extremely weak, a circumstance that makes it harder for the administration to show that religious discrimination is not the true motivation for the order. It also should not matter that the order only targets some of the world’s Muslims, but not all of them. Discriminating against some members of a group based on their religion is still discrimination, even if not all adherents of that faith are affected. This issue was effectively dealt with in the Virginia federal district court ruling against Trump’s initial order.\n\nI honestly do not know which way the courts will go on this. The new order does address some of the key vulnerabilities of the old one, and that could incline judges to be more deferential to the president, even though such deference would be a mistake.\n\nWhichever way the new cases go, the litigation over both the original travel order and the new one is a notable example of state efforts to combat abuses by the federal government. Just as the red states used lawsuits to oppose constitutional overreach by the Obama administration, so the blue states are doing so under Trump. I am one of the relatively few commentators to support many of the state efforts under both administrations, because I believe that the federal government has accrued too much power in many areas, and needs to be curbed regardless of who happens to be in the White House.\n\nIronically, Neal Katyal and I are both veterans of the legal struggle over the constitutionality of the Obamacare individual mandate, where we were on opposite sides. We are much more on the same page this time around. In fairness to Katyal, the two cases raise very different legal issues, though I believe they are also similar in so far as both involve dubious assertions of nearly unfettered authority by the federal government, overriding normal constitutional constraints. Hopefully, state resistance will help curb federal overreach under Trump, just as it was sometimes effective under the previous administration.\n\nUPDATE: I have made a few additions to this post.", "authors": [], "publish_date": "2017-03-10", "source": "washingtonpost", "top_words": ["travel", "revised", "katyal", "ban", "challenge", "state", "constitutional", "court", "order", "trumps", "federal", "filed", "states", "legal"], "summary": "State seal of Hawaii, the state that filed the first lawsuit challenging Trump’s revised travel ban.\nSeveral states have now filed legal challenges to Donald Trump’s revised travel order temporarily banning citizens of six Muslim-majority nations from entering the United States.\nThe first of the new lawsuits was filed by Hawaii, and now Washington, Oregon, and other states have also challenged the order.\nThis issue was effectively dealt with in the Virginia federal district court ruling against Trump’s initial order.\nJust as the red states used lawsuits to oppose constitutional overreach by the Obama administration, so the blue states are doing so under Trump."}