{"url": "https://www.washingtonpost.com/news/dr-gridlock/wp/2017/02/01/heres-why-airlines-were-scrambling-after-trumps-travel-ban/", "id": "185", "title": "Here’s why airlines were scrambling after Trump’s travel ban", "text": "\n\nDemonstrators gather to protest against President Trump’s travel ban, outside of the international arrivals terminal at Philadelphia International Airport on Jan. 29, 2017. Trump issued an executive order on Jan. 27, barring entry to people from seven Muslim-majority countries for 90 days, as well as an indefinite block of Syrian refugees. (EPA/TRACIE VAN AUKEN)\n\nOfficials with the Department of Homeland Security on Tuesday issued written guidance designed to give airlines and travelers a clearer understanding of new rules barring people from seven Muslim-majority countries from entering the U.S.\n\nThe goal is to prevent a repeat of the chaotic scenes that played out over the weekend after hundreds of people affected by the ban arrived in the U.S. only to be told they would not be allowed to enter the country.\n\n“We are also working closely with airline partners to prevent travelers who would not be granted entry under the Executive Orders from boarding international flights to the United States,” said officials with U.S. Customs and Border Protection, the department charged with implementing President Trump’s order.\n\nThe updated website includes a summary of the executive order as well as a question and answer section. Travelers can click here for a link to answers on questions about their own status.\n\n[Trump travel ban sows chaos at airports; outrage at protests]\n\nEven in an industry accustomed to quickly adopting security initiatives, airline officials said Trump’s order was difficult to carry out because there was no advance notice. Unlike other instances when changes have been made to security rules, airlines weren’t briefed until several hours after the executive order was put into place. As a result, many travelers who were barred from entering the U.S. already were in route.\n\n“The [executive order] was issued without prior coordination or warning, causing confusion among both airlines and travelers,” officials with the International Air Transport Association (IATA) said in a written statement. IATA, one of the largest industry trade groups, represents more than 260 airlines in 117 countries.\n\nOfficials with CBP said they held a conference call with airlines late Friday night. A second phone briefing was held early Saturday morning. But even as CBP officials outlined the order, which temporarily bans refugees and citizens from seven Muslim-majority countries Iraq, Iran, Sudan, Somalia, Syria, Libya and Yemen from entering the U.S., the policy was being challenged in several courts including in New York, Boston, California and Virginia.\n\nThe resulting rulings caused additional confusion since rules for a traveler landing in Boston were different from those landing in Los Angeles.\n\nJohn McDonald, a retired airline executive who worked for four airlines, said the speed with which the order was applied created chaos for airlines.\n\n“These are what we in the airline business used to call self-inflicted gunshot wounds,” said McDonald, who runs the consulting firm Caeli Communications. “There is no reason for this to have happened.”\n\nAirlines, he said, have procedures in place to communicate these type of policy changes. First there is communication between the airline and the federal agency involved. That communication prior to an executive order is important, he said.\n\nIt was clear, he said, from what happened initially when green-card holders were denied entry into the United States that the airlines didn’t quite grasp what the order required. The typical FAQ that the airlines put out to reservation agents, gate agents, ticket counters, and crews and on their websites was not available, he said. (In a situation like this, the airline creates that FAQ, it is reviewed by the agency that is enforcing the policy (in this case CBP), and it tries to address all possible questions passengers might have.)\n\n“There is a real need to communicate between the federal government and the regulatory authorities and the airlines in advance of these kinds of orders, so they can properly plan for the implementation,” he said. “They have to talk to the customers… It is up to the airlines to know which visas are required for them to board an aircraft for a particular destination. So the reservations people have information to communicate to the public when they are making reservations or planning their travel.”\n\nAt a news conference Tuesday, acting CBP Commissioner Kevin K. McAleenan said officials moved as quickly as they could to provide accurate information. He noted that the department put provisions in place to account for individuals already in transit when the order went into effect. CBP’s legal team also worked through the weekend to determine how a series of court decisions should be handled by CBP staff on the ground, he said.\n\n[Trump defends executive order: “This is not a Muslim ban\"]\n\nMcAleenan said in the first 72 hours of the executive order, 1 million people traveled to the U.S via plane. Of those, 500,000 were foreign nationals. In all, officials denied boarding to 721 travelers who had visas from the affected countries. CBP however, did process waivers for 1,060 lawful permanent residents. An additional, 75 waivers given to immigrant visa holders and non-immigrant, he said.\n\nIATA said it sent a detailed email to all its members outlining the new travel requirements. Even so, officials with the trade group noted that “ . . . some policy questions were answered, but a number have yet to be resolved. “\n\nThere are signs that problems at airports are waning. Many international carriers implemented procedures to prevent those covered by the ban from boarding U.S.-bound flights. Most have offered fee waivers or refunds to travelers who opted to change their travel plans. Delta Air Lines pro-actively reached out to affected passengers.\n\n“At this point focus in the industry is how these new measure should be implemented, in a way that doesn’t cause confusion to travelers,” said Anthony Concil, IATA’s vice president for communications.\n\nAnn Zaninovich, spokeswoman for Alaska Airlines & Horizon Air, said agents continue to review international document requirements as passengers check-in – a standard procedure for international flights.\n\nAirlines, including some Middle East-based carriers such as Emirates, also have had to make changes to their flight crews to ensure pilots and flight attendants that would be barred from entering the U.S. are not working on affected flights.\n\n“That is an operational problem because if you have a crew that comes into the United States and somebody gets denied entry then they have to immediately return to the country they came from and that can short you for crew members and delay or change flights,” said McDonald, the airline consultant.\n\nStill, even as airlines put the policy into place, some voiced concern about the message it sent.\n\nIn a message to employees, Doug Parker, president of American Airlines wrote:", "authors": [], "publish_date": "2017-02-01", "source": "washingtonpost", "top_words": ["heres", "executive", "travel", "scrambling", "international", "ban", "cbp", "travelers", "order", "officials", "trumps", "airlines", "airline", "policy"], "summary": "Demonstrators gather to protest against President Trump’s travel ban, outside of the international arrivals terminal at Philadelphia International Airport on Jan. 29, 2017.\nThe updated website includes a summary of the executive order as well as a question and answer section.\nUnlike other instances when changes have been made to security rules, airlines weren’t briefed until several hours after the executive order was put into place.\nJohn McDonald, a retired airline executive who worked for four airlines, said the speed with which the order was applied created chaos for airlines.\n[Trump defends executive order: “This is not a Muslim ban\"]McAleenan said in the first 72 hours of the executive order, 1 million people traveled to the U.S via plane."}