{"url": "https://www.washingtonpost.com/news/politics/wp/2017/06/29/the-travel-ban-going-into-effect-would-have-saved-zero-lives-from-terrorist-attacks-in-the-last-20-years/", "id": "171", "title": "The travel ban going into effect would have saved zero lives from terrorist attacks in the last 20 years", "text": "\n\nPeople protest and welcome arriving passengers at Dulles International Airport in Virginia, on Jan. 28. (Astrid Riecken for The Washington Post)\n\nAt 8 p.m. Eastern on Thursday, President Trump’s ban on travel from six mostly Muslim countries will go into partial effect.\n\nAfter months during which the ban was stayed by federal judges, the Supreme Court this week allowed the administration’s bar on entry for visitors from Libya, Iran, Somalia, Sudan, Syria and Yemen to move forward — with a big caveat. Those with a “bona fide” connection to the country, including having a job or being enrolled in college, had to be allowed in. So, too, did those seeking entry who have a close family member in the United States.\n\nWhat’s a close family member? On Wednesday night, the State Department issued guidelines that clarified.\n\n“Close family” is defined as a parent (including parent-in-law), spouse, child, adult son or daughter, son-in-law, daughter-in-law, sibling, whether whole or half. This includes step relationships. “Close family” does not include grandparents, grandchildren, aunts, uncles, nieces, nephews, cousins, brothers-laws and sisters-in-law, fiances, and any other “extended” family members.\n\nOr, put visually:\n\nIf someone in one of those darker-colored boxes is in the United States, the applicant can gain entry. If not, no dice.\n\nTrump has repeatedly promoted his travel ban as a necessary step to protect the United States from the threat of international terrorism. He celebrated the Supreme Court’s decision this week on Twitter.\n\nVery grateful for the 9-O decision from the U. S. Supreme Court. We must keep America SAFE! — Donald J. Trump (@realDonaldTrump) June 26, 2017\n\n(The decision was not 9-to-0, incidentally.)\n\nNaturally, then, the question arises: How safe will this ban keep us?\n\nIt’s impossible to answer, of course, given that we may never know that someone who intended to commit a terrorist act in the United States was denied admission to the country. But we can use past acts as something of a guide.\n\nBelow, a list of successful and attempted terrorist attacks linked to radical Islamic ideology in the United States over the past 20 years, and an assessment of whether the travel ban about to go into effect might have prevented them.\n\nAugust 1997. Two men with Jordanian passports are arrested in New York before they could bomb public transit in the city. Would the ban have prevented this? No. Jordan isn’t on the list.\n\nTwo men with Jordanian passports are arrested in New York before they could bomb public transit in the city. Would the ban have prevented this? No. Jordan isn’t on the list. December 1999. A man from Algeria is arrested after entering the United States in Washington. His car is loaded with explosives; he planned to attack Los Angeles International Airport. Would the ban have prevented this? No, and he was detained at the border anyway.\n\nA man from Algeria is arrested after entering the United States in Washington. His car is loaded with explosives; he planned to attack Los Angeles International Airport. Would the ban have prevented this? No, and he was detained at the border anyway. September 2001. The attacks in New York and Washington, committed by 19 individuals from Saudi Arabia, the United Arab Emirates, Egypt and Lebanon. Would the ban have prevented this? No. None of those countries is on the list.\n\nThe attacks in New York and Washington, committed by 19 individuals from Saudi Arabia, the United Arab Emirates, Egypt and Lebanon. Would the ban have prevented this? No. None of those countries is on the list. December 2001. Richard Reid, a British citizen, attempts to light a shoe bomb on a plane to Miami. Would the ban have prevented this? No, Britain is not on the list.\n\nRichard Reid, a British citizen, attempts to light a shoe bomb on a plane to Miami. Would the ban have prevented this? No, Britain is not on the list. July 2002. A shooter from Egypt opens fire at a the El Al counter at LAX. Would the ban have prevented this? No, Egypt is not on the list.\n\nA shooter from Egypt opens fire at a the El Al counter at LAX. Would the ban have prevented this? No, Egypt is not on the list. March 2006. An Iran-born U.S. citizen drives an SUV into a group of people at the University of North Carolina, injuring nine. Would the ban have prevented this? Possibly . He came to the country at the age of 2 before being naturalized. It’s not clear if his parents had family in the country at the time.\n\nAn Iran-born U.S. citizen drives an SUV into a group of people at the University of North Carolina, injuring nine. Would the ban have prevented this? . He came to the country at the age of 2 before being naturalized. It’s not clear if his parents had family in the country at the time. July 2006. A man opens fire at a Jewish organization in Seattle. Would the ban have prevented this? No. He was a citizen, born in the United States.\n\nA man opens fire at a Jewish organization in Seattle. Would the ban have prevented this? No. He was a citizen, born in the United States. June 2009. A man opens fire at a military recruiting center in Little Rock. Would the ban have prevented this? No. He was a citizen, born in the United States.\n\nA man opens fire at a military recruiting center in Little Rock. Would the ban have prevented this? No. He was a citizen, born in the United States. November 2009. The shooting at Fort Hood, Tex. Would the ban have prevented this? No. He was a citizen, born in the United States.\n\nThe shooting at Fort Hood, Tex. Would the ban have prevented this? No. He was a citizen, born in the United States. December 2009. A Nigerian-born man attempts to detonate a bomb on a flight to Detroit. Would the ban have prevented this? No. Nigeria isn’t on the list.\n\nA Nigerian-born man attempts to detonate a bomb on a flight to Detroit. Would the ban have prevented this? No. Nigeria isn’t on the list. May 2011. Two Iraqi nationals are arrested in Bowling Green, Ky., for aiding terrorist attacks outside the United States. Would the ban have prevented this? No. Iraq isn’t on the list.\n\nTwo Iraqi nationals are arrested in Bowling Green, Ky., for aiding terrorist attacks outside the United States. Would the ban have prevented this? No. Iraq isn’t on the list. April 2013. Two bombs are detonated at the Boston Marathon. Would the ban have prevented this? No. The Tsarnaev brothers were born in the Soviet Union and Kyrgyzstan. One was a naturalized citizen, the other a green-card holder.\n\nTwo bombs are detonated at the Boston Marathon. Would the ban have prevented this? No. The Tsarnaev brothers were born in the Soviet Union and Kyrgyzstan. One was a naturalized citizen, the other a green-card holder. April-June 2014. A man in Washington murders several individuals in separate incidents. Would the ban have prevented this? No. He was a citizen, born in the United States.\n\nA man in Washington murders several individuals in separate incidents. Would the ban have prevented this? No. He was a citizen, born in the United States. October 2014. A man in Queens attacks police officers with a hatchet. Would the ban have prevented this? No. He was a citizen, born in the United States.\n\nA man in Queens attacks police officers with a hatchet. Would the ban have prevented this? No. He was a citizen, born in the United States. May 2015. Two men attempt to attack an event in Garland, Tex. Would the ban have prevented this? No. Both were citizens, born in the United States.\n\nTwo men attempt to attack an event in Garland, Tex. Would the ban have prevented this? No. Both were citizens, born in the United States. July 2015. A man opens fire at military installations in Chattanooga. Would the ban have prevented this? No. He was a naturalized citizen from Kuwait.\n\nA man opens fire at military installations in Chattanooga. Would the ban have prevented this? No. He was a naturalized citizen from Kuwait. December 2015. A married couple attack a holiday party in San Bernardino, Calif. Would the ban have prevented this? No. One was a citizen born in the United States, the other a native of Pakistan.\n\nA married couple attack a holiday party in San Bernardino, Calif. Would the ban have prevented this? No. One was a citizen born in the United States, the other a native of Pakistan. January 2016. A man shoots a police officer in Philadelphia. Would the ban have prevented this? No. The shooter appears to have been a native citizen.\n\nA man shoots a police officer in Philadelphia. Would the ban have prevented this? No. The shooter appears to have been a native citizen. February 2016. A man attacks diners at a restaurant in Ohio with a machete. Would the ban have prevented this? No. He was a native of Guinea and held a green card.\n\nA man attacks diners at a restaurant in Ohio with a machete. Would the ban have prevented this? No. He was a native of Guinea and held a green card. June 2016. Shooting at the Pulse nightclub in Orlando. Would the ban have prevented this? No. The shooter was born in Queens.\n\nShooting at the Pulse nightclub in Orlando. Would the ban have prevented this? No. The shooter was born in Queens. September 2016. A stabbing attack at a mall in Minnesota. Would the ban have prevented this? No. The attacker was born in Kenya and moved to the United States at the age of 3 months.\n\nA stabbing attack at a mall in Minnesota. Would the ban have prevented this? No. The attacker was born in Kenya and moved to the United States at the age of 3 months. September. A bomb is detonated in Manhattan. Would the ban have prevented this? No. The attacker was born in Afghanistan and was a naturalized citizen.\n\nA bomb is detonated in Manhattan. Would the ban have prevented this? No. The attacker was born in Afghanistan and was a naturalized citizen. November. A student at Ohio State University drives his car into a crowd, injuring 11. Would the ban have prevented this? Possibly . The attacker was born in Somalia and had been living in Pakistan when he immigrated in 2014.\n\nA student at Ohio State University drives his car into a crowd, injuring 11. Would the ban have prevented this? . The attacker was born in Somalia and had been living in Pakistan when he immigrated in 2014. January. A man opens fire at the Fort Lauderdale airport. Would the ban have prevented this? No. He was a citizen, born in the United States.\n\nOf the 24 attacks listed above, only two might have been prevented had the perpetrator been subject to the full travel ban Trump has proposed. One would have had to have been rejected at the age of 2. No deaths would have been prevented.\n\nIt’s clear that Trump and his administration have embraced the travel ban as a symbol of their efforts to combat terrorism. It’s not clear, though, that the ban will actually do much to accomplish that goal.", "authors": [], "publish_date": "2017-06-29", "source": "washingtonpost", "top_words": ["travel", "lives", "born", "naturalized", "ban", "opens", "man", "terrorist", "zero", "going", "saved", "prevented", "united", "citizen", "states", "attacks", "20", "effect"], "summary": "So, too, did those seeking entry who have a close family member in the United States.\nOr, put visually:If someone in one of those darker-colored boxes is in the United States, the applicant can gain entry.\nTrump has repeatedly promoted his travel ban as a necessary step to protect the United States from the threat of international terrorism.\nTwo Iraqi nationals are arrested in Bowling Green, Ky., for aiding terrorist attacks outside the United States.\nTwo Iraqi nationals are arrested in Bowling Green, Ky., for aiding terrorist attacks outside the United States."}