{"url": "https://www.washingtonpost.com/news/wonk/wp/2017/02/01/big-pharma-depends-on-immigrants-it-kept-quiet-about-the-travel-ban/", "id": "163", "title": "Big pharma depends on immigrants. It kept quiet about Trump’s travel ban.", "text": "\n\nMerck chief executive Ken Frazier, left, talks with President Trump during a meeting with pharmaceutical industry leaders in the Roosevelt Room of the White House. (Jabin Botsford/The Washington Post)\n\nAs leaders from across the business world chimed in to speak against the temporary travel ban President Trump implemented last week on citizens from seven predominantly Muslim countries and refugees, one industry that relies on immigrant labor stayed under the radar: big pharma.\n\nAccording to a 2014 study by researchers at George Mason University, immigrants made up 13 percent of the U.S. population in 2011, but constituted 17 percent of the pharmaceutical industry labor force. That reliance has only increased according to Justin Lowry, a postdoctoral researcher at George Mason's Institute for Immigration Research: An estimate using 2015 data shows that immigrants made up 23 percent of the pharma workforce. Lowry said the industry is “very heavily reliant” on foreign-born workers.\n\nAnd among those who work in research and development — the engine of discovery and innovation for the industry — immigrants made up one-third of the labor force, according to the 2014 report. Foreign-born scientists made up 43 percent of medical and life scientists, the study found.\n\n[Trump calls for lower drug prices, fewer regulations in meeting with pharmaceutical executives]\n\n“In general, intellectual endeavors in the U.S. -- education, research — they rely on immigrants,” Lowry said. “It’s important to have innovation, and innovation comes from diversity. A difference in perspective allows for a difference in approach.”\n\n\n\n(George Mason University Institute for Immigration Research)\n\nYet in the run-up to a big meeting Tuesday morning with Trump, the pharmaceutical industry was muted compared with other big businesses responding to the ban.\n\nPharmaceutical Research and Manufacturers of America (PhRMA), the trade group that represents the industry and usually speaks on its behalf, said it didn't have a comment about the ban. Neither did Pfizer, one of the world's largest pharmaceutical companies. And those that did have a response to the ban often struck a neutral tone and focused on its employees.\n\n“We are working to fully understand the implications of the Executive Order on our business and our employees,” AstraZeneca said in a statement.\n\n“Upholding our steadfast commitment to associates of all nationalities and religions is core to our values as we work to address society's most pressing healthcare challenges,” a Novartis statement said, noting that to date there had been no disruption to Novartis employees as a result of the order.\n\nLeaders in the biotech industry, on the other hand, were more vocal.\n\n“The travel ban is causing confusion among several of my company's associates and I have been told by other biotech CEOs of similar responses across the industry,” Ron Cohen, a chief executive of Acorda Therapeutics, said in an email. “This is a difficult situation for scientists, doctors and other professionals whom we rely on to help invent and develop new treatments and cures for disease. If we restrict travel excessively, they will go elsewhere and their talents will enrich other countries.”\n\n[Judge says Aetna dropped out of some Obamacare markets to help win its merger fight]\n\nIt's not necessarily surprising that pharmaceutical leaders didn't take a vocal public stand on Trump's policy ahead of such a high-profile meeting. The industry has been hammered by Trump and accused of “getting away with murder” on pricing. The trade group launched a major ad campaign last week aimed at changing its image after a year of blistering congressional hearings and news stories about rising drug prices. The industry has been trying to fend off any government intervention on pricing.\n\nAfter the meeting at the White House, Merck chief executive Kenneth Frazier answered a reporter's question about the ban.\n\n“We have employees from around the world; we have to get the best scientists, the best employees around the world, so having access to those employees and having an environment in our companies that stimulates diversity and inclusion is very important to us,” Frazier said.\n\nBut the George Mason researchers said that the industry's competitive edge going forward may depend in large part on keeping and attracting its immigrant workforce for a reason none of those leaders brought up. Immigrants tend to come from countries that have fast-growing pharmaceutical markets — places where U.S. companies would like to sell drugs. In other words, if those immigrant workers are deterred, they could easily become part of the competition.\n\n“Given that the majority of immigrants within the pharmaceutical industry are from the world’s fastest growing pharmaceutical markets, the U.S. may benefit from the continued encouragement of immigration from those regions,” the authors said. “Failing to do so carries the risk that those individuals will use their skills and talents to build the pharmaceutical industries in the very countries that are emerging as the leading competitors to the U.S. pharmaceutical industry.”\n\n\n\n(George Mason University Institute for Immigration Research)\n\nMore from Wonkblog:\n\nTo fight their negative image on prices, drug companies launch a major ad campaign that doesn’t mention them\n\nA single chart everybody needs to look at before Trump’s big fight over bringing back American jobs\n\nHigh prices make once-neglected 'orphan' drugs a booming business\n\nWhy Obamacare’s insurance marketplaces won’t necessarily collapse with a repeal", "authors": [], "publish_date": "2017-02-01", "source": "washingtonpost", "top_words": ["travel", "industry", "trump", "immigrants", "ban", "prices", "big", "depends", "pharmaceutical", "research", "trumps", "pharma", "meeting", "quiet", "scientists", "employees", "mason", "kept"], "summary": "Merck chief executive Ken Frazier, left, talks with President Trump during a meeting with pharmaceutical industry leaders in the Roosevelt Room of the White House.\nAccording to a 2014 study by researchers at George Mason University, immigrants made up 13 percent of the U.S. population in 2011, but constituted 17 percent of the pharmaceutical industry labor force.\nAnd among those who work in research and development — the engine of discovery and innovation for the industry — immigrants made up one-third of the labor force, according to the 2014 report.\nPharmaceutical Research and Manufacturers of America (PhRMA), the trade group that represents the industry and usually speaks on its behalf, said it didn't have a comment about the ban.\n“Given that the majority of immigrants within the pharmaceutical industry are from the world’s fastest growing pharmaceutical markets, the U.S. may benefit from the continued encouragement of immigration from those regions,” the authors said."}