{"url": "https://www.washingtonpost.com/news/volokh-conspiracy/wp/2017/03/16/two-federal-courts-rule-against-trumps-revised-travel-ban/", "id": "116", "title": "Two federal courts rule against Trump’s revised travel ban", "text": "\n\nU.S. President Donald Trump speaks on the phone on Saturday, Jan. 28, 2017. Photographer: Pete Marovich/Pool via Bloomberg\n\nOver the last 24 hours, two federal courts have issued rulings suspending President Trump’s revised executive order temporarily banning citizens of six majority-Muslim nations from entering the United States. One of the decisions was issued yesterday by a federal district court in Hawaii, as a result of a lawsuit brought by the state of Hawaii and other plaintiffs. The second ruling, issued just this morning, comes from the federal district court in Maryland.\n\nAs I predicted might be the case, both judges conclude that the revised ban is likely unconstitutional because it discriminates against Muslims and is motivated by hostility towards them, despite the fact that it does not explicitly mention them in the text. Both rely on the extensive statements by Trump and his advisers that reveal their purposes. I defended the use of such evidence here.\n\nThe Maryland decision summarizes the issue well:\n\nThese statements, which include explicit, direct statements of President Trump’s animus towards Muslims and intention to impose a ban on Muslims entering the United States, present a convincing case that the First Executive Order was issued to accomplish, as nearly as possible, President Trump’s promised Muslim ban. In particular, the direct statements by President Trump and Mayor Giuliani’s account of his conversations with President Trump reveal that the plan had been to bar the entry of nationals of predominantly Muslim countries deemed to constitute dangerous territory in order to approximate a Muslim ban without calling it one-precisely the form of the travel ban in the First Executive Order…. [T]he history of public statements continues to provide a convincing case that the purpose of the Second Executive Order remains the realization of the long-envisioned Muslim ban. The Trump Administration acknowledged that the core substance of the First Executive Order remained intact. Prior to its issuance, on February 16, 2017, Stephen Miller, Senior Policy Advisor to the President, described the forthcoming changes as “mostly minor technical differences,” and stated that the “basic policies are still going to be in effect.”\n\nWhile the new order does contain some important changes relative to the original one, most of them reduce its vulnerability to due process challenges. They do little to protect it on the religious discrimination front.\n\nBoth rulings contain detailed recitations of the public statements and their relevance. The Maryland decision is, once again, particularly strong on this. Both also contain strong responses to various arguments defending the order, such as the claim that it does not discriminate against Muslims because it does not cover all Muslim-majority nations. I criticized the latter argument here; it was also effectively rebutted in the Virginia federal district court ruling against Trump’s original order.\n\nLike the Virginia district court ruling against the original order, both of the new decisions consider the religious discrimination issue under the Establishment Clause of the First Amendment. For reasons I have outlined previously, I believe the religious discrimination issue is better addressed under the Equal Protection Clause and the Free Exercise Clause. But the Supreme Court’s Establishment Clause precedents also cover religious discrimination, and the two new decisions follow those precedents closely.\n\nThe Maryland ruling also concludes that the executive order is likely illegal because the President lacked congressional authorization for his actions. Section 1152(a) of the Immigration and Nationality Act of 1965 bars discrimination in the issuance of “immigrant visa[s]” on the basis of “race, sex, nationality, place of birth or place of residence.” The court concludes that Trump’s order violates this because it bars the issuance of visas to citizens of six specific nations, based on their nationality. This argument was previously advanced by David Bier of the Cato Institute. But it has not previously been the basis for any of the decisions against the original travel ban. The issue bears watching in the future.\n\nBoth rulings are also notable for refusing to defer to the executive merely because the case involves immigration. Like the judicial decisions against the original order, they represent further indications that the “plenary power” doctrine, supposedly immunizing immigration actions from constitutional challenges that apply to other government policies, is not as robust as its more enthusiastic champions would like it to be.\n\nLike the rulings against the original order, these new decisions merely issue a preliminary injunction (Maryland) or temporary restraining order(Hawaii) preventing the challenged parts of the order from going into effect until the court can reach a final decision. But both also make clear that the final ruling is highly likely to go against the administration.\n\nBoth decisions also find that the plaintiffs have standing to challenge the new order, on a wide range of different grounds. For example, the Hawaii ruling concludes that the state government has standing because the order prevents travel by potential students and visitors to its state universities. The Maryland ruling grants standing to relatives of citizens of the affected nations who are applying for visas to enter the United States. In my view, the state standing granted to Hawaii is consistent with previous decisions broadly construing standing for state governments, including those who challenged President Obama’s executive action on immigration.\n\nThe two district court decisions are just the beginning of what may well be a prolonged legal battle over the revised order. The administration will surely appeal them. Indeed, Trump has already said he intends to fight the issue all the way to the Supreme Court. In the same speech, he also said that the new order is just a “watered-down version of the first one,” a statement that will surely be used against him by the plaintiffs as litigation proceeds.\n\nIt is hard to say how this legal battle will ultimately be resolved. Certainly, it is far from over. But one thing is clear: the new order remains vulnerable to legal challenge and is not as secure against them as some commentators initially thought.", "authors": [], "publish_date": "2017-03-16", "source": "washingtonpost", "top_words": ["executive", "ruling", "travel", "original", "courts", "revised", "trump", "ban", "court", "trumps", "rule", "statements", "federal", "order", "president", "decisions"], "summary": "Photographer: Pete Marovich/Pool via BloombergOver the last 24 hours, two federal courts have issued rulings suspending President Trump’s revised executive order temporarily banning citizens of six majority-Muslim nations from entering the United States.\nThe Trump Administration acknowledged that the core substance of the First Executive Order remained intact.\nI criticized the latter argument here; it was also effectively rebutted in the Virginia federal district court ruling against Trump’s original order.\nBut it has not previously been the basis for any of the decisions against the original travel ban.\nThe two district court decisions are just the beginning of what may well be a prolonged legal battle over the revised order."}