{"url": "https://www.washingtonpost.com/opinions/after-a-ruling-on-trumps-travel-ban-all-eyes-are-on-the-4th-circuit/2017/06/02/b7a555f2-4545-11e7-bcde-624ad94170ab_story.html", "id": "135", "title": "After a ruling on Trump’s travel ban, all eyes are on the 4th Circuit", "text": "Protesters hold signs and march outside the U.S. Court of Appeals for the 4th Circuit, in Richmond on May 8. (Steve Helber/Associated Press)\n\nThe U.S. Court of Appeals for the 4th Circuit is a court in transition. The Richmond-based appeals court was long considered the most ideologically conservative of the 12 regional circuits, the intermediate appellate tribunals across the country that are the courts of last resort for 99 percent of appeals. When a case heard in Maryland and Virginia federal district courts is appealed, it goes to the 4th Circuit. This is the court that has resolved appeals involving Maryland gun laws and Virginia transgender students’ rights, for example.\n\nAnd change has come to the 4th Circuit.\n\nThis was recently on display when the entire court — all judges in active service who did not have conflicts of interest — substantially affirmed a Maryland district court’s nationwide injunction that blocked enforcement of President Trump’s revised travel ban. Notably, a majority of the judges proclaimed that the Constitution “protects Plaintiffs’ right to challenge the Executive Order that in text speaks in vague words of national security, but in context drips with religious intolerance, animus and discrimination.”\n\nFor decades, the 4th Circuit was a conservative stronghold. Seated in the former capital of the Confederacy, the court hears appeals in the Lewis F. Powell Jr. Courthouse, a building that served as the official headquarters for Confederate President Jefferson Davis. The circuit retains Southern manners. For instance, judges descend from the bench after oral arguments to shake the hands of counsel.\n\nPresident George W. Bush tried to continue the court’s conservative legacy when numerous vacancies materialized in his administration. However, the White House insisted on pressing for confirmation of nominees whom many Democratic senators considered outside the mainstream, even after Democrats had captured a Senate majority in November 2006. Political machinations left four vacancies at the Bush administration’s close, enabling President Barack Obama to appoint numerous judges. The court now has nine members whom Democratic presidents appointed, five whom Republican presidents confirmed and Chief Judge Roger Gregory, whom President Bill Clinton recess-appointed and Bush confirmed.\n\nTwo recent developments in the travel ban appeal demonstrate change in the court. First, all of the active judges without conflicts heard the appeal, called an initial en banc proceeding, which is so extraordinary that the last one was decades ago. One judge, not the parties, suggested this procedure, and the court requested the litigants’ views on an en banc process, while a circuit majority favored it apparently because of the appeal’s exceptional public importance.\n\nAnother sign of change was the court’s April 27 announcement that the argument would be livestreamed. Allowing “cameras in the courtroom” has proved extremely controversial at the Supreme Court, which has never permitted live broadcast of arguments. Indeed, since-retired Justice David Souter famously declared “over my dead body.” A few lower federal courts allow broadcasts. The 9th Circuit began livestreaming all oral arguments in 2015.\n\nResolution of the Maryland travel ban appeal seemingly depended on how the judges perceived the case’s issues. A majority of the jurists viewed the appeal principally as a question of religious discrimination and affirmed the district court’s finding that the executive order violated the establishment clause. The three dissenting judges asserted that the majority “looks past the face of the Order’s statements on national security and immigration, which it concedes are neutral in terms of religion, and considers campaign statements made by candidate Trump to conclude that the Order denigrates Islam in violation of the Establishment Clause.”\n\nThe dissenters argued that “this approach (1) plainly violates the Supreme Court’s directive . . .; (2) adopts a new rule of law that uses campaign statements to recast the plain, unambiguous, and religiously neutral text of an executive order; and (3) radically extends the Supreme Court’s Establishment Clause holdings.”\n\nRegardless of how the Supreme Court decides this case, which the government appealed on Thursday, the opinions issued by 4th Circuit judges in the majority, the determination to proceed with initial en banc review and the choice to livestream the argument suggest that the 4th Circuit is a different court than it was only a decade ago.\n\nThe writer is the Williams Chair in Law at the University of Richmond.", "authors": [], "publish_date": "2017-06-02", "source": "washingtonpost", "top_words": ["ruling", "travel", "courts", "judges", "ban", "circuit", "appeals", "eyes", "majority", "supreme", "4th", "court", "trumps", "order", "president"], "summary": "Protesters hold signs and march outside the U.S. Court of Appeals for the 4th Circuit, in Richmond on May 8.\n(Steve Helber/Associated Press)The U.S. Court of Appeals for the 4th Circuit is a court in transition.\nWhen a case heard in Maryland and Virginia federal district courts is appealed, it goes to the 4th Circuit.\nAnd change has come to the 4th Circuit.\nAllowing “cameras in the courtroom” has proved extremely controversial at the Supreme Court, which has never permitted live broadcast of arguments."}