{"url": "https://www.washingtonpost.com/world/national-security/judges-in-travel-ban-appeal-press-justice-department-lawyer-about-trumps-comments/2017/05/15/1277fe58-3975-11e7-8854-21f359183e8c_story.html", "id": "160", "title": "Judges in travel ban appeal press lawyers about Trump’s comments", "text": "The federal appeals court panel weighing President Trump’s travel ban focused acutely on Trump’s own comments at a hearing Monday — lobbing skeptical inquiries at lawyers on both sides of the issue as they tried to ascertain to what extent they should hold the president’s inflammatory rhetoric against him.\n\nOn the campaign trail, Trump promised a “total and complete shutdown” of Muslims entering the United States, and the three judges with the U.S. Court of Appeals for the 9th Circuit specifically asked about how much they should consider that and other statements in deciding the future of the president’s executive order.\n\nThe hearing was important in its own right to the future of the travel ban but was made even more interesting because Trump has repeatedly criticized the 9th Circuit for ruling against him.\n\n[7 things Trump and his advisers have said about the travel ban that wound up hurting them in court]\n\nJudge Michael Daly Hawkins asked a Justice Department lawyer whether Trump had “ever disavowed his campaign statements,” and Judge Ronald M. Gould inquired about how the court should determine if the executive order was “a Muslim ban in the guise of a national security justification.”\n\nProtesters march outside the U.S. Court of Appeals for the 4th Circuit in Richmond, where judges heard arguments on President Trump’s travel ban last week. A different court — the 9th Circuit — took up another challenge Monday. (Steve Helber/AP)\n\nJudge Richard A. Paez noted that many of Trump’s statements on the matter were made “in the midst of a highly contentious campaign” and asked those suing over the ban, “If we don’t consider the campaign statements, do you still prevail?” He did, however, deem the campaign trail comments “profound.”\n\nTrump’s travel ban — key sections of which have been frozen by two courts — tried to temporarily shut down the U.S. refu­gee program and suspend the issuance of new visas to residents of six Muslim-majority countries.\n\nThose challenging the ban say it is unconstitutional because it was motivated by Trump’s desire to discriminate against Muslims, and they point to Trump’s comments and those of his advisers as evidence to prove their case. The Justice Department argues that the executive order is well within the president’s purview and that lower courts have been wrong to second-guess him on a matter of national security.\n\nThe panel of three 9th Circuit judges — all appointed by President Bill Clinton — will join the U.S. Court of Appeals for the 4th Circuit in deciding the fate of the ban. To fully reinstate the measure, the Justice Department would have to win in both the 4th and 9th circuits — or escalate the dispute to the Supreme Court.\n\n[President Trump’s lawyers on revised travel ban repeatedly asked about campaign promises]\n\nOn Monday, acting solicitor general Jeffrey B. Wall told the judges that they need only determine whether there was a “rational basis” for the president’s travel ban, and if they thought there was some bad intent, they should focus on official, unequivocal statements as evidence.\n\nWall argued that the president had said “several things approaching” a repudiation of his campaign trail comments, in that he had “clarified that what he was talking about were Islamic terrorist groups and the countries that shelter or sponsor them.” But the judges, he said, should nonetheless tread lightly in weighing political remarks.\n\n“We shouldn’t start down the road of psychoanalyzing what people meant on the campaign trail,” Wall said.\n\nPressed at the daily briefing Monday about whether the president would repudiate his previous comments, White House press secretary Sean Spicer declined to answer specifically but insisted that the ban was “fully lawful and will be upheld.”\n\n“Right now, the president is making sure that we make the appropriate arguments to get the ban in place,” Spicer added.\n\nLawyer Neal Katyal, arguing the case on behalf of those who sued over the ban, said the judges should simply ask themselves “what would an objective observer think, with these sorts of statements.”\n\nKatyal noted that when Trump signed the first version of his travel ban, which he later revoked and rewrote, the president read the title and commented, “We all know what that means” — a post-campaign hint of a discriminatory intention. And after a court blocked the revised order, Katyal said, Trump declared the new measure a “watered-down” version of the first.\n\nPressed by Paez on whether the order would be constitutional if it was signed by someone who had not made such comments, Katyal quipped, “If you don’t say all these things, you never wind up with an executive order like this.”\n\nKatyal allowed, though, that the president would not be forever barred from issuing a similar executive order, if he were to repudiate his previous comments or take other actions to prove that his intent was not to discriminate.\n\nThe 9th Circuit blocked Trump’s first travel ban, though the revised version is before a different panel. The 4th Circuit, which is based in Richmond, heard arguments on the matter last week. Their decision and the 9th Circuit’s probably won’t come for weeks.\n\nLast week, a federal judge in Michigan ordered the Trump administration to turn over communications from former New York mayor Rudolph W. Giuliani and other advisers — whose comments judges nationwide have pointed to as they have ordered the ban frozen. That case is separate from the two that have put Trump’s latest ban on hold.\n\n[All the times Trump personally attacked judges — and why his tirades are ‘worse than wrong’]\n\nTrump has not been shy about criticizing judges who rule against him, but he seems to have particular ire for the 9th Circuit. When U.S. District Judge William Orrick blocked his executive order on stripping federal funding from sanctuary cities, Trump incorrectly attributed the decision to the 9th Circuit as he wrote on Twitter: “First the Ninth Circuit rules against the ban & now it hits again on sanctuary cities — both ridiculous rulings. See you in the Supreme Court!” Orrick is a ­lower-court judge whose rulings would be reviewed by the 9th Circuit.\n\nTrump then wrote that the circuit had a “terrible record of being overturned” — a claim that is highly debatable — and he said later that he had “absolutely” considered breaking up the court.", "authors": [], "publish_date": "2017-05-15", "source": "washingtonpost", "top_words": ["travel", "lawyers", "judges", "trump", "ban", "circuit", "comments", "appeal", "9th", "court", "trumps", "press", "president"], "summary": "A different court — the 9th Circuit — took up another challenge Monday.\nThose challenging the ban say it is unconstitutional because it was motivated by Trump’s desire to discriminate against Muslims, and they point to Trump’s comments and those of his advisers as evidence to prove their case.\n[President Trump’s lawyers on revised travel ban repeatedly asked about campaign promises]On Monday, acting solicitor general Jeffrey B.\nThe 9th Circuit blocked Trump’s first travel ban, though the revised version is before a different panel.\nSee you in the Supreme Court!” Orrick is a ­lower-court judge whose rulings would be reviewed by the 9th Circuit."}