{"url": "https://www.washingtonpost.com/world/national-security/trumps-travel-ban-expires-in-less-than-two-weeks-heres-what-could-happen-after-that/2017/09/13/5ffe6624-97eb-11e7-b569-3360011663b4_story.html", "id": "17", "title": "Trump’s travel ban expires in less than two weeks. Here’s what could happen after that.", "text": "Homeland Security officials plan to submit to the White House in the coming weeks a report that is likely to shape the future of President Trump’s entry ban — a key portion of which is set to expire on Sept. 24, authorities said. (Brian Snyder/Reuters)\n\nDepartment of Homeland Security officials plan soon to submit to the White House a report that is likely to shape the future of President Trump’s entry ban, a key portion of which is set to expire Sept. 24, authorities said.\n\nThe report is critical because it is being prepared in response to Trump’s order that the homeland security secretary present him with a list of countries for inclusion in what effectively amounts to a more permanent ban. And because of impending deadlines, the White House will probably have to take action even before the Supreme Court hears arguments next month on whether the entry ban is at its core legal.\n\n[Supreme Court allows limited version of Trump’s travel ban to take effect and will consider case in fall]\n\nThe White House has several options — including extending the current ban, modifying it or letting it lapse. The matter now sits in the hands of the Department of Homeland Security, which has been tasked with assessing the type of information that other countries provide so American officials can vet travelers wanting to come to the United States.\n\nWhen Trump signed his revised entry ban in March, it was billed as a temporary measure, necessary to reduce officials’ workload so they could review what information they were getting to vet people coming into the country.\n\nThe executive order barred citizens of six Muslim-majority countries from entering the United States for 90 days and banned refugees from all countries from entering for 120 days. Unlike a similar travel ban signed in January, the order exempted current visa holders and spelled out ways people might apply for a waiver.\n\nThe ban also established the cap on refugees for fiscal 2017 at 50,000, and officials at the State Department, the Department of Homeland Security and the White House have been discussing possibly lowering the limit for fiscal 2018, a level not seen in decades, according to a person familiar with the discussions. No final decision has been made, though, and the matter is ultimately up to the White House. The discussions were first reported by the New York Times. The new fiscal year begins Oct. 1.\n\n[U.S. surpasses Trump administration’s cap on refugee admissions]\n\nIn March, with certain travelers prevented from entering, Trump commanded the Department of Homeland Security to conduct — within 20 days — a “worldwide review” of the information needed to vet travelers from other countries, and to come up with a list of those that did not provide adequate data.\n\nThose countries were then to be given 50 days to start providing the information or come up with a plan to provide it. Those that didn’t would risk being included in a presidential proclamation that would bar the entry of at least certain categories of their citizens, according to the executive order.\n\nDavid Lapan, a Department of Homeland Security spokesman, said the department delivered a report to the White House in early July on the results of its worldwide review and now was working on the report about countries that could not provide adequate information.\n\nLapan said officials had “a comprehensive understanding of the information we receive from all foreign partners” and would “provide a report to the President in the coming weeks.” A State Department spokeswoman said that agency was “engaging with foreign governments in order to meet these new standards for information sharing.” She said she could not “prejudge the outcome of this engagement.”\n\nA person familiar with discussions over the entry ban said it is possible Homeland Security’s report — and what the White House decides to do with it — could have a significant impact on the legal wrangling surrounding the measure. If the ban were to lapse or be changed significantly, that could render the upcoming Supreme Court hearing on the matter moot, or it could spawn fresh legal challenges, the person said.\n\nThe person, who spoke on the condition of anonymity because discussions are ongoing, said that it seemed unlikely the White House would abandon the ban entirely but that establishing a permanent ban could make it harder to defend in court. The White House declined to comment on what it was considering.\n\nAlthough Trump signed the travel ban in March, it was waylaid by court challenges before it could take effect, and the president issued a memo effectively declaring that the 90- and 120-day clocks wouldn’t start running until the court-imposed blockades were lifted.\n\nOn June 26, though, the Supreme Court permitted a limited version of the measure to take hold — although it said the government could not bar those with a “bona fide” connection to the United States, such as having family members here, or a job or a place in an American university.\n\nU.S. officials formally implemented the directive three days later. Spokesmen for the Justice and Homeland Security departments said this week that they consider the clocks to have started running when the Supreme Court ruled. That means the ban on citizens from the six countries will expire Sept. 24, and the ban on refugees will expire Oct. 24. On Oct. 10, the Supreme Court is scheduled to hear arguments on whether the ban is legal.\n\nThat probably means by the time the court issues a decision, the entry ban on refugees and citizens of six countries will have expired.\n\nAs it stands now, the administration is allowed to implement a version of the ban that is far less forceful than it had hoped. After the Supreme Court ruled in the White House’s favor in June, officials initially tried to block even grandparents and other extended relatives of people in the United States from entering — although a federal district judge ultimately stopped them from doing so, and the Supreme Court left that decision undisturbed.\n\nThe Supreme Court on Tuesday, though, put on hold another portion of the district judge’s ruling, which would have prevented the administration from banning refugees with formal assurances from resettlement agencies. That means the government can keep out a pool of about 24,000 refugees, despite the assertion by those suing over the ban that they had a bona fide connection to the United States and thus should be allowed in.", "authors": [], "publish_date": "2017-09-13", "source": "washingtonpost", "top_words": ["heres", "travel", "expires", "homeland", "ban", "supreme", "security", "report", "court", "officials", "trumps", "countries", "weeks", "house", "white", "happen"], "summary": "[Supreme Court allows limited version of Trump’s travel ban to take effect and will consider case in fall]The White House has several options — including extending the current ban, modifying it or letting it lapse.\nNo final decision has been made, though, and the matter is ultimately up to the White House.\nThe White House declined to comment on what it was considering.\nSpokesmen for the Justice and Homeland Security departments said this week that they consider the clocks to have started running when the Supreme Court ruled.\nOn Oct. 10, the Supreme Court is scheduled to hear arguments on whether the ban is legal."}