{"url": "https://www.washingtonpost.com/news/post-nation/wp/2017/02/06/trumps-travel-ban-what-happens-next/", "id": "19", "title": "Trump’s travel ban: What happens next?", "text": "\n\nThousands gather at a Denver park on Feb. 4 for a rally to support the Muslim community and to protest President Trump’s executive order temporarily banning the U.S. entry of some refugees from seven Muslim-majority countries. (Brennan Linsley/AP)\n\nA ruling by a federal judge in Seattle temporarily blocked the enforcement of President Trump’s travel ban. The suspension means people who were previously banned will have more time to reach the United States.\n\nTrump’s executive order called for temporarily barring refugees and citizens of seven Muslim-majority counties from entering the United States.\n\n[Opposition to Trump travel ban grows as key court decision looms]\n\nOn Sunday, two appeals court judges on the West Coast declined to immediately restore the ban, but they asked to hear more arguments. The states of Washington and Minnesota, which are suing over it, made their case early Monday. The Justice Department has to answer by 6 p.m. Monday.\n\nWhat happens next?\n\nThe appeals court will likely make one of three decisions: Restore the ban, keep it suspended, or schedule a further hearing.\n\nSeveral federal judges have already struck down aspects of the ban, but the case before the U.S. Court of Appeals for the 9th Circuit is much broader and more significant. That is because the judges there are considering whether it should be halted entirely, as opposed to just for particular people or those who already have made it to U.S. airports.\n\nHow can a U.S. district judge’s decision affect the entire country?\n\nAs the name implies, U.S. district judges are federal, appointed by the president, and their decisions can have nationwide repercussions. A federal judge in Texas similarly blocked former president Barack Obama’s executive action on immigration.\n\nWhat does the lawsuit say?\n\nThe lawsuit alleges the immigration order was “separating families, harming thousands of the states’ residents, damaging the states’ economies, hurting state-based companies, and undermining both states’ sovereign interest in remaining a welcoming place for immigrants and refugees.”\n\nWhat if the court sides with the White House?\n\nIf Trump’s ban were to be immediately reinstated, that might spark chaos similar to what occurred when it was first rolled out. Hundreds of people were detained by customs officers at U.S. airports, and some were deported. The actions sparked protests and other lawsuits across the country.\n\nIt was unclear whether U.S. officials had a plan to avoid a repeat of that scenario, though much would depend on what specifically was ordered by a court and when.\n\nWhat can either side do if it loses?\n\nEither side could request Supreme Court intervention, though it would take the votes of five justices to overturn the panel decision. The court has been shorthanded since the death of Associate Justice Antonin Scalia, and it is ideologically divided between four more liberal justices and four conservative-leaning ones.\n\nThe Supreme Court could become involved as soon as this week, if either side challenges the ruling of the appellate court.\n\nWhat do legal experts say?\n\nLegal analysts have said that the president has broad authority to set immigration policy. But civil liberties advocates counter that the executive order essentially amounts to a discriminatory ban on Muslims that has no real national security purpose.\n\nWhat has the White House said?\n\nThe Trump administration has been steadfast in its support of the executive order, which it says is necessary for national security. Trump tweeted multiple times his disdain for the federal judge in Washington state who put a stop to it.\n\nThe opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned! — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nOn NBC’s “Meet the Press,” Vice President Pence said the White House thought that Trump was “operating within his authority as president, both under the Constitution and under clear statutory law.”\n\nWhat happens to the people who were previously barred entry?\n\nThe enforcement of the order is entirely suspended for now, and people who have been stranded have rushed to fly back to the United States. The State Department also restored visas that were previously revoked.\n\nSome successfully reunited with family members, while others — particularly those whose visas were physically taken or marked as invalid — ran into roadblocks trying to board planes overseas.\n\nImmigration advocates are encouraging people who qualify for entry to board planes as soon as possible.\n\nRead more:\n\nWho could be affected by the travel ban", "authors": [], "publish_date": "2017-02-06", "source": "washingtonpost", "top_words": ["executive", "travel", "judges", "trump", "ban", "judge", "court", "happens", "trumps", "states", "federal", "order", "president"], "summary": "(Brennan Linsley/AP)A ruling by a federal judge in Seattle temporarily blocked the enforcement of President Trump’s travel ban.\nTrump’s executive order called for temporarily barring refugees and citizens of seven Muslim-majority counties from entering the United States.\n[Opposition to Trump travel ban grows as key court decision looms]On Sunday, two appeals court judges on the West Coast declined to immediately restore the ban, but they asked to hear more arguments.\nIf Trump’s ban were to be immediately reinstated, that might spark chaos similar to what occurred when it was first rolled out.\nBut civil liberties advocates counter that the executive order essentially amounts to a discriminatory ban on Muslims that has no real national security purpose."}