{"url": "https://www.washingtonpost.com/world/national-security/opposition-to-trump-travel-ban-grows-as-key-court-decision-looms/2017/02/06/d766ec7c-ec74-11e6-9662-6eedf1627882_story.html", "id": "178", "title": "Federal appeals court decides to schedule a hearing on Trump travel order", "text": "A federal appeals court will hear arguments Tuesday on whether to restore President Trump’s controversial immigration order, marking a critical juncture for the president’s directive temporarily barring refugees and those from seven Muslim-majority countries from entering the United States.\n\nThe hearing, which will be conducted by telephone, is to review an order by a lower court judge to put Trump’s directive on hold.\n\nIt was scheduled just as Justice Department lawyers made their final written pitch to immediately restore the president’s order — and as tech companies, law professors and former high-ranking national security officials joined a mushrooming legal campaign to keep the measure suspended.\n\nJustice Department lawyers asserted that the executive order was “a lawful exercise of the President’s authority over the entry of aliens into the United States and the admission of refugees,” and that U.S. District Judge James Robart’s order to stop it was “vastly overbroad.”\n\nThe future of the temporary ban now lies with three judges on the U.S. Court of Appeals for the 9th Circuit: William C. Canby Jr., who was appointed by President Jimmy Carter; Judge Richard Clifton, who was appointed by President George W. Bush; and Judge Michelle Taryn Friedland, who was appointed by President Barack Obama.\n\n(Jayne Orenstein,Dalton Bennett,Natalie Jennings/The Washington Post)\n\nThe judges said each side would have 30 minutes to present their arguments beginning at 6 p.m. Eastern. It is unclear how soon a ruling could follow. The hearing will be live-streamed, the clerk of court said.\n\nWith the court case ongoing, those once stopped from coming to the United States have rushed to come into the country. The Department of Homeland Security said it was suspending all enforcement of Trump’s directive after the federal judge in Seattle ordered it frozen, and many travelers have since been able to reunite with family here.\n\n[Court document: Declaration of National Security Officials]\n\nThe broad legal issue is whether Trump exceeded his authority and violated the First Amendment and federal immigration law, and whether his executive order imposes irreparable harm on those it affects.\n\nEither Justice Department lawyers representing the Trump administration, or the states of Washington and Minnesota — which had successfully sued to put the ban on hold — could ask the Supreme Court to intervene if they disagree with the appeals court decision. The Supreme Court, though, remains one justice short, and many see it as ideologically split 4-4. A tie would keep in place whatever the appeals court decides.\n\nThe rhetoric from both sides has been fierce. The states of Washington and Minnesota argued in a filing Monday that reinstating the ban would “unleash chaos again” by “separating families, stranding our university students and faculty, and barring travel.”\n\nJustice Department lawyers countered that noncitizens outside the United States have “no substantive right or basis for judicial review in the denial of a visa at all,” and that, at most, the lower court judge should have limited his ruling to “previously admitted aliens who are temporarily abroad now or who wish to travel and return to the United States in the future.”\n\nFederal immigration law undeniably gives the president broad authority to bar people from coming into the United States, saying that if he finds “the entry of any aliens” would be “detrimental” to the country’s interests, he can impose restrictions. Legal analysts have said those challenging the ban will face an uphill climb to overturn it.\n\n[Court document: Amicus brief by tech companies]\n\nYet the opposition has been successful so far, and it is growing. On Monday, 10 former high-ranking diplomatic and national security officials; nearly 100 Silicon Valley tech companies; more than 280 law professors; a coalition of 16 state or district attorneys general, including those from D.C., Maryland and Virginia; and a host of civil liberties and other organizations formally lent their support to the legal bid to block Trump’s order.\n\nWhile it is not unusual for outside parties to weigh in on legal cases of such public interest, the breadth and depth of those lining up behind Washington and Minnesota is notable.\n\nFormer secretaries of state John F. Kerry and Madeleine Albright, along with former CIA director Leon Panetta, former CIA and National Security Agency director Michael Hayden and other former top national security officials, attached their names to an affidavit declaring there was “no national security purpose” for a complete barring of people from the seven affected countries.\n\n“Since September 11, 2001, not a single terrorist attack in the United States has been perpetrated by aliens from the countries named in the Order,” the group declared. “Very few attacks on U.S. soil since September 11, 2001 have been traced to foreign nationals at all.”\n\n[Travelers from Iran board flights to the United States following stay, attorney says]\n\nApple, Facebook, Google, Microsoft, Netflix, Twitter, Uber and other companies asserted in a brief that Trump’s order “hinders the ability of American companies to attract great talent; increases costs imposed on business; makes it more difficult for American firms to compete in the international marketplace; and gives global enterprises a new, significant incentive to build operations — and hire new employees — outside the United States.”\n\nAnd 16 attorneys general said, while their specific businesses and residents were different, “all stand to face the concrete, immediate, and irreparable harms caused by the Executive Order.”\n\nTrump and his supporters have continued to press the case that the short-term stoppage on refugees and immigrants from Iraq, Iran, Syria, Libya, Somalia, Sudan and Yemen is necessary for national security reasons. He said Monday, during remarks at MacDill Air Force Base in Tampa, “We need strong programs so that people that love us and want to love our country and will end up loving our country are allowed in, not people who want to destroy us and destroy our country.”\n\nOn Twitter, he went so far as to suggest that if an attack were to happen, the judiciary would be to blame.\n\n“Just cannot believe a judge would put our country in such peril,” Trump wrote. “If something happens blame him and court system. People pouring in. Bad!”\n\n[Trump lashes out at ‘so-called judge’ who temporarily blocked entry ban]\n\nThe president also dismissed as “fake news” polls showing opposition to the executive order and asserted that the public wants and needs border security and strong vetting.\n\nFederal courts in New York, California and elsewhere already have blocked aspects of the ban from being implemented, although one federal judge in Massachusetts declared that he did not think that challengers had demonstrated that they had a high likelihood of success. The case before the 9th Circuit, though, is much broader than the others, because it stems from a federal judge’s outright halting of the ban.\n\nRobert Barnes, Brian Murphy and John Wagner contributed to this report.", "authors": [], "publish_date": "2017-02-06", "source": "washingtonpost", "top_words": ["travel", "trump", "national", "appeals", "security", "judge", "court", "united", "states", "president", "trumps", "schedule", "federal", "order", "decides", "hearing", "legal"], "summary": "A federal appeals court will hear arguments Tuesday on whether to restore President Trump’s controversial immigration order, marking a critical juncture for the president’s directive temporarily barring refugees and those from seven Muslim-majority countries from entering the United States.\nThe hearing, which will be conducted by telephone, is to review an order by a lower court judge to put Trump’s directive on hold.\nWith the court case ongoing, those once stopped from coming to the United States have rushed to come into the country.\nFormer secretaries of state John F. Kerry and Madeleine Albright, along with former CIA director Leon Panetta, former CIA and National Security Agency director Michael Hayden and other former top national security officials, attached their names to an affidavit declaring there was “no national security purpose” for a complete barring of people from the seven affected countries.\n“Since September 11, 2001, not a single terrorist attack in the United States has been perpetrated by aliens from the countries named in the Order,” the group declared."}