{"url": "https://www.washingtonpost.com/powerpost/2017/02/10/561a1520-efb4-11e6-9662-6eedf1627882_story.html", "id": "128", "title": "Republicans tight-lipped on court decision against Trump’s travel ban", "text": "President Donald Trump meets with congressional leaders and Vice President Mike Pence at the White House on Jan. 23, 2017. (Jonathan Ernst/Reuters)\n\nCongressional Republicans were mostly silent Friday, choosing not to respond to the federal court ruling against President Trump’s immigration ban in a move that underscores how the controversial executive order continues to vex the president’s party.\n\nSpokespeople for Senate Majority Leader Mitch McConnell (R-Ky.) and House Speaker Paul D. Ryan (R-Wis.) did not respond to requests for comment. Few Republicans issued written statements. Democrats, meanwhile, proactively cheered the court’s ruling.\n\n[Federal appeals court rules against Trump travel ban]\n\nThe muted response from the GOP contrasted with that of President Trump, who took to Twitter after the ruling was announced Thursday to issue a defiant response in all caps: “SEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE!”\n\nIt also reflected the distance many Republicans have sought from the president over his temporary ban on refugees and foreign nationals from seven majority-Muslim nations. On Thursday, the U.S. Court of Appeals for the 9th Circuit upheld a stoppage on the order’s enforcement.\n\n(Victoria Walker/The Washington Post)\n\nA spokeswoman for House Homeland Security Committee Chairman Michael McCaul (R-Tex.) said he had nothing to add to his previous statement about the executive order, which he said “went too far.” Senate Judiciary Committee Chairman Charles E. Grassley (R-Iowa) did not immediately comment.\n\nThe White House sent talking points to Republicans on Capitol Hill on Thursday evening that framed the ruling as an “interim” decision that would eventually be overturned.\n\n“Once the government is able to present a case on the merits, the courts will undoubtedly rule in the government’s favor because the law clearly states that the President has full authority to restrict access in the country by foreign nationals in the interest of national security,” said the talking points, which two recipients shared on the condition of anonymity.\n\nThose Republicans who did speak out on Friday were generally critical of the court’s decision.\n\nRep. Chris Collins (R-N.Y.), a Trump ally, said in an interview that he, like the president, was “not happy” with the court’s ruling.\n\n“I can’t speak to why other Republicans may not be speaking out, but I certainly relish the opportunity to make sure people know where I stand on this,” said Collins. He said he believes that the vast majority of his constituents support Trump’s executive order.\n\n“It seems to me very biased on the liberal side of things,” remarked Rep. Tom Cole (R-Okla.) in an interview. Cole argued that the court should have afforded the president more latitude in implementing his policies. The administration has argued that in enforcing the order, it was acting to protect American citizens from terrorist attacks.\n\n“You can disagree with the policy, but the real question here is, ‘Does he have the authority to pursue the policy?’ ” Cole asked.\n\nSen. Dan Sullivan (R-Alaska), a former 9th Circuit law clerk, sounded a similar note.\n\n“The idea that there’s no threats out there and that the executive branch doesn’t have the exclusive ability to determine what those are is, from my perspective . . . it’s a pretty bold assertion by a court,” said Sullivan, who noted that he had not yet read the full court opinion.\n\nTrump issued the order two weeks ago after virtually no consultation with congressional Republicans, angering many GOP leaders on Capitol Hill who were caught off guard by the ensuing uproar.\n\n[Angry Republicans lash out at Trump for not consulting them on travel ban]\n\nThe administration could now seek to have the Supreme Court consider its case. Or, it could retool its order, as many Republicans have suggested over the past two weeks.\n\n“There is this option which is withdraw the current order, tighten it, make sure it gets the vetting it needs from not only Homeland Security, but Office of Legal Counsel and everybody else and reissue it, right?” said Sullivan. “So, that, to me, might be a course worth taking.”\n\nRep. Trey Gowdy (R-S.C.), a former federal prosecutor, said the Supreme Court will now have to determine “what process is due, if any” to legal residents and other noncitizens.\n\n“It seems clear to most of us — not on the 9th Circuit Court of Appeals — there is no right to come to this country for non-citizens of the United States,” Gowdy said in a written statement, in which he concluded: “For those, like Alexander Hamilton, who once or now wondered if the Judicial Branch would be too weak. Wonder no more.”\n\nThe Supreme Court currently has only eight justices. The Senate is engaged in a heated fight over Judge Neil Gorsuch, Trump’s nominee to fill the ninth seat. Many Democrats have voiced heavy skepticism about his record and whether he will be able to have enough independence from Trump.\n\n“You can’t just assert, ‘I’m an independent person,’ which he did. You have to show examples. I await them,” Senate Minority Leader Charles E. Schumer (D-N.Y.) said on the Senate floor this week.\n\nAfter quickly applauding the 9th Circuit Court’s ruling on Thursday night, Democrats continued praising it on Friday.\n\n“Liberty & justice also prevailed last night, proving our system of checks & balances cannot be shaken,” Rep. Grace F. Napolitano (D-Calif.) wrote on Twitter, adding the hashtag “#MuslimBan.”\n\nCole said he believed that the many Republicans who did not weigh in were simply opting to act in a way that “respects the process” the judiciary goes through with major cases.\n\nIn the past, however, such as when the Supreme Court upheld a key part of the Affordable Care Act during Barack Obama’s presidency, Republicans have not held back from expressing their opinions on major decisions.\n\n“Today’s ruling is deeply disappointing,” said Ryan, then-House Ways and Means Committee chairman, in a statement at the time.\n\nRobert Costa contributed to this report.\n\nRead more at PowerPost", "authors": [], "publish_date": "2017-02-10", "source": "washingtonpost", "top_words": ["ruling", "travel", "courts", "trump", "tightlipped", "ban", "supreme", "security", "republicans", "court", "trumps", "order", "president", "senate", "decision"], "summary": "(Jonathan Ernst/Reuters)Congressional Republicans were mostly silent Friday, choosing not to respond to the federal court ruling against President Trump’s immigration ban in a move that underscores how the controversial executive order continues to vex the president’s party.\nDemocrats, meanwhile, proactively cheered the court’s ruling.\n[Angry Republicans lash out at Trump for not consulting them on travel ban]The administration could now seek to have the Supreme Court consider its case.\nWonder no more.”The Supreme Court currently has only eight justices.\nAfter quickly applauding the 9th Circuit Court’s ruling on Thursday night, Democrats continued praising it on Friday."}