{"url": "https://www.washingtonpost.com/news/post-nation/wp/2017/02/03/after-four-years-and-trumps-travel-ban-a-child-meets-her-family/", "id": "121", "title": "After four years and Trump’s travel ban, a child meets her family", "text": "\n\nSamira Dahir with her daughters, Mumtaz, 7, Mushkaad, 4, and Mueahib, 8, in their home in Minneapolis. (Jenn Ackerman for The Washington Post)\n\nSamira Dahir got the call in the middle of the night: Her 4-year-old daughter, who was scheduled to leave a Ugandan refugee camp for the United States, would not be going anywhere because of an executive order President Trump had signed days before, temporarily blocking refugees from entering the United States.\n\nDahir, a Somali refugee who lives in Minneapolis, had been waiting to see Mushkaad since she and her two older daughters left the camp in 2013. In December, she got word that the girl was finally cleared to come to the United States. With Mueahib, 8, and Mumtaz, 7, Dahir spent a month getting ready, buying a bed, clothes and toys. Mushkaad was scheduled to land Tuesday in Minneapolis.\n\nMushkaad had gotten her hair braided and henna on her hands for the occasion. She wore a white dress her mother had sent from Minneapolis. But as the child and a chaperon were at the airport in Kampala, they were told that Trump’s order would not allow her to enter the United States.\n\n\n\nSamira Dahir takes a photo of Mumtaz, 7, and Mushkaad, 4, brush their teeth. (Jenn Ackerman for The Washington Post)\n\nDahir, paralyzed by the news she had just received from Africa, immediately started trying to figure out how to get her daughter to the United States. The next few days became an round-the-clock saga that went from the offices of lawyers and social-service groups in Minneapolis to the U.S. Senate to the Department of Homeland Security and, finally, to the Minneapolis-St. Paul International Airport on Thursday night, when Mushkaad was at last reunited with her family.\n\nThe first thing she told her mother: She wants to stay with her forever.\n\n“It was hundreds of hours of work by a lot of people. … We were going to get this girl back in through litigation or any other means,” said Benjamin Casper Sanchez, director of the Center for New Americans at the University of Minnesota Law School, who argues that Trump’s executive order blocking migrants, refugees and others from seven predominantly-Muslim countries is neither legal nor constitutional.\n\nThe happy ending for Mushkaad “is the exception,” he said. “The thousands of other people who don’t have these resources, they have no chance of getting in, and there are so many other people with cases that are just as compelling.”\n\n\n\nMushkaad was greeted with a party after she was allowed to fly to the United States from a Ugandan refugee camp. (Jenn Ackerman for The Washington Post)\n\nIn an interview through an interpreter Friday, Dahir recounted her journey since leaving Somalia in 2005. In the refugee camp, she gave birth to her older daughters and applied for refugee status in the United States. All three were granted visas.\n\nThen Mushkaad was born, and Dahir learned that the family would have to restart the process to obtain a visa for the baby. She faced an agonizing choice: Redo everything from the very beginning or leave Mushkaad in Uganda with a family friend while she, Mueahib and Mumtaz went to the United States. Dahir was instructed to apply for reunification, a process she says she was told would take less than a year. Mushkaad was 5 months old when her mother and sisters flew away.\n\n[State Dept. says about 60,000 visas revoked due to travel ban; Justice Dept. atty says 100,000]\n\nAccording to U.S. Citizenship and Immigration Services, a child must be included on the original application for refugee status or asylum, or the child must be born or conceived before the parent is granted refugee or asylum status.\n\nThe reunification process instead took three years. Dahir spent them working with Lutheran Social Services, which helps resettle refugees, and later the offices of Minnesota Sens. Al Franken (D) and Amy Klobuchar (D). The news in December that Mushkaad was cleared to come left her ecstatic. The Monday morning call saying the opposite left her paralyzed, she said.\n\n“It felt like her heart was sticking out of her chest,” her interpreter.\n\nLawyers, spearheaded by the Immigrant Law Center of Minnesota, immediately went to work, drafting a lawsuit in case it was needed. Minnesota Attorney General Lori Swanson cited Mushkaad’s case in a suit she filed against the Trump administration that contends the executive order — which names Somalia as one of the targeted countries — is unconstitutional.\n\n[Who is affected by Trump’s travel ban?]\n\nFranken and Klobuchar pushed throughout the weekend to try to bring Mushkaad to the United States, seizing on language from the administration that it would evaluate situations on a case-by-case basis. Both said they spoke this week with Homeland Security Secretary John F. Kelly about Dahir’s case.\n\n“I don’t think [the Trump administration] would ever expect, with the stroke of a pen, an executive order would put all of these families in peril,” Klobuchar said.\n\nKevin K. McAleenan, the acting director of U.S. Customs and Border Patrol, said late Friday that his agency learned of Mushkaad’s case through the two senators. Customs contacted the State Department, which got in touch with the Office of International Migration. A team at the agency is making sure the order is applied with intent and recognizing cases where exceptions like Mushkaad’s case are warranted, he said, noting that 87 waivers have been issued since Saturday.\n\n“We have a family of U.S. residents, lawfully residing, and they’re missing a daughter. It’s in the national interest to have families unified,” McAleenan said.\n\nWednesday, Dahir got another middle-of-the-night call: Mushkaad would soon be on her way to Minneapolis.\n\nThe 4-year-old got on a flight from Kampala to Abu Dhabi, where she had a seven-hour layover and lawyers feared she might be blocked from transferring to her next plane. She wasn’t, and it was there that she got a national interest waiver to come to the United States.\n\nAs she cleared customs, an officer removed his American flag pin and put it on her dress.\n\nThen came a 15-hour flight to Chicago’s O’Hare International Airport, where immigration lawyers were ready to assist in case there were last-minute glitches.\n\nFinally, Mushkaad boarded her final plane to Minnesota.\n\n\n\nSamira Dahir’s daughters are together again for the first time in nearly four years. (Jenn Ackerman for The Washington Post)\n\nWaiting there were Dahir and Mushkaad’s sisters, who were so excited to see her that they tried to run through security to give her a hug. All three wore matching pink coats and pink scarves.\n\n“Before I even said anything, she starts saying, ‘Mommy, Mommy, Mommy,’ ” Dahir recounted. The family went out to dinner with friends and supporters Thursday night. At a party afterward, the guest of honor opened presents and cut into a cake decorated with yellow, pink and blue balloons. It read “Welcome Mushkaad.”\n\nDahir avoided saying much about Trump’s executive order, but through the interpreter, she conveyed that she wants him and others to understand that refugees are vulnerable and only flee their countries because there is no safety or education for their children.\n\n“Every refugee mom or parent,” she explained, “wants their children to be educated and have a better life than themselves.”", "authors": [], "publish_date": "2017-02-03", "source": "washingtonpost", "top_words": ["executive", "travel", "case", "dahir", "child", "family", "ban", "refugee", "mushkaad", "order", "united", "trumps", "went", "states", "meets", "washington"], "summary": "In December, she got word that the girl was finally cleared to come to the United States.\nBut as the child and a chaperon were at the airport in Kampala, they were told that Trump’s order would not allow her to enter the United States.\nIn the refugee camp, she gave birth to her older daughters and applied for refugee status in the United States.\n“I don’t think [the Trump administration] would ever expect, with the stroke of a pen, an executive order would put all of these families in peril,” Klobuchar said.\nShe wasn’t, and it was there that she got a national interest waiver to come to the United States."}