{"url": "https://www.washingtonpost.com/opinions/is-trumps-travel-ban-moral-legal-both-neither/2017/01/31/f5862444-e732-11e6-903d-9b11ed7d8d2a_story.html", "id": "158", "title": "Is Trump’s travel ban moral? Legal? Both? Neither?", "text": "Regarding the Jan. 30 front-page article “Trump stands by order as confusion, dissent swirl”:\n\nThe guidance provided by President Trump and his team to Immigration and Customs Enforcement officials was so confusing and disorganized that his own staff, including Homeland Security Secretary John F. Kelly and Mr. Trump’s chief of staff, Reince Priebus, did not know how green-card holders were to be vetted. In a separate statement, Mr. Trump indicated that the “seven countries named in the Executive Order were the same countries previously identified by the Obama administration as sources of terror.”\n\nIt is ironic that none of the Muslim-majority countries where Mr. Trump has business interests were included in the list and that Mr. Trump and his staff did not have the wherewithal or competence to create their own comprehensive list of countries for this purpose.\n\nJoel Papier, Olney\n\nThe Jan. 29 editorial “Pandering to fear” criticized President Trump’s executive order “calling a temporary halt to travel to the United States from seven predominantly Muslim nations” and said it was “an affront to values upon which the nation was founded.” The law authorizes the president to do precisely what Mr. Trump has done. You don’t have to be a lawyer, which I am not, to find the relevant section of the U.S. Code. All you need to do is Google “8 U.S. Code § 1182 — Inadmissible aliens, paragraph (f), Suspension of entry or imposition of restrictions by President,” which reads as follows:\n\n“Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate.”\n\nJay R. Baker, Rockville\n\nWhen he immigrated, my grandfather had one relative in the United States: his cousin Cecilia. Cecilia was a cook at the White House. She was able to secure a job for my grandfather, an undocumented worker, as a White House gardener.\n\nMy grandfather was unaccustomed to Washington heat in the summer. He said he felt as if he were working in a furnace. On a particularly hot day, first lady Florence Harding brought bowls of ice cream out to the gardeners. “Only in America,” my grandfather would say, “would the president’s wife serve common laborers ice cream.”\n\nMy grandfather (and Ms. Harding) knew that the United States was the greatest country on Earth. How sad to see our humanity and decency squashed by bullies. Unless we are all 100 percent Native American, we must stand by immigrants. Our ancestors would expect nothing less.\n\nJulia A. Collins, Boyds\n\nI am an immigrant. Ever since I became a naturalized citizen when still a child, I felt blessed to be an American and, throughout many decades, I was always proud to show my U.S. passport whenever and wherever I traveled. For the first time in my life, I am not proud of my government, and I am fearful about the future of the United States. That is personally devastating and heart-rending.\n\nKsenia Kuzmycz, North Potomac\n\nClaims by House Speaker Paul D. Ryan (Wis.) and other Republican leaders that President Trump’s recent immigration orders would not create a religious test for entry into the United States would be laughable were they not so pernicious. Supreme Court Justice Antonin Scalia famously saw through just this type of deceit when he quipped: “A tax on wearing yarmulkes is a tax on Jews.” Don’t be fooled. A ban on Syrians, Iranians, Iraqis, Libyans, Somalis, Sudanese and Yemenis is a ban on Muslims.\n\nLarry L. Goldstein, Chevy Chase", "authors": [], "publish_date": "2017-01-31", "source": "washingtonpost", "top_words": ["travel", "aliens", "trump", "ban", "grandfather", "united", "trumps", "countries", "entry", "states", "president", "moral", "mr", "legal"], "summary": "You don’t have to be a lawyer, which I am not, to find the relevant section of the U.S. Code.\nShe was able to secure a job for my grandfather, an undocumented worker, as a White House gardener.\n“Only in America,” my grandfather would say, “would the president’s wife serve common laborers ice cream.”My grandfather (and Ms. Harding) knew that the United States was the greatest country on Earth.\nFor the first time in my life, I am not proud of my government, and I am fearful about the future of the United States.\nA ban on Syrians, Iranians, Iraqis, Libyans, Somalis, Sudanese and Yemenis is a ban on Muslims."}