{"url": "https://www.washingtonpost.com/news/food/wp/2017/02/07/can-eating-lead-to-understanding-in-the-case-of-trumps-travel-ban-some-hope-so/", "id": "196", "title": "Can eating lead to understanding? In the case of Trump’s travel ban, some hope so.", "text": "While President Trump has been trying to keep people from the seven countries on his “ban” list out, others have been working to bring people in — to the restaurants that serve the affected people’s food.\n\nAs Trump’s executive order to bar refugees and other travelers from Iraq, Iran, Syria, Libya, Somalia, Sudan and Yemen heads into its latest challenge — a federal appeals court will hear arguments Tuesday night on whether to restore the order — some in the restaurant industry have responded the best way they know how. What better way to promote an understanding of a foreign culture — and thus combat xenophobia — than to suggest that diners taste its food?\n\n[Restaurants depend on immigrants. Trump’s orders could hit them particularly hard.]\n\nWriters across the country have published listicles of where to eat food from the affected countries. L.A. Weekly told its readers where to get Libyan tagine or Yemeni malawach. A Boston-area food blogger sent readers to an Iraqi food truck for dijaj ahmer, a dish of chicken cooked in tomato sauce. Seattle Refined tipped its readers off to a catering company, Project Feast, that employs refugee and immigrant cooks and serves Iraqi, Syrian and east African food. Lissa Rosenthal-Yoffe, the Washington-area director of a cultural nonprofit, started a Facebook group soliciting nationwide recommendations for restaurants owned by people from, or serving the food of, the countries affected by the ban. The Washington Post, for what it’s worth, compiled a list of restaurants that includes cuisine from many of the banned countries in 2015.\n\nOne of the highest-profile efforts comes from a group called Breaking Bread NYC, which launched a map and food tour focusing on cuisines of the listed nations, donating proceeds to such groups as the Council on American-Islamic Relations. The group originally planned to call itself “Eat the Ban.”\n\n[Who makes the tortillas, pierogi and pasta you love? These immigrants do.]\n\n“We all realize that fear comes from misunderstanding, and the best way to understand each other is to eat together. You eat food from someone else’s culture and understand more about their grandmother and upbringing,” the group’s co-founder Scott Wiener told the New York Daily News.\n\nHome cooks and the businesses that cater to them have responded in kind. Food 52 and Grub Street published lists of cookbooks from the banned countries, including “The Aleppo Cookbook,” “Sirocco” and “The Africa Cookbook.” San Francisco’s Omnivore Books tweeted out a widely shared photo of its window display:\n\nMy new shop window, courtesy of our president. pic.twitter.com/FoHurAz0Y8 — Omnivore Books (@omnivorebooks) January 28, 2017\n\nIn Detroit, an Iranian chef turned Peace Meal Kitchen, the pop-up restaurant she created to expose diners to her native food, into a fundraiser for the Michigan chapter of the American Civil Liberties Union.\n\n“Food has always been used as a bridging tool throughout many cultures throughout history,” founder Mana Heshmati told NPR. “It takes out some of the stigma of some of the politics. It helps people reach a new level of understanding about a different culture. Food makes everything approachable.”\n\n[Aleppo in our hearts, and in the kitchen]\n\nConflict Kitchen, a Pittsburgh restaurant/art project that serves food from countries that are in conflict with the United States, will be introducing an immigrant guest chef program at partnering Pittsburgh restaurants, focusing on Syrian cooking, in March. And Syria Supper Club, a year-old initiative that brings refugees and Americans together to break bread in private homes, has caught the attention of NPR and CNN.\n\n“People see Syria Supper Club as a way to resist,” Kate McCaffrey, the club’s co-founder, said to Quartz.\n\nAs enjoyable a form of resistance as it may be, learning about and eating food from the banned countries will not, of course, directly influence lawmakers or change any policy. But it could make a difference for immigrant-owned restaurants, whose businesses may have suffered because of stigma. And while some of those restaurant owners may be safely based in this country, many are worried about their family members, which can take a toll on their work.\n\n“In order to run a business, you have to be in a settled, comfortable position. You have to be more stable,” Arwa Aljarmozi told The Post. As the owner of House of Mandi, a Yemeni restaurant in Arlington, Va., it’s a luxury she doesn’t have; though she’s a naturalized citizen, she worries that her children will never again see their grandparents, who live in Yemen. The Post wrote about Aljarmozi and other restaurant owners who are concerned about an immigration crackdown last week.\n\nAnd even though Kiwiana in Brooklyn isn’t serving the food of any of the banned nations — it’s a New Zealander restaurant — it has introduced a pointed way of reminding people about the connection between immigration and dining. Chef Mark Simmons recently added a note to the bottom of all of his receipts that reads: “Immigrants make America great (they also cooked your food and served you today).”\n\nhttps://twitter.com/stephichernov/status/828306366800461824", "authors": [], "publish_date": "2017-02-07", "source": "washingtonpost", "top_words": ["food", "travel", "case", "lead", "ban", "eating", "told", "trumps", "countries", "restaurant", "banned", "eat", "syria", "restaurants", "readers", "hope", "understanding", "way"], "summary": "Writers across the country have published listicles of where to eat food from the affected countries.\nA Boston-area food blogger sent readers to an Iraqi food truck for dijaj ahmer, a dish of chicken cooked in tomato sauce.\nThe Washington Post, for what it’s worth, compiled a list of restaurants that includes cuisine from many of the banned countries in 2015.\nYou eat food from someone else’s culture and understand more about their grandmother and upbringing,” the group’s co-founder Scott Wiener told the New York Daily News.\nAs enjoyable a form of resistance as it may be, learning about and eating food from the banned countries will not, of course, directly influence lawmakers or change any policy."}