{"url": "https://www.washingtonpost.com/local/public-safety/government-reveals-over-100000-visas-revoked-due-to-travel-ban/2017/02/03/7d529eec-ea2c-11e6-b82f-687d6e6a3e7c_story.html", "id": "188", "title": "Justice Dept. lawyer says 100,000 visas revoked under travel ban; State Dept. says about 60,000", "text": "More than 100,000 visas have been revoked as a result of President Trump’s ban on travel from seven predominantly Muslim countries, an attorney for the government asserted Friday in federal court in Alexandria, Va.\n\nThe number came out during a hearing in a lawsuit by two Yemeni brothers who arrived at Dulles International Airport last Saturday and were quickly put on a return flight to Ethi­o­pia because of the new restrictions. While the government is working to resolve that case and return the brothers to the United States, lawyers at the hearing addressed the broader impact of the ban.\n\nThe 100,000 figure was immediately disputed by the State Department, which said the number of visas revoked was roughly 60,000. A spokeswoman said the revocations have no impact on the legal status of people already in the United States. If those people leave the United States, though, their visas will no longer be valid.\n\nImmigrant advocates, attorneys and the media have been pushing the Trump administration to offer an accounting of how many people were affected by the controversial executive order.\n\nIn response to a question from a judge, Erez Reuveni, of the Justice Department’s Office of Immigration Litigation, told the U.S. District Court that there were tens of thousands abroad holding visas when Trump signed his order a week ago.\n\n(Heba Farouk Mahfouz / The Washington Post)\n\n“Over 100,000 visas were revoked on Friday at 6:30 p.m.,” Reuveni told the court, speaking of Jan. 27.\n\nReuveni offered no other details about the group of people. He said that he did not know how many people had been detained at the nation’s airports because of the order but that it could be 100 to 200. It was not immediately clear how the Justice Department and State Department arrived at such different tallies for the broader number of people affected.\n\n“The number 100,000 sucked the air out of my lungs,” said Simon Sandoval-Moshenberg of the Legal Aid Justice Center, who represents the Yemeni brothers.\n\nDuring the hearing, U.S. District Court Judge Leonie M. Brinkema said she was heartened to see that the government was working to return the brothers, Tareq and Ammar Aqel Mohammed Aziz, to the United States and reinstate their visas in exchange for dropping their case. The government appears to be attempting similar case-by-case reprieves across the nation.\n\n[Has your visa been affected by Trump’s travel ban? Tell us about it.]\n\nBut Brinkema offered a stern rebuke to the Trump administration in its overall handling of the travel ban. Brinkema said the case had drawn an even larger public outpouring than another high profile one she handled: the trial of 9/11 conspirator Zacarias Moussaoui.\n\n“This order was issued quite quickly. It’s quite clear that not all the thought went into it that should have gone into it,” Brinkema said. “It was chaos.”\n\nShe said people had relied on their visas as valid and families had expected to be reunited with loved ones. Brinkema said there was no evidence that the travel restrictions were necessary.\n\nShe urged the government to work “globally” to resolve all the cases of those affected by the travel ban. Lawsuits have been playing out over individual cases in at least 10 courts across the country.\n\nThe Trump administration has argued that the travel ban is necessary to keep Americans safe from terrorism as it institutes more restrictive vetting of visitors and refugees, but it has drawn protests at airport’s nationwide and condemnation from Democrats, many of whom call the executive action a “Muslim ban.”\n\nBrinkema on Friday extended a temporary restraining order she had issued blocking the removal of any green-card holders being detained at Dulles and requiring that people held there because of the ban have access to lawyers.\n\nThe judge also allowed the state of Virginia to join the lawsuit. State officials argued in court that more than 350 students from a handful of state universities had been affected by the travel ban, along with professors and other workers.\n\nThe officials said they include a Libyan woman from George Mason University who was stuck in Turkey and an Iranian doctoral student who is unable to travel to the United States to defend his dissertation. In addition, Brinkema ordered the government to turn over a list of the state’s lawful permanent residents and visa holders who were affected by the ban.\n\nOutside the courthouse, Virginia Attorney General Mark R. Herring (D) said he was “really pleased the judge recognized real harm is happening in Virginia.”\n\nHerring’s office had also been seeking to hold government officials in contempt for the way they handled travelers from the seven countries over the weekend, but Brinkema declined, saying she did not know enough Friday to make that determination.\n\nVirginia officials had cited news reports and affidavits from lawmakers saying that, contrary to the order Brinkema issued last weekend, Customs and Border Patrol officers had denied immigrants access to lawyers.\n\n“There were so many lawyers there willing to help, and not a single one got access,” Virginia Solicitor General Stuart A. Raphael said during the hearing.\n\nReuveni said that security at Dulles bars lawyers from anything but telephone access to people who are in screening. Separately, affiliates of the American Civil Liberties Union in all 50 states have filed freedom-of-information requests to gain a greater understanding of how customs officials are implementing Trump’s order.\n\nBrinkema also allowed a Sudanese woman to join the lawsuit. Sahar Kamal Ahmed Fadul was traveling on the same flight as the Aziz brothers and was sent on a return flight to Ethi­o­pia by customs officials. She had plans to meet her fiance in Colorado and get married.\n\n“Too suddenly, at the stroke of a pen, that dream was dashed,” said her attorney, Timothy Heaphy. “It’s tremendously traumatic.", "authors": [], "publish_date": "2017-02-03", "source": "washingtonpost", "top_words": ["travel", "ban", "visas", "state", "justice", "brinkema", "dept", "officials", "lawyer", "united", "order", "court", "revoked", "states", "60000", "100000"], "summary": "The 100,000 figure was immediately disputed by the State Department, which said the number of visas revoked was roughly 60,000.\nA spokeswoman said the revocations have no impact on the legal status of people already in the United States.\nIf those people leave the United States, though, their visas will no longer be valid.\nBut Brinkema offered a stern rebuke to the Trump administration in its overall handling of the travel ban.\nShe urged the government to work “globally” to resolve all the cases of those affected by the travel ban."}