{"url": "https://www.washingtonpost.com/news/wonk/wp/2017/03/20/how-trumps-travel-ban-would-hurt-the-people-who-voted-for-him/", "id": "145", "title": "How Trump’s travel ban would hurt the people who voted for him", "text": "\n\nPresident Trump signs his first executive order for a U.S. travel ban at the Pentagon on Jan. 27. After a court blocked it, he issued a revised order in March, which a court also blocked. (Carlos Barria/Reuters)\n\nIn defending an order to restrict immigration from certain majority-Muslim nations, President Trump and his administration have emphasized the alleged risks of letting in people that they fear intend to do Americans harm.\n\nBut the administration has made little effort to address the consequences of keeping such visitors out, and new data suggest that by choking off the flow of immigration from the six blacklisted countries — Iran, Libya Somalia, Syria, Sudan and Yemen — the Trump administration risks dwindling the supply of doctors in parts of rural America that need them most.\n\nThe United States has long relied on immigrants to practice medicine in areas where doctors are otherwise hard to come by, including many rural areas. Lack of access to medical care is one reason rural Americans tend to live shorter lives than their urban counterparts. Where doctors are scarce, deaths from chronic, treatable diseases are more common.\n\nFederal programs provide incentives to talented foreigners to practice medicine in rural areas, including states such as West Virginia, a state where only 1.2 percent of residents are immigrants, but where 28 percent of the doctors received their training overseas, according to data from the Association of American Medical Colleges. (Some fraction of these may be U.S.-born citizens — the data do not distinguish — but it's safe to assume that the majority of these doctors are immigrants.)\n\nIf Trump succeeds in implementing his travel ban from these six countries, he risks cutting off that supply of doctors and exacerbating shortages in rural areas. A recent report from researchers at Harvard and MIT shows that doctors trained in the countries targeted by the travel ban are an important part of this effort.\n\nIt's not as if the travel ban would leave rural America doctor-free overnight. Of the nation’s 800,000 active physicians, only about 7,000 — or about 0.85 percent — come from the six targeted countries, according to medical license data collected by the physician-networking site Doximity. And the order wouldn't remove the immigrant doctors who are already here, only prevent new ones from entering in the next three months.\n\nImmigrant doctors from those six countries are often recruited to practice medicine in rural places. In West Virginia, for example, immigrants from the six blacklisted countries alone account for 2.7 percent of physicians, according to a Washington Post analysis of census data. In Michigan, it's 2.3 percent of physicians. In Ohio, 1.5 percent. That's a small slice, but it's a slice that areas with doctor shortages can ill-afford to lose.\n\nMany of the most affected states would be ones that supported Trump in the 2016 election, as this scatter plot shows. Unlike typical immigrants, who concentrate in blue states, the doctors from the targeted countries live all across the nation.\n\nAnother way to see how these doctors are spread out is to compare the counties that were most and least enthusiastic about Trump. The following chart shows the nation’s 3,000-plus counties divided into 10 groups. At the top are the counties where Trump received the highest share of the vote. On bottom are the counties where Trump received the smallest share of the vote. Immigrants are rare in places that showed the highest support for Trump, making up only 3.3 percent of residents. In anti-Trump counties, on the other hand, the foreign-born were over 20 percent of the population.\n\nIn contrast, doctors trained in the six targeted counties are evenly distributed in red and blue parts of the country, according to an analysis of the Doximity data by Anupam Jena, an associate professor at Harvard Medical School.\n\nIf anything, the immigrant doctors are slightly more prevalent in both particularly pro-Trump and pro-Clinton areas. This is because medically underserved areas tend to be located either in rural America, which largely votes Republican, or in the inner city, which largely votes Democrat.\n\nThe above trend is a small piece of a bigger picture: Immigrants increase the pool of high-skill workers ready to do the most in-demand jobs — including those from the six countries the Trump administration wants to blacklist.\n\nCompared with native-born Americans, immigrants from the six blacklisted countries are 2.8 times more likely to have a law or medical degree, and 4.3 times as likely to have a PhD, according to a Washington Post analysis of census data. Although the president continues to claim that people from the targeted countries are terrorist risks, many of those ensnared by his earlier travel ban in January turned out to be scientists and doctors. If his new restrictions eventually go forward, they will not only prevent hospitals from recruiting new physicians, but also universities, for instance, from bringing in new professors and tech companies from hiring new programmers.\n\nTrump has continually understated — or outright rejected — the potential benefits of immigration to the United States. He announced his presidential run by claiming that immigrants from Mexico aren't that country's “best” but rather its “rapists” and “murderers.” And since then, he has made the alleged danger of immigrants — and particularly of Muslim immigrants — a central theme of both his White House run and the opening months of his presidency.\n\nAt times in the past, however, the president has shown support for highly skilled immigrants. On a Breitbart radio show in November 2015, Trump suggested that foreign Ivy League students should be encouraged to stay in the United States. “You know, we have to keep our talented people in this country,” he said.\n\nPowerful members of his administration disagree, seeing immigrants as a threat to society simply because they are immigrants.\n\nTrump was being interviewed by Stephen K. Bannon, a former Breitbart News executive who is now chief strategist of Trump's White House — and among the principal architects of the proposed ban. And whatever their economic benefits, Bannon disagreed with Trump's sentiments about working to retain talented foreigners.\n\n“A country is more than an economy,” Bannon replied. “We’re a civic society.”\n\nShould a version of Trump's proposed travel ban survive legal challenge — the administration filed papers against a federal ruling that stayed the proposed executive action — the administration will be able to put one these views of high-skill immigrants into practice. Trump’s executive order would allow the Department of Homeland Security to make case-by-case exceptions in the name of the national interest. It remains to be seen, however, how, or if, those waivers would be applied.", "authors": [], "publish_date": "2017-03-20", "source": "washingtonpost", "top_words": ["doctors", "hurt", "travel", "rural", "voted", "trump", "ban", "immigrants", "areas", "trumps", "countries", "data", "administration"], "summary": "President Trump signs his first executive order for a U.S. travel ban at the Pentagon on Jan. 27.\nThe United States has long relied on immigrants to practice medicine in areas where doctors are otherwise hard to come by, including many rural areas.\nIf Trump succeeds in implementing his travel ban from these six countries, he risks cutting off that supply of doctors and exacerbating shortages in rural areas.\nA recent report from researchers at Harvard and MIT shows that doctors trained in the countries targeted by the travel ban are an important part of this effort.\nIt's not as if the travel ban would leave rural America doctor-free overnight."}