{"url": "https://www.washingtonpost.com/opinions/is-trumps-travel-ban-unconstitutional/2017/06/01/a255efb6-463c-11e7-8de1-cec59a9bf4b1_story.html", "id": "134", "title": "Is Trump’s travel ban unconstitutional?", "text": "Protesters hold signs and march outside the U.S. Court of Appeals for the 4th Circuit in Richmond on May 8. (Steve Helber/Associated Press)\n\nThe May 29 editorial “Mr. Trump’s travel ban is offensive” gave the president a wholly unwarranted and unjustifiable constitutional pass. Three things differentiate President Trump’s anti-Muslim rants from garden-variety campaigning. First, in the modern history of presidential campaigns, only George Wallace was as explicit in hateful speech, and no serious person doubted that he was a racist. Second, Mr. Trump’s rants continued after the election. And third, Mr. Trump has never directly and unequivocally repudiated the rants. Beyond all that, if Mr. Trump had made (and never repudiated) campaign statements advocating banning all Jews or Catholics from entering the United States, the argument that the courts should not take the statements into account would not survive its own articulation. It is therefore easy to see why the U.S. Court of Appeals for the 4th Circuit took the rants into account and, thus, why it ruled as it did. As Mr. Trump might tweet: The Post does not think that speech or a pattern of speech matters. So sad!\n\nMichael M. Landa, Kensington\n\nThe constitutionality of President Trump’s travel ban on six majority-Muslim countries may well pivot on determining his intent, an elusive exercise, as noted in the May 29 editorial. Both sides are girding for a Supreme Court showdown.\n\nThe travel ban was issued on March 6 in an executive order. It asserted these countries were not providing information sufficient for our government to vet visa applicants.\n\nThe order called for the homeland security secretary to submit a report within 20 days about what information our government needed from these countries to allow for adequate screening. That report should be ready, given that the order was issued more than 80 days ago.\n\nThe courts should examine the requests that the administration plans to make and determine whether they comply with applicable laws — rather than deducing the president’s motives.\n\nLarry Kahn, Potomac", "authors": [], "publish_date": "2017-06-01", "source": "washingtonpost", "top_words": ["travel", "trump", "ban", "speech", "court", "trumps", "countries", "order", "president", "unconstitutional", "mr", "rants"], "summary": "Trump’s travel ban is offensive” gave the president a wholly unwarranted and unjustifiable constitutional pass.\nThree things differentiate President Trump’s anti-Muslim rants from garden-variety campaigning.\nSecond, Mr. Trump’s rants continued after the election.\nAs Mr. Trump might tweet: The Post does not think that speech or a pattern of speech matters.\nMichael M. Landa, KensingtonThe constitutionality of President Trump’s travel ban on six majority-Muslim countries may well pivot on determining his intent, an elusive exercise, as noted in the May 29 editorial."}