{"url": "https://www.washingtonpost.com/news/volokh-conspiracy/wp/2017/07/07/federal-judge-issues-strange-ruling-denying-hawaiis-challenge-to-administrations-implementation-of-trumps-travel-ban-executive-order/", "id": "172", "title": "Federal judge issues strange ruling denying Hawaii’s challenge to administration’s implementation of Trump’s travel ban executive order", "text": "Federal District Court Judge Derrick Watson (District of Hawaii).\n\nA few hours ago, federal district court judge Derrick Watson issued a ruling denying the state of Hawaii’s challenge to the Trump administration’s dubious interpretation of the Supreme Court’s recent ruling on the injunctions against the president’s travel ban executive order. The ruling is not only wrong, but extremely strange. Instead of concluding that Hawaii’s position was wrong, Judge Watson opined that he somehow lacked the authority to interpret the Supreme Court’s decision.\n\nThe order bans citizens of six Muslim-majority nations from entering the United States for 90 days, and bans refugee admissions from around the world for 120 days. Two federal appellate courts had issued preliminary injunctions blocking implementation of the order: the Fourth Circuit because it was likely motivated by unconstitutional discrimination against Muslims; the Ninth Circuit because it determined that the president had exceeded the statutory authority granted to him by Congress. On June 26, the Supreme Court partly lifted the injunctions, but retained them with respect to “foreign nationals who have a credible claim of a bona fide relationship with a person or entity in the United States.”\n\nThe Trump administration decided that such relationships as being the grandparent, uncle, or aunt of a US resident do not qualify as the sort of “close familial relationship” protected by the Supreme Court’s ruling, even though the Court specifically noted that being a mother-in-law of a US resident is sufficient. The administration also decided that refugees’ relationships with US-based refugee sponsorship organizations were not sufficiently “bona fide.”\n\nBoth of these determinations are extremely dubious, particularly the one about relatives (see also this detailed analysis by immigration law scholar Peter Margulies). The state of Hawaii, one of the plaintiffs in the Ninth Circuit case, filed an emergency motion urging the trial court judge to force the administration to allow admission of close relatives and refugees who have established relationships with sponsoring organizations.\n\nJudge Watson has now ruled against Hawaii – not because he concluded that its position is wrong, but because the issue can only be resolved by the Supreme Court itself: “Because Plaintiffs seek clarification of the June 26, 2017 injunction modifications authored by the Supreme Court, clarification should be sought there, not here.”\n\nThis makes little sense. It is standard practice for lower courts to interpret and apply the decisions of higher courts when doing so is necessary to resolve the issue at hand. It is particularly common for this to happen in cases where an appellate court issues a procedural ruling in an ongoing case, and the trial judge must then apply the appellate decision to ongoing issues that may arise. Judge Watson wrote that he “declines to usurp the prerogative of the Supreme Court to interpret its own order.” But no usurpation is involved when a trial court interprets a relevant decision by an appellate court. If the Supreme Court disagrees with Judge Watson’s interpretation of its order, it is free to reverse his decision (as is the Ninth Circuit Court of Appeals).\n\nIn my view, Hawaii’s position on these two disputed issues is overwhelmingly strong, and the administration’s borders on incompetence or outright bad faith. But even if I am wrong about that and these questions are more disputable, the trial court still has a duty to apply the Supreme Court’s ruling and – where necessary – interpret it. That is simply a standard part of the job of lower court judges. It’s hard to understand why Judge Watson chose not to do it in this case.\n\nJudge Watson cites a few cases where one court indicated it would be inappropriate for it to overrule or second-guess another court’s interpretation of its own injunction. But Hawaii is not asking the district court to somehow overrule the Supreme Court’s interpretation of its own order. It is merely asking Judge Watson to apply that order and reject the dubious interpretation developed by the administration. The situation would be different if, for example, the Supreme Court had said that being the grandparent of an American does not qualify as a “close familial relationship,” and Hawaii asked Judge Watson to rule otherwise. Judge Watson obviously cannot reverse or set aside any part of the Supreme Court’s decision. But no such thing has occurred here. Rather, the Court has outlined the relevant standard – “a credible claim of a bona fide relationship with a person or entity in the United States” – and it is the job of the trial court to interpret and apply that ruling.\n\nJudge Watson previously ruled against the travel ban, and indeed first issued the injunction that eventually made its way to the Ninth Circuit and the Supreme Court. So it is unlikely that he ducked this question out of some hidden sympathy for the administration’s position, or because he is unwilling to deal with a controversial question in a high-profile case. I am sure he genuinely believes that only the Supreme Court itself can interpret its ruling on the injunction. But it’s a strange and dubious conclusion nonetheless.\n\nHawaii will likely appeal this ruling to the Ninth Circuit. Hopefully, the appellate judges there will step up to the plate, even though Judge Watson chose not do so. In the meantime, there will be continued uncertainty about the effect of the Supreme Court’s ruling, and many of those affected by the executive order – including some refugees escaping horrible conditions – will remain in limbo.\n\nUPDATE: I have a a few minor additions to this post.\n\nUPDATE #2: Noted legal journalist Lyle Denniston has a similar reaction to this ruling:\n\nIn the ordinary decision coming out of the Supreme Court, the Justices sometimes leave issues or interpretations open, and it is commonly understood that any such gaps will be filled in when the case returns to a lower court for the Justices’ ruling to be carried out. It is very rare for the Justices to be asked directly to specify what they meant when questions arise about the language it has used in an opinion. In fact, it is not clear where, in the court’s rules of procedure, there is a provision allowing a motion to clarify or modify. It is conceivable the Justices might be asked to rehear the enforcement issue, but that, too, may not be contemplated by its rules.\n\nUPDATE #3: Hawaii has now officially appealed Judge Watson’s decision to the Ninth Circuit.", "authors": [], "publish_date": "2017-07-07", "source": "washingtonpost", "top_words": ["ruling", "implementation", "travel", "ninth", "courts", "supreme", "issues", "circuit", "judge", "hawaiis", "court", "strange", "trumps", "federal", "order", "watson", "interpret"], "summary": "A few hours ago, federal district court judge Derrick Watson issued a ruling denying the state of Hawaii’s challenge to the Trump administration’s dubious interpretation of the Supreme Court’s recent ruling on the injunctions against the president’s travel ban executive order.\nInstead of concluding that Hawaii’s position was wrong, Judge Watson opined that he somehow lacked the authority to interpret the Supreme Court’s decision.\nIt’s hard to understand why Judge Watson chose not to do it in this case.\nIt is merely asking Judge Watson to apply that order and reject the dubious interpretation developed by the administration.\nHopefully, the appellate judges there will step up to the plate, even though Judge Watson chose not do so."}