{"url": "https://www.washingtonpost.com/news/early-lead/wp/2017/01/30/gregg-popovich-and-steve-kerr-sharply-criticize-trumps-travel-ban/", "id": "147", "title": "Gregg Popovich and Steve Kerr sharply criticize Trump’s travel ban", "text": "\n\nGregg Popovich is shown during a Spurs game earlier in January. (David Zalubowski/Associated Press)\n\nThe executive order issued by President Trump on Friday, temporarily barring citizens from seven majority-Muslim nations from entering the U.S., caused numerous protests and created ripples in the sports world. Among those speaking out Sunday against the administration’s move were a pair of NBA coaches, Gregg Popovich and Steve Kerr.\n\nThe two have already emerged as prominent critics of Trump, particularly Popovich, whose lengthy comments last week included saying of the president, “You’ve gotten to the point where you really can’t believe anything that comes out of his mouth.” On Sunday, Popovich referred to the confusion surrounding the reach, not to mention legality, of the executive order.\n\n[‘Not what he died for’: Pat Tillman’s widow dismayed by Trump’s ban]\n\n“As you already know, I have lots of thoughts about what we’ve done to ourselves as a country and what we’ve allowed to happen,” the Spurs coach said (via ESPN’s Michael C. Wright). “But we’ll see where this goes.\n\n“Obviously the rollout today was Keystone Kops-like by any measure with objectivity. Whether you want to say it’s good or bad is irrelevant. But it was Keystone Kops, and that’s scary.”\n\nKerr, who made light last week of White House press secretary Sean Spicer’s claims about attendance at the inauguration, struck a much more somber tone Sunday. He referred to his father, Dr. Malcolm Kerr, who was president of American University of Beirut, and was assassinated there by Islamic terrorists in 1984.\n\n“I would just say — as someone whose family member was a victim of terrorism — having lost my father, if we’re trying to combat terrorism by banishing people from coming to this country, by really going against the principles of what our country is about, and creating fear, it’s the wrong way to go about it,” the Warriors coach told reporters. “If anything, we could be breeding anger and terror, so I’m completely against what’s happening.\n\n“It’s shocking. It’s a horrible idea, and I really feel for all of the people who are affected, the families that are being torn apart, and I worry in the big picture what this means to the security of the world. It’s going about it completely opposite. You want to solve terror, you want to solve crime, this is not the way to do it.”\n\nSteve Kerr — \"as someone whose family member was a victim of terrorism\" — speaks out against Donald Trump's recent executive order pic.twitter.com/YbCH2sn0hw — Anthony Slater (@anthonyVslater) January 30, 2017\n\n[U.S. basketball players ‘stranded’ in Dubai, unable to return to team in Iran]\n\nKerr added that, while he had not had a chance over the weekend to discuss the executive order with his players, he and his team “talk a lot about this stuff.” Just after the election, Golden State forward David West had said, “This whole fairy tale about some post-racial … this utopia that Obama supposedly created, it’s all bull. That’s the bottom line. When you look at what the results say from last night, this nation has not moved a thread in terms of its ideals.”\n\nThat election roiled the NBA, with many prominent league figures, including Kerr and Popovich, decrying what they saw as a national turn in the wrong direction. Given the coaches’ recent remarks, it’s apparent that they don’t think Trump has done much to put America back on the right track.", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["executive", "travel", "kerr", "trump", "steve", "ban", "sharply", "order", "really", "popovich", "trumps", "president", "country", "terrorism", "criticize", "gregg", "say"], "summary": "Gregg Popovich is shown during a Spurs game earlier in January.\n(David Zalubowski/Associated Press)The executive order issued by President Trump on Friday, temporarily barring citizens from seven majority-Muslim nations from entering the U.S., caused numerous protests and created ripples in the sports world.\nAmong those speaking out Sunday against the administration’s move were a pair of NBA coaches, Gregg Popovich and Steve Kerr.\nHe referred to his father, Dr. Malcolm Kerr, who was president of American University of Beirut, and was assassinated there by Islamic terrorists in 1984.\nGiven the coaches’ recent remarks, it’s apparent that they don’t think Trump has done much to put America back on the right track."}