{"url": "https://www.washingtonpost.com/local/social-issues/groups-fighting-travel-ban-see-an-equal-threat-in-trumps-proposed-budget/2017/03/16/6339d3d2-0a7e-11e7-a15f-a58d4a988474_story.html", "id": "173", "title": "Groups fighting travel ban see an equal threat in Trump’s proposed budget", "text": "President Trump attends the Friends of Ireland Luncheon at the U.S. Capitol on March 16. (Olivier Douliery/Bloomberg)\n\nAdvocacy groups fighting President Trump’s travel ban rallied outside the White House Thursday to celebrate a pair of court rulings that stopped it from being implemented but said their joy was tempered by the specifics of Trump’s newly released budget proposal.\n\nThe president is asking Congress to deeply cut foreign-aid, anti-poverty and other programs and boost funding for a border wall and to deport immigrants.\n\nStanding on a patch of snow and mud in front of 1600 Pennsylvania Ave. NW, holding signs that said “Love thy neighbor” and “My people were refugees too,” activists and advocates urged Trump to reverse course.\n\n“We are a nation of displaced persons. We come from everywhere, immigrants, refugees, former slaves. . . . This is our country,” said the Rev. Earl Trent, chairman of the board of Church World Service, which resettles refugees in the United States.\n\nHe asked Trump “to stand down from appealing” the ruling by federal judges to halt his travel ban, “to stand down from this cruel and mean hatred that he has displayed. To stand down and welcome the people of God.”\n\n(Peter Stevenson/The Washington Post)\n\nRep. Luis V. Gutiérrez (D-Ill.), who was briefly handcuffed Monday during a sit-in after a meeting with Immigration and Customs Enforcement officials in Chicago, said Trump’s policies have managed to unite the president’s opponents — from Muslims to people who support gay rights to those who advocate for reproductive rights.\n\n“We have a moment in America that I have not seen in my 25 years in the Congress of the United States,” Gutiérrez said. “We will together defeat this ban and the other discriminatory practices that want to be brought forward.”\n\nLater in the day, Kamal Essaheb, director of policy and advocacy at the National Immigration Law Center, said Trump’s executive orders and his budget proposal offered a jarring look at the president’s vision for the future.\n\n“Trump’s actions expose this administration’s blueprint for reshaping America,” Essaheb said in a conference call. “Those of us who oppose Trump’s agenda need to fight lots of fights. The budget, the Muslim ban and Trump’s deportation force will hurt real people in real communities.”", "authors": [], "publish_date": "2017-03-16", "source": "washingtonpost", "top_words": ["equal", "travel", "trump", "fighting", "ban", "real", "budget", "stand", "united", "trumps", "proposed", "groups", "refugees", "president", "threat"], "summary": "President Trump attends the Friends of Ireland Luncheon at the U.S. Capitol on March 16.\n(Olivier Douliery/Bloomberg)Advocacy groups fighting President Trump’s travel ban rallied outside the White House Thursday to celebrate a pair of court rulings that stopped it from being implemented but said their joy was tempered by the specifics of Trump’s newly released budget proposal.\nEarl Trent, chairman of the board of Church World Service, which resettles refugees in the United States.\nHe asked Trump “to stand down from appealing” the ruling by federal judges to halt his travel ban, “to stand down from this cruel and mean hatred that he has displayed.\nThe budget, the Muslim ban and Trump’s deportation force will hurt real people in real communities.”"}