{"url": "https://www.washingtonpost.com/news/grade-point/wp/2017/02/03/nearly-600-colleges-object-to-trumps-travel-ban/", "id": "126", "title": "Nearly 600 colleges object to Trump’s travel ban", "text": "\n\nGeorgetown University (Nikki Kahn/The Washington Post)\n\nNearly 600 colleges and universities have united behind a letter expressing concern about President Trump’s recent executive order on immigration.\n\nTrump signed an executive order last week that put in place a temporary ban on allowing people from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen to enter the United States, and a temporary suspension on allowing refugees to enter the country. The order, “Protecting the Nation from Foreign Terrorist Entry into the United States,” was welcomed by many Americans who felt it signaled a stronger effort to keep radical Islamist terrorists out of the country.\n\n“We want to make sure we are not admitting into our country the very threats our soldiers are fighting overseas,” Trump said in signing the measure.\n\n\n\nPresident Trump signs an executive order on extreme vetting during an event at the Pentagon in Washington on Jan. 27. (Susan Walsh/Associated Press)\n\nBut the order quickly led to protests and lawsuits around the United States. Many university leaders have spoken out strongly against the measure, arguing it harms their ability to recruit and retain top scholars and participate in academic collaborations overseas. They say it runs counter to fundamental American principles.\n\nIn letters both sweeping and intimate, presidents of institutions such as Princeton, MIT and Johns Hopkins have urged a change in the policy.\n\n[Ivy League and other presidents call on Trump to revoke, or change, the immigration order]\n\nOn Friday, hundreds of college leaders spoke in unison. The letter, sent from the American Council on Education on behalf of several higher education organizations to Homeland Security Secretary John F. Kelly said, in part:\n\nWe take seriously the need to safeguard our nation and also the need for the United States to remain the destination of choice for the world’s best and brightest students, faculty, and scholars. International exchange is a core value and strength of American higher education. Moreover, our nation’s welcoming stance to scholars and scientists has benefited the U.S. through goodwill and a long history of scientific and technological advances that have been essential to the economic growth our country has experienced for decades. When they return home they are ambassadors for American values, democracy and the free market. Our nation can only maintain its global scientific and economic leadership position if it encourages those talented people to come here to study and work. America is the greatest magnet for talented people from around the world and it must remain so.\n\n[51 Nobel laureates, tens of thousands of academics sign protest of Trump immigration order]\n\nIt closes with a list of the 598 colleges signing on, starting with Adelphi University of New York and ending, 14 pages later, with Yale University.\n\n[‘We fear the chilling effect this will have’: Nearly 50 higher education associations unite to oppose Trump order on immigration]\n\nGillian Christensen, a spokeswoman for the Department of Homeland Security, did not immediately respond to a request for comment Friday afternoon.\n\nEarlier this week she sent a written defense of the policy, which read, in part,\n\nThe United States has the world’s most generous immigration system, yet it has been repeatedly exploited by terrorists and other malicious actors who seek to do us harm. … The Executive Order protects the United States from countries compromised by terrorism and ensures a more rigorous vetting process. This Executive Order ensures that we have a functional immigration system that safeguards our national security. The Department of Homeland Security will continue to enforce all of President Trump’s executive orders in a manner that ensures the safety and security of the American people. We will treat all of those we encounter humanely and with professionalism.\n\n[‘I am trusting the American people’: Yale professor worries his wife and baby won’t be allowed back into the U.S. after Trump’s order on immigration]\n\nLetter From Institutions to DHS", "authors": [], "publish_date": "2017-02-03", "source": "washingtonpost", "top_words": ["executive", "travel", "trump", "colleges", "ban", "university", "security", "immigration", "nearly", "united", "trumps", "states", "order", "education", "600", "american", "object"], "summary": "Georgetown University (Nikki Kahn/The Washington Post)Nearly 600 colleges and universities have united behind a letter expressing concern about President Trump’s recent executive order on immigration.\nPresident Trump signs an executive order on extreme vetting during an event at the Pentagon in Washington on Jan. 27.\n(Susan Walsh/Associated Press)But the order quickly led to protests and lawsuits around the United States.\n… The Executive Order protects the United States from countries compromised by terrorism and ensures a more rigorous vetting process.\nThis Executive Order ensures that we have a functional immigration system that safeguards our national security."}