{"url": "https://www.washingtonpost.com/world/national-security/why-hawaii-says-trumps-new-travel-ban-is-still-unconstitutional/2017/03/08/3419306e-040e-11e7-b9fa-ed727b644a0b_story.html", "id": "127", "title": "Why Hawaii says Trump’s new travel ban is still unconstitutional", "text": "A federal judge in Hawaii will hear arguments on whether to block President Trump’s revised executive order barring the issuance of new visas to citizens of six Muslim-majority countries the day before the measure is set to take effect.\n\nU.S. District Judge Derrick K. Watson scheduled a hearing for March 15 at 3:30 p.m. Eastern time to hear arguments on the state of Hawaii’s latest legal challenge to the order.\n\nHawaii late Wednesday formally filed its lawsuit asking Watson to block the executive order.\n\nThe 38-page complaint asserts that the new executive order — much like the old — violates the establishment clause of the First Amendment because it is essentially a Muslim ban, hurts the ability of state businesses and universities to recruit top talent and damages the financial interests of the state, which considers tourism its lead economic driver.\n\n[Hawaii plans to sue to block new Trump travel ban]\n\n“President Trump’s new Executive Order is antithetical to Hawaii’s State identity and spirit,” lawyers for the state wrote. “For many in Hawaii, including State officials, the Executive Order conjures up the memory of the Chinese Exclusion Acts and the imposition of martial law and Japanese internment after the bombing of Pearl Harbor.”\n\nTrump’s new travel ban is substantially revised from its original version, and those who sue over it will probably have a harder time getting it ­immediately frozen by the courts. They will have to convince judges that there is an urgent need to do so and that, in the long term, Trump will probably be found to have run afoul of the First Amendment.\n\nThe new order reduces the list of affected countries from seven to six — removing Iraq while keeping Iran, Somalia, Sudan, Libya, Yemen and Syria. It explicitly exempts legal permanent residents and current visa holders, blocking only the issuance of new visas for citizens of the affected countries for 90 days.\n\nIt also spells out a lengthy list of people who may be eligible for exceptions, including those previously admitted to the United States for “a continuous period of work, study, or other long-term activity”; those with “significant business or professional obligations”; and those seeking to visit or live with family.\n\nThe new order keeps intact a 120-day suspension of the refu­gee program, and it declares that the United States will not accept more than 50,000 refugees in fiscal 2017, down from the 110,000 cap set by the Obama administration. It will take effect March 16 unless a court intervenes before then.\n\n[What Trump changed in the new travel ban]\n\nIn its lawsuit, Hawaii argues that foreign residents and ­travelers contribute substantially to the functioning of the state, and blocking even the issuance of new visas would have a major impact. State lawyers wrote that Hawaii is home to 12,000 foreign students, and at least 27 ­graduate students are from the seven countries affected by the original ban.\n\nIn 2016, lawyers for the state wrote, Hawaii’s foreign students contributed more than $400 million to Hawaii’s economy with tuition and fees, living expenses and other activities. The lawyers also said that tourism was a driver of Hawaii’s economy, and that 8.7 million visitors ­accounted for $15 billion in spending in 2015.\n\n[Trump’s new travel ban raises the same Silicon Valley objections]\n\nAs others did with the first travel ban, Hawaii is still ­pointing to campaign trail comments by Trump indicating that he wanted to impose a blanket ban on Muslims as evidence that the order violates the establishment clause of the First Amendment. U.S. officials have disputed that characterization.\n\nJustice Department lawyers have asserted that a short-term freeze is especially unnecessary, because the new ban only applies to the issuance of new visas, a process that can take months.\n\nIn its court filing, the state pointed to the case of Ismail Elshikh, the imam of the Muslim Association of Hawaii, whose mother-in-law’s application for an immigrant visa was still being processed. Under the new executive order, lawyers for Hawaii said, Elshikh feared that his mother-in-law would ultimately be banned from entering the United States.\n\nThat could be true, and Elshikh, a U.S. citizen, would have better standing to sue in U.S. courts than a noncitizen. But Justice Department lawyers might point to the waiver process as a way the imam’s mother-in-law could enter the country.\n\nThe state of Washington had successfully convinced a U.S. district judge and a three-judge appellate panel that economic harms imposed by Trump’s first ban presented a need to ­immediately order the measure suspended. The new order, though, might lessen the effect of any harms.", "authors": [], "publish_date": "2017-03-08", "source": "washingtonpost", "top_words": ["executive", "travel", "hawaii", "lawyers", "trump", "ban", "visas", "state", "hawaiis", "trumps", "order", "unconstitutional"], "summary": "Hawaii late Wednesday formally filed its lawsuit asking Watson to block the executive order.\n[Hawaii plans to sue to block new Trump travel ban]“President Trump’s new Executive Order is antithetical to Hawaii’s State identity and spirit,” lawyers for the state wrote.\nState lawyers wrote that Hawaii is home to 12,000 foreign students, and at least 27 ­graduate students are from the seven countries affected by the original ban.\n[Trump’s new travel ban raises the same Silicon Valley objections]As others did with the first travel ban, Hawaii is still ­pointing to campaign trail comments by Trump indicating that he wanted to impose a blanket ban on Muslims as evidence that the order violates the establishment clause of the First Amendment.\nUnder the new executive order, lawyers for Hawaii said, Elshikh feared that his mother-in-law would ultimately be banned from entering the United States."}