{"url": "https://www.washingtonpost.com/world/national-security/what-the-supreme-courts-travel-ban-ruling-means/2017/06/26/5e86e1cc-5a7e-11e7-9fc6-c7ef4bc58d13_story.html", "id": "115", "title": "What the Supreme Court’s travel ban ruling means", "text": "The Supreme Court’s decision to allow portions of President Trump’s travel ban to take effect is a win for the administration, but the impact will be far less severe than President Trump’s initial version of the measure.\n\nThat is because the high court effectively allowed Trump to ban from coming to the United States only citizens of six majority-Muslim countries “who lack any bona fide relationship with a person or entity in the United States.” It also nudged the president to complete his promised review of vetting procedures, which might mean the issue is resolved by the time the court is set to fully consider the ban in its October term.\n\nFor now, if you are not a U.S. citizen and have a relative here, have been hired by a U.S. employer or admitted to an American university, you can still probably get a visa. But if you’re applying cold as a visitor or through the diversity visa program, you probably can’t.\n\n[Supreme Court allows limited version of Trump’s travel ban to take effect, will consider case in fall]\n\n“The facts of these cases illustrate the sort of relationship that qualifies,” the court said in an unsigned opinion. “For individuals, a close familial relationship is required. A foreign national who wishes to enter the United States to live with or visit a family member … clearly has such a relationship. As for entities, the relationship must be formal, documented, and formed in the ordinary course, rather than for the purpose of evading [the executive order].”\n\n(Bastien Inzaurralde/The Washington Post)\n\nThe justices wrote that an immigration-rights nonprofit group could not simply add a foreign national to a client list just so that person could travel to the United States.\n\nThey said the same standard would apply to refugees wanting to come to the country, and those with U.S. connections would effectively be exempt from the 50,000-refu­gee cap the ban sought to impose.\n\nThere could, of course, be disputes. In a dissenting opinion that said the travel ban should have been allowed to take effect in full, Justice Clarence Thomas, joined by Justices Samuel A. Alito Jr. and Neil M. Gorsuch, wrote that the decision would “prove unworkable.”\n\n“Today’s compromise will burden executive officials with the task of deciding — on peril of contempt — whether individuals from the six affected nations who wish to enter the United States have a sufficient connection to a person or entity in this country,” Thomas wrote.\n\n[Trump’s big travel ban win? Let’s not get carried away.]\n\nWhen Trump issued his first travel ban, chaos ensued. The State Department provisionally revoked tens of thousands of visas, and some travelers were detained and sent away from U.S. airports, prompting a flurry of legal challenges. That will not be the case since the Supreme Court’s decision.\n\nTrump had revised and rewritten his executive order, and it now affects only the issuance of new visas to people from six Muslim-majority countries: Iran, Sudan, Somalia, Libya, Yemen and Syria. That means no one should be blocked at a U.S. airport but rather will simply be denied a visa.\n\nLeon Fresco, deputy assistant attorney general for the Office of Immigration Litigation in President Barack Obama’s Justice Department, said that in some ways the court’s ruling restores long precedent.\n\n“It has never been the case for 100 years that someone can simply sue us for not getting a visa,” he said.\n\n[Supreme Court sides with religious institutions in a major church-state decision]\n\nBut Fresco said the decision also puts pressure on the administration to review its vetting procedures — and possibly end the ban. That’s because the administration has posited the ban as a temporary measure, designed to alleviate officials’ “investigative burdens” while they assessed what information they need about travelers coming to the United States.\n\nThe visa ban was supposed to last 90 days, the refu­gee ban 120 days. In the interim, the homeland security secretary was to have asked the affected countries to provide information about their citizens’ requests for U.S. visas, review the data and report to the president which countries could not adequately comply.\n\nBut the administration said it felt blocked by a U.S. district judge from even conducting such a review. Trump signed a memorandum earlier this month indicating that the order would take effect within 72 hours of when the injunctions on his ban were lifted or stayed.\n\nThe Supreme Court wrote that the government now should be able to do its work. “We fully expect that the relief we grant today will permit the Executive to conclude its internal work and provide adequate notice to foreign governments within the 90-day life of [the order],” the justices wrote.\n\nThe court said it would take up the travel ban fully in its October term; their ruling Monday only partially lifted lower courts’ stays on the measure. By that time, the 90-day period will have run, and Fresco said the administration will be pressed to come up with good reasons for imposing a ban.\n\n“If there is not an answer to the question on the first day of oral arguments about why this ban is still in place, that is going to make the court much more skeptical about the government’s reasons for having this ban,” Fresco said.", "authors": [], "publish_date": "2017-06-26", "source": "washingtonpost", "top_words": ["ruling", "travel", "relationship", "courts", "means", "ban", "supreme", "court", "united", "states", "president", "review", "administration", "visa"], "summary": "The Supreme Court’s decision to allow portions of President Trump’s travel ban to take effect is a win for the administration, but the impact will be far less severe than President Trump’s initial version of the measure.\n[Trump’s big travel ban win?\nWhen Trump issued his first travel ban, chaos ensued.\nThe visa ban was supposed to last 90 days, the refu­gee ban 120 days.\nThe court said it would take up the travel ban fully in its October term; their ruling Monday only partially lifted lower courts’ stays on the measure."}