{"url": "https://www.washingtonpost.com/news/post-nation/wp/2017/02/03/trump-administration-attempts-to-clarify-exceptions-to-travel-ban/", "id": "139", "title": "Trump administration attempts to clarify exceptions to travel ban", "text": "\n\nPeople gather to protest against President Trump’s executive order travel ban at Los Angeles International Airport on Jan. 31, 2017. (Reuters/Monica Almeida)\n\nThe Department of Homeland Security on Friday night said a ban on nationals from seven predominantly Muslim countries would not apply to permanent residents or green card-holders, dual citizens who carry a passport from somewhere other than one of the banned countries, and those with NATO or U.N. visas.\n\nSpecial immigrant visa holders from one of the ban countries — meaning Iraqis who helped the U.S. mission in Iraq — may also “board U.S.-bound planes, and apply for and receive a national interest exception to the pause upon arrival,” according to a statement from DHS.\n\nThe agency’s clarification comes a week into the chaotic backlash to President Trump’s executive order, which halted the United States’ refugee resettlement program, banned the entry of citizens of Iraq, Iran, Syria, Libya, Yemen, Sudan and Somalia, regardless of their visa or residency status, and disrupted the planned travel of tens of thousands of people, including many who were planning to move to the United States or reunite with family.\n\nU.S. Customs and Border Protection agents detained scores of legal residents and visa holders at airports; have canceled tens of thousands of valid visas for immigrants, professionals, students and travelers stranded abroad; and are are alleged to have coerced at least two permanent residents into relinquishing their green cards.\n\nThe administration offered piecemeal adjustments to the ban, including those exceptions spelled out in Friday night’s statement, over the course of the past week, as lawyers and advocates highlighted stories of families torn apart, and protesters of the ban converged on major airports across the country. The statement provided the most comprehensive clarification yet on the specific parameters of the ban, after a week of confusion and disarray.\n\nDHS also appeared to address rumors of a draft executive order that would add several more countries to the list that have been circulating widely in immigrant communities in recent days, and which immigration attorney say have also impacted travel.\n\n“Importantly, these seven countries are the only countries to which the pause on entry applies,” the Department’s statement said in reference to the seven banned countries. “No other countries face such treatment. Nor have any other countries been identified as warranting future inclusion at this time, contrary to false reports.”\n\nImmigration attorneys have described widespread panic and confusion among visitors and immigrants who do not hold U.S. citizenship, including many whose countries of origin were not listed in the administration’s 90-day travel ban. Rumors of a draft executive order that would add Colombia, Egypt, Pakistan and several other countries to the list have led citizens of those countries to rush or cancel their own travel plans, some immigration attorneys say.\n\n“There is a great deal of confusion,” said Greg Chen, the director of advocacy for the American Immigration Lawyers Association. “And there is fear and anxiety that has been spreading because of the lack of consistent information coming from the U.S. government, and also the conflicting information coming from the White House” and various agencies, he said.\n\nClaudia Slovinsky, an immigration attorney in New Jersey, said her phone has been ringing all week with callers explicitly affected by the ban and those worried that they might be. On Friday, she got a call from a gay green card-holder who was afraid to leave the country on a planned trip.\n\nThe client, Slovinsky said, was not a national from one of the banned countries. But, she said of her clients: “The imagination just runs wild. What if tomorrow [Trump] signs an executive order that gay people can’t come in here? Now I don’t think that’s going to happen, but we got the call anyway.”\n\n[Related: Travelers previously blocked by Trump’s immigration ban are arriving in the U.S. through Boston]", "authors": [], "publish_date": "2017-02-03", "source": "washingtonpost", "top_words": ["executive", "travel", "trump", "ban", "immigration", "statement", "week", "exceptions", "countries", "banned", "clarify", "order", "attempts", "administration", "visa"], "summary": "People gather to protest against President Trump’s executive order travel ban at Los Angeles International Airport on Jan. 31, 2017.\n“Importantly, these seven countries are the only countries to which the pause on entry applies,” the Department’s statement said in reference to the seven banned countries.\nThe client, Slovinsky said, was not a national from one of the banned countries.\nWhat if tomorrow [Trump] signs an executive order that gay people can’t come in here?\nNow I don’t think that’s going to happen, but we got the call anyway.”[Related: Travelers previously blocked by Trump’s immigration ban are arriving in the U.S. through Boston]"}