{"url": "https://www.washingtonpost.com/world/national-security/tough-but-tailored-travel-restrictions-await-trumps-approval/2017/09/22/6ace7ad2-9fb4-11e7-9083-fbfddf6804c2_story.html", "id": "104", "title": "‘Tough’ but ‘tailored’ entry restrictions await Trump’s approval", "text": "The Trump administration is replacing its controversial travel ban with a new set of restrictions. (James Lawler Duggan/Reuters)\n\nThe Trump administration is considering replacing a part of its controversial travel ban with more-tailored restrictions that could vary from country to country, officials announced Friday.\n\nOfficials declined to say precisely what those restrictions will be, which countries they might affect or even when the president will put them into effect.\n\nThe key portion of Trump’s travel ban, which bars the issuance of visas to citizens of six majority-Muslim countries, is set to expire Sunday.\n\nTrump’s travel ban had always been contemplated as a temporary measure, designed to give officials time to assess vetting procedures and the information other countries were able or willing to provide.\n\nOfficials of the Department of Homeland Security had quietly been conducting that assessment and recently delivered to the White House a critical, classified report on their findings.\n\n[White House receives DHS report that will shape travel ban’s future]\n\nMiles Taylor, counselor to acting Homeland Security Secretary Elaine Duke, said Duke recommended that the president impose restrictions that are “tough” but “tailored.”\n\nHe said the measures ultimately put in effect might vary from place to place, and they could be lifted if countries meet U.S. demands for information and other security measures.\n\n“Quite frankly, the screening and vetting status quo for border and immigration security is not adequate,” Taylor said.\n\nOfficials said Trump had not made a final decision, and they did not say when he would. White House deputy press secretary Raj Shah said there were “contingency plans” if the ban were to expire without new restrictions being in place.\n\nThe assistant secretary for consular affairs at the State Department, Carl C. Risch, said he expected the State Department to issue guidance to those in the field next week.\n\nThe latest measures would mark the third iteration of Trump’s effort to restrict entry of foreign travelers to the United States. His original travel ban, signed in January, blocked citizens of seven majority-Muslim countries — Iraq, Iran, Sudan, Somalia, Libya, Yemen and Syria — as well as all refugees across the globe.\n\nWhen that measure was blocked in court, Trump signed a revised order removing Iraq from the banned list and only barring the issuance of visas to citizens of the six remaining countries and all refugees.\n\nThe second order, too, was blocked by judges, but the Supreme Court in June allowed it to go into effect with a significant caveat. The administration, the court said, could not block those with a “bona fide” connection to the United States, such as family members or those with firm offers of employment, from entering the country.\n\nThe ban on citizens of the six countries was to last 90 days; the ban on refugees was to last 120 days. The refu­gee ban is set to expire Oct. 24, and it was not immediately clear what impact the new restrictions might have on it.\n\nThe Supreme Court has scheduled arguments for Oct. 10 on whether the measure, at its core, is legal. It is unclear how any new restrictions might affect that case, and it is possible that they could spark fresh legal challenges.\n\nJustice Department spokeswoman Sarah Isgur Flores said the department was continuing to defend the executive order but could not comment on the ongoing litigation.\n\nIn assessing vetting procedures, U.S. officials established a new “baseline” for the information officials want about foreigners hoping to come to the United States, Taylor said. In July, he added, the United States communicated that new baseline to countries across the world.\n\nMany countries, he said, already met U.S. requests — using secure biometric passports, for example, and willingly passing along terrorism and criminal-history information. Others agreed to make changes and share more data. But some were either unable or unwilling to give the United States what it needed, Taylor said.\n\nHe said those are the countries that are likely to face restrictions, although the restrictions could be lifted if conditions changed.\n\nOfficials declined to say what new restrictions were being considered, or whether citizens of any country could still be banned outright from U.S. entry. They also declined to say how many countries might face restrictions — although Taylor said more than six initially did not at first provide the United States with the necessary information.\n\nCiting an attack in London, Trump last week seemed to call for an expansion of the travel ban, writing on Twitter, “The travel ban into the United States should be far larger, tougher and more specific-but stupidly, that would not be politically correct!”\n\nA Homeland Security spokesman said this week, though, that the intention of the department’s recommendation to the White House was “not to create a ban of any sort.”", "authors": [], "publish_date": "2017-09-22", "source": "washingtonpost", "top_words": ["restrictions", "travel", "approval", "trump", "ban", "taylor", "security", "tough", "united", "trumps", "countries", "entry", "states", "await", "department", "tailored"], "summary": "The Trump administration is replacing its controversial travel ban with a new set of restrictions.\nThe key portion of Trump’s travel ban, which bars the issuance of visas to citizens of six majority-Muslim countries, is set to expire Sunday.\nThe latest measures would mark the third iteration of Trump’s effort to restrict entry of foreign travelers to the United States.\nIn assessing vetting procedures, U.S. officials established a new “baseline” for the information officials want about foreigners hoping to come to the United States, Taylor said.\nHe said those are the countries that are likely to face restrictions, although the restrictions could be lifted if conditions changed."}