{"url": "https://www.washingtonpost.com/news/post-nation/wp/2017/06/26/aclu-supreme-court-decision-allows-for-only-the-narrowest-travel-ban/", "id": "195", "title": "ACLU: Supreme Court decision allows for ‘only the narrowest’ travel ban", "text": "The Supreme Court on June 26 decided to allow a limited version of President Trump's travel ban to be implemented. The court will also hold a hearing on the case in the fall. (Bastien Inzaurralde/The Washington Post)\n\nThe Supreme Court on Monday granted the Trump administration permission to implement a limited version of President Trump’s travel ban on the citizens of six Muslim-majority countries. But immigrant and refugee rights advocates have broadly divergent views of what that means for the policy that opponents have branded a “Muslim ban.”\n\nIn its unsigned opinion, the court wrote that the ban “may not be enforced against foreign nationals who have a credible claim of a bona fide relationship with a person or entity in the United States” — a new qualifier to an executive order that the administration has repeatedly amended to limit its scope in the face of legal challenges.\n\nThe American Civil Liberties Union and several other organizations that have challenged Trump’s travel ban in court said the “bona fide relationship” clause applies to most successful visa applicants from the six countries.\n\n“This order, properly construed, should really allow for only the narrowest implementation of any part of the ban,” Omar Jadwat, director of the ACLU’s immigrants’ rights project, said Monday during a conference call with reporters.\n\nRefugees awaiting resettlement through American nonprofit organizations, current visa-holders, students seeking to attend American universities, foreigners hired to work on U.S. soil, and the relatives of those already living here, among other examples, should be exempt from any enforcement of the ban, according to their reading of the Supreme Court’s decision, the advocates said.\n\n[What the Supreme Court’s travel ban ruling means]\n\nBut other groups such as Amnesty International USA saw it differently, and warned that the court’s decision would lead to a fresh bout of “chaos” at airports, and an enforcement of the ban that would “tear families apart.”\n\nAnd human rights groups called on Congress “to step in immediately to nullify [the ban] once and for all” — or risk further chaos.\n\n“Reinstating any part of this ban could create chaos in the nation’s airports and tear families apart,” Margaret Huang, the group’s executive director, said in a statement.\n\nThe International Rescue Committee, which provides refugee assistance, said the court’s decision will impact “innocent, security-vetted refugees.”\n\n“The Court’s decision threatens damage to vulnerable people waiting to come to the US: people with urgent medical conditions blocked, innocent people left adrift, all of whom have been extensively vetted,” said the organization’s president and former British foreign secretary, David Miliband.\n\nAnd the Council on American-Islamic Relations (CAIR), a Washington-based Muslim advocacy group, said the court’s decision “ignores the Islamophobic origins of the policy and emboldens Islamophobes in the Trump administration.”\n\nTrump’s first iteration of the ban in January sought to block entry to refugees, immigrants and other nationals — including permanent legal residents of the United States — who held citizenship in Yemen, Syria, Iran, Iraq, Sudan, Libya and Somalia. The ban’s blanket enforcement set off a wave of detentions, deportations and the mass revocation of visas, and it provoked chaotic scenes of protest and confusion at airports across the country.\n\n[The Supreme Court sided with Trinity Lutheran Church. Here’s why that matters.]\n\nThe ACLU and other advocacy groups involved in lawsuits against the ban said they didn’t expect the same chaos to ensue this time because the Supreme Court’s decision had restricted the policy so much that it would affect only a small number of people.\n\n“It should only apply to pending visas. And in the entire universe of pending visas, there is only one that doesn’t involve a tie” to someone or something in the United States — a tourist visa, said Becca Heller, director of the International Refugee Assistance Project (IRAP), the plaintiff in IRAP v. Trump, the full case of which the Supreme Court will hear in October.\n\nBut Heller and other advocates also said they will closely monitor the enforcement of the limited travel ban, given the possibility that the administration may interpret the court’s decision differently. They said refugee and immigrant advocacy groups would be prepared to file new lawsuits over any perceived abuses.\n\n“It’s going to be really important to us over this intervening period to make sure that the government abides by the terms of the order and is not going to use it as a back door to implement the full-scale Muslim ban that it’s been seeking to implement throughout the presidency,” said Jadwat.\n\n“I think the government will be shooting itself in the foot if it does decide to take this as some kind of license to apply the ban aggressively,” he added.", "authors": [], "publish_date": "2017-06-26", "source": "washingtonpost", "top_words": ["travel", "courts", "allows", "ban", "supreme", "visas", "refugee", "court", "enforcement", "aclu", "groups", "narrowest", "decision"], "summary": "The Supreme Court on June 26 decided to allow a limited version of President Trump's travel ban to be implemented.\n(Bastien Inzaurralde/The Washington Post)The Supreme Court on Monday granted the Trump administration permission to implement a limited version of President Trump’s travel ban on the citizens of six Muslim-majority countries.\nThe American Civil Liberties Union and several other organizations that have challenged Trump’s travel ban in court said the “bona fide relationship” clause applies to most successful visa applicants from the six countries.\n[The Supreme Court sided with Trinity Lutheran Church.\nBut Heller and other advocates also said they will closely monitor the enforcement of the limited travel ban, given the possibility that the administration may interpret the court’s decision differently."}