{"url": "https://www.washingtonpost.com/news/soccer-insider/wp/2017/01/29/u-s-soccer-community-worries-about-how-immigration-ban-will-affect-its-image/", "id": "198", "title": "U.S. soccer has never known borders. President Trump’s travel ban could change that.", "text": "The U.S. soccer community is diverse and well-traveled, engaged with the world and fluent in language and culture. So amid the chaos and furor of President Trump’s executive order banning entry of refugees, migrants and green-card holders from seven mostly-Muslim countries, it was hardly surprising to hear Americans who have traveled the world playing the world’s game speak out.\n\nMichael Bradley, the U.S. men’s national team captain with a well-stamped passport, wrote on Instagram he was “sad and embarrassed” and Trump is “out of touch with our country and the right way to move forward.”\n\nAlex Morgan was one of several prominent soccer voices to speak out against President Trump’s ban on immigration from seven mostly-Muslim countries. (Associated Press)\n\nAlex Morgan, the U.S. women’s national team star who has circled the globe with the 2015 world champions, tweeted: “I am in shock and disbelief. Has history not taught us anything?”\n\nWhile most every sport played here, through competitors or competitions, can claim links to the outside world, soccer is intrinsically connected because of the game’s universality and a century of immigrant influences.\n\nAs Andrei Markovits, a University of Michigan professor who has written extensively about the intersection of American soccer, culture and politics, said, “The insularity of North American sports has been busted open, and it’s been busted open nowhere more than in soccer.”\n\nBecause every country plays soccer, albeit to varying degrees of sophistication and success, it’s not uncommon for a young American to perform for a select team on three continents before he or she turns 18. It’s why the men’s national team has visited 22 nations in four years and why the MLS work force last season featured players born in 61 countries. American soccer fans, meanwhile, are more likely to watch a match originating from London than Los Angeles.\n\nIn the United States, in short, soccer has known no borders.\n\nMLS player Kei Kamara is a Muslim refugee from Sierra Leone. (Joshua Blanchard/Getty Images)\n\nNew England Revolution forward Kei Kamara knows first-hand what it’s like to cross borders in search of a better life. At age 14, he and his family left war-torn Sierra Leone and eventually settled in Southern California as part of a refugee program. He is Muslim. In 2006, he was naturalized.\n\n“I was a Muslim refugee (2000) and a Muslim citizen today (2017),” he wrote on Instagram on Sunday. “This is the UNITED States of America. #UnitedWeStand #MeltingPot #NoMuslimBan”\n\nNo current MLS players hail from the seven countries cited in Friday’s executive order, though two represent them. Toronto FC defender Steven Beitashour, born in Northern California to Iranian immigrants of Christian and Muslim faith, was a member of the Iranian World Cup squad in 2014. Columbus Crew attacker Justin Meram, a Christian from the Detroit area, plays for Iraq. Both are dual citizens who should be unaffected by the new guidelines.\n\nBut while the crackdown will not prevent MLS’s efforts to sign players from most countries, it threatens to create a perception that internationals are not welcome here.\n\nThere is also concern for players in MLS youth academies shielded by the Deferred Action for Childhood Arrivals (DACA). The administration seems set on repealing a program that allows children of illegal immigrants brought to this country by their parents, primarily from Mexico, to receive temporary protection from deportation and work permits. The number of DACA players affiliated with MLS teams is unclear.\n\nFurther, the crackdown comes at a time when U.S. Soccer Federation officials are weighing a bid to host the 2026 World Cup. One scenario involves a joint bid with Mexico (or with both Mexico and Canada).\n\nLast summer, as the presidential race was heating up, USSF President Sunil Gulati said a Trump victory would make it a “little trickier” to enter a joint bid with Mexico. After the election, Gulati said that, should a bid go forward, the USSF is prepared to work with the new administration.\n\nIn selecting World Cup hosts, FIFA is notorious for casting aside political factors in favor of riches — in which case Trump’s initiatives won’t have the slightest effect on the potential U.S. bid.\n\nBut Markovits, for one, fears greater isolation will strand U.S. soccer.\n\n“Because the United States is not a soccer power, it’s even more dependent on the global discourse,” he said. “The United States really depends on the goodwill of the world even more in soccer.”", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["known", "travel", "world", "ban", "change", "players", "mls", "mexico", "soccer", "united", "trumps", "countries", "borders", "states", "president", "muslim", "team"], "summary": "In the United States, in short, soccer has known no borders.\n“This is the UNITED States of America.\n#UnitedWeStand #MeltingPot #NoMuslimBan”No current MLS players hail from the seven countries cited in Friday’s executive order, though two represent them.\n“Because the United States is not a soccer power, it’s even more dependent on the global discourse,” he said.\n“The United States really depends on the goodwill of the world even more in soccer.”"}