{"url": "https://www.washingtonpost.com/blogs/right-turn/wp/2017/09/25/new-travel-ban-implicitly-concedes-previous-ones-were-ludicrous/", "id": "10", "title": "New travel ban implicitly concedes previous ones were ludicrous", "text": "President Trump expands new travel ban to restrict visitors from North Korea, Venezuela and Chad. (Reuters)\n\nThe Post reports:\n\nThe Trump administration announced new restrictions Sunday on visitors from eight countries — an expansion of the pre-existing travel ban that has spurred fierce legal debates over security, immigration and discrimination. In announcing the new rules, officials said they are meant to be both tough and targeted. The move comes on the day the key portion of President Trump’s travel ban, one which bars the issuance of visas to citizens of six majority-Muslim countries, was due to expire. … Three new nations were added to the list of countries whose citizens will face the restrictions: Chad, North Korea and Venezuela — although the restrictions on Venezuela are narrowly crafted, targeting that country’s leadership and their family members. One country, Sudan, fell off the travel ban list issued at the beginning of the year. Senior administration officials said a review of Sudan’s cooperation with the U.S. government on national security and information-sharing showed it was appropriate to remove them from the list. The new restrictions will be phased in over time, officials said, and the restrictions will not affect anyone who already holds a U.S. visa. For those visitors affected by the changed restrictions, the new rules will go into effect Oct. 18, according to the proclamation.\n\nThe new ban creates innumerable questions:\n\nWhat becomes of the case pending in the Supreme Court on President Trump’s second version of the travel ban?\n\nWhat evidence has the administration compiled to justify these bans? (“In explaining how the administration came to single out these eight countries, officials said many governments already met U.S. requests — using secure biometric passports, for example, and willingly passing along terrorism and criminal-history information,” The Post reported. “Others agreed to make changes and share more data. But some were either unable or unwilling to give the United States what it needed, officials said.” It remains to be seen whether this is true.)\n\nWhat objective criteria were deployed, and how did six of the original majority-Muslim countries remain on the list?\n\nHow can the administration continue to justify restrictions on refugees “indefinitely” given the exacting nature of the vetting they undergo?\n\nWhy aren’t countries such as Saudi Arabia, Turkey and Afghanistan on the list?\n\nWhat exceptions are to be made, and how will they impact hospitals, universities and other institutions that bring people in from the banned nations?\n\nThe most significant takeaway from travel ban 3.0 is confirmation that the first two bans were shoddily constructed initiatives, which could not be justified on available data. They were, just as critics claimed, designed as blatantly political documents playing to Trump’s anti-Muslim base.\n\nWill this ban last any longer than the last two, or is it also tainted by the president’s racist appeals? The American Civil Liberties Union isn’t buying the new iteration. “Six of President Trump’s targeted countries are Muslim. The fact that Trump has added North Korea — with few visitors to the US — and a few government officials from Venezuela doesn’t obfuscate the real fact that the administration’s order is still a Muslim ban,” it said in a written statement. “President Trump’s original sin of targeting Muslims cannot be cured by throwing other countries onto his enemies list.”\n\nThe move highlights a truism about this administration: It is as incompetent as it is mendacious. Had it from the beginning exercised care, conducted an appropriate review and narrowly tailored its ban for legitimate national security interests, Trump might have garnered public support and gotten the stamp of approval from the courts. Now, however, he risks losing once again in the courts if for no other reason than his credibility is shot. His deep devotion to race-baiting calls into doubt even legitimate national security goals.", "authors": [], "publish_date": "2017-09-25", "source": "washingtonpost", "top_words": ["travel", "restrictions", "previous", "administration", "visitors", "ban", "venezuela", "ludicrous", "officials", "trumps", "ones", "concedes", "countries", "president", "implicitly"], "summary": "President Trump expands new travel ban to restrict visitors from North Korea, Venezuela and Chad.\nThe move comes on the day the key portion of President Trump’s travel ban, one which bars the issuance of visas to citizens of six majority-Muslim countries, was due to expire.\nOne country, Sudan, fell off the travel ban list issued at the beginning of the year.\nThe new ban creates innumerable questions:What becomes of the case pending in the Supreme Court on President Trump’s second version of the travel ban?\nThe most significant takeaway from travel ban 3.0 is confirmation that the first two bans were shoddily constructed initiatives, which could not be justified on available data."}