{"url": "https://www.washingtonpost.com/news/post-politics/wp/2017/02/06/trump-gives-fake-news-sneer-at-polls-critical-of-travel-ban-order/", "id": "194", "title": "Trump gives ‘fake news’ sneer at polls critical of travel ban order", "text": "\n\nPresident Donald Trump leaves after speaking to commanders and coalition representatives during a visit to U.S. Central Command and U.S. Special Operations Command at MacDill Air Force Base in Tampa, Fla. on Feb. 6. (Reuters/Carlos Barria)\n\nPresident Trump on Monday tried to dismiss public opinion surveys showing opposition to his travel ban as “fake news,” insisting that there is popular support for his executive order temporarily prohibiting the entry of all refugees as well as travelers from seven majority-Muslim nations.\n\nTrump tweeted at 7:01 a.m.: “Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting.”\n\nAny negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting. — Donald J. Trump (@realDonaldTrump) February 6, 2017\n\nThe president followed that up six minutes later with a second tweet: “I call my own shots, largely based on an accumulation of data, and everyone knows it. Some FAKE NEWS media, in order to marginalize, lies!”\n\nI call my own shots, largely based on an accumulation of data, and everyone knows it. Some FAKE NEWS media, in order to marginalize, lies! — Donald J. Trump (@realDonaldTrump) February 6, 2017\n\nThe context of Trump's second tweet is unclear, but it may have been aimed at the suggestion, advanced in a “Saturday Night Live” sketch last weekend, that chief strategist Stephen K. Bannon is as powerful as Trump — if not more so — in running the federal government.\n\nTrump sent his tweets from his Mar-a-Lago resort in Palm Beach, Fla., where he has been spending the long weekend golfing and socializing with family and friends.\n\nThe president may have been reacting to commentary on cable news morning shows about polling showing a majority of Americans oppose the travel ban. For instance, MSNBC’s “Morning Joe” discussed a CNN/ORC poll, released last Friday, which shows 53 percent of Americans oppose the executive order and 47 percent support it.\n\nMeanwhile, the executive order has been frozen by a legal challenge. A Justice Department response is expected later Monday.", "authors": [], "publish_date": "2017-02-06", "source": "washingtonpost", "top_words": ["executive", "travel", "trump", "polls", "ban", "weekend", "gives", "support", "donald", "president", "fake", "order", "sneer", "critical"], "summary": "President Donald Trump leaves after speaking to commanders and coalition representatives during a visit to U.S. Central Command and U.S. Special Operations Command at MacDill Air Force Base in Tampa, Fla. on Feb. 6.\nTrump tweeted at 7:01 a.m.: “Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election.\nSorry, people want border security and extreme vetting.”Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election.\nFor instance, MSNBC’s “Morning Joe” discussed a CNN/ORC poll, released last Friday, which shows 53 percent of Americans oppose the executive order and 47 percent support it.\nMeanwhile, the executive order has been frozen by a legal challenge."}