{"url": "https://www.washingtonpost.com/news/worldviews/wp/2017/02/27/iranians-celebrate-oscar-winning-film-with-sarcastic-thanks-to-trumps-travel-ban/", "id": "169", "title": "Iranians celebrate Oscar-winning film with sarcastic thanks to Trump’s travel ban", "text": "\n\nIranian director Asghar Farhadi attends the 2016 premiere of his film “The Salesman” in Paris. (Michel Euler/Associated Press)\n\nCall it the Trump bump.\n\nAt least that’s the sarcastic spin from some Iranians who believe that the uproar over President Trump’s travel ban helped give some extra Oscar buzz to “The Salesman,” which took home the Academy Award in the best foreign language category Sunday.\n\nIran doesn’t really need a boost with the academy. Iranian films have pulled in prizes worldwide for decades, including an Oscar in 2012 for Asghar Farhadi’s “A Separation.”\n\nBut this year, it was hard to separate the nomination for Farhadi’s “The Salesman” and Trump’s clampdown on travel to the United States by refugees as well as citizens of seven Muslim-majority nations, including Iran. Farhadi stayed away from the Academy Awards ceremony in protest. So did the cast.\n\n[The Oscars’ most political moments]\n\nThe snubs, some contend, might have resonated well with the Oscar-awarding judges opposed to Trump’s executive order, which is locked in a court challenge.\n\n“I’m sorry I’m not with you tonight,” said a statement from Farhadi read by Iranian American astronaut Anousheh Ansari, who has taken part in a mission on the International Space Station.\n\n“My absence is out of respect for the people of my country and those of the other six nations who have been disrespected by the inhumane law that bans entry of immigrants to the U.S.,” the statement continued.\n\nBefore the ceremony, Farhadi joined the four other directors of films nominated in the foreign language category in issuing a statement decrying a rising tide of “fanaticism” in the United States. The directors — whose films' casts and crews span the globe — agreed that this year’s award would be dedicated to “unity and understanding” regardless of who won.\n\nIranian Foreign Minister Mohammad Javad Zarif tweeted congratulations to the cast and crew of “The Salesman” and their “stance against #MuslimBan.”\n\nProud of cast & crew of \"The Salesman\" for Oscar & stance against #MuslimBan. Iranians have represented culture & civilization for millennia — Javad Zarif (@JZarif) February 27, 2017\n\nThe film itself has nothing to do with international politics. The story is about a Tehran couple performing Arthur Miller’s “Death of a Salesman” and their struggles with social stigmas after the wife is assaulted in their apartment.\n\nYet many Iranian movie fans and others rallied around the belief that the Oscar win was something of a Hollywood referendum on the White House.\n\n“We are so proud of you,” said one Twitter message using the hashtags #travelban and #trump.\n\nhttps://twitter.com/KhoshAzar/status/836124739735326720\n\nBanifilm, a leading Iranian film industry newspaper and website, posted an opinion piece saying Trump “probably never imagined what contribution the travel ban would have for Farhadi’s film.”\n\nAcross Iranian social media, a popular cartoon depicted Farhadi playing chess and using an Oscar to take out his opponent’s piece. It looked a lot like Trump.", "authors": [], "publish_date": "2017-02-27", "source": "washingtonpost", "top_words": ["travel", "foreign", "film", "salesman", "trump", "ban", "statement", "celebrate", "farhadi", "iranians", "iranian", "thanks", "trumps", "oscar", "sarcastic", "oscarwinning", "films"], "summary": "Iranian director Asghar Farhadi attends the 2016 premiere of his film “The Salesman” in Paris.\nAt least that’s the sarcastic spin from some Iranians who believe that the uproar over President Trump’s travel ban helped give some extra Oscar buzz to “The Salesman,” which took home the Academy Award in the best foreign language category Sunday.\nIranian Foreign Minister Mohammad Javad Zarif tweeted congratulations to the cast and crew of “The Salesman” and their “stance against #MuslimBan.”Proud of cast & crew of \"The Salesman\" for Oscar & stance against #MuslimBan.\nIranians have represented culture & civilization for millennia — Javad Zarif (@JZarif) February 27, 2017The film itself has nothing to do with international politics.\n“We are so proud of you,” said one Twitter message using the hashtags #travelban and #trump."}