{"url": "https://www.washingtonpost.com/world/national-security/after-saying-dangerous-people-may-be-pouring-into-our-country-trump-has-repeatedly-put-off-inking-new-travel-ban/2017/03/01/6f3ca47e-fe86-11e6-8f41-ea6ed597e4ca_story.html", "id": "144", "title": "Revised Trump immigration order, delayed after speech, will not ban citizens from Iraq", "text": "President Trump arrives on Capitol Hill for his address to a joint session of Congress on Tuesday. After the speech went well, the White House scrapped plans for a new travel ban Wednesday. (Jim Lo Scalzo/Associated Press)\n\nPresident Trump’s new executive order on immigration will not include a blanket ban on citizens from Iraq, among a host of other revisions meant to allay legal and diplomatic concerns, people familiar with the matter said.\n\nThe White House late Tuesday scrapped plans for Trump to sign a revised travel ban Wednesday afternoon, a person familiar with the matter said, marking the third time the administration has put off the matter since the president said that dangerous people might enter the country without a prohibition in place.\n\nBut when it is signed, people familiar with the matter said, the order is still expected to include a host of significant changes. The order will exempt current visa holders and legal permanent residents, and it will not impose a blanket ban on those from Iraq, where U.S. forces are working with the Iraqis to battle the Islamic State. It will not include an exception for religious minorities, which critics had pointed to as evidence it was meant to discriminate against Muslims. And it will not go into effect immediately when it is signed, people familiar with the matter said.\n\nThe people said the situation remains fluid and changes remain possible. Lt. Gen. Stephen Townsend, commander of the U.S.-led coalition in Iraq and Syria, said he, too, had heard Iraq would not be included in the revised order, though he also had heard the opposite. Asked if he had concerns about Iraq’s possible inclusion in the new executive order, he praised the country as “our partner and ally.”\n\n“They are protecting us here, and we’re fighting this enemy that threatens all of our countries together,” Townsend said. Earlier, he had said the Iraqis’ reaction to the first ban was “pretty level-headed and sophisticated,” and that the security forces with whom he dealt — while “relieved when the executive order was suspended” — remained focused on their mission.\n\n“Now they’re waiting to see how that may play out here in the future,” Townsend said of the new executive order.\n\nThe decision to delay signing the order came as people on Twitter and elsewhere heaped praise on Trump for his speech Tuesday night to a joint session of Congress. A CNN-ORC poll, for example, showed that 7 in 10 people who watched said the address made them feel more optimistic about the direction of the country, and about two-thirds said the president has the right priorities for the nation. The pool of those who watched the speech was about eight points more Republican than the total population.\n\nIt was not immediately clear why the White House canceled plans to ink the new executive order, although CNN reported that a White House official did not deny that optics were part of the calculus. “We want the [executive order] to have its own ‘moment,’ ” an official told the network. A White House spokesman did not immediately return messages seeking comment for this article.\n\n[New travel ban will exempt current visa holders, sources say]\n\nTrump’s original executive order, now frozen by the courts, had temporarily barred citizens of seven Muslim-majority countries — Iraq, Iran, Syria, Somalia, Sudan, Libya and Yemen — and all refugees from entering the United States. When it was implemented, the State Department provisionally revoked tens of thousands of visas, and some people who were in transit when it took effect were detained or deported once they reached U.S. airports.\n\nAlthough courts have disagreed, the president has insisted that the ban is necessary for national security reasons. He wrote on Twitter that, because a federal judge in Washington state had ordered it frozen, “many very bad and dangerous people may be pouring into our country.” He also suggested that if something were to happen, the court system would be to blame.\n\nSince then, the Justice Department has asked courts to delay litigation while a new order is drafted, and the White House has repeatedly put off doing that. The president said on Feb. 10, a Friday, that he was considering writing a new order and that he probably would take some action the following Monday or Tuesday. He did not write a new order by then, and on Feb. 16, a Thursday, he said he would do so the following week.\n\nAgain, he did not, and a senior administration official said on Feb. 22 that the order would be delayed another week, as officials worked to make sure it would be implemented smoothly. The president was slated to sign the order Wednesday, but now, it seems, it will have to wait again. How long is unclear.\n\nThe delays and the removal of Iraq from the list of blocked countries could undermine the administration’s argument about the necessity of the ban. In arguing that the ban should not be frozen, the Justice Department had asserted that the seven countries, including Iraq, covered by the order were identified by Congress and the previous administration as having problems with terror.\n\nJudges and others had already been skeptical of the argument that the administration needed to impose a ban for national security reasons. U.S. District Judge Leonie M. Brinkema said at a court hearing there was “startling evidence” from national security professionals that the order “may be counterproductive to its stated goal” of keeping the nation safe. A recent Department of Homeland Security report concluded citizenship is an “unreliable” threat indicator and that people from the seven countries affected by the ban have rarely been implicated in U.S.-based terrorism.\n\nOf 82 people “who died in the pursuit of or were convicted of any terrorism-related federal offense” since March 2011, that report said, more than half were U.S.-born citizens. and just two were from Iraq. The president said Tuesday night that the “vast majority” of people convicted for terrorism-related offenses since 9/11 came here from outside the United States.\n\nThe Justice Department said in a statement Wednesday that it had won convictions “against over 500 defendants for terrorism or terrorism-related charges in federal courts,” and a “review of that information revealed that a substantial majority of those convicted were born in foreign countries.” A department spokeswoman declined to provide the raw data.\n\nThe administration already has faced criticism for pointing to terror attacks that the ban could not have prevented as evidence of its necessity, and critics noted it omitted Saudi Arabia, which is where most of the Sept. 11 hijackers came from. Now Justice Department lawyers might be pressed to justify why people from Iraq can enter the United States, when those from other countries with the same designation cannot.\n\nKaren DeYoung contributed to this report.", "authors": [], "publish_date": "2017-03-01", "source": "washingtonpost", "top_words": ["executive", "revised", "trump", "citizens", "ban", "immigration", "speech", "iraq", "delayed", "security", "house", "countries", "white", "order", "president", "department"], "summary": "After the speech went well, the White House scrapped plans for a new travel ban Wednesday.\n“Now they’re waiting to see how that may play out here in the future,” Townsend said of the new executive order.\nIt was not immediately clear why the White House canceled plans to ink the new executive order, although CNN reported that a White House official did not deny that optics were part of the calculus.\n“We want the [executive order] to have its own ‘moment,’ ” an official told the network.\nA White House spokesman did not immediately return messages seeking comment for this article."}