{"url": "https://www.washingtonpost.com/news/volokh-conspiracy/wp/2017/06/26/supreme-court-issues-mixed-ruling-on-trumps-travel-ban/", "id": "16", "title": "Supreme Court issues mixed ruling on Trump’s travel ban", "text": "The Supreme Court ruled on June 26 that a limited version of President Trump's travel ban can go into effect, and will consider the case when it reconvenes in the fall. The move allows the Trump administration to ban travelers from six Muslim-majority countries unless they have a \"bona fide relationship with a person or entity in the U.S.\" (Reuters)\n\nEarlier today the Supreme Court issued a mixed ruling on the two lower court injunctions staying implementation of President Donald Trump’s executive order barring citizens of six majority-Muslim nations from entering the United States for 90 days. Two federal appellate courts had issued preliminary injunctions against the order: the Fourth Circuit because it concluded that the order was likely motivated by unconstitutional discrimination against Muslims; the Ninth Circuit because the president had exceeded the statutory authority granted to him by Congress.\n\nToday’s Supreme Court ruling is a mixed bag. It offers something to both sides, while also giving both some potentially bad news. The Court has decided to hold oral argument on the two rulings during its October term. The two lower court rulings will be combined into a single case for review by the Supreme Court. In the meantime, it lifts parts of the preliminary injunctions issued by the lower courts, but leaves the rest in place. Specifically, it maintains the injunctions with respect to entry by “foreign nationals who have a credible claim of a bona fide relationship with a person or entity in the United States.” The Court provides a brief explanation of what counts as a “bona fide relationship”:\n\nFor individuals, a close familial relationship is required. A foreign national who wishes to enter the United States to live with or visit a family member, like Doe’s wife or Dr. Elshikh’s mother-in-law, clearly has such a relationship. As for entities, the relationship must be formal, documented, and formed in the ordinary course, rather than for the purpose of evading [the executive order]. The students from the designated countries who have been admitted to the University of Hawaii have such a relationship with an American entity. So too would a worker who accepted an offer of employment from an American company or a lecturer invited to address an American audience. Not so someone who enters into a relationship simply to avoid §2(c) [of the order]: For example, a nonprofit group devoted to immigration issues may not contact foreign nationals from the designated countries, add them to client lists, and then secure their entry by claiming injury from their exclusion.\n\nThe Court offers very little justification for this distinction between aliens with a “bona fide relationship” to the US and those without one. It notes only that denying entry to foreign nationals without a “bona fide” relationship does not burden any Americans, and that “unadmitted and nonresident alien[s]… ha[ve] no constitutional right of entry to this country.”\n\nIt is true that aliens in the second category do not have a “constitutional right” to enter the US. But the same is true of those with such a relationship, but no residency permit or visa. The point of the lower court rulings against the ban is that the government is forbidden to exceed its authority or to engage in unconstitutional discrimination even against people without such a right. This is a standard principle of constitutional law: when the government is barred from engaging in in some form of discrimination, the restriction applies even to the distribution of government benefits and privileges that are not themselves constitutional rights. For example, no one has a constitutional right to receive Social Security benefits. But it would surely be unconstitutional for Congress to enact a law under which Social Security benefits are available to Christians or Jews, but not adherents of other religions.\n\nPreliminary injunctions are generally supposed to be issued only if the plaintiffs have a “substantial likelihood of success on the merits.” The fact that the Supreme Court upheld the injunction with respect to foreign nationals with a “bona fide” relationship to the US suggests that a majority of justices believe that this category of aliens and Americans with a suitable relationship to them (which includes all or most of the plaintiffs in the two lower court cases) does in fact have such a likelihood of success.\n\nThis in turn suggests that the justices endorse either the religious discrimination argument against Trump’s order, the statutory argument, or both. If they support the former argument, it also means they likely accept the validity of using Trump’s campaign statements, tweets, and other unofficial fulminations as evidence of the intent behind the order (I defended their use here and here). It likewise – correctly in my view – would not be bothered by the possibility that Trump’s order might be constitutional if issued by a different president, with different motives.\n\nThis aspect of the Court’s ruling favors the plaintiffs. On the other hand, the fact that the injunction was lifted with respect to foreign nationals who lack a “bona fide” tie to the US favors the Trump administration. The justices may believe that people who fall into that category do not have a substantial likelihood of success on the merits. On the other hand, however, it is possible the justices excluded them because they fail to meet one or more of the other three criteria for a preliminary injunction: that the plaintiff is likely to suffer irreparable harm in the absence of preliminary relief, that the balance of equities weighs in the plaintiff’s favor, and that a preliminary injunction is in the public interest. The Court in fact briefly mentions the “balance of equities” as the basis for its ruling, and does not mention likelihood of success. If that factor is indeed the only basis for the distinction made between the two categories of aliens, it is possible that the Court will ultimately uphold the lower court rulings on the merits with respect to all categories of aliens covered by the executive order.\n\nIn a dissent joined by justices Samuel Alito and Neil Gorsuch, Justice Clarence Thomas argues that the court should have overturned the entirety of the two injunctions because the government is likely to prevail on the legality of the entire order. Thomas also argues that the majority’s approach will unleash “a flood of litigation” in cases where it may be difficult to tell whether the foreign nationals in question have a “bona fide relationship” or not. He may well be right, at least with respect to cases where it will be difficult to tell whether a “relationship” was formed in the “ordinary course” or merely for purposes of getting around the order. For example, if tomorrow my university invites aSyrian lecturer to address one of our classes, it may not be easy for executive branch officials and courts to determine what the true motive was.\n\nIt is significant that only three justices joined Thomas’ dissent. Two conservative justices (Chief Justice John Roberts and Anthony Kennedy) joined with the four liberal justices in upholding parts of the lower court injunction. This suggests that they may be willing to strike down some or all of the executive order on the merits.\n\nOf course, it also possible that there will never be a Supreme Court decision on the merits. In today’s ruling, the Supreme Court asked the parties to brief the question of whether the legal issues involving the order became moot on June 14, when the original 90 day travel ban included in the order expired. On June 14, the president issued a new order stating that each provision of the executive order would go into effect only after all judicial injunctions against it are lifted. Perhaps the justices have doubts about the validity of this move. Among other things, it undermines the administration’s claim that the purpose of the order is to give officials time to review vetting procedures for citizens of the six countries in question. By the time the case gets argued in October, the government will have had more than ninety days to conduct such a review. If the administration nonetheless insists on continuing with the travel ban at that point, it reinforces the plaintiff’s argument that the true purpose of the order is discrimination against Muslims.\n\nBecause of the brevity of the majority’s reasoning and the the fact that it only addresses a preliminary injunction and does not explicitly consider the issue of likelihood of success on the merits, it is difficult to predict what will actually happen when the Court takes up these cases on the merits. We will know more after the oral arguments in the fall.\n\nUPDATE: I have made a few minor additions to this post.", "authors": [], "publish_date": "2017-06-26", "source": "washingtonpost", "top_words": ["ruling", "justices", "travel", "relationship", "fide", "lower", "injunctions", "ban", "supreme", "issues", "bona", "foreign", "court", "trumps", "order", "mixed"], "summary": "The Supreme Court ruled on June 26 that a limited version of President Trump's travel ban can go into effect, and will consider the case when it reconvenes in the fall.\nToday’s Supreme Court ruling is a mixed bag.\nThe two lower court rulings will be combined into a single case for review by the Supreme Court.\nThe Court offers very little justification for this distinction between aliens with a “bona fide relationship” to the US and those without one.\nOf course, it also possible that there will never be a Supreme Court decision on the merits."}