{"url": "https://www.washingtonpost.com/news/post-politics/wp/2017/02/07/trump-ill-take-common-sense-travel-ban-to-the-supreme-court-if-necessary/", "id": "165", "title": "Trump: I’ll take ‘common sense’ travel ban to the Supreme Court, if necessary", "text": "\n\nPresident Donald Trump speaks to business leaders during a strategy and policy forum at the White House last week. (Jabin Botsford/The Washington Post)\n\nPresident Trump said Tuesday that he is prepared to take the case for his now-frozen travel ban to the Supreme Court — but added that he hopes it doesn’t come to that.\n\n“We're going to take it through the system,” Trump said. “It's very important for the country. … We’ll see what happens. We have a big court case. We’re well represented.”\n\nTrump’s comments came as a federal appeals court prepared to hear arguments later Tuesday on his directive temporarily barring refugees and those from seven Muslim-majority countries from entering the United States.\n\n[Federal appeals court decides to schedule a hearing on Trump travel order]\n\nTalking to reporters at a White House event with local sheriffs, Trump said the Islamic State has made its intentions known to have terrorists infiltrate the United States through its immigration system.\n\n“And then we’re not allowed to be tough on the people coming in? Explain that one,” Trump said.\n\nAsked whether he is prepared to press his case to the Supreme Court, Trump said: “Hopefully it doesn’t have to. It’s common sense.”\n\n“Some things are law, and some things are common sense,” Trump added. “This is common sense.”", "authors": [], "publish_date": "2017-02-07", "source": "washingtonpost", "top_words": ["sense", "ill", "travel", "necessary", "case", "trump", "ban", "supreme", "court", "united", "things", "white", "prepared", "common"], "summary": "President Donald Trump speaks to business leaders during a strategy and policy forum at the White House last week.\n(Jabin Botsford/The Washington Post)President Trump said Tuesday that he is prepared to take the case for his now-frozen travel ban to the Supreme Court — but added that he hopes it doesn’t come to that.\nWe have a big court case.\nAsked whether he is prepared to press his case to the Supreme Court, Trump said: “Hopefully it doesn’t have to.\nIt’s common sense.”“Some things are law, and some things are common sense,” Trump added."}