{"url": "https://www.washingtonpost.com/posteverything/wp/2017/05/16/trumps-administration-says-the-travel-ban-isnt-like-japanese-internment-it-is/", "id": "167", "title": "Trump's administration says the travel ban isn't like Japanese internment. It is.", "text": "\n\nActing Solicitor General Jeffrey Wall argues before the 9th Circuit Court of Appeals in Seattle on Monday. (C-SPAN via AP)\n\nThere isn’t a single mention of the words “Japanese” or “Japanese American” in President Franklin D. Roosevelt’s infamous Executive Order 9066, empowering the secretary of war to “prescribe military areas in such places and of such extent as he or the appropriate Military Commander may determine, from which any or all persons may be excluded.” Yet it resulted in the incarceration of an estimated 117,000 persons of Japanese ancestry, about two-thirds of whom were U.S. citizens, during World War II. Justice Frank Murphy was right to describe it as the “legalization of racism” when he dissented in Korematsu v. United States, the case in which the 1944 Supreme Court shamefully pronounced Roosevelt’s order constitutional.\n\nPresident Trump’s administration is trying to pull the same maneuver.\n\nNeither Trump’s Executive Order 13769, nor its successor, Executive Order 13780, restricting travel to the United States from six predominantly Muslim countries, specifically references “Muslims.” Monday, when pressed by judges during oral arguments before the 9th Circuit Court of Appeals, the Trump administration’s lawyer, Acting Solicitor General Jeffrey Wall, insisted “this case is not Korematsu.” But history shows the clear intent in 1944 was to round up Japanese Americans. And the administration’s intent today is just as clearly to ban Muslims.\n\n[George Takei: They interned my family. Don’t let them do it to Muslims.]\n\nTrump’s first order, issued Jan. 27, carved out an exception for refugees persecuted as a religious minority in countries affected by the ban. Since virtually all the beneficiaries of this exception would have been Christian, it suggests the order was meant to keep the immigration door open for Christians and closed for Muslims. When more than one federal judge blocked the initial order, Trump responded with a new order on March 6 that halted immigration from these same countries — Iran, Libya, Somalia, Sudan, Syria and Yemen — but did not provide an explicit exception for Christians. In the new order, Trump also bent over backward to insist he wasn’t aiming to exclude Muslims — just people from those six countries. The first order, the second order says, did not “provide a basis for discriminating for or against members of any particular religion.”\n\nBut Trump advertised his motives in inflammatory remarks throughout his presidential campaign. He called for “a total and complete shutdown of Muslims entering the United States.” He described his policy as aimed at “preventing Muslim immigration.” He went so far as to call for a Muslim registry, which he initially hesitated to distinguish from the Nazis registry of Jews during World War II. To CNN’s Anderson Cooper he said, “we can’t allow people coming into this country who have this hatred of the United States” and “of people that are not Muslim.” He even asserted that he was following in Roosevelt’s footsteps when he told “Good Morning America’s” George Stephanopoulos “what I am doing is no different than what FDR — FDR’s solution for German, Italian, Japanese, you know, many years ago,” adding, “Take a look at what FDR did many years ago, and he’s one of the most highly respected presidents. … They named highways after him.”\n\nIt’s worth noting that Korematsu has never been formally overturned, but there’s no doubt today that the internment of Japanese Americans was legally impermissible and morally reprehensible.\n\nFederal law gives the president broad power to control immigration, provided that, like any government power, it is exercised without violating constitutionally protected rights. But both Roosevelt’s and Trump’s orders were unconstitutional because intent matters. It is unconstitutional for a legal directive to discriminate based on religion or race, even if the directive doesn’t mention either, and even if the directive expressly states, as E.O. 13780 does, that E.O. 13768 “was not motivated by animus toward any religion.” As the Supreme Court said in 1993, “Official action that targets religious conduct for distinctive treatment cannot be shielded by mere compliance with the requirement of facial neutrality.” The law is more than words on a page. For the courts to pretend otherwise would be, as Judge Derrick K. Watson said when recently blocking Trump’s order, “to crawl into a corner, pull the shutters closed, and pretend [the court] has not seen what it has.”\n\nBoth Roosevelt’s and Trump’s executive orders are driven by a vision of America as a fundamentally white and Christian nation. The reason the orders don’t explicitly spell out their intended targets is that such an expression would violate an important part of the Constitution, the First Amendment’s protection of religious liberty: Citizens with Japanese ancestry were targeted not just because of race or national origin but also because most were Buddhists.\n\nWriting to Roosevelt in April 1942 to clarify the order’s intended target, Attorney General Francis Biddle said, “You signed the original executive order permitting the exclusion so the Army could handle the Japs.” The order, Biddle said, “was never intended to apply to Italians and Germans.” What distinguished those of Japanese descent from those on U.S. soil who traced their ancestry to other countries with which we were at war? “In the case of the Japanese,” a confidential U.S. Army report from 1942 explains, special concern exists because of “their Oriental habits of life, their and our inability to assimilate biologically, and what is more important, our inability to distinguish the subverters and saboteurs from the rest.”\n\nEven before the outbreak of World War II, confidential studies by intelligence agencies had asserted that Buddhist and Shinto priests posed a grave threat to national defense and were even anti-American. A report issued by the Counter Subversion Section of the Office of Naval Intelligence just three days before the Pearl Harbor attack claimed, with no evidence, that Buddhist and Shinto temples and shrines, unlike Japanese Christian churches, were fertile ground for “subversive activity” and that their priests were likely to engage in espionage for Japan.\n\nRegistries of community leaders that had been compiled based on such reports were used as a pretext to round up individuals starting just hours after the attack on Pearl Harbor. Nearly three-quarters of the Buddhist priests and every single Shinto priest were detained in the high-security camps run by the Army and the Department of Justice during the initial dragnet in the weeks after Pearl Harbor. By contrast, less than a fifth of the Japanese community’s Christian leaders were initially detained, though after Roosevelt’s order, every Japanese American on the West Coast was forced into camps. The mass incarceration of Japanese Americans was not the result of war hysteria, but the end point of a process of exclusion based on the conflation of race, national origin and religion.\n\n[New Orleans mayor: Why I’m taking down my city’s Confederate monuments]\n\nStarting with the Chinese Exclusion Act of 1882 that halted labor migration from China, nativists argued that the “heathen Chinee” — a common slur for Chinese immigrants in California during the 1870s — represented an alien and even anti-American religion and race. In the 1876 congressional hearings on Chinese immigration, politicians like California state Sen. Frank McCoppin testified that America was “in danger of being overrun by this pagan horde, unless their coming be checked by legislation.”\n\nThe exclusion of Asians was completed with the Immigration Act of 1924 that effectively built a wall on the Pacific. Like Trump’s travel ban, the law, commonly known as the Oriental Exclusion Act, does not specifically identify races or religions to be banned but uses the phrase “aliens ineligible for citizenship” as a code word to achieve an almost complete shutdown of immigration from Asia.\n\nRoosevelt’s executive order is best understood as a natural outcome of a process that began with a travel ban, followed by intelligence agencies’ surveillance of Japanese religious and cultural organizations and compilation of registries of individuals to be arrested in case of a national security emergency. The order’s presumption that a community constituted by a majority non-Christian population represented a threat to national security had consequences.\n\nLives were disrupted, homes and businesses were lost and Japanese Americans were incarcerated in barracks surrounded by watchtowers and barbed wire. Muslims today face the same set of nativist fears of a threat to a narrowly conceived American identity. The potential results are denials of family reunification, timely grants of refugee status and loss of business opportunities.\n\nThough he has tried to sell his travel ban as part of a broader national security effort, the president’s orders, when viewed in light of his many public statements, appear aimed at burdening those who practice a religion he has characterized as alien. Trump’s fearmongering will hopefully seem as absurd to future generations as earlier fears of Japanese Americans seem now. We must hope that today’s courts, unlike those of 75 years ago, will continue to prevent the president’s reprehensible views from establishing untenable national policy.", "authors": ["Duncan Williams Is An Associate Professor Of Religion", "East Asian Languages", "Cultures At The University Of Southern California.", "Gideon Yaffe Is A Professor Of Law", "Philosophy", "Psychology At Yale University.", "About The Authors"], "publish_date": "2017-05-16", "source": "washingtonpost", "top_words": ["executive", "travel", "national", "japanese", "ban", "immigration", "roosevelts", "orders", "states", "trumps", "war", "internment", "order", "administration", "isnt"], "summary": "Trump’s first order, issued Jan. 27, carved out an exception for refugees persecuted as a religious minority in countries affected by the ban.\nBut both Roosevelt’s and Trump’s orders were unconstitutional because intent matters.\nBy contrast, less than a fifth of the Japanese community’s Christian leaders were initially detained, though after Roosevelt’s order, every Japanese American on the West Coast was forced into camps.\nLives were disrupted, homes and businesses were lost and Japanese Americans were incarcerated in barracks surrounded by watchtowers and barbed wire.\nTrump’s fearmongering will hopefully seem as absurd to future generations as earlier fears of Japanese Americans seem now."}