{"url": "https://www.washingtonpost.com/news/monkey-cage/wp/2017/02/20/universities-overwhelmingly-objected-to-the-trump-travel-ban-here-are-the-values-they-emphasized/", "id": "131", "title": "Universities overwhelmingly objected to the Trump travel ban. Here are the values they emphasized.", "text": "\n\nHandwritten ‘messages of resistance’ to President Trump and his executive orders are on view on a wall near the Washington Monument. (Drew Angerer/Getty Images)\n\nUniversities played an important role in the unexpectedly widespread mobilization against President Trump’s Jan. 27 executive order suspending entry to the United States from seven Muslim-majority countries.\n\nThe protests themselves came from many directions, as civil liberties organizations played a key role, while lawyers and activists flocked to airports to provide free assistance to arriving international travelers. While implementation of the order ended after injunctions by multiple courts, the Trump administration has indicated that it plans to issue a new order as soon as this week.\n\n[The U.S. already tried extreme vetting. It doesn’t work.]\n\nAcademic institutions took an unusually active role in speaking out against the order. Nearly every college and university in the country released a statement in response to the executive order. Seventeen universities joined an amicus brief against the order, while 49 leaders of top universities signed a widely noted open letter. Many schools referred to statements issued by the Association of American Universities, the Association of Catholic Colleges and Universities, and the Association of Public and Land Grant Universities. A wide range of academic professional associations issued statements, ranging from brief statements of concern to lengthy briefs. (Full disclosure: I helped draft this Middle East Studies Association Task Force statement.)\n\nThese academic institutions certainly responded to a clear threat to their interests. The travel ban threatened the visa status and ability to travel of students and faculty from the affected countries, disrupted regular research exchanges and threatened international conferences.\n\nBut almost every academic institution went well beyond such direct institutional interests. The executive order became a moment for academia collectively to assert a collective identity through a remarkably clear statement of the shared values that define American higher education.\n\nWhat values, specifically, did the U.S. higher education system believe were threatened by Trump’s executive order?\n\nTo find out, I compiled a data set of statements issued by the leaders of U.S. universities and colleges in the week after Trump issued his executive order. I began with a list compiled by David Comp for the International Higher Education Consulting blog and supplemented it with targeted searches of other universities and colleges. The data set includes statements by the leaders of 264 individual institutions of higher education, both public and private, and at least one from every state. The data set included 125 institutions based in states that voted for Trump (77 of them public institutions, 28 private) and 139 from states that voted for Hillary Clinton (52 of them public, 87 private). Although it’s not comprehensive, it’s a pretty good cross-section of U.S. higher education.\n\n[Trump’s travel ban may backfire — and hinder U.S. policy]\n\nNot a single university or college in this data set endorsed the immigration order.\n\nA very small number, especially public universities facing conservative legislatures and public opinion, limited themselves to assurances of support to students and faculty affected by the disruptive impact of the executive order. But all but a very small number of institutions went on to articulate the institutional mission and the core values that the immigration order violated.\n\nThis is not to say that these academic institutions took a political lead or adopted partisan views. Almost all universities, public or private, avoid any direct partisan commentary. The word “condemn” appears only six times and “resist” only four times. Public universities were generally more likely to release short, businesslike statements primarily focused on the services available to students facing disruption: Seventy-four percent of the statements with fewer than 200 words came from public universities. Elite private schools were more likely to wax eloquent. But virtually all statements included some reference, however curt, to deeply held values and institutional missions.\n\nBalancing national security with other enduring values\n\nThe Trump administration’s framing of the order as an appropriate response to the threat of terrorism receives little traction with the nation’s higher educational institutions. While a number of schools acknowledged the demands of national security, virtually all went on to call for balancing those concerns with the needs of international students and with enduring values, of the logistical problems for students with a recognition of the demands of national security. The word “security” (used in this context) appears 46 times, while the words “terror” and “terrorism” appear only 23 times in the 264 statements. By contrast, “values” and “mission” appear 498 times. Not a single statement expressed the belief that the order aligned with their values.\n\nLiberal arts values were emphasized, including the open exchange of ideas\n\nThose values were not liberal in a partisan Democratic sense but in the tradition of the liberal arts. The statements collectively asserted the open exchange of ideas and the values of a diverse community as the core of their identity. The word “community” appears 960 times. That community is typically described as diverse (244 mentions), welcoming (204) and inclusive (139). There are frequent references to the free exchange of ideas (111). The safety of students is a recurrent theme, with variations of “safe” or “protect” appearing 299 times, but the assertively positive values articulated give very little sense of students as vulnerable snowflakes. In short, these statements present their universities as a distinctive type of community with powerful shared values violated by the travel ban.\n\nThe academic community is understood to be global and internationalist\n\n“Global” appears 190 times. International students are presented as enriching the educational and research environment. These global connections offer a back door for some public institutions that otherwise shied away from explicit value statements that might be taken as political. A number of statements instead highlighted the number and diversity of international students on campus as a way of asserting nonpartisan values. That may be why the word “Muslim” appears 86 times, but “Islam” only six times. Institutions could focus on individual Muslim students as members of this diverse community rather than engaging the broader question of religion.\n\nWas there a blue state/red state divide?\n\nLess than you would expect. Fifty-two red state institutions issued statements of fewer than 300 words, compared with only 30 blue state institutions. Fifty-five blue state institutions issued statements of more than 500 words, compared with only 20 red state institutions. But the values articulated in the statements were remarkably similar across the partisan divide. Red state institutions tended to emphasize the same kinds of diverse and inclusive communities, and to highlight the same contributions by international scholars, as those in blue states.\n\n[How Trump changed Americans’ view of Muslims — for the better]\n\nThese results are striking in part because of what they say about the contemporary discourse on the academy. For many on the left, today’s universities are dominated by a soulless neoliberalism, bereft of values or conscience. For many on the right, they are the domain of postmodernist dogma and leftist indoctrination. The response to the executive order shows instead that, at least by the rhetoric of leaders, liberal values remain the essence of the modern academy. Most leaders of institutions of higher education seem willing to fight not only to protect their students and faculty, but to speak out in defense of inclusion, toleration, diversity and community.", "authors": [], "publish_date": "2017-02-20", "source": "washingtonpost", "top_words": ["executive", "travel", "values", "trump", "ban", "emphasized", "public", "state", "institutions", "universities", "objected", "overwhelmingly", "times", "statements", "order", "students"], "summary": "Nearly every college and university in the country released a statement in response to the executive order.\nWhat values, specifically, did the U.S. higher education system believe were threatened by Trump’s executive order?\nIn short, these statements present their universities as a distinctive type of community with powerful shared values violated by the travel ban.\nFifty-two red state institutions issued statements of fewer than 300 words, compared with only 30 blue state institutions.\nFifty-five blue state institutions issued statements of more than 500 words, compared with only 20 red state institutions."}