{"url": "https://www.washingtonpost.com/world/national-security/white-house-receives-dhs-report-that-will-shape-travel-bans-future/2017/09/19/47cc3d76-9d57-11e7-8ea1-ed975285475e_story.html", "id": "124", "title": "White House receives DHS report that will shape travel ban’s future", "text": "The Department of Homeland Security has submitted to the White House a classified report on screening foreign travelers wanting to enter the United States — a key document President Trump is likely to rely on as he decides the future of his controversial travel ban.\n\nWith a major portion of the ban set to expire Sunday, DHS officials in recent days sent a report to the White House that “meets the requests that the president laid out in the executive order in an effort to establish better screening and vetting of persons to the United States,” department spokesman Jonathan Hoffman said.\n\nHoffman declined to say exactly what the report recommended, although he asserted it was not meant to form the basis of a permanent ban. Last week, citing an attack in London, Trump had written on Twitter that his ban should be “far larger, tougher and more specific.”\n\n[Citing London terrorist attack, Trump calls for expansion of his travel ban]\n\n“The intention of it is not to create a ban of any sort,” Hoffman said. “It is to ensure that we have the ability to screen and vet people traveling to the United States.”\n\nTrump’s travel ban — which barred the issuance of new visas to residents of six Muslim-majority countries and blocked the entry of all refugees — was contemplated as a temporary measure, designed to give DHS officials time to assess the information the United States is able to get about those coming to the country.\n\nThe portion of the ban affecting citizens of the six countries was to expire in 90 days, and the portion affecting refugees was to expire in 120 days. The 90-day period expires Sunday, according to spokesmen for the Justice Department and DHS.\n\n[Which of your family members could visit under the travel ban]\n\nWhile the ban was in effect, DHS and other officials were to assess the information other countries provided to the United States to help with vetting. Those countries that could not produce the necessary information or come up with a plan to do so were to be included on a list sent to the president. Those on the list risked being named in “a Presidential proclamation that would prohibit the entry of appropriate categories of foreign nationals,” according to Trump’s executive order.\n\nHoffman declined to say whether the report to the president included such a list, although he said it was created in response to the executive order’s demand for one. He also declined to say what officials will do after Sunday, referring questions on that subject to the White House.\n\n“Everybody is aware of the timeline, and we are focused on ensuring that persons traveling to the United States are properly vetted and screened before coming here, regardless of where they’re coming from,” he said.\n\nThe White House declined to comment on the future of the ban, offering only that the administration would “ensure we only admit those who can be properly vetted and will not pose a threat to national security or public safety.”\n\nThe Supreme Court is scheduled to hear arguments on Oct. 10 on whether the travel ban is legal. In the meantime, officials have been allowed to impose only a limited version of the measure, exempting those with a bona fide connection to the United States, such as a job or family member here.\n\nThe refu­gee portion of the ban is set to expire Oct. 24, U.S. officials have said, probably before the Supreme Court will have made a decision. It is possible the case could be moot, and it is also possible the Trump administration will impose new restrictions that could be met with fresh legal challenges, U.S. officials have said.", "authors": [], "publish_date": "2017-09-19", "source": "washingtonpost", "top_words": ["travel", "future", "shape", "trump", "ban", "receives", "report", "officials", "united", "states", "president", "portion", "dhs", "bans", "house", "white"], "summary": "The Department of Homeland Security has submitted to the White House a classified report on screening foreign travelers wanting to enter the United States — a key document President Trump is likely to rely on as he decides the future of his controversial travel ban.\nHoffman declined to say exactly what the report recommended, although he asserted it was not meant to form the basis of a permanent ban.\nHe also declined to say what officials will do after Sunday, referring questions on that subject to the White House.\n“Everybody is aware of the timeline, and we are focused on ensuring that persons traveling to the United States are properly vetted and screened before coming here, regardless of where they’re coming from,” he said.\nThe refu­gee portion of the ban is set to expire Oct. 24, U.S. officials have said, probably before the Supreme Court will have made a decision."}