{"url": "https://www.washingtonpost.com/news/answer-sheet/wp/2017/02/02/mass-college-creates-refugee-scholarship-for-a-student-affected-by-trumps-travel-ban/", "id": "184", "title": "Mass. college creates ‘refugee scholarship’ for a student affected by Trump’s travel ban", "text": "\n\nHundreds gather at Los Angeles International Airport to protest the travel ban from Muslim-majority countries enacted by President Trump. (European Pressphoto Agency)\n\n(Adding: Scholarships from Roger Williams University)\n\nIn what appears to be a first, Wheaton College in Massachusetts just announced a new scholarship for an international student affected by President Trump’s immigration order temporarily banning entry into this country for citizens of seven Muslim-majority countries and refugees from around the world.\n\nThe Wheaton Refugee Scholarship being offered by the liberal arts school with some 1,600 students was just announced by the college’s president, Dennis M. Hanno, and will cover all costs of attending the college in Norton, Mass. For the 2016-17 school year, tuition, room and board, and a student activity fee amounted to $61,512, with $48,694 of that covering tuition.\n\nHanno said, according to the school’s website, that Wheaton is “dedicated to improving the world by advancing knowledge and sharing it,” but that Trump’s order “endangers our ability to deliver on that mission.”\n\nThe executive order includes a ban on entry into the United States by citizens of Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen for the next 90 days and temporarily bans refugees as well, including indefinitely blocking those from Syria.\n\nAbout 1 in 20 of the more than 20 million students enrolled in U.S. colleges in 2015-2016 came from other countries, the Institute of International Education said. Some 17,000 of them were originally from the seven countries in Trump’s ban.\n\nIn late January, Roger Williams University, a semi-private liberal arts school in Rhode Island, offered four scholarships — two to the law school and two to the architectural school — to students from war-torn Syria. The announcement on the school’s website notes that as many as 200,000 Syrian students have been forced to terminate their university studies because of the crisis in Syria.\n\nThere are a number of scholarships available for immigrants and foreign-born Americans, but this appears to be the first scholarship created to help students affected by the president’s travel ban.\n\nColleges and universities around the United States have been scrambling to help students and scholars affected by the ban. Some school presidents have issued statements condemning the travel ban, saying that it is a violation of American values. Colleges and universities are also concerned about the longer-term fallout from the ban, which could stem the flow here of international students, who spend billions of dollars a year in this country.\n\nWheaton found a concrete way to express its concern for the travel ban and offer help to a student with the scholarship. This is the announcement on the Wheaton website:", "authors": [], "publish_date": "2017-02-02", "source": "washingtonpost", "top_words": ["travel", "college", "mass", "international", "ban", "affected", "refugee", "trumps", "creates", "school", "countries", "wheaton", "student", "scholarship", "students", "website"], "summary": "Hundreds gather at Los Angeles International Airport to protest the travel ban from Muslim-majority countries enacted by President Trump.\nSome 17,000 of them were originally from the seven countries in Trump’s ban.\nThere are a number of scholarships available for immigrants and foreign-born Americans, but this appears to be the first scholarship created to help students affected by the president’s travel ban.\nSome school presidents have issued statements condemning the travel ban, saying that it is a violation of American values.\nWheaton found a concrete way to express its concern for the travel ban and offer help to a student with the scholarship."}