{"url": "https://www.washingtonpost.com/world/nations-condemn-trumps-travel-ban-as-the-fallout-infects-peoples-lives/2017/01/29/0c7b70e8-e5ab-11e6-a419-eefe8eff0835_story.html", "id": "138", "title": "Nations condemn Trump’s travel ban, as the fallout infects people’s lives", "text": "People gather at Schiphol Airport, near Amsterdam, to protest the travel ban imposed by President Trump’s executive order. (Alexander Schippers/European Pressphoto Agency)\n\nIn Turkey, a Syrian American woman worried that if she tried to enter the United States with her Syrian refugee husband, he could be deported back to Syria.\n\nIn Moscow, a young Yemeni Russian man said he was denied a U.S. student visa because U.S. officials deemed he was more Yemeni than Russian.\n\nAnd in Kenya, a young Somali refugee scheduled to fly to the United States on Monday to launch a new life was informed that his trip was canceled.\n\nAnd so, on the second day after President Trump signed his executive order banning visas to nationals of seven Muslim-majority countries, the fallout continues, permeating through the lives of countless people around the globe.\n\n“I felt the world turning around and I felt crushed,” said Jameel Almaqtari, 23, who carries both Russian and Yemeni passports, after his hope of getting an American education was denied Friday. “I feel a great sense of oppression and injustice. It was always my dream to go to the U.S.”\n\nThe psychological and emotional toll was accompanied Sunday by a growing diplomatic fallout from the decision to prevent would-be immigrants, refugees and even visitors from the affected countries from entering the United States for the next 30 days — or longer. From Europe to the Middle East, politicians who condemned the travel bans said they were unjustified, would do little to combat terrorism and would bring more woes to the most vulnerable people in the world.\n\n[Denied Entry: Stories of refugees and immigrants barred from the U.S.]\n\n“The chancellor regrets the entry ban imposed by the U.S. government against refugees and nationals from certain countries,” read a statement issued by the office of German Chancellor Angela Merkel. “She is convinced that even in the necessary resolute battle against terrorism it is not justified to place people from a certain origin or belief under general suspicion.”\n\nIran on Sunday again blasted the executive order, after announcing its own ban on American citizens entering the country. The tensions threatened the diplomatic thaw that took place between Iran and the United States under former president Barack Obama.\n\nThe Iranian speaker of parliament, Ali Larijani, said that the decision to ban citizens of the seven Muslim-majority countries — Iran, Yemen, Somalia, Iraq, Syria, Libya and Sudan — was “hasty” and based on fear, according to Iran’s official Islamic Republic News Agency.\n\nBanning Iranians over terrorism concerns “is nothing but a lame joke,” he said at an open session of parliament, IRNA reported.\n\nIn Iraq, some clerics and members of parliament called for the government to implement a reciprocal ban on Americans. The more than 5,000 U.S. troops in the country as part of a coalition to fight the Islamic State are supported by thousands of security contractors on visas, who could be affected.\n\n[He risked his life working for the U.S. in Iraq. Now his visa’s no good.]\n\nThe outspoken Shiite cleric Moqtada al-Sadr, whose militia once battled the U.S. occupation of Iraq following the 2003 invasion, released a statement Sunday calling for American nationals to be expelled.\n\nThe United States enters Iraq and other countries with “complete freedom” while closing its doors to the nationals of those countries, he said.\n\n“That is swagger and arrogance,” he said. “Get your citizens out.”\n\n“We clearly demanded that the Iraqi government deal reciprocally,” Hassan Shwairid, the deputy head of the Iraqi parliament’s foreign affairs committee, told Agence France-Presse.\n\nSaad al-Hadithi, a spokesman for Iraqi Prime Minister Haider al-Abadi, said that Iraq hopes that the new procedures won’t damage the relationship between Baghdad and Washington. He said that he thought that the changes would not be permanent, as Trump told Abadi that he was “keen on developing relations” on a recent call.\n\n“We understand the security motives behind these procedures, but we stress at the same time on the importance of taking the mutual interests of both countries into consideration,” he said.\n\nIn Yemen, the Houthi-led rebel government that controls the capital, Sanaa, angrily denied that the country and its citizens are “a potential source of terrorism and extremism.” And Turkey’s deputy prime minister, Mehmet Simsek, said on Twitter on Sunday that refugees are welcome in Turkey, “the world’s largest refugee hosting country.”\n\n“We’d happily welcome global talent not allowed back into #USA,” he posted.\n\nMohammed Abdi, who fled war-torn Somalia, was supposed to be on his way to the United States on Monday. He had boarded a bus from Dadaab, the largest refugee camp in the world, to a small transit center in Nairobi run by the International Organization for Migration (IOM).\n\nThat’s where he was supposed to get a crash course on American culture — how to take public transportation, how to apply for a job, how to navigate a large city after two decades living in a sprawling camp for Somalis who had fled their countries’ wars.\n\nAbdi was bound for St. Louis. Back at Dadaab, he sold what he owned to buy winter clothes for himself, his wife and his four children. Even the store at Dadaab had an American name: “U.S. Clothes.” Then, on Saturday, employees of the transit center told him that his trip had been canceled.\n\n“They told me this has been suspended by the honorable president of the United States, Donald Trump,” he said.\n\nAbdi looked around at the other refugees. Some of them were crying. He tried to stay optimistic, telling the others that nothing was certain yet.\n\n“We wish the best,” he said, “but I don’t know what will happen.”\n\nIn Istanbul, the Syrian American woman and her Syrian refugee husband contemplated their next steps. They spoke on the condition of anonymity because they are worried they could face retribution both in Turkey and at U.S. entry points. Married for nearly two years, both are humanitarian workers aiding the Syrian people.\n\n[As Trump bars Syrian refugees, life in their camps is getting harder]\n\nThe husband received a U.S. visa this month that grants him an immediate green card. They wanted to live in the United States, so they quit their jobs and bought their airplane tickets to Chicago, where the wife is from.\n\n“Now, if we travel, we don’t know if we can get in,” she said.\n\nIf her husband is sent back to Turkey, he may not be allowed to re-enter because of strict Turkish immigration rules for Syrian refugees, she said. And if he’s sent back to Syria, he would return to a war zone.\n\n“We were ready to move to the States,” she said. “We were looking for places to live, looking for apartments. I was already doing interviews for new jobs. And now all of this happened.”\n\n“I won’t go back to the U.S. without my husband,” she added. “I just won’t.”\n\nKevin Sieff in Nairobi; Erin Cunningham in Istanbul; Ali al-Mujahed in Sanaa; Loveday Morris in Irbil, Iraq; Mustafa Salim in Baghdad; and Stephanie Kirchner in Berlin contributed to this report.\n\nRead more\n\nTrump official appears to walk back inclusion of green-card holders in travel ban\n\n‘Donald Trump destroyed my life,’ says barred Iraqi who worked for U.S.\n\nWorld’s airports turn into limbo for many under Trump order\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["syrian", "travel", "lives", "trump", "ban", "iraq", "refugee", "condemn", "refugees", "united", "states", "trumps", "countries", "husband", "infects", "peoples", "nations", "fallout", "american"], "summary": "The tensions threatened the diplomatic thaw that took place between Iran and the United States under former president Barack Obama.\nMohammed Abdi, who fled war-torn Somalia, was supposed to be on his way to the United States on Monday.\n“They told me this has been suspended by the honorable president of the United States, Donald Trump,” he said.\n“We wish the best,” he said, “but I don’t know what will happen.”In Istanbul, the Syrian American woman and her Syrian refugee husband contemplated their next steps.\nThey wanted to live in the United States, so they quit their jobs and bought their airplane tickets to Chicago, where the wife is from."}