{"url": "https://www.washingtonpost.com/news/global-opinions/wp/2017/03/16/how-trumps-travel-ban-uses-muslim-women-as-pawns/", "id": "114", "title": "How Trump’s travel ban uses Muslim women as pawns", "text": "\n\nA Syrian refugee in her home in Jordan. (Muhammad Hamed/Reuters)\n\nRemember when rescuing women from the violence of radical Islam was used by Laura Bush as a reason for U.S. troops to go to war to fight terrorism abroad? Now it appears that President Trump is using women’s safety to justify keeping foreigners from Muslim countries out of the United States.\n\nLost among the outrage over Trump’s revised travel ban, which was at least temporarily blocked by court actions Wednesday, is a particularly problematic clause that supposedly targets violence against women. Section 11 (ii) says that “the secretary of Homeland Security, in consultation with the Attorney general, shall … collect and make publicly available … information regarding the number and types of acts of gender based violence against women, including so-called ‘honor killings,’ in the United States by foreign nationals.”\n\n[So much for the West “saving\" Muslim women from terrorism]\n\nTrump’s order to track information on gender-based violent crimes has nothing to do with protecting women and everything to do with stigmatizing Muslim immigrants and trying to justify more public surveillance of marginalized groups. Preserving the dignity and safety of women (usually white women) has been used as a justification for racism and xenophobia against people of color for ages in Western countries. Before gunning down black parishioners at a church in South Carolina, white supremacist Dylann Roof reportedly said, “You rape our women, and you’re taking over our country.”\n\nOn Monday, a group of advocacy organizations sent a letter to Trump emphasizing that this executive order does little to help protect vulnerable women and girls. The coalition rightly criticized the use of the phrase “honor killings” in the context of the ban on Muslim-majority countries, saying that it “not only promotes and inflames Islamophobia, but it further feeds into the false narrative that violence against women is specific to non-Western cultures.”\n\nOf course, “honor killings” of women and girls are a problem in countries such as Pakistan, where the high-profile killing of social media star Quandeel Baloch sparked international outrage. Her brother confessed and was arrested. But numerous countries have taken steps to address the problem. Turkey gives life sentences to those involved in honor killings. Jordan has moved to create special courts to address them. Prominent Islamic leaders and imams around the world have condemned the practice.\n\nTo say it once again, immigrants in the United States, both documented and undocumented, are less likely to commit crimes than people born here. Sadly, it also bears repeating that violence against women is not solely an Islamic problem, nor is it a problem of black and brown countries. It is a global problem, and the United States is no exception*. About 20,000 calls a day are made to U.S. domestic violence hotlines, and nearly one in three women have been victims of some form of domestic violence. About 19.3 million women have reported being stalked by an intimate partner.\n\n(8:57 pm * Thanks to an astute reader who pointed out that the “crimes of passion” defense in a number of states in the U.S. have allowed men to get away with killing their wives after being irrationally angry with them, to only face softened punishments under lesser charges. In Georgia, as seen in a case where a man killed his wife after becoming enraged when he learned about her affairs, a killing can become an involuntary manslaughter when the perpetrator “acts solely as the result of a sudden, violent and irresistible passion resulting from serious provocation sufficient to excite such passion in a reasonable person.” Honor killings and the “crime of passion” killings– are they so different?)\n\nThat Trump, who bragged about forcibly groping women during his reality TV days, would present himself as a protector of women from violence is insidious enough. But from a policy level, Trump’s cynical use of violence against women in his immigration order is even more hypocritical, considering that his administration is reportedly planning to gut the very programs that would assist women who are victims of domestic violence. The Trump administration may cut 25 grant programs managed by the Justice Department’s Office of Violence against Women; these programs help fund organizations that assist women who are victims of stalking, domestic violence, sexual assault and elder abuse. The Department of Housing and Urban Development, which may face a budget cut of $6 billion, also adopted special rules to shield women who report being victims of domestic violence from being evicted from subsidized housing.\n\nIf the Trump administration were serious about protecting women, it would be strengthening domestic violence programs and allowing women refugees in, not fortifying our borders. Instead he is using women as political pawns, exploiting the issue of their safety to promote xenophobia and anti-immigrant animus. None of us, neither men nor women, will be safer for it.", "authors": [], "publish_date": "2017-03-16", "source": "washingtonpost", "top_words": ["travel", "pawns", "women", "trump", "ban", "problem", "killings", "honor", "victims", "united", "trumps", "uses", "countries", "muslim", "domestic", "violence"], "summary": "Lost among the outrage over Trump’s revised travel ban, which was at least temporarily blocked by court actions Wednesday, is a particularly problematic clause that supposedly targets violence against women.\nTurkey gives life sentences to those involved in honor killings.\nAbout 20,000 calls a day are made to U.S. domestic violence hotlines, and nearly one in three women have been victims of some form of domestic violence.\nIf the Trump administration were serious about protecting women, it would be strengthening domestic violence programs and allowing women refugees in, not fortifying our borders.\nInstead he is using women as political pawns, exploiting the issue of their safety to promote xenophobia and anti-immigrant animus."}