{"url": "https://www.washingtonpost.com/national/health-science/trump-gives-no-sign-of-backing-down-from-travel-ban/2017/01/29/4ffe900a-e620-11e6-b82f-687d6e6a3e7c_story.html", "id": "199", "title": "Amid protests and confusion, Trump defends executive order: ‘This is not a Muslim ban’", "text": "President Trump’s executive order temporarily prohibiting entry into the United States for migrants from seven mostly Muslim countries and refugees from around the world fueled confusion, angst and a wave of protests across the country Sunday.\n\nEven as administration officials tried to clarify the reach of Trump’s action — “This is not a Muslim ban,” the president said in a statement — the exact limits of its scope and legal questions over its constitutionality remained unresolved. So did the question of whether the administration would comply with orders from federal judges to temporarily halt the travel ban.\n\nRaucous protests erupted in airport terminals from coast to coast. Tens of thousands of people protested outside the gates of the White House, in Boston’s Copley Square and in New York’s Battery Park, with its views over the Statue of Liberty.\n\nScenes of relief, anxiety and sorrow played out around the globe.\n\nAt Dallas Fort Worth International Airport, a 70-year-old Iranian woman who recently received her green card was released after being detained overnight. In New York City, a graduate student contemplated whether he would quit his doctoral program to rejoin his wife in Iran after she was blocked from returning to the United States.\n\nAnd in Iraq, a man who had risked his life working on behalf of the U.S. government bleakly wondered about his future and that of his wife and three children. Visas in hand, the family was due to fly Monday to the United States. “It’s like someone’s stabbed me in the heart with a dagger,” he said.\n\n[Scholars: Many more legal challenges likely for Trump’s executive order on immigration]\n\nTrump issued a statement late Sunday afternoon that offered little clarity, even as he defended his executive order as necessary to protect the United States from terrorism.\n\n“To be clear, this is not a Muslim ban, as the media is falsely reporting,” Trump said in the statement. “This is not about religion — this is about terror and keeping our country safe. There are over 40 different countries worldwide that are majority Muslim that are not affected by this order.”\n\n\n\nThe president reiterated that the country would resume issuing visas to all countries “once we are sure we have reviewed and implemented the most secure policies over the next 90 days.”\n\nStill, barely 48 hours after Trump issued his order, confusion reigned over its reach and its implementation. Even as the president and other top advisers defended the ban, some Trump officials appeared on Sunday to walk back one of the most controversial elements of the action: its impact on green-card holders, who are permanent legal residents of the United States.\n\n“As far as green-card holders going forward, it doesn’t affect them,” Trump’s chief of staff, Reince Priebus, said on NBC News’ “Meet the Press,” contradicting what government officials had said only a day earlier.\n\n1 of 23 Full Screen Autoplay Close Skip Ad × Photos from the scene of protest at New York’s JFK airport against Trump’s executive order halting refu­gee admissions View Photos Entry to the United States is being refused to legal residents, including green-card holders, from seven mostly Muslim countries who were abroad when the executive order was signed Friday by the president, and some travelers were detained at U.S. airports. Caption Entry to the United States is being refused to legal residents, including green-card holders, from seven mostly Muslim countries who were abroad when the executive order was signed Friday by the president. Jan. 28, 2017 People protest the Muslim immigration ban at John F. Kennedy International Airport in New York. President Trump signed an executive order that halted refugees and residents from certain predominantly Muslim countries from entering the United States. Stephanie Keith/Getty Images Buy Photo Wait 1 second to continue.\n\nIn a separate statement, Homeland Security Secretary John F. Kelly was less definitive, suggesting that green-card holders’ status would help them gain entry to the country but that they nonetheless would be subject to a “case-by-case” review.\n\nMeanwhile, Kelly’s department indicated separately Sunday that it would continue to implement Trump’s directive, even as it said it “will comply with judicial orders” issued by federal judges over the weekend, blocking enforcement of the ban to varying degrees.\n\n“Prohibited travel will remain prohibited, and the U.S. government retains its right to revoke visas at any time if required for national security or public safety,” the agency said in a statement. “No foreign national in a foreign land, without ties to the United States, has any unfettered right to demand entry into the United States or to demand immigration benefits in the United States.”\n\nTrump’s virtually unprecedented executive action applies to migrants and U.S. legal residents from Iraq, Iran, Sudan, Somalia, Syria, Libya and Yemen, and to refugees from around the world. People subject to the ban include dual nationals born in one of the seven countries who also hold passports from U.S. allies such as the United Kingdom.\n\nAs the legal questions surrounding the order remained unanswered Sunday, the uncertainty and resentment unleashed by the executive order he signed two days earlier showed few signs of waning.\n\nAt Dulles International Airport, lawyers seeking to represent people who had been detained failed to get information from Customs and Border Protection officials despite repeated attempts.\n\nEven three Democratic members of Congress — Reps. Gerald E. Connolly and Don Beyer of Virginia and Jamie Raskin of Maryland — ran into similar roadblocks. Connolly pressed an airport police officer to get a Customs and Border Protection official to meet with the lawmakers to tell them how many people were detained and to see whether they had been able to communicate with their attorneys.\n\n“Are people being detained?” Connolly asked the officer. “How can you enforce the law if you’re not enforcing a judge’s order?”\n\nConnolly soon was on the phone with a CBP congressional affairs official. He and the other members pressed for information on possible detainees, including those traveling on a flight from Turkey. No one on site from the agency would meet with them.\n\n“That is unacceptable. It is our understanding you are detaining people,” Connolly said. “Our understanding is you have not followed that [court] order.”\n\nThe president’s far-reaching action triggered a wave of criticism from Democrats on Capitol Hill, who plan to assemble Monday on the steps of the Supreme Court in a show of solidarity with legal attempts to block Trump’s travel ban. In addition, at least one House member said he plans to introduce legislation to overturn Trump’s action by forcing him to comply with the 1965 Immigration and Nationality Act, which banned discrimination against immigrants on the basis of national origin.\n\nTrump also encountered growing opposition Sunday from lawmakers in his own party.\n\n“You have an extreme vetting proposal that didn’t get the vetting it should have,” Sen. Rob Portman (R-Ohio) said Sunday on CNN’s “State of the Union,” even as he stopped short of opposing the order outright.\n\nSens. John McCain (R-Ariz.) and Lindsey O. Graham (R-S.C.) also spoke out against the action, saying in a joint statement that the government has a responsibility to defend its borders but must uphold “all that is decent and exceptional about our nation.”\n\n“It is clear from the confusion at our airports across the nation that President Trump’s executive order was not properly vetted,” they said, adding, “Such a hasty process risks harmful results.”\n\nIn a tweet Sunday afternoon, Trump was quick to criticize McCain and Graham as “sadly weak on immigration.” And Republican leaders in Congress on Sunday did not join the opposition to Trump’s order.\n\n“I don’t want to criticize them for improving vetting,” Senate Majority Leader Mitch McConnell said on ABC’s “This Week.” He cautioned that the United States doesn’t have a religious test for entry into the country, and he stopped short of saying that Trump’s action amounted to a Muslim ban.\n\n“I think we need to be careful,” McConnell said. “We don’t have religious tests in this country.”\n\nThe Department of Homeland Security noted that “less than one percent” of international air travelers arriving Saturday in the United States were “inconvenienced” by the executive order — though the situation described by lawyers and immigrant advocates across the country was one of widespread uncertainty and disorder at airports where travelers from the targeted countries were suddenly detained.\n\nFederal judges began stepping in late Saturday as requests for stays of Trump’s action flooded courtrooms.\n\nA federal judge in New York temporarily blocked deportations nationwide. Her ruling was followed by similar decisions by federal judges in California, Virginia, Seattle and Boston.\n\n[The tumultuous politics of U.S. immigration policy, from Roosevelt to Trump]\n\nTrump, who centered his campaign in part on his vow to crack down on illegal immigration and to impose what became known as his “Muslim ban,’’ remained unbowed Sunday. As White House officials insisted that the measure strengthens national security, the president stood squarely behind it.\n\nJust after 8 a.m. Sunday, Trump tweeted: “Our country needs strong borders and extreme vetting, NOW. Look what is happening all over Europe and, indeed, the world — a horrible mess!”\n\nLater in the morning, Trump tweeted, “Christians in the Middle-East have been executed in large numbers. We cannot allow this horror to continue!”\n\nMany Americans agreed with Trump. “He doesn’t hate Muslims,” said Kelley Anne Finn of Manassas, Va., who was interviewed at Dulles airport Sunday. “He doesn’t hate anybody. He’s trying to protect us.”\n\nAdministration officials said Sunday that they think it is possible for the White House to both comply with a judge’s order and continue enforcing Trump’s executive action. Their thinking is that the court order affects only people now in the United States, and that since the State Department is proactively canceling visas of people from seven predominantly Muslim countries, other travelers who would be affected by the court order are not expected to be able to travel to the United States in the first place.\n\nThe officials pointed out that while the order affects deportations, the travelers stranded at U.S. airports are not legally considered to be deported if they go back to their home countries, because they were never technically admitted to the United States.\n\nThat interpretation of the law will almost certainly lead to more court battles in coming days and could keep overseas travelers detained at airports in a state of legal limbo. As Sunday wore on, it became clear that the answers to those questions would have to wait until another day.\n\nThe protesters outside the White House pushed on, wielding poster boards with messages such as “Islamophobia is un-American” and “Dissent is patriotic,” chanting “No justice! No peace!” and singing renditions of “This Land is Your Land.”\n\nAnd in airports from Baltimore to Bangor, from Dallas to Denver, shouts of “Let them go!” and “Let them in!” reverberated Sunday. In many cities, demonstrators invoked the same chant: “No hate, no fear. Refugees are welcome here.”\n\nPhilip Bump in New York, Daniel Gross in Boston, and Michael Chandler, Steve Hendrix, Jenna Johnson, Sarah Larimer, Michael Laris, Ellen Nakashima, Ed O’Keefe, Abby Phillip, Kelsey Snell, Elise Viebeck and David Weigel in Washington contributed to this report.", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["executive", "protests", "amid", "trump", "legal", "ban", "defends", "united", "trumps", "states", "countries", "president", "action", "order", "muslim", "confusion"], "summary": "President Trump’s executive order temporarily prohibiting entry into the United States for migrants from seven mostly Muslim countries and refugees from around the world fueled confusion, angst and a wave of protests across the country Sunday.\nVisas in hand, the family was due to fly Monday to the United States.\n[Scholars: Many more legal challenges likely for Trump’s executive order on immigration]Trump issued a statement late Sunday afternoon that offered little clarity, even as he defended his executive order as necessary to protect the United States from terrorism.\nPresident Trump signed an executive order that halted refugees and residents from certain predominantly Muslim countries from entering the United States.\nFederal judges began stepping in late Saturday as requests for stays of Trump’s action flooded courtrooms."}