{"url": "https://www.washingtonpost.com/blogs/plum-line/wp/2017/02/28/trumps-muslim-ban-is-about-to-make-a-comeback-heres-whats-really-driving-it/", "id": "223", "title": "Trump’s ‘Muslim ban’ is about to make a comeback. Here’s what’s really driving it.", "text": "\n\n(AP Photo/Pablo Martinez Monsivais)\n\nAny day now, President Trump is going to issue a new version of his travel ban — one designed to get around the courts, which blocked his last one. Which will renew attention to the question: what is the real motive behind his ban?\n\nIn a new interview, one of the chief architects of that ban has offered an expanded rationale for it that goes well beyond the original one. Top Trump adviser Stephen Miller says the ban isn’t just about national security; it’s also about protecting American workers from foreign competition and protecting taxpayers from the drain on public benefits that refugees represent.\n\nMiller — who has been widely described as one of the key ideologists behind Trump’s America-first nationalism, along with Stephen Bannon — made the comments in the big Bloomberg Businessweek profile of him that has been making the rounds today. Here’s the key part:\n\nMiller and Bannon want Trump to undertake a radical recasting of U.S. policies, from immigration to trade to taxation, that would invert this frame by making the interests of U.S. citizens (or what Miller and Bannon perceive to be their interests) predominant, almost to the point of exclusivity. This will entail confronting trade-offs most people prefer to ignore and making hard-headed decisions on emotionally charged issues, such as the status of refugees and Dreamers — decisions Miller, with Trump’s blessing, has begun tackling already. The order temporarily banning refugees from seven Muslim-majority countries is a prime example. Miller contends that national security concerns warranted the move but adds that refugees compete with U.S. workers (“Obviously, a smaller number of refugees will have some effects in terms of raising wages”) and burden U.S. taxpayers (“because of how expensive American benefits programs are”), whereas “regional resettlement” would be cheaper. “For the prices of resettling one refugee in America,” he says, “you can support 12 in their home region.” (His numbers come from a study done by the Center for Immigration Studies, a conservative think tank in Washington.)\n\nIn this telling, the ban — which temporarily barred from entry refugees and migrants from seven Muslim-majority countries — is also necessary because refugees (and, presumably, migrants) are competing with Americans for jobs, driving down wages, and because they are accessing taxpayer-funded benefits.\n\nThe original executive order is heavily focused on national security as the rationale for the ban, describing it as designed to “protect the American people from terrorist attacks.” The order adds that “numerous foreign-born individuals have been convicted or implicated in terrorism-related crimes since September 11, 2001,” including some “who entered through the United States refugee resettlement program.” It says the temporary pause is necessary to tighten the screening process.\n\nMiller’s latest comments suggest an additional rationale, however, one rooted in a much broader set of imperatives designed to limit immigration for reasons that go beyond national security. And elsewhere in the Bloomberg piece, Miller talks about the need to restrict immigration to protect American workers.\n\nOf course, it’s possible for the ban to have more than one rationale, and Miller himself says as much. But the point is that this raises additional legitimate questions about whether the national security rationale for the ban is merely a pretext. Such questions have been raised before. As many have pointed out, Trump repeatedly campaigned on an explicit vow to ban Muslim entry into the United States, which raises questions as to whether the executive order was designed to move towards a Muslim ban in a manner designed to get around legal hurdles, meaning it has discriminatory intent and effect. In blocking the ban, the 9th Circuit Court of Appeals agreed that outside evidence, such as Trump’s public “Muslim ban” comments, can be considered in assessing its intent. Miller has added another possible motive into the mix.\n\nIndeed, this reading is consistent with everything we now know about the immigration vision put forth by Miller and Bannon. As the Los Angeles Times reports today:\n\nBehind President Trump’s efforts to step up deportations and block travel from seven mostly Muslim countries lies a goal that reaches far beyond any immediate terrorism threat: a desire to reshape American demographics for the long term and keep out people who Trump and senior aides believe will not assimilate… U.S. demographics have been changing rapidly — and undesirably in the eyes of top Trump aides, including his chief strategist, Stephen K. Bannon, and domestic policy advisor Stephen Miller. Inside the West Wing, the two men have pushed an ominous view of refugee and immigration flows, telling other policymakers that if large numbers of Muslims are allowed to enter the U.S., parts of American cities will begin to replicate marginalized immigrant neighborhoods in France, Germany and Belgium that have been home to plotters of terrorist attacks in recent years, according to a White House aide familiar with the discussions… The two men see the country’s long-term security and wage growth entwined with reducing the number of foreign-born people allowed to visit, immigrate and work in the U.S.\n\nAnd so, for Miller and Bannon, the rationale for the ban is rooted in something much broader — a combined longer-term demographic reshaping project designed to protect American workers from foreign competition and prevent European-style immigrant communities (which are seen as potential incubators of terror attacks) from developing in the United States. Miller’s comments in the Bloomberg article are broadly consistent with this. (The travel ban is temporary, but it’s easy to see it getting expanded and prolonged in the event of a terror attack, and moreover, another tacit goal here could be to discourage certain types of emigration to the U.S.)\n\nMeanwhile, a recently leaked internal Department of Homeland Security assessment blew apart the administration’s stated short-term national security rationale for the travel ban, concluding that “country of citizenship is unlikely to be a reliable indicator of potential terrorist activity.”\n\nPut this all together, and the idea that there is a serious and legitimate short term national security rationale for the travel ban is becoming harder and harder to sustain. It’s hard to say whether this will have any legal significance once the new version is introduced, but we now have very little doubt as to what is actually driving it.", "authors": [], "publish_date": "2017-02-28", "source": "washingtonpost", "top_words": ["heres", "driving", "comeback", "national", "ban", "trump", "security", "immigration", "designed", "trumps", "whats", "miller", "rationale", "refugees", "muslim", "really", "american"], "summary": "Which will renew attention to the question: what is the real motive behind his ban?\nIn a new interview, one of the chief architects of that ban has offered an expanded rationale for it that goes well beyond the original one.\nOf course, it’s possible for the ban to have more than one rationale, and Miller himself says as much.\nBut the point is that this raises additional legitimate questions about whether the national security rationale for the ban is merely a pretext.\nIn blocking the ban, the 9th Circuit Court of Appeals agreed that outside evidence, such as Trump’s public “Muslim ban” comments, can be considered in assessing its intent."}