{"url": "https://www.washingtonpost.com/news/morning-mix/wp/2017/02/03/kellyanne-conway-cites-bowling-green-massacre-that-never-happened-to-defend-travel-ban/", "id": "274", "title": "Kellyanne Conway cites ‘Bowling Green massacre’ that never happened to defend travel ban", "text": "In an interview with MSNBC's Chris Matthews on Feb. 2, White House counselor Kellyanne Conway defended President Trump's travel ban with inaccurate claims of a \"Bowling Green massacre,\" and an Iraqi refugee ban under former president Barack Obama. She later said she misspoke. (Jenny Starrs/The Washington Post)\n\nKellyanne Conway has taken “alternative facts” to a new level.\n\nDuring a Thursday interview with MSNBC’s Chris Matthews, the counselor to the president defended President Trump’s travel ban related to seven majority-Muslim countries. At one point, Conway made a reference to two Iraqi refugees whom she described as the masterminds behind “the Bowling Green massacre.”\n\n“Most people don’t know that because it didn’t get covered,” Conway said.\n\nThe Bowling Green massacre didn’t get covered because it didn’t happen. There has never been a terrorist attack in Bowling Green, Ky., carried out by Iraqi refugees or anyone else.\n\nIt appeared initially that Conway was referring to two Iraqi citizens living in Bowling Green who were arrested in 2011 and eventually sentenced to federal prison for attempting to send weapons and money to al-Qaeda in Iraq for the purpose of killing U.S. soldiers, according to a statement from the Justice Department.\n\nOn Friday morning, she acknowledged that with a tweet:\n\nBowling Green city officials said Friday in a statement that “while in 2011, two Iraqi nationals living in Bowling Green were arrested for attempting to provide money and weapons to terrorists in Iraq, there was no massacre in Bowling Green.”\n\n“I understand during a live interview how one can misspeak,” Mayor Bruce Wilkerson said of Conway’s remarks, “and we appreciate the clarification.”\n\n[Fact Checker: Kellyanne Conway’s claim of a ‘Bowling Green massacre’]\n\nThe arrests in Bowling Green were indeed covered, contrary to what Conway initially said. A Lexis search of major papers turned up about 90 news stories. That’s not counting TV coverage, as in the ABC news story she attached to her tweet.\n\nI was the @bgdailynews' city editor when the Bowling Green Massacre didn't happen. — Daniel Pike (@DPikeBGDN) February 3, 2017\n\nWe couldn't cover the Bowling Green Massacre because it didn't happen, but this newspaper has written close to 100 stories about that case. — Daniel Pike (@DPikeBGDN) February 3, 2017\n\nAs a result of the Bowling Green investigation, Mohanad Shareef Hammadi, 25, was sentenced to life in federal prison. Waad Ramadan Alwan, 31, was sentenced to 40 years in federal prison, followed by a life term of supervised release.\n\nBoth men pleaded guilty to federal terrorism charges and admitted to having taken part in attacks against U.S. troops in Iraq, not in Bowling Green.\n\nHere’s what the Justice Department said in a Jan. 29, 2013, statement:\n\nHammadi and Alwan both admitted, in FBI interviews that followed waiver of their Miranda rights, to participation in the purported material support operations in Kentucky, and both provided the FBI details of their prior involvement in insurgent activities while living in Iraq. Both men believed their activities in Kentucky were supporting AQI. Alwan admitted participating in IED attacks against U.S. soldiers in Iraq, and Hammadi admitted to participating in 10 to 11 IED attacks as well as shooting at a U.S. soldier in an observation tower. Court documents filed in this case reveal that the Bowling Green office of the FBI’s Louisville Division initiated an investigation of Alwan in which they used a confidential human source (CHS). The CHS met with Alwan and recorded their meetings and conversations beginning in August 2010. The CHS represented to Alwan that he was working with a group to ship money and weapons to Mujahadeen in Iraq. From September 2010 through May 2011, Alwan participated in ten separate operations to send weapons and money that he believed were destined for terrorists in Iraq. Between October 2010 and January 2011, Alwan drew diagrams of multiple types of IEDs and instructed the CHS how to make them. In January 2011, Alwan recruited Hammadi, a fellow Iraqi national living in Bowling Green, to assist in these material support operations. Beginning in January 2011 and continuing until his arrest in late May 2011, Hammadi participated with Alwan in helping load money and weapons that he believed were destined for terrorists in Iraq.\n\nConway also reiterated claims from Trump that his refugee policy is similar to “what President Obama did in 2011 when he banned visas for refugees from Iraq for six months.” Conway said it was “brand new information” to people that Obama enacted a “six-month ban on the Iraqi refugee program.” Breitbart also reported this week that “Obama suspended Iraq refugee program for six months over terrorism fears in 2011.”\n\nAs The Washington Post reported, that was not the case. Obama administration officials told The Post that there was never a point when Iraqi resettlement was stopped or banned. In the aftermath of the arrests of the two Iraqis living in Kentucky, the Obama administration imposed more extensive background checks on Iraqi refugees, and the new screening procedures created a dramatic slowdown in visa approvals.\n\n[Trump’s facile claim that his refugee policy is similar to Obama’s in 2011]\n\nState Department records show there was a significant drop in refugee arrivals from Iraq in 2011, The Post’s Glenn Kessler reported. There were 18,251 in 2010, 6,339 in 2011 and 16,369 in 2012. One news report said the “pace of visa approvals” had “slowed to a crawl,” indicating some were still being approved.\n\nConway’s interview was by no means the first time the arrests of the two Iraqis in Bowling Green had been politicized as support for blocking refugees from reaching the United States.\n\nIn December 2015, Sen. Rand Paul (R-Ky.) released a dramatic campaign video ad featuring images and video footage of the two Iraqi nationals, while criticizing then-rivals in the presidential race Sens. Ted Cruz (R-Tex.) and Marco Rubio (R-Fla.). In the 90-second ad, the faces of Alwan and Hammadi are featured with pounding, dismal music, establishing that the men were “welcomed into America, given public housing and public assistance — as refugees.”\n\nConway’s comments made the front page of the local newspaper in Bowling Green.\n\nCongratulations to the Bowling Green Daily News (@bgdailynews) for this front page and one-word headline. cc @DrMarioRGarcia pic.twitter.com/DRgLWRpPzb — BGrueskin (@BGrueskin) February 3, 2017\n\nThey were also shared widely on social media.\n\nOne journalist tweeted that the American Civil Liberties Union had created a “Bowling Green Massacre Victims Fund,” which actually redirected to the ACLU’s website.\n\nACLU has created a “Bowling Green Massacre Victims Fund”—which redirects to donate to the ACLU Trolling level: high https://t.co/XbX4WlIPka pic.twitter.com/Nwe04sB3eh — Bradd Jaffy (@BraddJaffy) February 3, 2017\n\nBut the organization said it wasn’t responsible.\n\nThe “Bowling Green Massacre” was the No. 1 topic trending on Twitter, and Conway’s interview prompted many to share memories of where they were “when the Bowling Green Massacre didn’t happen.”\n\nBut on a more serious note, Chelsea Clinton called the massacre “completely fake” and urged people not to “make up attacks.”\n\nVery grateful no one seriously hurt in the Louvre attack …or the (completely fake) Bowling Green Massacre. Please don't make up attacks. — Chelsea Clinton (@ChelseaClinton) February 3, 2017\n\nThen Conway called her out, tweeting, “ @ ChelseaClinton & others, you can’t ‘invent’ quality candidates either. I misspoke; you lost the election.”\n\nWe'll be sharing photos and fun facts about the #BowlingGreenMassacre as soon as it happens. #staytuned — Bowling Green NPS (@BowlingGreenNPS) February 3, 2017\n\nOne still shudders to think how bad the Bowling Green massacre would've been if not for the heroic intervention of Fred Douglass. — Alec MacGillis (@AlecMacGillis) February 3, 2017\n\nBrian Williams won a Purple Heart for his service at the Bowling Green Massacre. — Michael Blackman (@ParaComedian09) February 3, 2017\n\nMoments before the Bowling Green Massacre. – RZ pic.twitter.com/zKx2eEc23E — Richard M. Nixon (@dick_nixon) February 3, 2017\n\nHere are all the names of the people that perished in the Bowling Green Massacre. May they Rest In Peace pic.twitter.com/vB3k6vNz2y — Sam Z Comedy (@SamZComedy) February 3, 2017\n\nAnd then came this tweet from comedian Justin Shanes:\n\nFinding these Bowling Green Massacre jokes to be a little too soon. Out of respect, we should wait until it takes place. — Justin Shanes (@justinshanes) February 3, 2017\n\n1 of 10 Full Screen Autoplay Close Skip Ad × Controversial comments from Kellyanne Conway that made headlines View Photos Conway, counselor to President Trump, coined the term “alternative facts” and referred to a “Bowling Green massacre” that never happened. Caption Conway, counselor to President Trump, coined the term “alternative facts” and referred to a “Bowling Green massacre” that never happened. The government has many ways to surveil “What I can say is there are many ways to surveil each other now, unfortunately,” including “microwaves that turn into cameras, et cetera,” Conway told the Bergen Record in an interview Sunday. “So we know that that is just a fact of modern life,”Conway told ABC’s “Good Morning America.” READ THE STORY Bill O’Leary/The Washington Post Buy Photo Wait 1 second to continue.\n\nKellyanne Conway, the counselor to President Trump, defended his travel ban to seven Muslim-majority countries by referring to a \"Bowling Green massacre\" that never actually happened. (Alyse Young/The Washington Post)\n\nThis story has been updated.\n\nRead more:\n\nKellyanne Conway gave a master class in not answering questions in her Fox News interview\n\n‘They never saw this coming’: A Q&A with Kellyanne Conway\n\nHow Kellyanne Conway ushered in the era of ‘alternative facts’", "authors": [], "publish_date": "2017-02-03", "source": "washingtonpost", "top_words": ["travel", "iraqi", "bowling", "ban", "2011", "alwan", "kellyanne", "conway", "iraq", "refugee", "happened", "cites", "green", "president", "massacre", "defend"], "summary": "The Bowling Green massacre didn’t get covered because it didn’t happen.\n#staytuned — Bowling Green NPS (@BowlingGreenNPS) February 3, 2017One still shudders to think how bad the Bowling Green massacre would've been if not for the heroic intervention of Fred Douglass.\n— Alec MacGillis (@AlecMacGillis) February 3, 2017Brian Williams won a Purple Heart for his service at the Bowling Green Massacre.\nCaption Conway, counselor to President Trump, coined the term “alternative facts” and referred to a “Bowling Green massacre” that never happened.\nKellyanne Conway, the counselor to President Trump, defended his travel ban to seven Muslim-majority countries by referring to a \"Bowling Green massacre\" that never actually happened."}