{"url": "https://www.washingtonpost.com/news/powerpost/paloma/daily-202/2017/03/17/daily-202-blocked-travel-ban-raises-the-stakes-for-neil-gorsuch-s-confirmation-hearing/58cb8499e9b69b46c82e5c39/", "id": "293", "title": "The Daily 202: Blocked travel ban raises the stakes for Neil Gorsuch’s confirmation hearing", "text": "President Trump announces Neil Gorsuch as his choice for Supreme Court in the East Room of the White House on Jan. 31. (Jabin Botsford/The Washington Post)\n\nWith Breanne Deppisch\n\nTHE BIG IDEA: Vowing to fight for his frozen travel ban all the way to the Supreme Court, President Trump knows Neil Gorsuch may ultimately cast the deciding vote in his favor. Senate Republicans are rushing to confirm the judge by Easter so that he can break several 4-4 ties for conservatives before the end of the term, and this could be the biggest.\n\nGorsuch, who at 49 is the youngest nominee for the high court in a quarter century, would be pivotal in hundreds of cases over the next several decades that impact every single American. But the pending nature of the travel ban, combined with Trump’s continuing attacks on judges, raise the already high stakes of his Senate Judiciary Committee hearing, which begins Monday.\n\nThe president and his surrogates promise Gorsuch will be as, or maybe more, conservative than the late Antonin Scalia. On the 10th Circuit in Denver, he has been a staunch critic of the regulatory state but perennially deferential to the commander-in-chief's prerogative on matters related to national security.\n\n-- As a high-ranking official in George W. Bush’s Justice Department, Gorsuch was heavily involved in defending many of the president’s most controversial post-9/11 policies. Robert Barnes and Ed O’Keefe report that, by his own account, Gorsuch “helped coordinate litigation efforts involving a number of national security matters,” including opposing the rights of Guantanamo Bay detainees to sue in federal court and working to block the release of photos of prisoners abused by U.S. military personnel in Iraq’s Abu Ghraib prison. \"He took an active role in developing talking points for the administration on detainees, including whether ‘enhanced interrogation’ works. ‘Yes’ is handwritten next to a typed question: ‘Have the aggressive interrogation techniques employed by the Admin yielded any valuable intelligence?’”\n\nThe New York Times identifies some other notable emails Gorsuch sent while at DOJ that show how favorably inclined he is to executive power. Many more are classified or still have not been turned over for review. In Dec. 2005, Congress handed Bush a significant defeat by tightening legal restrictions against torture in a law called the Detainee Treatment Act. Soon afterward, Gorsuch emailed to a White House colleague in case he needed “cheering up” about the administration’s setback. “The email from Judge Gorsuch … linked to articles about a less-noticed provision in the act that undercut the rights of Guantánamo Bay detainees by barring courts from hearing their habeas corpus lawsuits,” Charlie Savage wrote. “The administration’s victory is not well known but its significance shouldn’t be understated,” wrote Judge Gorsuch, who had helped coordinate the Justice Department’s work with Congress on the bill.\n\nAround that time, Gorsuch visited Guantánamo for a briefing and tour : “Afterward, he wrote a note to the prison operation commander, offering a glowing review.”\n\n: “Afterward, he wrote a note to the prison operation commander, offering a glowing review.” “He … helped draft … an op-ed published by USA Today, under his supervisor’s byline, defending President Bush’s warrantless surveillance program and his use of a signing statement to claim a right to bypass the Detainee Treatment Act’s provision banning torture.”\n\n-- Trump has attacked judges in deeply personal terms. His declaration that Indiana-born Gonzalo Curiel could not fairly adjudicate a fraud lawsuit against Trump University because his parents were born in Mexico is the most notorious example. Paul Ryan called it the textbook definition of racism.\n\nAlways looking for a scapegoat, the president has pretty explicitly laid the groundwork to blame the courts after the next terrorist attack on the homeland – just as he blamed the generals when a Navy SEAL died on an operation he authorized in Yemen.\n\nHe tweeted this last month after a federal judge in Washington State issued an injunction:\n\nThe opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned! — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nWhat is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.? — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nJust cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad! — Donald J. Trump (@realDonaldTrump) February 5, 2017\n\nHis supporters listen to him closely and now echo Trump’s messaging. Here’s an example from a conservative site that has 100,000 Twitter followers:\n\nAll it will take is one Jihadi Nut Job to get into the country courtesy of the Judges blocking Trump’s Travel Ban. #BloodOnTheirHands pic.twitter.com/P5HO818CYe — Red Nation Rising (@RedNationRising) March 15, 2017\n\nA documentary filmmaker, who wrote a book called “Gorilla Mindset,” shared this with his 221,000 followers:\n\nThe next terrorist attack will be blamed on activist judges, deep state, and the media. Trump will have unprecedented popular support. — Mike Cernovich 🇺🇸 (@Cernovich) March 16, 2017\n\nHas Trump done everything in his power to prevent terrorism? Yes. Who has worked to stop him? Exactly. — Mike Cernovich 🇺🇸 (@Cernovich) March 16, 2017\n\nLou Dobbs, who has a TV show on Fox Business, framed this week’s rulings as part of a broader conspiracy by the “deep state” in a post to his 1.2 million followers:\n\nJay Bybee after delivering a lecture to University of Utah law students in 2015. (Salt Lake Tribune via AP)\n\n-- Gorsuch has made clear that he’s uncomfortable with Trump’s personal attacks on judges, including the one in Washington State who blocked the first order. But vastly more meaningful than that is whether he will be independent when legal challenges to his patron’s agenda wind up on the SCOTUS docket. If the first two months are any indication, that will happen a lot, and just because Gorsuch doesn’t like Trump’s methods or rhetoric doesn’t mean that he won’t back him up on the substance every time.\n\nJay Bybee, who signed the so-called “Torture Memos” in 2002 that permitted “enhanced interrogation” techniques on detainees, now sits on the Ninth Circuit. In an opinion this week, he poignantly rebuked Trump: “The personal attacks on the distinguished district judge and our colleagues were out of bounds of civic and persuasive discourse — particularly when they came from the parties. It does no credit to the arguments of the parties to impugn the motives or the competence of the members of this court; ad hominem attacks are not a substitute for effective advocacy. Such personal attacks treat the court as though it were merely a political forum in which bargaining, compromise and even intimidation are acceptable principles. The courts of law must be more than that, or we are not governed by law at all.”\n\nBut here’s the rub: Bybee wrote that paragraph at the very end of a 29-page dissent that took Trump’s side on all the underlying legal questions. Nothing would stop Gorsuch from doing the same.\n\n-- “Trump and his advisers can’t keep quiet — and it’s becoming a real problem,” John Wagner and Matt Zapotosky note. “In rulings halting both the first and second attempts at a ban, judges have cited comments by Trump and his close advisers as evidence of the administration’s intent to target Muslims in a manner inconsistent with the Constitution — even as lawyers for Trump insist that is not the case. … Undermining the administration’s claim of secular intent was Trump’s statement on the Christian Broadcasting Network on Jan. 27 — just before the first ban went into place — that he saw persecuted Christians as a priority in accepting refugees. And when he actually signed the measure, Trump declared: ‘This is the protection of the nation from foreign terrorist entry into the United States. We all know what that means.’ … The next day, a close Trump adviser, Rudolph W. Giuliani, appeared on Fox News and seemed to offer an explanation. ‘I’ll tell you the whole history of it,’ Giuliani said. ‘So when [Trump] first announced it, he said, ‘Muslim ban.’ He called me up. He said, ‘Put a commission together. Show me the right way to do it legally.’’\n\n“In his blistering 43-page opinion issued Wednesday, U.S. District Judge Derrick K. Watson in Hawaii referred to those comments as well as a recent Fox News appearance by Trump senior policy adviser Stephen Miller, who said the second attempt at a ban would have ‘mostly minor technical differences’ and that Americans would see ‘the same basic policy outcome for the country.’ At Wednesday night’s rally in Nashville, Trump took aim at Watson and suggested there was little difference between the intent of his first executive order and his second. ‘The order he blocked was a watered-down version of the first order that was also blocked by another judge and should have never been blocked to start with,’ Trump said.” That too can and will be used against him in court.\n\n-- Perhaps someone should have Mirandized the president? Trump’s words are being used against him not just in courts of law, but they are also complicating what might have been a slam dunk confirmation process for Gorsuch. The more the president attacks judges and makes unsubstantiated claims on Twitter about things like wiretapping, the harder it is for moderate Senate Democrats to justify defecting to their base. That, in turn, makes it harder for Mitch McConnell to get the 60 votes he needs to avoid a confrontation over the nuclear option.\n\n-- A disquieting trend: Some allies and strong supporters of the president are pleading with him to begin disregarding federal court orders. These populists are doing their best to encourage Trump’s “I-alone-can-fix-it” strongman impulses.\n\nMike Huckabee, a two-term governor of Arkansas and the father of a high-ranking White House official, posted this after the administration's most recent legal setback:\n\nHoping @POTUS tells Hawaii judge what Andrew Jackson told overreaching court-\"I'll ignore it and let the court enforce their order.\" — Gov. Mike Huckabee (@GovMikeHuckabee) March 15, 2017\n\nJackson almost certainly never actually said that quote, though it is often attributed to him, but he did indeed refuse to enforce an 1832 Supreme Court decision that affirmed the sovereignty of the Cherokee Nation. His rejection of this ruling, praised by Huckabee, led directly to the Trail of Tears, in which at least four thousand Native Americans died.\n\nBreitbart News, separately, gave big play yesterday to a Q&A with an attorney named Robert Barnes, who said the president could “go full Andrew Jackson.\" “America’s courts only have power as long as people respect and believe and have confidence in the independence and integrity of those courts,” Barnes said. “As that gets sacrificed, courts lose power, and we may return back to a time and place where someone like President Trump needs to go back to Andrew Jackson and invoke his tradition and legacy in order to challenge judicial usurpation of the safety and security of the country. At the current time, there’s not a lot we can do without being willing to go full Andrew Jackson against the court system.” (This Barnes has no relation to the WaPo Supreme Court correspondent by the same name.)\n\nThat Breitbart interview got tons of pick-up on social media. For example, this is a Trump supporter who has 300,000 Twitter followers:\n\nDO IT!\n\nPres Trump Could ‘Go Full Andrew Jackson’ and Ignore Interference from Activist Judges#MakeAmericaSafeAgainhttps://t.co/SE2UdmBrxZ pic.twitter.com/fyM4CMxkC6 — Linda Suhler, Ph.D. (@LindaSuhler) March 16, 2017\n\n-- All this sudden talk about Jackson – specifically an episode that happened two centuries ago – is no coincidence. Trump calls himself “a big fan” of Jackson, hung a portrait of him in the Oval Office and on Wednesday visited the late president’s estate on what would have been his 250th birthday. Trump stood at the grave and raised his hand to salute Jackson as taps was played. He said it was “inspirational” and noted that he too was elected by opposing the “arrogant elites.” “They say my election was most similar to his,” Trump said. Stephen K. Bannon, the president’s chief strategist, said the president’s dark inaugural address about “American carnage” was inspired by Jackson. “I don’t think we’ve had a speech like that since Andrew Jackson came to the White House,” Bannon said.\n\nTrump pauses to look at a portrait of Andrew Jackson at the Hermitage, Jackson's home, in Nashville. (Jonathan Ernst/Reuters)\n\n“By accident or by design, Trump’s visit to the Hermitage delighted white nationalists,” Dana Milbank reports. “The Daily Stormer, a neo-Nazi website, applauded as ‘fitting’ Trump’s honoring of this ‘white supremacist extremist,’ as it calls Jackson. The group created a poster for supporters to display featuring a portrait of Jackson underneath a reference to a quote from Bannon: ‘Like Andrew Jackson’s populism, we’re going to build an entirely new political movement.’ Beneath the Jackson portrait the poster says, with adorning swastikas, ‘The new face of the Republican Party: DailyStormer.com.’ … White nationalists are attempting to appropriate Jackson the way the tea party commandeered the ‘Don’t Tread on Me’ flag, and they see Trump encouraging them. ‘The fact that he put up a portrait of Andrew Jackson in the Oval Office should’ve sent a huge signal,’ white nationalist James Edwards said on his radio show, ‘Political Cesspool.’ … ‘We are in serious need of some more trails of tears just about now,’ Andrew Anglin wrote on the Daily Stormer. ‘And it’s look[ing] like Trump may well deliver in spades.’”\n\nMichael Gerson, a top speechwriter for George W. Bush, writes in his column today that Trump picked “a deeply disturbing hero” in Jackson: “He was the original, and prototypical, testostero-president. … He consistently pressed the boundaries of executive authority. Many of the Founders had been internally conflicted slaveholders. Jackson was not one for psychic struggle. … And much of Jackson’s reputation depended on being a frontier Indian fighter. This was a president who once earned the Indian nickname ‘Sharp Knife.’ In a battle against the Red Stick Creeks, Jackson set about to ‘exterminate them’ (his words). Hundreds of fighters and civilians were killed trying to flee across the Tallapoosa River. By one account, ‘the river ran red with blood.’ … Jackson was also one of the nation’s leading advocates of ‘Indian removal,’ which amounted to the ethnic cleansing of Creeks and Cherokee across the lower South…\n\n“Why discuss this ancient history (which is not really so ancient to the Cherokee)? Because Trump, in visiting Jackson’s Hermitage, has invited us,” Gerson concludes. “Jackson was wrong — badly, culpably wrong — on the largest issue of his time: the dignity and value of people of color. There is no refuge in the argument that Jackson merely reflected the values of his time. Jackson’s opponent in two elections, John Quincy Adams, viewed slavery as ‘the great and foul stain upon the North American Union.’ Henry Clay called Indian expulsion ‘a foul and lasting stain upon the good faith, humanity and character of the nation.’ And Jackson’s reputation will always bear those indelible marks.”\n\nWelcome to the Daily 202, PowerPost's morning newsletter.\n\nSign up to receive the newsletter.\n\nWHILE YOU WERE SLEEPING:\n\nSecretary of State Rex Tillerson stands with his Chief of Staff, Margaret Peterlin, and Gen. Leem Ho-young as two North Korean soldiers look on in the border village of Panmunjom, which has separated the two Koreas since the Korean War. (Lee Jin-man/Pool/Reuters)\n\n-- The Trump administration gave its strongest signal yet that it would consider taking military action against North Korea, with Rex Tillerson saying a few hours ago that “all options are on the table.” “Certainly we do not want for things to get to a military conflict, we’re quite clear on that in our communications, but obviously if North Korea takes actions that threaten the South Korean forces or our own forces, then that would be met with an appropriate response,” the secretary of state said at a press conference in Seoul. “If they elevate the threat of their weapons program to a level that we believe requires action, that option is on the table.\" He added that he hopes Pyongyang will respond to other pressures such as sanctions before military action becomes necessary.\n\n“Tillerson made the remarks after visiting the Demilitarized Zone that divides the two Koreas,” Anna Fifield reports. “There, he came almost face to face with North Korean soldiers standing on the other side of the yellow line that marks the border. North Korea has said that it is working on an intercontinental ballistic missile capable of striking the United States’ mainland, and has shown clear progress in its missile program in tests over the last year. Sanctions and diplomatic engagement have failed to convince North Korea to abandon its nuclear weapons program. But American administrations have long considered military action unfeasible because North Korea has artillery lined up on Seoul, a city of more than 20 million people that lies just 30 miles south of the DMZ.”\n\nSyrian civil defense volunteers, known as the White Helmets, dig through the rubble of a mosque following an alleged U.S. airstrike on a mosque in the village of Al-Jineh in Aleppo yesterday. The U.S. says it carried out an air strike in northern Syria against an Al-Qaeda target but denies deliberately targeting a mosque. (Omar haj kadour/AFP/Getty Images)\n\n-- The Pentagon confirmed that U.S. forces carried out an airstrike inside Syria that killed several al-Qaeda militants, amid emerging reports that dozens of civilians were also possibly killed in the same attack. Louisa Loveluck reports: “A statement Thursday from the U.S. Army’s Central Command said it had struck a ‘meeting location’ in the northeastern province of Idlib. But local activists and a monitoring group claimed the airstrike had hit a mosque in the west Aleppo countryside next to Idlib province, killing at least 46 people and leaving dozens more under the rubble. Reasons for the discrepancy in location were not immediately clear. The Syrian Observatory for Human Rights, a Britain-based monitoring network, described the attack as a ‘massacre’ and said the dead were mostly civilians. … Separately Friday, Syria and Israel traded competing claims over an apparent Israeli attack near the western city of Palmyra in the early hours of the morning. While the Syrian military said its air [defenses] had shot down Israeli jets over what it called ‘occupied ground,’ an Israeli military spokesman said the pilots’ safety had ‘at no point’ been compromised.”\n\nJohn Boehner swears in Steve Stockman in 2013. (Evan Vucci/AP)\n\n-- Ex-Rep. Steve Stockman (R-Texas) was charged with conspiring to violate federal election laws during his time in office. KPRC, the NBC affiliate in Houston, reports: “Stockman, a Tea Party favorite, .... was brought into court Thursday shackled and handcuffed. … It's a felony that could send him to federal prison if he's convicted. As Stockman stood before the judge, prosecutors alleged that the former Congressman had conspired with two former employees to funnel hundreds of thousands of dollars to his personal use. ... According to the complaint, in 2011 Stockman set up a non-profit called Life Without Limits in Las Vegas. A single contributor donated $350,000 to the charity, which Stockman then allegedly funneled back to himself through donations made by his employees.” He gave up his seat to challenge Sen. John Cornyn (R) in a 2014 primary.\n\nGET SMART FAST:​​\n\nThe House approved a pair of bills that would make it easier to fire employees at the VA and also allow some veterans deemed “mentally incompetent” to own firearms. (Military Times) USA Gymnastics president and CEO Steve Penny resigned, amid continued scrutiny of the Olympic sports organization’s handling of sexual abuse allegations against coaches. His resignation comes after a rare intervention by the U.S. Olympic Committee, which recommended he cede his post ahead of a high-profile hearing before the Senate Judiciary Committee that would have become a media circus. (Will Hobson) Prosecutors said that they will not bring any criminal charges against New York Mayor Bill de Blasio after parallel state and federal investigations into his fundraising apparatus. (Mark Berman) Three leading Irish musicians said they declined offers to perform at the White House St. Patrick’s Day celebration, citing opposition to the president’s stance on immigration and his proposed budget cuts to arts programs. “I just can’t do it,” said one U.S.-born performer, whose father was an Irish immigrant. “My father would be disgusted with me if I supported this administration in any way.” (Mary Jordan) The Florida Senate passed a measure to expand its “stand-your-ground” law, which allows people to use deadly force during an altercation if they “reasonably believe” their life is in danger. The changes would shift the burden of proof to prosecutors, forcing them to prove “beyond a reasonable doubt” -- the highest legal standard – that the use of force was unjustified. The law would apply not only to shootings, but also misdemeanors, domestic violence and assault cases not involving guns. (Katie Zezima) Hours after a Florida prosecutor announced she would not seek the death penalty in any cases, Gov. Rick Scott (R) said that he will remove her from the high-profile prosecution of a man charged with killing an Orlando police officer. (Mark Berman) Oklahoma state Sen. Ralph Shortey (R) is now facing prostitution charges after he was caught in a motel room with a 17-year-old boy. Police obtained his text messages, in which he allegedly offered money for “sexual” stuff. Charges filed against the senator include soliciting the prostitution of a minor; transportation for the purpose of prostitution; and prostitution within 1,000 feet of a church. A witness, potentially the boy’s father, saw the lawmaker pick him up and called police. (Kristine Phillips) Two Secret Service agents assigned to protect Trump’s grandson are under investigation for temporarily abandoning their posts after the duo reportedly took selfies with the eight-year-old while he was sleeping. The grandson, Donald Trump III, reportedly woke up as they took his picture and told his dad, who escalated it to the highest levels of the service. (Mother Jones) The number of opioid-related deaths in Ohio has spiked by 775 percent since 2003, killing so many people in the state that some counties have resorted to using cold-storage trailers as overflow morgues. (Kristine Phillips) Several Democratic lawmakers have called on the Justice Department to investigate as hate crimes a spike in transgender killings. Seven transgender women have been killed so far since the start of 2017 – a number lawmakers say puts the country on track to easily surpass the record number of killings last year. (Avi Selk) Thailand has launched a pilot program to provide separate detention facilities for transgender inmates. The new wing of a prison – painted pink and designed to hold up to 150 inmates – comes as many LBGT prisoners struggle to adapt to a binary prison system, which forces them to live with members of their birth gender and denies them hormone medication that many have been taking for years. (Axel Kronholm) A gang of pirates who seized an oil tanker in Somalia earlier this week has released the ship and all eight members of its Sri Lankan crew. Security officials said they agreed to disembark after negotiations with local elders. (AP) A U.S. ally recently used a “Patriot” surface-to-air missile – which costs $3 million, weighs 700 pounds, and is considered one of the most sophisticated weapons in the world – to shoot down a $200 drone purchased from Amazon. An Army commander gave a brief account of the incident at a symposium in Alabama – noting with a grin that “the Patriot won.” (Derek Hawkins) “SNL” will close out its record-smashing season tomorrow by doing something the series has never done before: going live, from coast-to-coast. The final four episodes of the season will air simultaneously across the country – meaning those in the Pacific time zone can tune in at 8:30 p.m., instead of catching a taped version of the show. Officials said they’re trying out the idea to allow everyone to be “in on the joke at the same time.” (Elahe Izadi) The decision in a class-action lawsuit about overtime pay for truck drivers in Maine hinged entirely on the use of an Oxford comma. Now a dairy company could be forced to shell out up to $10 million as a result. (New York Times) Surveillance footage from Birmingham shows a woman escaping a kidnapping. A man's car was rolling out of a parking lot when his trunk popped open, and she rolled from the vehicle. She told authorities that the driver attempted to rob her at gunpoint, and, upon discovering she had no money, forced her into his car. (Lindsey Bever) Pharma bro Martin Shkreli is trolling reporters who have written negative stories about him by purchasing internet domains associated with their names. The former pharmaceutical executive purchased domain names related to writers from Vice, Vanity Fair, AOL, Bloomberg, Dealbreaker, and Gizmodo, along with others who have merely been critical of Shkreli on social media. (Business Insider)\n\nPatrick Shanahan, a Boeing executive, speaks at the Paris Air Show. (Pierre Verdy/AFP/Getty Images)\n\nPERSONNEL IS POLICY:\n\n-- The president picked a Boeing executive to serve as Defense Secretary Jim Mattis’ second-in-command. Although Patrick Shanahan's recent job for the aircraft company was on the commercial side, he has also served as vice president and general manger of Boeing Missile Defense Systems and their military rotorcraft division. (Thomas Gibbons-Neff)\n\n-- Trump is expected to tap a coal lobbyist to be the #2 at the EPA. Politico reports that the appointment of Andrew Wheeler, a former aide to Sen. Jim Inhofe (R-Okla.), has not been finalized but it is expected to be in the coming weeks.\n\n-- In a note to shareholders, Goldman Sachs CEO Lloyd Blankfein noted that several alumni of the investment bank are now in top policymaking positions at the White House and Treasury Department. “We have been criticized for the fact that some of our colleagues, after long careers at the firm, have moved to work in the public sector. The charge is that Goldman Sachs is able to extract certain advantages that others cannot. In fact, the opposite is true. Those in government bend over backward to avoid any perception of favoritism,” Blankfein said in the letter. “We are proud of our tradition of leadership and public service and believe it is a core part of our culture. That is why we will continue to encourage our people to contribute to government service if they are fortunate enough to be asked.” (Renae Merle)\n\n-- One of Trump's top national security aides, Sebastian Gorka, denies reports that he is a member of – and took an oath of loyalty to – a Nazi-allied group. Buzzfeed News’ Talal Ansari and Lissandra Villa report: The Forward alleged that he is a member of Historical Vitézi Rend, a far-right Hungarian group that had ties to the Nazi party from the World War II era. \"When BuzzFeed News reached Gorka by phone on Thursday, he stonewalled when asked about the report. ‘Send a request to White House press,’ Gorka [said] … Captain Gyula Soltész, a current leader in the (group), later told BuzzFeed News that Gorka is a current member. Later Thursday, in an interview with Tablet magazine, Gorka was quoted saying, ‘I have never been a member of the Vitez Rend. I have never taken an oath of loyalty to the Vitez Rend.’”\n\n-- Another senior national security official brought on by Trump said just last year that he believes Muslims are “dedicated to establishing Sharia law in Western countries” and that they want to “subjugate and humiliate” non-Muslims. The Huffington Post’s Christopher Mathias reports: “Frank Wuco ― a former radio host and veteran Naval Intelligence officer ― was hired on Jan. 20 as [Trump’s] senior White House adviser for the Department of Homeland Security … In June 2016, Wuco was asked by Breitbart News about [Pulse nightclub shooter] Omar Mateen. ‘There’s nothing radical about him at all,’ Wuco said. ‘He is a Muslim who is following the strictures of Islam and its guidance and prescriptions for violence and warfare against unbelievers.’ … Wuco has also taken a conspiratorial view of Muslims in Europe and North America, portraying them as ‘hellbent’ on taking over Western countries: ‘The assertiveness of Muslim communities in Western nations is becoming so pronounced. … you don’t even need ISIS in Sweden,’ he said in another 2016 radio interview.”\n\nMichael Flynn sits in the East Room. (Carolyn Kaster/AP)\n\nTHERE IS A BEAR IN THE WOODS:\n\n-- Former national security adviser Michael Flynn, now a registered foreign agent for Turkey, was paid nearly $68,000 by multiple Russia-related entities in 2015, a higher amount that was previously known. Rosalind S. Helderman and Tom Hamburger report: “The records show that the bulk of the money, more than $45,000, came from the Russian government-backed television network RT, in connection to a December 2015 trip Flynn took to Moscow. Flynn has acknowledged that RT sponsored his trip. The [documents] show that Flynn was also paid $11,250 that year by the U.S. subsidiary of a Russian cybersecurity firm, Kaspersky Lab, and another $11,250 by a U.S. air cargo company affiliated with the Volga-Dnepr Group, which is owned by a Russian businessman. The cyberfirm and the airline said the payments were made for speeches Flynn delivered in Washington.”\n\nThe documents were released by ranking House Oversight Committee Democrat Elijah Cummings, who sent FBI director James Comey a letter asking whether the fees violated prohibitions on retired military officers accepting payments or gifts from foreign governments. Cummings also asked for the release of documents Flynn filed to get a security clearance for his White House job, to examine whether Flynn was candid in response to detailed questions about his contacts with foreign governments. “I cannot recall any time in our nation’s history when the President selected as his National Security Advisor someone who violated the Constitution by accepting tens of thousands of dollars from an agent of a global adversary that attacked our democracy,” Cummings wrote.\n\nSean Spicer briefs the press. (Jabin Botsford/The Washington Post)\n\nAN ALTERNATIVE REALITY:\n\n-- Senate Intelligence Committee Chairman Richard Burr released a joint statement with ranking Democrat Mark Warner stating that they have not seen any evidence supporting Trump’s wiretapping claims. “Based on the information available to us, we see no indications that Trump Tower was the subject of surveillance by any element of the United States government either before or after Election Day 2016,” they said categorically. Paul Ryan also said that he has “not seen any evidence that this has occurred.” (Karoun Demirjian)\n\n-- But then Sean Spicer said during his press briefing that Trump stands by his unsubstantiated allegations against Obama. “He stands by it,” Spicer said, adding that he believes the president will ultimately be “vindicated.” \"Spicer refused to say whether Trump was relying on classified information to base his claims, and pointed repeatedly to news articles and ‘widespread, open source material,'\" Philip Rucker and Abby Phillip report. \"Spicer spent nearly 10 minutes reading a litany of news stories, including from conservative reporters and the New York Times, that discuss reports of inquiries into the president's campaign aides and Russian officials. (None) of the reports confirm that Trump Tower was wiretapped.”\n\n-- Spicer also repeated a claim, swirling around in the fever swamps of the far right, that Obama used the British spy agency GCHQ – the NSA's counterpart -- to surveil Trump. This prompted a very rare statement from the agency last night: “Recent allegations made by media commentator Judge Andrew Napolitano about GCHQ being asked to conduct 'wire tapping' against the then President Elect are nonsense. They are utterly ridiculous and should be ignored.\" Let that sink in: A top official of the United States government, on camera and from behind a podium at the White House, accused our closest ally of spying on the president at the request of his predecessor. He did this with no evidence.\n\n-- The Telegraph reports that the U.S. has formally apologized to Britain over Spcier's comment. The London paper says both Spicer and national security adviser H.R. McMaster have personally apologized. \"The apology came direct from them,\" a source told the paper.\n\n-- A Fox News poll finds that 66 percent of Americans think Congress should investigate Russian interference in the presidential election. About the same number also want lawmakers to probe possible connections between the Trump campaign and the Kremlin. Voter are split, 46-49, over whether Congress should further investigate Trump’s wiretapping claims.\n\n-- “Tonight, we know the president of the United States has no facts,” Anderson Cooper said on his show last night. “No facts to back up his startling allegation that the former president of the United States, President Obama, wiretapped him in Trump Tower during the campaign.\"\n\nCopies of Trump's budget blueprint priorities for Fiscal Year 2018. (Reuters/Joshua Roberts)\n\nTRUMP'S BUDGET LANDS WITH A THUD IN THE CAPITOL:\n\n-- \"Some of Trump’s top Congressional allies sharply criticized his first budget, pushing back on the proposed Pentagon funding hike as 'insufficient,' and slamming other proposed cuts to federal agencies and programs,\" Kelsey Snell and Karoun Demirjian report: “Capitol Hill Republicans, however, did not seem terribly worried about the prospect of such a budget being enacted, stating matter-of-factly that it is Congress, after all, that controls the purse strings. ‘Presidents propose, Congress disposes,’ said Rep. Hal Rogers (R-Ky.) the former chairman of the House Appropriations Committee. ‘We’ve not had our chance yet.’ Rogers was one of several GOP lawmakers to dismiss Trump’s budget as a pie-in-the sky wishlist with little hope of surviving negotiations in Congress. Most Republicans gave passing support to Trump’s general goal of increasing defense spending while reducing costs elsewhere in the budget. But none would embrace the specific White House blueprint.”\n\n-- “If you’re a poor person in America, President Trump’s budget proposal is not for you,” Steven Mufson and Tracy Jan write. “Trump has unveiled a budget that would slash or abolish programs that have provided low-income Americans with help on virtually all fronts, including affordable housing, banking, weatherizing homes, job training, paying home heating oil bills, and obtaining legal counsel in civil matters. During the presidential campaign ….Trump vowed that the solution to poverty was giving poor people incentives to work. But most of the proposed cuts in his budget target programs designed to help the working poor, as well as those who are jobless, cope. And many of them carry out their missions by disbursing money to the states, which establish their own criteria. The White House budget cuts will fall hardest on the rural and small town communities that Trump won, where 1 in 3 people are living paycheck to paycheck — a rate that is 24 percent higher than in urban counties, according to a new analysis.\"\n\n-- OMB Director Mick Mulvaney strongly defended Trump’s budget – and the long list of controversial cuts it contains – in a White House news conference, saying every program on the cutting board is either “wasteful” or “ineffective.” Abby Phillips reports: “He stated broadly that the budget was intended to defund areas of the government that had been deemed wasteful or ineffective in the interest of being better stewards of taxpayer dollars. ‘We can’t spend money on programs just because they sound good,’ Mulvaney said. ‘That is about as compassionate as you can get.’ Faced with repeated questions about line items in the federal budget that help fund programs like … after-school educational programs for poor, rural communities; and public broadcasting; Mulvaney insisted that the cuts were targeted at programs that didn't have a track record of success. ‘The message the president sent right now is that we want to defund those,’ Mulvaney said. ‘And there are completely defensible reasons for doing that.’ Trump's budget also makes significant cuts to scientific research, especially climate change, which is the target of some of the deep cuts within the State Department. ‘We’re not spending money on that anymore,’ Mulvaney said of climate change research. ‘We consider that to be a waste of your money.’”\n\nMORE BUDGET FALLOUT:\n\n-- Trump’s proposal includes a plan to remove 30,000 FAA workers from the federal payroll. That group comprises 14,000 air traffic controllers and about 16,000 other FAA employees, many of whom work on a project called NextGen, Michael Laris reports. The program is a combination of several projects aimed at increasing the speed of air travel, saving airline fuel and accommodating a 20 percent increase in passengers in the next 20 years. The plan would also shutter federal support for Amtrak’s long-distance train service.\n\n-- The plan also proposes eliminating three airport security programs developed after 9/11, diverting the money to help fund Trump’s U.S.-Mexico border wall. (Ashley Halsey III)\n\n-- The New York Police Department said Trump’s spending plan would gut critical counter-terrorism efforts that would make the nation’s largest city less safe. From Mark Berman: “Police say the funding cuts would hit everything from intelligence analysis to active-shooter training. The blunt assessment was delivered by the top law enforcement officer in Trump’s hometown, who leads an agency tasked with defending the city against terrorism … ‘Under the president’s proposal, nearly all federal funding to the NYPD would be eradicated,’ [NYC police commissioner James P. O’Neill said]. ‘This funding is absolutely critical. It is the backbone of our entire counter-terrorism apparatus.’ O’Neill described the federal funding that would be lost as ‘essential’ to numerous aspects of the NYPD’s counter-terrorism activities, including the city’s intelligence analyst program, active-shooter training provided to tens of thousands of officers and the department’s bomb squad.”\n\n-- The U.S. Institute of Peace – which was created to help manage conflict resolution around the world, and whose staffers have been dispatched to some of the most dangerous places around the globe -- is slated for elimination. Carol Morello reports: “[The] deep spending cuts proposed for foreign aid prompted an immediate backlash across the spectrum in Congress and among humanitarian organizations and religious groups. Rep. Eliot L. Engel (N.Y.), the senior Democrat on the House Foreign Affairs Committee, called the cuts a ‘catastrophic mistake,’ while Rep. Edward R. Royce (R-Calif.), the committee chairman, expressed concern that cuts in diplomacy will hurt efforts to combat terrorism. Mercy Corps called the foreign aid cuts ‘reckless, dangerous and irresponsible.’”\n\n-- After school programs for 16 million kids could lose funding. (Emma Brown)\n\n-- The Meals for Wheels program would get slashed. Mulvaney said it is “just not showing any results,” drawing howls of protest from advocates. The program provides food aid to needy senior citizens who, because of physical limitations or financial reasons, have difficulty shopping for or preparing meals for themselves. (Christopher Ingraham)\n\n-- The budget disappointed leaders of historically black colleges and universities, who met with Trump last month in the hopes of securing additional funding for scholarships, technology and campus infrastructure. Rather than expanding Pell grants for low-income students, the proposal raids $4 billion from the program’s reserves. (Danielle Douglas-Gabriel)\n\n-- One potential problem ahead: firing federal workers is not nearly as easy as Trump’s proposal makes it seem. Eric Yoder and Lisa Rein report: “Laying off federal workers requires going through a formal process that can be lengthy, expensive and disruptive to the workplace … Under [Trump’s] budget proposal, federal employees at many agencies may need to acquaint themselves with a lately dormant but still much-feared term: Reduction in Force. RIFs have not been used widely for decades. It is a complex process that catalogues and ranks employees based on the work they do and where, their employment status, veteran status, length of service and performance ratings. Employees in eliminated jobs in some cases may be able to displace lower-ranked employees while keeping their higher pay rates temporarily — meaning the projected savings don’t always materialize. And there are job placement rights, appeal rights and severance pay entitlements for those ultimately let go. In some cases, unions are able to bargain on behalf of their members.”\n\n-- “What a Presidential budget really represents is a wish list and a numerical expression of the President’s political philosophy,” the New Yorker’s John Cassidy explains: “’Philosophy’ isn’t a word often associated with [Trump], but this partial budget outline—the White House is promising to release a fuller version later—accurately reflects the impulses, prejudices, and slogans that animated Trump’s campaign. Indeed, his budget director has said that he saw his job as taking what Trump said on the stump and translating it into figures. In carrying out this task, Mulvaney performed a public service of sorts. Thanks to his translation, the entire world can see what America would look like if Trumpism were fully converted into practice. The country would be an uglier, less equal, less prosperous, more paranoid, more myopic, and more mean-spirited place. Its claims that it’s a role model for other countries would be besmirched, perhaps beyond redemption. And far from being rendered great again, it would be a weaker world power. In the long term, the prosperity of the country as a whole depends on it having a skilled labor force; world-beating science, technology, and arts; first-rate public infrastructure; and a clean and healthy environment. This budget, if it ever went into effect, would undercut all of these things.”\n\nHouse Budget Committee Chair Diane Black (R-Tenn.), joined by Rep. Todd Rokita (R-Ind.), presides over a hearing to advance the health care bill. (J. Scott Applewhite/AP)\n\nHEALTH CARE LATEST:\n\n-- The GOP proposal cleared a key hurdle, as the House Budget Committee narrowly voted to move it to the House floor and recommended a series of changes to the plan reflecting concerns from conservatives and centrists. Mike DeBonis and Sean Sullivan report: “All of the panel’s Republicans and five Democrats supported a motion to change the system of tax credits created under the plan to ensure they are ‘afforded to the population that they are intended to serve,’ an idea embraced across the ideological spectrum, including among centrists whose votes could be key. The committee voted along party lines for a pair of motions supporting additional cuts to Medicaid beyond what’s in the bill — and for a third motion endorsing a requirement that ‘able-bodied’ participants in the program work in exchange for their benefits. It remains unclear whether the Budget Committee’s nonbinding recommendations will make it into the final bill.” The panel voted 19 to 17 overall in favor of the bill, with three Republicans – Reps. Dave Brat, Gary Palmer, and Mark Sanford – voting against it. All three are members of the House Freedom Caucus.\n\n-- Freedom Caucus Chairman Mark Meadows said his group is now drafting changes to the bill that they believe could garner “widespread support,” which he said could be released as soon as today. He declined to release additional details but said he was in talks with “multiple senators” about it. “We’re working very diligently to try to make sure that any amendment that we put forth has a real chance of success,” he said.\n\n-- But even as the bill made incremental progress, its overall fate remains very much in doubt. In an interview with the Portland Press-Herald, Sen. Susan Collins (R-Maine) said she would not vote for the bill without significant changes: “This is not a bill I could support in its current form,” the moderate Republican said.\n\n-- “The sleeping giants of the Obamacare debate remain Republican moderates in the House,” says Paul Kane. “Arch conservatives have come to define the House Republican brand this decade, pushing the Treasury to the edge of default in 2011 [and] shutting down the government in 2013 … Now, however, [Ryan] is dealing with a different rebellious flank within the House Republican Conference ... Larger in number but softer in tone than their conservative counterparts, moderate Republicans are shaping up to be at least as big a hurdle to achieving the long-held goal of repealing the 2010 Affordable Care Act and replacing it with a more market-oriented series of policies. These Republicans are getting their share of meetings with Ryan and his leadership team, voicing their concerns about the impact specific pieces of the bill would have in their districts. They are making clear that any negative fallout from these policy moves would place their seats in jeopardy in next year’s midterm elections, a fate that Ryan understands would open the door to losing the House majority. And, of course, these moderates are making their case in a much quieter fashion than members of the House Freedom Caucus.”\n\n-- “Whom to trust when it comes to health-care reform? Trump supporters put their faith in him,” from Jenna Johnson in Nashville: “Soon after Charla McComic’s son lost his job, his health-insurance premium dropped from $567 per month to just $88, a ‘blessing from God’ that she believes was made possible by [Trump]. ‘I think it was just because of the tax credit,’ said McComic … The price change was actually thanks to a subsidy made possible by former president [Obama’s] Affordable Care Act, which is still in place, not by the tax credits proposed by Republicans as part of the health-care bill still being considered by Congress. It has been difficult for many Americans to keep up with the changes brought by Obamacare and exactly how the Republican proposal, if enacted, would affect their lives. But for Trump’s most dedicated supporters, it’s simply easier to trust the president is making things better and will follow through on his promise to provide ‘insurance for everybody’ and ‘great health care for a fraction of the price.’ McComic said she’s not worried about her disability benefits changing or her 3-year-old granddaughter getting kicked off Medicaid or her 33-year-old son’s premiums going up. ‘So far, everything’s been positive, from what I can tell,’ she said.\"\n\nQuote du jour: McComic says she has never trusted a president the way she trusts Trump. Referencing the work she did on his behalf in the months leading up to the election, she said her and her relatives asked themselves, \"Who else would we do this for, besides Trump?\" \"We agreed on the Lord,\" she said. \"We would stand here for the Lord, but that’s about it.”\n\nGerman Chancellor Angela Merkel talks to students yesterday in Berlin. (Michael Kappeler/pool photo via AP)\n\nTHE WORLD RECALIBRATES:\n\n-- Angela Merkel will meet with Trump at the White House today after postponing her visit because of the snowstorm earlier in the week. “It's a visit that seems a clash of geopolitical poles and personalities — Trump, the maverick, shoot-from-the-hip outsider and Merkel, the bookish, calm and experienced policy wonk,” Ishaan Tharoor reports in his newsletter. “Trump stands at the forefront of a new trend in mainstream Western politics, a populist challenge to the status quo anchored in ethnic nationalism. Merkel, on the other hand, is arguably the de facto guardian of the liberal order once authored by the United States. Although a center-right politician herself, she has set about defending international institutions as well as the broader politics of integration and tolerance now seemingly under assault from Trump and his far-right European counterparts. But Merkel arrives at the White House with a message of unity and collaboration. She will bring a number of CEOs of leading German companies in tow — a pro-trade agenda Trump certainly understands — and will stress the significance of the overall German-U.S. partnership.\"\n\n-- “Wilders vows to be a player in forming of Dutch government despite 2nd-place finish,” by Michael Birnbaum: “The Dutch anti-Islam leader Geert Wilders acknowledged Thursday that voters denied him a chance to rule his nation. But to many Dutch Muslims, his victory was secured long before his nation’s nail-biter election. The reelected Dutch prime minister told immigrants to fit in or get out. A likely coalition partner wants to impose restrictions on refugees. A nation once known for its laid-back tolerance is now focused on its divisions. And while European leaders breathed a sigh of relief that a raucous populist had been beaten back ahead of elections this year in France and Germany, many Muslims say that Wilders’s raw racism is still ascendant. Europe has a new face, they say — and it’s that of the blond-haired bomb thrower from the Netherlands.”\n\nSean Hannity tapes a segment for his show with Sean Spicer. (Nicholas Kamm/AFP/Getty Images)\n\nSTUFF THAT DOESN'T HAPPEN IN OUR NEWSROOM:\n\n-- Sean Hannity pulled a gun on Juan Williams in his studio. CNN Money’s Dylan Byers reports: “Last year, after ending one of his many spirited on-air arguments with liberal contributor Juan Williams, Hannity pulled out a gun and pointed it directly at Williams … He even turned on the laser sight, causing a red dot to bob around on Williams' body. (Hannity was just showing off, the sources said, but the unforeseen off-camera antic clearly disturbed Williams and others on set.) A Fox News spokesperson said the incident was referred to the legal and human resources departments.” \"Sean Hannity has been trained in firearm safety since he was 11 years old and has a license to carry a gun in five states,\" the network said. \"The situation was thoroughly investigated and it was found that no one was put in any danger.\" (Literally the first thing they teach you in gun safety classes is to never point a gun at another person!)\n\n-- IJR reporter Joe Perticone resigned in protest over disagreements “with the website’s direction,” Politico’s Hadas Gold reports. \"Perticone felt as though his credibility as a congressional reporter was damaged by the actions of other writers on the millennial-focused viral news site. The last straw, sources said, was a post published earlier in the day that connected Obama’s visit to Hawaii with a Hawaiian federal judge’s ruling against Trump’s travel ban. It was retracted on Thursday afternoon. \"The tension seems to lie between creating content that goes viral and becoming respected as a news outlet,” Gold writes.\n\nMeanwhile, IJR correspondent Erin McPike – the sole reporter allowed on Tillerson’s plane during his trip to Asia – has yet to file a story. An IJR spokesman said she's not filing spot stories because \"she's writing a profile piece on Secretary Tillerson.\" As CNN’s Brian Stelter notes, that seems to be passing up a powerful opportunity.\n\nMark Begich speaks at the Capitol in 2012. He lost reelection in 2014. (Jacquelyn Martin/AP)\n\nTHE PATH BACK FOR DEMOCRATS:\n\n-- Former Alaska Sen. Mark Begich organized a three-day strategy session with 30 moderates in Denver to chart a path forward for that wing of the Democratic Party, which feels increasingly left behind by the Elizabeth Warren wing. Among the attendees: North Dakota Sen. Heidi Heitkamp, Georgia Assembly minority leader Stacey Abrams and Louisville Mayor Greg Fischer. “Begich would not name all the participants, saying some of them preferred to keep their involvement private,” McClatchy’s Alex Roarty reports. “But Conner Eldridge, a former U.S. attorney who ran unsuccessfully for the Senate in Arkansas, said in an interview that he’d brought six former U.S. attorneys. (He declined to name them.) Ken Salazar, who served as Obama’s secretary of the interior, was also there. Salazar is considering a run for governor of Colorado next year. … Presentations included a discussion about faith, and what millennials and Generation Z – America’s youngest generation – are experiencing in the economy and politically. Joel Heitkamp, the senator’s brother and a talk radio host in North Dakota, addressed the group to discuss how the participants could engage with radio, usually the sole province of conservatives.”\n\n-- The Democratic Congressional Campaign Committee is paying for three focus groups in Tom Price’s old House district this week to figure out how they can best target Millennials, African Americans and swing voters in the upcoming special election. Anzalone Liszt Grove Research organized a session on Tuesday night of people between the ages of 55 and 74 who voted for Mitt Romney in 2012 and Hillary Clinton in 2016. Then Wednesday night they did a session with voters between 18 to 45 about what might prompt them to vote in an off-year election. The final group, targeting black voters, will be conducted next week by Cornell Belcher, a Democratic pollster who worked on both of Barack Obama's campaigns. “The 6th District is about 12 percent African American, but that number has nearly doubled in the past decade as the Atlanta suburbs have grown and diversified,” NPR’s Jessica Taylor reports. “Democrats will need those reliably Democratic voters to turn out not just for Jon Ossoff, but in November 2018, too.”\n\nSOCIAL MEDIA SPEED READ:\n\nThe cable news presidency continues:\n\nTrump called @TomiLahren & spoke to her for “solid 10 to 15 minutes” after watching her defend him on “Hannity” https://t.co/JB2AoweBl1 pic.twitter.com/kpJGXSvXyX — Oliver Darcy (@oliverdarcy) March 16, 2017\n\nRep. Steve King (R-Iowa) claims he's getting colleagues' support for his comments that \"someone else's babies\" can't save Western civilization:\n\nRep. Steve King (R-IA) tells me fellow GOP colleagues have \"generally been coming by & patting me on the back\" since they all returned to DC — Cristina Marcos (@cimarcos) March 16, 2017\n\nThis senator slammed the proposed cuts to Meals on Wheels in Trump's budget:\n\nSorry Frank. The seniors who need Meals on Wheels are not following your twitter feed. And can't afford broadband/smartphone/laptop. https://t.co/nmKr9DzIne — Claire McCaskill (@clairecmc) March 16, 2017\n\nHere's a more visual Democratic take:\n\nPolitical question: how many Republicans are willing to walk the plank in their 2018 re-elects to say they cut Meals on Wheels? #TrumpCuts — Joy Reid (@JoyAnnReid) March 17, 2017\n\nYou don't have to be a Christian or believe in Jesus to know that Christians are called to feed the hungry. See Mt 25:35 https://t.co/8B5TgubMUB — Kirsten Powers (@KirstenPowers) March 17, 2017\n\nEven celebs weighed in:\n\nEveryone should read this. Meals on Wheels serves meals to 500K veterans a year. Nothing Trump does makes sense. We must resist bad ideas. https://t.co/YhY0UTuNhX — Judd Apatow (@JuddApatow) March 17, 2017\n\nOn Trump's budget more generally:\n\nWait until middle class families realize fewer international students subsidizing universities means higher tuition for Americans. https://t.co/RqKlhQd9ct — jelani cobb (@jelani9) March 17, 2017\n\nThe Republican Party is the villain from a Dickens novel. Trust me on this, my name is Oliver. — Oliver Willis (@owillis) March 17, 2017\n\nFrom a conservative pundit on Rep. Mark Meadows's stance on the GOP health care measure:\n\nPols enjoyed St. Patty's Day:\n\nKaren & I welcomed Taoiseach Kenny & Mrs. Kenny to our home for an Irish breakfast. Snow needs to melt before trying my new hurley. pic.twitter.com/Sr4uWT2yHL — Vice President Pence (@VP) March 16, 2017\n\nGOOD READS FROM ELSEWHERE:\n\n-- New York Times, “‘I Am an American Because of Him’: The Journey of Pence’s Irish Grandfather,” by Sheryl Gay Stolberg: “The S.S. Andania, plain and sturdy, pulled into New York Harbor on April 11, 1923, after a slow journey from Liverpool, England. In a third-class cabin was a gray-eyed Irishman named Richard Michael Cawley, fleeing poverty and war. The son of a tailor from a rural village, Mr. Cawley, then 20, had come of age during a guerrilla conflict. Now, with Irish fighting Irish, he had made his way to America … He had the equivalent of $23. And though records show he did not become a citizen until 1941, a decade after he married, historians say that was typical; many Irish came to America not quite sure they would stay. He would settle in Chicago … marry a teacher; find work as a streetcar driver; and sing ballads by the piano on Saturday nights. It is a familiar American tale, except for this: Mr. Cawley’s grandson and namesake, Michael Richard Pence, is the vice president of the United States, which is in the thick of a roiling immigration debate.”\n\nHOT ON THE LEFT: “ICE Agents Now Going To Courthouses To Arrest Undocumented Immigrants,” from CBS Los Angeles: “U.S. Immigration and Customs Enforcement agents have been going to courthouses and arresting people in America illegally, sparking outrage from prosecutors and attorneys. They worry such tactic will discourage undocumented immigrants from appearing in court to testify as witnesses for prosecutors. Criminal defense lawyer Octavio Chaidez said his client is among those taken into custody by ICE agents, who arrested him at the Los Angeles Superior Court in Pasadena. He said he had just finished a criminal court appearance with his client when four agents swooped in, confirmed his name and took his client away. ‘It was very shocking because it occurred inside of a courthouse, and the reason for the detention had nothing to do with that proceeding,’ recalled Chaidez, who would not say if his client has a criminal history.” HOT ON THE RIGHT: “NDP Candidate Removes Post with Beyoncé Lyrics after Cultural Appropriation Accusations,” from National Review: “New Democratic party candidate Niki Ashton has deleted her social-media posts containing Beyoncé lyrics because a Twitter account attributed to Vancouver’s Black Lives Matter said that using those lyrics was ‘appropriating black culture.’ Ashton had posted ‘Like Beyoncé says, to the left. Time for an unapologetic turn to the left for the #NDP, for social, racial, enviro, and economic justice. #ndpldr’ above a meme that read ‘To the Left, to the Left …’ Now, this may seem like a harmless post. It may seem like just another politician shamelessly trying to connect with voters by demonstrating that she, like, knows things about pop culture. But apparently not, because in response, a Twitter account attributed to Vancouver’s chapter of Black Lives Matter tweeted”: “… Appropriating Black culture is not intersectional feminism. Please delete your ‘to the left’ FB post & address the issue.”\n\nDAYBOOK:\n\nAt the White House: Trump will meet with the Republican Study Committee before holding a listening session on veterans’ affairs. Later, Trump will welcome Angela Merkel to the White House for a bilateral meeting, roundtable discussion with business leaders, joint press conference, and working luncheon.\n\nMeanwhile, Pence will join Trump at his veterans’ affairs listening session before participating in the bilateral meeting, roundtable discussion, joint press conference, and working luncheon with Merkel. Later, he’ll participate in bilateral meetings with Costa Rican President Luis Guillermo Solís.\n\n-- In the evening, Trump will depart the White House for Joint Base Andrews en route to West Palm Beach, Florida. He'll spend the weekend at Mar-a-Lago.\n\nIn related news, the helicopter landing pad has finally been completed at Mar-a-Lago. The Sun-Sentinel’s Skyler Swisher reports: “The landing pad has passed inspection, and the building permit was closed on Monday, said Karl Swierzko, acting building official for the town of Palm Beach. The landing pad is on the western lawn of the 20-acre estate and is big enough to accommodate Marine One, the signature green chopper used by presidents, according to plans submitted to the town. A spokeswoman for Marine One would not say Thursday whether Trump will use the landing pad this weekend when he visits Mar-a-Lago. Air Force One is expected to arrive at Palm Beach International Airport about 6:30 p.m. Friday.” City Council officials restricted use of the landing pad to “business related to the presidency,” and stipulated that it can only be used during Trump’s time in office.\n\nQUOTE OF THE DAY: After John McCain said “the senator from Kentucky is now working for Vladimir Putin” by blocking a treaty that would let Montenegro join NATO, Rand Paul fired back at his Arizona colleague on MSNBC: “I think he makes a really, really strong case for term limits. I think maybe he’s past his prime; I think maybe he’s gotten a little bit unhinged.”\n\nNEWS YOU CAN USE IF YOU LIVE IN D.C.:\n\n-- “While we wait for the ground to melt and wear its St. Patrick’s Day green, we humans can enjoy a steady rise in temperatures despite increasing cloud cover.” The Capital Weather Gang forecasts: “Afternoon temperatures should max out in the mid-40s to around 50. Winds thankfully are calmer than recent days, blowing around 5 mph out of the west (southwest direction, later). A quick shower is possible as we head toward sunset, with odds increasing as it turns dark.”\n\n-- Denver Riggleman, the populist candidate running as a Republican in Virginia’s gubernatorial race, announced Thursday that he is suspending his bid. “Based on business considerations, resource shortages, and family health issues, I have no other choice but to suspend my campaign for Governor effective today,” he said in a written statement. “I want to thank everyone who has supported me, and particularly those that were willing to donate to our cause.” (Laura Vozzella)\n\n-- The Whole Foods store in Glover Park voluntarily closed this week for renovation after health inspectors identified a problem with rodents – the store’s second citation for pest problems in as many months. “We will be remodeling the Georgetown store to offer our customers a fresh, new shopping experience,” a spokeswoman for the company said. Shoppers described the move as “abrupt.” (Justin Wm. Moyer)\n\nVIDEOS OF THE DAY:\n\nWatch how these St. Patty's day mishaps aren't going over well with the Irish:\n\nSee this California Republican pan the GOP's proposed health care plan's tax cuts for the rich:\n\nRep. McClintock (R-CA): Tax cuts for wealthy investors in ACHA are not defensible or sustainable https://t.co/8pmAllhVQp — All In w/Chris Hayes (@allinwithchris) March 17, 2017\n\nWatch Van Jones talk to a Meals on Wheels recipient:\n\n.@VanJones68 talks with Meals on Wheels recipient: \"Try to put yourself in my situation... how else would I eat?\" https://t.co/bd7KuwNaxU — CNN (@CNN) March 17, 2017\n\nSee what Trump's budget proposal could mean for the D.C. region:\n\nThis video went viral:\n\nFred Rogers defending public television to the Senate https://t.co/uMNvDyb8Fr https://t.co/MP7zJVpJRz — pourmecoffee (@pourmecoffee) March 17, 2017\n\nYour happy news of the day:\n\nIn case you had a bad day ...\n\n\n\nA priceless reaction of deaf baby boy hearing his mom's voice for first time pic.twitter.com/RIRkf14ypN — Vala Afshar (@ValaAfshar) March 17, 2017\n\nSee a Latina come to a Muslim couple's defense in the New York City subway.", "authors": ["James Hohmann Is A National Political Correspondent For The Washington Post."], "publish_date": "2017-03-17", "source": "washingtonpost", "top_words": ["jackson", "travel", "gorsuchs", "trump", "stakes", "confirmation", "ban", "cuts", "budget", "neil", "reports", "court", "president", "trumps", "white", "daily", "blocked", "house", "hearing", "raises"], "summary": "President Trump announces Neil Gorsuch as his choice for Supreme Court in the East Room of the White House on Jan. 31.\n(Jabin Botsford/The Washington Post)With Breanne DeppischTHE BIG IDEA: Vowing to fight for his frozen travel ban all the way to the Supreme Court, President Trump knows Neil Gorsuch may ultimately cast the deciding vote in his favor.\nSoon afterward, Gorsuch emailed to a White House colleague in case he needed “cheering up” about the administration’s setback.\n“I don’t think we’ve had a speech like that since Andrew Jackson came to the White House,” Bannon said.\n-- In the evening, Trump will depart the White House for Joint Base Andrews en route to West Palm Beach, Florida."}