{"url": "https://www.washingtonpost.com/blogs/plum-line/wp/2017/02/06/governor-who-blocked-muslim-ban-tells-trump-this-is-what-the-resistance-looks-like/", "id": "269", "title": "Governor who blocked ‘Muslim ban’ tells Trump: This is what the resistance looks like", "text": "\n\n(Olivier Douliery/Pool via Bloomberg)\n\nTHE MORNING PLUM:\n\nDonald Trump’s immigration ban faces a critical moment in court on Monday afternoon. Its long term fate remains uncertain: It could survive, or it could get overturned. But one thing is now clear: Whatever happens to it, we have now seen what “the Resistance” to Trump’s authoritarianism is going to look like.\n\nTrump’s executive order was dealt a big setback over the weekend, when a federal appeals court sided with Washington State and Minnesota in a lawsuit against the order and temporarily upheld a lower court’s hold on it. This allowed refugees and migrants from seven Muslim-majority countries to resume travel to the United States, and today the appeals court will decide whether the hold remains, after which the underlying legal dispute must be sorted out.\n\nFamilies that had been affected by President Trump's ban on travel reunited in airports across the U.S. on Sunday. (Jayne Orenstein,Dalton Bennett,Natalie Jennings/The Washington Post)\n\nIn an interview with me, Jay Inslee, the Democratic governor of Washington, argued that this victory has broad significance, suggesting that this effort by the states could provide a model or a template for Democratic governors, states and others to mount further resistance to other aspects of Trump’s agenda on multiple fronts.\n\n[Did you attend a protest? Tell us what you plan to do next.]\n\n“This demonstrates the importance of governors and states in the four-year battle to preserve the fundamental values of this country,” Inslee told me. “The nation needs checks against a president who’s prone to rogue behavior, and governors will assume a more important place in the democratic system.”\n\nInslee suggested multiple ways in which Democratic governors can resist Trump. Governors can amplify the argument that the GOP plan to repeal the Affordable Care Act could result in untold numbers of their constituents getting thrown off of Medicaid, if the GOP replacement block-grants the program to the states, making cuts to Medicaid funds over time more likely. Inslee said Dem governors are in the process of forming a “subterranean alliance with Republican governors who are now notifying Congress that cutting their funds is unacceptable.”\n\nWhat’s more, Democratic governors can push forward with battling climate change and transitioning their states to clean energy economies, even if Trump continues to maintain that climate science is a hoax and tries to roll back President Obama’s carbon-reduction regulations. “We can maintain an example for the rest of the country to show how you can grow your economy around a clean energy plan,” Inslee said. Many states have already begun to do this in the Trump era, by encouraging renewable energy and setting their own ambitious reduction targets for greenhouse gas emissions.\n\nGovernors can also help protect so-called “sanctuary cities,” which shelter undocumented immigrants by declining to enforce federal immigration laws against them. If Trump goes through with his threat to try to deny federal funding to sanctuary cities, Inslee said, that will face “a huge amount of litigation,” in part from states.\n\nThe fourth act of resistance that governors might be able to mount has broad ramifications for the long-term health of the Democratic Party. But it requires winning a bunch of gubernatorial elections. In 2017 and especially in 2018, there will be over three dozen gubernatorial contests. The vast majority of them feature GOP-held seats, meaning Republicans are on defense — and many are in states Obama (and to a lesser extent Hillary Clinton) won. Governors can veto redistricting maps in many states, so if Dems can win a bunch of these, they will have a big hand in shaping the redistricting of House seats after 2020 — influencing control of the Lower Chamber in the next decade.\n\n“Governors are absolutely instrumental in giving us a chance to break the stranglehold of gerrymandering that’s gone on in Congress,” says Inslee, who in 2018 will be the chairman of the Democratic Governors Association, which seeks to install Dem governors across the country.\n\nIn the 2018 campaigns, Democratic gubernatorial candidates can campaign in part on a vow to function as a check on Trump in multiple ways. “There is an outpouring of energy demanding that this president’s wings be clipped,” Inslee said. “That energy will be stronger in 2018. When you have an activist president who is enraging the opposition party, that finds a voice in the non-presidential elections….an army of enraged Democratic voters will go to the polls like they never have before.”\n\nTrump’s executive order poses the first major test as to whether popular mobilization and our institutions — the news media, the courts — can act as a check on his worst impulses. It’s always possible, of course, that Trump will prevail in the long-term battle over his ban. Pressed on whether a loss would take the steam out of “the Resistance,” Inslee answered that the weekend’s victory had already demonstrated that resisting “in every way we can” can get results. “That in itself is a win,” Inslee said. “It inspires people. They need a sense of hope right now.”\n\nThis first victory in court, by operating as an inspiration to further action, perhaps points to more ways that Democrats can seek to channel the passion and energy unleashed by Trump’s agenda into constructive efforts to limit the damage that it threatens to do on so many fronts.\n\n**********************************************************************\n\n* NEW INTERNAL CHECKS ON BANNON? The New York Times reports that White House chief of staff Reince Priebus is trying to institute a “new set of checks on the previously unfettered power” of Steve Bannon and policy director Stephen Miller:\n\nMr. Priebus has told Mr. Trump and Mr. Bannon that the administration needs to rethink its policy and communications operation in the wake of embarrassing revelations that key details of the orders were withheld from agencies, White House staff and Republican congressional leaders…Mr. Priebus has also created a 10-point checklist for the release of any new initiatives that includes signoff from the communications department and the White House staff secretary.\n\nRemember, though, the Bannonite Disruption Feedback Loop dictates that any chaos and disruptions Bannon creates are instantly converted into proof that he’s doing something right.\n\n* MILLIONS ARE NOW TARGETS FOR DEPORTATION: The Los Angeles Times looks at Trump’s recent executive order on deportations and calculates that more than eight million people could now be targets for removal:\n\nHis new order allows immigration agents to detain nearly anyone they come in contact with who has crossed the border illegally. People could be booked into custody for using food stamps or if their child receives free school lunches….Families would be separated. Businesses catering to immigrant customers may be shuttered.\n\nBut Trump said he was going to start with criminals only! Press reports dramatizing the human toll this takes should drive home the true reality of Trumpism.\n\n* SUPER BOWL ADS SEND MESSAGE TO TRUMP: Bloomberg points out that many of the ads that ran during the Super Bowl emphasized inclusion and diversity:\n\nAlphabet Inc.’s Google kicked off the Super Bowl with a commercial featuring…a woman asking the company’s voice-activated digital assistant, “How do you say, ‘Nice to meet you’ in Spanish?”…Airbnb Inc. aired a spot that flipped through a series of faces of people of different races…Anheuser-Busch waded into the immigration debate with an ad depicting German-born founder Adolphus Busch arriving in America, where he’s greeted by people shouting, “Go back home!”\n\nAs Bloomberg concludes: “It was hard not to see some ads as responses to the new president’s controversial policies on immigration.”\n\n* TECH COMPANIES ENTER THE FRAY: CNN reports that nearly 100 major tech companies have weighed in against Trump’s travel ban:\n\nA total of 97 companies — including Apple, Facebook and Microsoft — filed a court motion Sunday night declaring that Trump’s executive order on immigration “violates the immigration laws and the Constitution.” The ban represents “a sudden shift in the rules governing entry into the United States, and is inflicting substantial harm on U.S. companies,” says the court document, whose backers also include Twitter, Netflix and Uber.\n\nNo doubt this just proves that Trump’s ban of migrants seeking to better their lives, and refugees desperately fleeing war and persecution, is taking on the coastal elites.\n\n* JUDGES UNDER PRESSURE TO REIN IN TRUMP: Trump spent the weekend blasting judges for blocking his travel ban, and former Bush lawyer Jack Goldsmith comments:\n\n“Trump’s serial attacks on judges and the judiciary take us into new territory. The sloppiness and aggressiveness of the directives, combined with the attacks on judges, put extra pressure on judges to rule against Trump.”\n\nThis is another way in which the battle over the travel ban is a major test of whether our institutions will act as a check on Trump’s authoritarianism.\n\n* STOP CREDITING TRUMP WITH ‘DISRUPTION’: E.J. Dionne nails it:\n\nWe must resist a bad habit infecting political commentary that sees Trump’s irresponsibility, bigotry and casual cruelty as a heroic form of “disruption” aimed at bringing down “the establishment.” No. The people in the streets rallying against Trump are not the establishment. Those political and business leaders who are, for now, playing along with and enabling Trump very much are the establishment.\n\nYes. Trump is benefiting from the GOP congressional leadership and most Republicans in Congress (that is, the GOP establishment) who are actively enabling his efforts to undermine our democracy on multiple fronts.\n\n* TRUMP WILL MAKE AMERICA GREAT FOR FINANCIAL SCAMMERS AGAIN: Trump is already taking steps to roll back Wall Street oversight, arguing that borrowing money is hard (for his friends), but Paul Krugman points to another motive that might be at play:\n\nOverall bank lending in the United States has been quite robust since Dodd-Frank was enacted. So what’s motivating the attack on financial regulation? Well, there’s a lot of money at stake — money that the financial industry has been extracting from unwitting, unprotected consumers. Financial reform was starting to roll back these abuses, but we clearly now have a political leadership determined to roll back the rollback. Make financial predation great again!\n\nAs I’ve argued, the rollback of financial regulation gives Democrats a major opportunity to mount another push for transparency around Trump’s business holdings and conflicts.\n\n* AND THE TRUMP TWEET OF THE DAY, FAKE POLLS EDITION: Another early morning Twitter rant:\n\nAny negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting. — Donald J. Trump (@realDonaldTrump) February 6, 2017\n\nThere you have it. Any and all polls showing Trump or his policies to be unpopular are fake by definition.", "authors": [], "publish_date": "2017-02-06", "source": "washingtonpost", "top_words": ["inslee", "trump", "governor", "ban", "tells", "immigration", "financial", "order", "democratic", "trumps", "governors", "blocked", "states", "muslim", "looks", "resistance"], "summary": "(Olivier Douliery/Pool via Bloomberg)THE MORNING PLUM:Donald Trump’s immigration ban faces a critical moment in court on Monday afternoon.\nFamilies that had been affected by President Trump's ban on travel reunited in airports across the U.S. on Sunday.\n“The nation needs checks against a president who’s prone to rogue behavior, and governors will assume a more important place in the democratic system.”Inslee suggested multiple ways in which Democratic governors can resist Trump.\nNo doubt this just proves that Trump’s ban of migrants seeking to better their lives, and refugees desperately fleeing war and persecution, is taking on the coastal elites.\n* JUDGES UNDER PRESSURE TO REIN IN TRUMP: Trump spent the weekend blasting judges for blocking his travel ban, and former Bush lawyer Jack Goldsmith comments:“Trump’s serial attacks on judges and the judiciary take us into new territory."}