{"url": "https://www.washingtonpost.com/world/africa/trumps-refugee-ban-is-a-matter-of-life-and-death-for-some-like-a-1-year-old-with-cancer/2017/01/30/4c8e4aae-e711-11e6-903d-9b11ed7d8d2a_story.html", "id": "280", "title": "Trump’s refugee ban is a matter of life and death for some, including a 1-year-old with cancer", "text": "President Trump speaks in the East Room of the White House on Jan. 27. Trump’s temporary halt to the U.S. refugee program has sparked protests across the country. (Evan Vucci/AP)\n\nThey were deemed the most vulnerable cases: refugees suffering from medical conditions so ­severe that normally their journeys to the United States would be expedited.\n\nOne is a 9-year-old Somali child in Ethiopia with a congenital heart disease that cannot be treated in a refugee camp. Another is a 1-year-old Sudanese boy with cancer. A third is a Somali boy with a severe intestinal disorder living in a camp that doesn’t even have the colostomy bags he needs.\n\nAfter President Trump’s executive order last week, their resettlement in America was put on hold. Now, the organization responsible for processing refugees in sub-Saharan Africa, Church World Service, says that order could be their death sentence.\n\nThe organization compiled an internal list of some of its most desperate cases, and it is urging the U.S. government to lift the suspension. “When you’re talking about a 9-year-old with congenital heart problems, a [delay of a] day is too long,” said Sarah Krause, the senior director of Church World Service’s immigration and refugee program. “It is unnecessary for these individuals to die while waiting for resettlement.”\n\nThe Office of the U.N. High Commissioner for Refugees said Monday that 20,000 people in precarious conditions would be banned from traveling to the United States under the 120-day suspension on refu­gee admissions that was announced Friday.\n\nThe Trump administration said it stopped accepting refugees temporarily to study ways to ensure that the new arrivals don’t pose a threat to the United States.\n\nBut the U.N. agency noted that the refugees it referred to the U.S. government for resettlement are highly vulnerable — including people in need of urgent medical assistance or survivors of torture.\n\nAbout 80,000 people in sub-Saharan Africa are at some stage of the U.S. refu­gee process, which can take years to complete. Of those, about 2,000 are deemed “most vulnerable,” because of urgent medical problems or “extreme protection concerns” such as worries about their safety or well-being, according to Church World Service, which represents dozens of Protestant, Anglican and Orthodox religious communities and also works with refu­gee resettlement offices across the United States.\n\nIts list offers a glimpse into the human lives affected by the executive order.\n\nIn addition to people with medical conditions, the list includes refugees who have endured horrifying cases of physical and psychological trauma. One is a young Somali woman who was raped multiple times by assailants. She is now living in a safe house in a neighboring country with a child who was conceived in one of those assaults, Krause said.\n\nMany of the people on the list were days or weeks away from traveling to the United States. Some had already been through a cultural orientation program, which teaches refugees what to expect in America — like how to use public transportation and how to apply for a job. They had passed numerous interviews and security screenings.\n\n“These are already the most thoroughly vetted of any individuals entering the United States,” Krause said.\n\nOne 38-year-old Somali woman that Church World Service added to its list is waiting at a small refu­gee transit center in Nairobi. Her name is Momina Hassan Aden. She had recently had a blood transfusion and was raising seven children alone, after her husband died last year.\n\nShe remained fragile, said other refugees, who did not know the details of her medical condition. She had spent the last four years at the Kakuma Refugee Camp, a sprawling facility in northwestern Kenya that is home to more than 150,000 people.\n\n“There’s not enough health care for me there,” Aden said in a brief interview at the Nairobi transit center. She sat on the ground, surrounded by her children, who range in age from 1 to 12.\n\n“We’re so worried about her,” said Mohammed Abdi, another refugee at the center.\n\nRefugees like Aden are in a new kind of purgatory. They have already given up their tents and humanitarian supplies, because they assumed they would be traveling to the United States. Now, the same buses that brought them from their refugee camps might end up taking them back.\n\nThey would be treated as new arrivals — often sent to crammed communal tents, waiting all over again to receive a card that entitles them to food rations. In Kakuma, those rations were halved in December, as humanitarian organizations ran low on money as they struggled to respond to the global refugee crisis.\n\nBecause many of the refugees’ U.S. clearances will expire during the 120-day suspension, it could take them “months or even years to get to complete the process again,” Krause said.\n\nRefugee organizations are frantically trying to find ways to save the lives of those who could suffer serious health problems or even die while waiting for the suspension to end. One possibility discussed was redirecting urgent cases from the United States to other countries.\n\nThe U.S. executive order allows the secretaries of state and homeland security to admit individuals as refugees on a case-by-case basis “in the national interest,” but it is not yet clear whether that would help the individuals on the Church World Service list. A call to the State Department for comment was not immediately returned on Monday.\n\nKrause was distraught as she described her worries about the refugees.\n\n“I don’t how else to take this but as a personal failure,” she said, choking up.\n\nRead more\n\nNations condemn Trump travel ban, as the fallout affects people’s lives\n\nWorld airports turn into limbo for many under Trump order\n\nThey were freed from Boko Haram rape camps. But their nightmare isn’t over.\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["death", "matter", "list", "world", "medical", "trump", "ban", "including", "life", "church", "refugee", "cancer", "united", "states", "trumps", "waiting", "refugees", "1yearold"], "summary": "Now, the organization responsible for processing refugees in sub-Saharan Africa, Church World Service, says that order could be their death sentence.\n“These are already the most thoroughly vetted of any individuals entering the United States,” Krause said.\nOne 38-year-old Somali woman that Church World Service added to its list is waiting at a small refu­gee transit center in Nairobi.\nThey have already given up their tents and humanitarian supplies, because they assumed they would be traveling to the United States.\nOne possibility discussed was redirecting urgent cases from the United States to other countries."}