{"url": "https://www.washingtonpost.com/local/md-politics/hogan-makes-his-third-state-of-the-state-address-on-wednesday/2017/02/01/7a5ed2d8-e805-11e6-80c2-30e57e57e05d_story.html", "id": "222", "title": "In speech, Md. Gov. Hogan remains silent on Trump travel ban", "text": "Md. Gov. Larry Hogan, delivering his State of the State address in Annapolis, has tried to distance himself from the president, who lost heavily Democratic Maryland by a wide margin in November. (Linda Davidson/The Washington Post)\n\nGov. Larry Hogan used his third State of the State speech on Wednesday to urge Democrats to work with him on a broad range of policy proposals, even as the state Senate prepared to vote Thursday to overturn one of his 2016 vetoes.\n\nThe popular first-term Republican did not heed calls from Democrats to publicly address the impact of the nascent Trump administration on Maryland, including controversial new travel restrictions for noncitizens and refugees and a proposed repeal of the federal Affordable Care Act.\n\nInstead, he asked legislators to consider his bills to expand vouchers and other school options, require certain businesses to offer paid sick leave, use tax credits to boost manufacturing jobs and take a variety of measures to address the state’s opioid crisis.\n\nHogan, whose proposals in many of these areas have been rejected by lawmakers over the past two years, talked about issues on which he said he and the majority-Democratic General Assembly have worked together, including last year’s passage of a broad criminal justice reform package and a tougher drunken-driving law named in honor of a slain Montgomery County police officer.\n\n“We have not been defined by party or ideology, but by our common purpose and our united obligation to solve problems, to make progress, and to bring real and lasting change to Maryland,” Hogan told a joint session of the Senate and House of Delegates. “We have already accomplished a great deal. But together, we can, and we must, do more.”\n\nGov. Larry Hogan delivers his third State of the State address to a joint session of lawmakers. (Linda Davidson/The Washington Post)\n\nDemocrats — who are poised to overturn Hogan’s veto of a bill to increase renewable-energy targets for the state — offered a lukewarm response to the remarks, with many focused on the fact that Hogan did not speak about Trump.\n\n“What was in the speech was perfectly fine, nothing particularly objectionable, nothing surprising,” said House Majority Leader C. William Frick (D-Montgomery County). “What was not in his speech was shocking. No discussion of the Trump ‘Muslim’ ban; no attempt to repudiate what’s been happening from Washington; no attempt to acknowledge that the Affordable Care Act may be repealed, shred the state budget and throw thousands of people off their health care.”\n\nHogan has tried to distance himself from the president, who lost heavily Democratic Maryland by a wide margin in November. The governor refused to endorse Trump during the campaign and declared that he didn’t vote for him in the election.\n\nSince the inauguration, he has resisted repeated attempts by Democrats to tie him to Trump or force him to denounce the 45th president. Most recently, those efforts have included calls from politicians and on social media for him to push back against the travel ban, as some other elected Republicans have done.\n\nHogan spokeswoman Amelia Chasse said the governor’s office has received “many” calls about the travel ban this week — nearly 2,000 on Monday alone. She could not say how many calls came in Tuesday or Wednesday.\n\nMost of the callers, Chasse said, were Marylanders who oppose Trump’s executive order, which was aimed at blocking the arrival of refugees as well as citizens of seven majority-Muslim countries.\n\nTrump says the purpose is to give the federal government time to put stronger vetting mechanisms in place. Critics of the order note that the government already strictly screens refugees and others with entry visas, and they say that the White House should not be barring people who have been approved or already have permanent residency here.\n\nAmong the callers was Abbi Lichtenstein, a health and wellness coach from Silver Spring who said she told the governor’s office that she thought Hogan should “stand up to” the Muslim ban. She added that her father had come to the United States as a refu­gee from Russia.\n\n“Silence to me means the same as being supportive of it,” said Lichtenstein, who posted on Facebook about having contacted Hogan’s office.\n\nMarion Herz, 64, of Bethesda said she called the governor’s office twice. “My parents were refugees from Nazi Germany, so this hits home to me,” she said, her voice emotional. “As an elected official, he should state his position. . . . He needs to let us know where he is on this.”\n\nChasse said on Tuesday that Hogan’s legal counsel is reviewing the executive order and its implications for Maryland.\n\nHouse Minority Leader Nicholaus R. Kipke (R-Anne Arundel) said Hogan was right to use the speech to talk about how “Maryland is doing well” rather than dwelling on the acrimony of national politics. For example, Hogan said Maryland has “moved into the top 10 states” in overall economic performance, adding 73,000 jobs and having an unemployment rate of 4.2 percent.\n\n“If we all spend our time focusing on [Washington], we’re not going to do the important things necessary this session,” Kipke said. “I think the governor is right not to drag partisan politics into this environment, and I encourage members of the Democratic Party to resist it as well.”\n\nHogan asked the legislature to increase the number of charter schools in the state; to allow residents to deduct 100 percent of the interest paid on their student loans to be tax-deductible; to enact two bipartisan proposals, including a job initiative, designed to create manufacturing jobs in high-unemployment areas and anti-crime legislation that cracks down on repeat sexual offenders and repeat drunk drivers.\n\nHe also again called on the legislature to rescind a law that requires the state to rank and rate transportation projects to determine which should get priority — a request met with a standing ovation from Republicans and silence from Democrats in the chamber.\n\nThe only direct mention Hogan made of the federal government was a call for federal, state and local leaders to work to “find real solutions” to address the growing heroin and opioid crisis.", "authors": [], "publish_date": "2017-02-01", "source": "washingtonpost", "top_words": ["travel", "silent", "hogan", "trump", "address", "ban", "state", "speech", "maryland", "democrats", "remains", "federal", "refugees", "gov", "washington", "md"], "summary": "Larry Hogan, delivering his State of the State address in Annapolis, has tried to distance himself from the president, who lost heavily Democratic Maryland by a wide margin in November.\nLarry Hogan delivers his third State of the State address to a joint session of lawmakers.\nThe governor refused to endorse Trump during the campaign and declared that he didn’t vote for him in the election.\nHogan spokeswoman Amelia Chasse said the governor’s office has received “many” calls about the travel ban this week — nearly 2,000 on Monday alone.\nTrump says the purpose is to give the federal government time to put stronger vetting mechanisms in place."}