{"url": "https://www.washingtonpost.com/opinions/math-suggests-trump-never-intended-his-travel-ban-to-expire/2017/03/10/b771a172-0516-11e7-9d14-9724d48f5666_story.html", "id": "227", "title": "Math suggests Trump never intended his travel ban to expire", "text": "On Jan. 27, when President Trump issued an executive order barring issuance of visas to citizens of several majority-Muslim countries for 90 days, he said it was vitally needed to permit development of stronger vetting procedures during that time period.\n\nCourts blocked implementation of that order, and so the president has now issued a new one, modified from the original in several respects [“Revised travel ban blocks new visas,” front page, March 7]. The new ban, like the old, is to be effective for 90 days, this time starting from the implementation date of March 16.\n\nBut 48 days will have passed between enactment of the two orders. Shouldn’t that mean that only 42 more days are needed to develop the new vetting regimen and that the clock should not, instead, start fresh with another 90?\n\nOr did the Trump administration do nothing in the intervening time toward developing a new vetting procedure — something the president insists is urgently needed to save us all from terrorist attack? More likely, does it mean that he never intended the travel ban to expire after 90 days at all?\n\nRalph Dannheisser, Silver Spring", "authors": [], "publish_date": "2017-03-10", "source": "washingtonpost", "top_words": ["travel", "trump", "ban", "visas", "days", "expire", "suggests", "vetting", "intended", "needed", "order", "president", "90", "math"], "summary": "On Jan. 27, when President Trump issued an executive order barring issuance of visas to citizens of several majority-Muslim countries for 90 days, he said it was vitally needed to permit development of stronger vetting procedures during that time period.\nCourts blocked implementation of that order, and so the president has now issued a new one, modified from the original in several respects [“Revised travel ban blocks new visas,” front page, March 7].\nThe new ban, like the old, is to be effective for 90 days, this time starting from the implementation date of March 16.\nShouldn’t that mean that only 42 more days are needed to develop the new vetting regimen and that the clock should not, instead, start fresh with another 90?\nMore likely, does it mean that he never intended the travel ban to expire after 90 days at all?"}