{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/06/12/anything-trump-tweets-can-be-and-just-was-used-against-him-in-a-court-of-law/", "id": "236", "title": "Anything Trump tweets can be (and just was) used against him in a court of law", "text": "President Trump's travel ban has been challenged in court at every turn. Now the Supreme Court is allowing a limited version to take effect, but with an expanded list of familial exemptions. (Jenny Starrs/The Washington Post)\n\nPresident Trump has made very clear that he's going to tweet what's on his mind, even if it makes his life harder. And now we have an example of that exact thing happening — on one of his top priorities, no less: his beleaguered travel ban.\n\nTrump went on a Twitter tear last week about the ban and why it should be tougher and how he doesn't trust the courts to make the right decision. Much of what he said completely undermined his administration's legal argument. And one very powerful court was listening.\n\nThe U.S. Court of Appeals for the 9th Circuit ruled Monday afternoon not to reinstate the president's travel ban for people from six majority-Muslim countries. A lower court paused the ban shortly after the Trump administration issued a second version. (The first met its death by the 9th Circuit, too, although this version is expected to go to the Supreme Court.)\n\nThe crux of three-judge panel's argument was this: The administration failed to prove the travel ban is so necessary for public safety that it can temporarily curtail people's liberties. And on this key part, it cited one of the president's tweets:\n\nThat's right, we need a TRAVEL BAN for certain DANGEROUS countries, not some politically correct term that won't help us protect our people! — Donald J. Trump (@realDonaldTrump) June 6, 2017\n\nThe court read that tweet as a president arguing his ban is aimed at entire countries, which is not what Trump's lawyers were arguing. (The second version of the ban excludes people with green cards, for example.) If the ban is aimed at dangerous countries, then why block certain travelers from these specific six countries, the court asked. From the decision:\n\nThe order does not tie these nationals in any way to terrorist organizations within the six designated countries. It does not identify these nationals as contributors to active conflict or as those responsible for insecure country conditions. It does not provide any link between an individual's nationality and their propensity to commit terrorism or their inherent dangerousness. In short, the Order does not provide a rationale explaining entry of nationals from the six designated countries under current protocols would be detrimental to the interests of the United States.\n\nHere's where Trump's tweet comes in. Footnoted in the court's argument was this:\n\nWe knew Trump's own words could come back to haunt him on this. Now we know his tweets can, too. The judges listened to hours of arguments from the Trump administration's official lawyers, and their opinion is 86 pages long. But one 140-character tweet from the president can upend all of that.\n\nFrom the moment the courts started ruling against the White House on its travel ban, judges made clear that everything Trump said on the campaign trail could be used as evidence of intent. During the campaign, Trump called for a “temporary ban on Muslims,” and courts ruling against Trump's various travel ban versions took note.\n\nThat's important context, because ban opponents argue that Trump's ban is discriminatory.\n\n(At one point, Trump's lawyers even tried to get the court to agree that his travel ban be evaluated without considering what Trump said during the campaign.)\n\nIf there was a legal question of whether the court could incorporate Trump's tweets, White House press secretary Sean Spicer ended that last week when he said the president's tweets “are considered official statements by the president of he United States.” The court took note of that, too.\n\nIf Trump's tweets are fair game to build a legal case against him, well — that's not good news for Trump.\n\nHis Twitter account is what The Fix's Aaron Blake recently described as a “minefield of hypocrisy.” On attacking Syria without congressional approval, on dropping a massive bomb on Afghanistan, on blaming Democrats. On former national security adviser Michael T. Flynn, whom he encouraged to seek immunity. Trump was tweeting about all this before he got into politics, and he's still tweeting about it now that he's governing the country.\n\nWhich means his thoughts are all there. And not infrequently, his tweets contradict his policies.\n\nTrump's tweets on the travel ban didn't just contradict his agenda; they undermined it. Judges at one of the highest levels of the U.S. legal system noticed — and used it against him a court of law.", "authors": [], "publish_date": "2017-06-12", "source": "washingtonpost", "top_words": ["travel", "trump", "tweets", "ban", "court", "version", "trumps", "countries", "president", "law", "used", "legal"], "summary": "President Trump's travel ban has been challenged in court at every turn.\nAnd now we have an example of that exact thing happening — on one of his top priorities, no less: his beleaguered travel ban.\nIf Trump's tweets are fair game to build a legal case against him, well — that's not good news for Trump.\nTrump's tweets on the travel ban didn't just contradict his agenda; they undermined it.\nJudges at one of the highest levels of the U.S. legal system noticed — and used it against him a court of law."}