{"url": "https://www.washingtonpost.com/news/post-politics/wp/2017/01/29/in-conservative-media-trump-executive-orders-are-a-home-run/", "id": "288", "title": "In conservative media, Trump executive orders are a home run", "text": "President Trump signed an executive order to halt U.S. entry for refugees, migrants and foreign nationals for 120 days starting Jan. 27. Fiery protests and lawsuits made for a tumultuous weekend. Here's what you need to know. (Dalton Bennett,Erin Patrick O'Connor,Katherine Shaver,Monica Akhtar,McKenna Ewen/The Washington Post)\n\nPresident Trump's response Sunday afternoon to criticism of his executive orders on refugees and immigration accused the news media of getting the story wrong. There was no “Muslim ban.” There was, instead, a policy that honest reporters ought to have recognized.\n\n“My policy,” Trump wrote, “is similar to what President Obama did in 2011 when he banned visas for refugees from Iraq for six months.”\n\nThe seemingly out-of-nowhere argument had come from a viral story on the Federalist, a conservative news and opinion site. Originally published in November 2015, when Trump proposed “a complete and total shutdown of all Muslims” entering the country, it had been repopularized this weekend as the furor built. A viral story at Breitbart News, about the same program, had been shared more than 15,000 times on Facebook by the time the White House issued its statement. Gateway Pundit, a conservative blog that is now sending a reporter to White House briefings, scored a hit with a nearly identical story.\n\nAs The Washington Post's Fact Checker has reported, the comparison was slightly inapt; the 2011 program was more narrowly tailored, affecting refugees only, after a specific security breach. But on Twitter, it had become a key plank of the conservative defense. Friday's orders, the most controversial decisions of the Trump presidency so far, began a familiar response from an increasingly balkanized media. In the mainstream press, the story was the protests happening at international airports across the United States, the legal effort to free stranded travelers, and the criticism Trump was receiving from his own party.\n\nBut in the conservative media that has been most supportive of Trump — and where his chief political adviser Stephen K. Bannon hails from — the executive orders have been received as tough and necessary, and a source of irritation for all of the right people. At Breitbart News, which Bannon ran until joining Trump's campaign, multiple stories pinned the negative response to the executive orders on the billionaire and liberal donor George Soros. Legal actions undertaken by immigrant rights groups were quickly tied to Soros's money.\n\n“The ACLU is massively funded by Soros’s Open Society Foundations, including with a $50 million grant in 2014,” wrote Breitbart News's Aaron Klein. “The National Immigration Law Center has received numerous Open Society grants earmarked for general support. The Urban Justice Center is also the recipient of an Open Society grant.”\n\nA similar story, by Breitbart News's Lee Stranahan, spotlighted the role of the Council on American-Islamic Relations in promoting the airport protests — doing so “as Trump protects [the] nation.”\n\n“The Council on American-Islamic Relations is also increasingly a part of America’s institutional left infrastructure and was one of the partners behind the recent Women’s March in Washington that drew hundreds of thousands, along with feminist groups like Planned Parenthood,” Stranahan wrote.\n\nAt every turn in the story, Breitbart noticed a reason to be skeptical of the political backlash. Judge Ann Donnelly, who sided with the American Civil Liberties Union against the executive orders, was described as an “Obama-Appointed, Schumer-Allied Judge.” A story about the teary news conference at which Senate Minority Leader Charles E. Schumer (N.Y.) announced Democratic plans to oppose the orders was headlined “Trump Week One: Schumer Weeps.”\n\nGateway Pundit, whose star has risen since Trump secured the nomination, took a similarly jaundiced view at the opposition to the executive orders. One story argued that protesters were hypocrites: “FLASHBACK: DEMOCRAT President Franklin D. Roosevelt Put Japanese AMERICAN CITIZENS In Internment Camps After 1 Attack.” Another recapped the protests at JFK International Airport through a reporter who tweeted that he had been threatened. The ACLU's stay on the executive orders was covered through the story of customs agents refusing to give lawyers access to detained travelers: “BIG LEAGUE: Customs Agents Ignore Liberal Judge, Enforce Trump’s Travel Ban!”\n\nThe coverage was just as positive on Fox News Channel, the network that the president said, in a midweek tweet, was covering him fairly. On Saturday, two of the network's shows covered the new policy as a clear story of media overreach. On “Watters' World,” Ed Henry, Fox News's chief national correspondent and a former White House Correspondents Association president, described the policy as a political success.\n\n“It hasn't been a Muslim ban for months,” he said. “This may be part of the brilliant Trump negotiating style. Throw something that's radical, that's out there. Have all the critics focus on that. Then you start moving to the middle on something that's really not that radical. Hey, let's enforce our immigration laws. Let's make sure there's real vetting so that terrorists don't come into the country. That's not so crazy.”\n\nOn “Justice With Judge Jeanine Pirro,” the policy's reasonableness was to take for granted that former New York mayor Rudolph W. Giuliani, a Trump supporter from the start of the 2016 campaign, concisely explained how the “Muslim ban” Trump had campaigned on became Friday's executive orders.\n\n“When he first announced it, he said Muslim ban,” Giuliani said. “He called me and asked me: Put a commission together, show me how to do it legally. ... We focused, instead of on religion, danger.”\n\nOn Sunday's episode “Media Buzz,” the press-watch show hosted by former Washington Post reporter Howard Kurtz, the subject shifted entirely to whether the media were getting the story wrong. At one point, Kurtz looked dismissively at the studio's window, saying that “out at the Capitol, behind our guests, about 200 protesters are gathering to protest this.” That was several hours before tens of thousands of protesters marched from the White House to Congress.\n\n“Isn't this almost exactly what he said he would do during the campaign?” Kurtz asked a panel of reporters. “The entire media establishment said, 'This is suicidal.'... Maybe they are missing those in the country now who think this is a good idea?”\n\nConservative commentator Guy Benson, a sometime critic of Trump, agreed that the coverage had been skewed. “There are hundreds of millions of Muslims living worldwide not affected by this ban — for example, Muslims in Indonesia,” he said.\n\nLater on Sunday, as other networks went long on protest coverage, Fox News republished and retweeted a poll conducted weeks before the actual executive orders.\n\nPoll: Nearly Half of America Voters Support Trump's Immigration Order https://t.co/ybonwad1Fg pic.twitter.com/4sZZ1JBVIY — Fox News (@FoxNews) January 29, 2017\n\nThe weekend that unfolded across conservative media looked almost nothing like the one unfolding across newspaper front pages or most of cable news. The president's statement was not the only evidence of the impact. On Sunday night, after a number of Republicans had gotten attention for criticizing the executive orders, Rep. Francis Rooney (R-Fla.) released a statement defending them and criticizing the media.\n\n“It is important to note that in 2011, President Barack Obama issued a six month ban on Iraqi refugees entering the U.S.,\" he said. “There was no outrage from the liberal media then.”\n\nUPDATE: An earlier version incorrectly attributed the quote from Rep. Francis Rooney to Rep. Thomas J. Rooney, also a member from Florida.", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["executive", "trump", "orders", "ban", "refugees", "breitbart", "conservative", "run", "media", "president", "white"], "summary": "President Trump signed an executive order to halt U.S. entry for refugees, migrants and foreign nationals for 120 days starting Jan. 27.\n(Dalton Bennett,Erin Patrick O'Connor,Katherine Shaver,Monica Akhtar,McKenna Ewen/The Washington Post)President Trump's response Sunday afternoon to criticism of his executive orders on refugees and immigration accused the news media of getting the story wrong.\nFriday's orders, the most controversial decisions of the Trump presidency so far, began a familiar response from an increasingly balkanized media.\nLater on Sunday, as other networks went long on protest coverage, Fox News republished and retweeted a poll conducted weeks before the actual executive orders.\nOn Sunday night, after a number of Republicans had gotten attention for criticizing the executive orders, Rep. Francis Rooney (R-Fla.) released a statement defending them and criticizing the media."}