{"url": "https://www.washingtonpost.com/news/worldviews/wp/2017/07/21/north-korean-travel-ban-marks-return-to-cold-war-era-restrictions-on-u-s-citizens-abroad/", "id": "286", "title": "North Korean travel ban marks return to Cold War-era restrictions on U.S. citizens abroad", "text": "\n\nAmerican student Otto Warmbier in Pyongyang, North Korea, on March 16, 2016. (Jon Chol Jin/AP)\n\nU.S. citizens have long been able to visit North Korea as tourists, but that will soon change. On Friday, the Trump administration announced that it was planning to bar U.S. tourists from traveling to North Korea next month.\n\nThe move coincides with increasing tension between the Trump administration and Pyongyang about North Korea's nuclear weapons program. It also comes after Otto Warmbier, an American student, was detained while on a trip to North Korea and sentenced to 15 years of hard labor.\n\nWarmbier later died, just six days after being released, in a comatose state, and flown to Ohio.\n\nThe decision to ban travel by U.S. citizens to a foreign country marks an unusual policy shift for the State Department, harking back to restrictions on travel not widely used since the Cold War era.\n\nThough the State Department routinely issues alerts and warnings about travel to certain countries (a warning is currently in place for North Korea), these serve only as recommendations and do not bar travel. And while U.S. nationals may in some cases find themselves barred from certain countries, that is generally the decision of a foreign government rather than the State Department.\n\n“The safety and security of U.S. citizens overseas is one of our highest priorities,” State Department spokeswoman Heather Nauert said late Friday morning as the ban was announced. “Due to mounting concerns over the serious risk of arrest and long-term detention under North Korea’s system of law enforcement, [Secretary of State Rex Tillerson] has authorized a Geographical Travel Restriction on all U.S. citizen nationals’ use of a passport to travel in, through, or to North Korea.”\n\nPeter Spiro, the Charles Weiner chair in international law at Temple University, said such a policy would be a revival of “area restrictions” that were common during the mid-20th century.\n\n“At various points, Americans were barred from traveling to various communist countries during the Cold War,” Spiro said in an email, noting that the practice went back as far as the 1920s.\n\nThese restrictions were noted explicitly on the passports themselves. A passport issued in 1954 to Jacqueline Kennedy, later the first lady, shows a page noting that the passport was not to be used for travel to “Albania, Bulgaria, China, Czechoslovakia, Hungary, Poland, Romania or the Union of Soviet Socialist Republics,” for example.\n\nThe logic behind these bans was varied. Sometimes they were used to restrict travel to a country after U.S. citizens were captured or detained there, such as after the Iran hostage crisis between 1979 and 1981 or the kidnappings of Americans in Lebanon during the late 1980s.\n\nSuch restrictions were last implemented against countries in the late 1980s and early 1990s, and none of those bans remain in place. The U.S. government appears to have moved away from State Department-ordered travel bans and instead used the Treasury Department to restrict tourism-related transactions in foreign countries (most notably Cuba).\n\nSpiro argued that a return to the use of travel bans would have legal standing, however. “The Supreme Court found the secretary of state to have the power to impose these restrictions in its 1965 decision in Zemel v. Rusk,” Spiro wrote. “In that case, the court rejected a First Amendment challenge to an area restriction (a ban on travel to Cuba) and also rejected the assertion of a constitutional right to international travel.”\n\nThough Spiro said he expected any ban on U.S. travel to North Korea to face legal challenges, he said he thought the legal precedent would allow the ban to stick.\n\nWhat was less clear, however, was how the law would work practically. Even when area restrictions were more widely used, legal experts argued that they were very difficult to enforce. State Department area restrictions on Iran were undermined when Ramsey Clark, a former attorney general, traveled to Tehran in 1980 in a bid to help defuse the ongoing hostage crisis. The Justice Department ultimately decided not to prosecute Clark, in part because of legal uncertainty about the outcome.\n\nEveryday, North Koreans are told that the Americans are \"imperialists\" and North Korean children are taught that \"cunning American wolves\" want to kill them. To understand why, we need to go back to the Korean War. (Anna Fifield,Jason Aldag/The Washington Post)\n\nThere are no direct connections between the United States and North Korea, with most travelers instead going through China to reach the country. Matthew Bradley, regional security director for the Americas at the travel safety firm International SOS and Control Risks, said he imagined that tourists who went to China or other neighboring countries would have their passports flagged before they reached U.S. immigration officers.\n\n“They'll be looking for indications that you were in the country you said you were in,” Bradley said in a phone call, adding that he would expect “pretty strict enforcement for the first six months to a year” after the new rules took effect. Even considering the threat of prosecution, he said it was likely that U.S. citizens would still try to visit North Korea. “It's very difficult to remove the incentive,” Bradley said. “There will still be people who risk it.”\n\nInstead, Bradley said, it would probably be the companies that organize trips to North Korea for foreigners that respond. Two of these companies, Koryo Tours and Young Pioneer Tours, have issued statements acknowledging the new rules. (Young Pioneer Tours had already announced that it would no longer take Americans to North Korea after Warmbier's death.)\n\nBradley added that, ultimately, the biggest responsibility lies with tourists — and his company has long advised against U.S. citizens traveling to North Korea.\n\n“The risk is that the government will seize you. And the reasons that they might seize you are arbitrary,” he said. “And when the risk cannot be mitigated through conventional means, it has to be avoided.”\n\nMore on WorldViews\n\nThere are 3 big reasons South Korea’s new president wants talks with North Korea", "authors": [], "publish_date": "2017-07-21", "source": "washingtonpost", "top_words": ["return", "travel", "restrictions", "citizens", "ban", "korean", "korea", "state", "warera", "countries", "north", "marks", "legal", "department", "used", "cold"], "summary": "(Jon Chol Jin/AP)U.S. citizens have long been able to visit North Korea as tourists, but that will soon change.\nOn Friday, the Trump administration announced that it was planning to bar U.S. tourists from traveling to North Korea next month.\nIt also comes after Otto Warmbier, an American student, was detained while on a trip to North Korea and sentenced to 15 years of hard labor.\n(Young Pioneer Tours had already announced that it would no longer take Americans to North Korea after Warmbier's death.)\nBradley added that, ultimately, the biggest responsibility lies with tourists — and his company has long advised against U.S. citizens traveling to North Korea."}