{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/06/06/trump-proposed-a-120-day-travel-ban-to-improve-vetting-its-been-129-days/", "id": "29", "title": "The Supreme Court will hear Trump’s travel ban case after part of it expires", "text": "President Trump's travel ban has been challenged in court at every turn. Now the Supreme Court is allowing a limited version to take effect, but with an expanded list of familial exemptions. (Jenny Starrs/The Washington Post)\n\nThis post was originally published in June and has been updated.\n\nIn President Trump's perfect world, his travel ban would have already expired before the Supreme Court reinstated it in June. The versions he signed in January, then March, were designed to be temporary pauses of most travelers from seven, then six, majority Muslim countries. The idea was to ban travel for a few months while the administration figured out a permanent vetting process to keep Americans safe from terrorism.\n\nBy the time the Supreme Court hears arguments in the case on Oct. 10, the ban on travelers from six countries will have already expired. The separate ban on refugees will expire at the end of October, likely before the court releases its opinion the case. The administration wanted 90 and 120 days, respectively, to develop “extreme vetting” processes for these groups.\n\nSo why was the Trump administration urging the Supreme Court to reinstate its travel ban, if a big part of it (and its purpose) would have expired by now?\n\nLegal wrangling over the ban itself continued after the Supreme Court announced it would hear the case. A series of cases questioning what constitutes a “bona fide” connection to a person in the United States made their way through lower courts all summer. Legal challenges forced the administration to change the list of family members allowed in under the ban, and the Supreme Court weighed in on the issue of refugee resettlement agencies this month.\n\nThe deadlines mean Trump's lawyers will have to defend a temporary travel ban when they already had more time than they wanted to implement a more permanent fix.\n\n“There was nothing stopping” Trump from setting up a long-term vetting process for people from, in Trump's words, countries that are known to sponsor terrorism, said Andrew Rudalevige, a political-science professor at Bowdoin.\n\nLegal opponents of the ban face a similar problem: Maryland and Hawaii, which are suing the administration, will have to explain how they'll be helped by a court ruling in October against a ban that already expired.\n\n\n\n\n\nThe administration has addressed the timeline — and proceeded to contradict itself. David Lapan, a spokesman for the Department of Homeland Security, told USA Today that the department was not crafting new vetting procedures because the courts had halted the executive order directing them to do so.\n\nLawyers and other experts dispute this characterization of the court order. The order only prevented Trump from banning travel to the United States, not from changing vetting procedures here in the United States, according to Leon Fresco, an immigration lawyer at Holland & Knight.\n\nTrump himself soon punched a giant hole into the Department of Homeland Security's argument that the ban on the ban prevented them from rewriting more permanent travel rules.\n\nRather than agreeing that the court prevented the administration from strengthening vetting, Trump tweeted in June that “extreme vetting” procedures have already been developed.\n\nIn any event we are EXTREME VETTING people coming into the U.S. in order to help keep our country safe. The courts are slow and political! — Donald J. Trump (@realDonaldTrump) June 5, 2017\n\nAround that time, the Trump administration rolled out a new questionnaire for visa applicants, which could be considered part of that vetting process.\n\n“The president has admitted that the ban is no longer necessary,” Fresco said, referring to that tweet. “The only reason to keep the ban now is to actually have a ban.”\n\nIn other words, Trump's lawyers will have to convince the Supreme Court that a temporary ban is necessary, even though it was supposed to expire before it was actually implemented, and months before the case is heard.\n\nBecause of the way the Supreme Court's schedule is set up, both sides will be arguing about a ban next month that has all but expired.", "authors": [], "publish_date": "2017-06-06", "source": "washingtonpost", "top_words": ["travel", "hear", "expires", "case", "trump", "ban", "supreme", "vetting", "court", "trumps", "expired", "order", "administration"], "summary": "President Trump's travel ban has been challenged in court at every turn.\nNow the Supreme Court is allowing a limited version to take effect, but with an expanded list of familial exemptions.\nIn President Trump's perfect world, his travel ban would have already expired before the Supreme Court reinstated it in June.\nBy the time the Supreme Court hears arguments in the case on Oct. 10, the ban on travelers from six countries will have already expired.\nLegal wrangling over the ban itself continued after the Supreme Court announced it would hear the case."}