{"url": "https://www.washingtonpost.com/news/post-nation/wp/2017/02/01/u-n-experts-say-trump-immigration-order-violates-u-s-human-rights-obligations/", "id": "264", "title": "U.N. experts say Trump immigration order violates U.S. human rights obligations", "text": "White House press secretary Sean Spicer defended the actions that led to a 5-year-old boy being detained at a U.S. airport for hours following President Trump's immigration ban. (Reuters)\n\nA panel of United Nations human rights experts said Wednesday that President Trump’s sweeping order restricting some travelers and refugees from entering the United States violates the country’s international human rights obligations.\n\nThe blunt assessment from the U.N. is the latest criticism it has volleyed at Trump’s ban, which temporarily closes America’s borders to people from seven Muslim-majority nations and suspends admission for almost all refugees for a 120-day period.\n\n“Such an order is clearly discriminatory based on one’s nationality and leads to increased stigmatization of Muslim communities,” a group of U.N. Special Rapporteurs — experts appointed to study human rights issues — said in a statement. The group includes rapporteurs on migrants, human rights and counterterrorism, racism, torture and freedom of religion.\n\nTrump and officials in his administration have argued since he signed the order last Friday that the measure is not a “Muslim ban.” During the presidential campaign, Trump called for a Muslim ban, a statement that remains on his campaign website, and he said the day he signed the order that he would prioritize Christians seeking admission as refugees.\n\n[‘These are people’s lives they are playing with’: World’s airports turn into limbo for many under Trump order]\n\nIn its statement, the group of U.N. experts alluded to people who have been detained at airports across the country, saying they were worried people flying to the United States “will be subject to detention for an undefined period of time and then ultimately deported.”\n\nA spokesman for the United States mission to the U.N. did not respond to a request for comment Wednesday.\n\nU.N. officials have spoken out against the ban in very sharp terms this week, worrying about its impact on refugees and expressing concerns it could help terrorist groups. Zeid Ra’ad Al Hussein, the U.N. high commissioner for human rights, called the travel ban “mean-spirited” on Monday, while U.N. Secretary-General António Guterres released a statement a day later saying he was worried about decisions “undermining the integrity of the international refugee protection regime.”\n\nPresident Trump signed an executive order to halt U.S. entry for refugees, migrants and foreign nationals for 120 days starting Jan. 27. Fiery protests and lawsuits made for a tumultuous weekend. Here's what you need to know. (Dalton Bennett,Erin Patrick O'Connor,Katherine Shaver,Monica Akhtar,McKenna Ewen/The Washington Post)\n\nTrump’s order included a temporary entry ban on people from seven countries: Iraq, Iran, Syria, Yemen, Sudan, Libya and Somalia. It also significantly cut back the number of refugees the United States will take in and, in addition to a 120-day freeze on most refugee admissions, indefinitely suspended the arrival of any Syrian refugees.\n\nThe U.N. has called the situation in Syria “the worst war, the worst humanitarian crisis, the worst displacement crisis, the worst refugee crisis in a generation,” and the experts Wednesday called Trump’s order “a significant setback for those who are obviously in need of international protection.”\n\n[As Trump bars Syrian refugees, life in their camps is getting harder]\n\nThey also expressed their concerns about what would happen to refugees left in limbo, referring to “non-refoulement,” a principle the U.N. has long held stating that nations cannot expel or return a refugee to an area where their life or freedom are threatened.\n\nThe experts wrote that the immigration policy “risks people being returned, without proper individual assessments and asylum procedures, to places in which they risk being subjected to torture and other cruel, inhuman or degrading treatment, in direct contravention of international humanitarian and human rights laws which uphold the principle of non-refoulement.”\n\nThe Trump administration said Tuesday that 872 refugees considered in transit and who would face “undue hardship” if turned back would be allowed into the United States by week’s end. The U.N. refugee agency, in a statement this week, said that Trump’s order could impact a far larger number of people, estimating that some 20,000 refugees might have been resettled in the United States during the 120-day window when most won’t be allowed to enter the country.\n\nFurther reading:\n\nTrump’s refugee ban is a matter of life and death for some, including a 1-year-old with cancer\n\nOfficials worry that U.S. counterterrorism defenses will be weakened by Trump actions\n\nTrump has fired the acting attorney general who ordered Justice Dept. not to defend president’s travel ban\n\nHundreds of lawyers descend on airports to offer free help after Trump’s executive order\n\nTrump and his aides keep justifying the entry ban by citing attacks it couldn’t have prevented", "authors": [], "publish_date": "2017-02-01", "source": "washingtonpost", "top_words": ["trump", "ban", "immigration", "refugee", "refugees", "united", "states", "trumps", "rights", "experts", "violates", "order", "obligations", "human", "say"], "summary": "White House press secretary Sean Spicer defended the actions that led to a 5-year-old boy being detained at a U.S. airport for hours following President Trump's immigration ban.\n(Reuters)A panel of United Nations human rights experts said Wednesday that President Trump’s sweeping order restricting some travelers and refugees from entering the United States violates the country’s international human rights obligations.\n“Such an order is clearly discriminatory based on one’s nationality and leads to increased stigmatization of Muslim communities,” a group of U.N. Special Rapporteurs — experts appointed to study human rights issues — said in a statement.\nThe group includes rapporteurs on migrants, human rights and counterterrorism, racism, torture and freedom of religion.\nFurther reading:Trump’s refugee ban is a matter of life and death for some, including a 1-year-old with cancerOfficials worry that U.S. counterterrorism defenses will be weakened by Trump actionsTrump has fired the acting attorney general who ordered Justice Dept."}