{"url": "https://www.washingtonpost.com/national/trump-is-right-in-a-way-to-do-what-hes-doing-christian-syrian-community-in-pa-supports-temporary-travel-ban/2017/01/30/9004dd38-e71c-11e6-bf6f-301b6b443624_story.html", "id": "224", "title": "‘Trump is right, in a way’: These Christian Syrians in Pa. back the travel ban", "text": "\n\nRestaurant owner Elias Shetayh, who came to Allentown, Pa., in 1971, is pictured behind hookah pipes at his restaurant on Jan. 29. Syrians have been immigrating to Allentown for more than a century. (Mark Makela for The Washington)\n\n— Hookah smoke drifted through the restaurant as Elias Shetayh and Aziz Wehbey spoke intently about their support for President Trump, whose temporary halt on immigration from war-torn Syria — their homeland — had touched off a political firestorm. Nearby, a waitress carried out several platters of Mediterranean food to a large Arab American family.\n\n“Trump is right, in a way, to do what he’s doing,” Shetayh said, discussing the executive order banning certain immigrants from entry into the United States. “This country is going into a disaster.”\n\nAllentown and surrounding Lehigh County have one of the country’s largest and most established communities of Syrian Americans, many of them emigres who moved from the “Christian Valley” in Syria decades ago. They have helped a steady stream of family members join them in the United States, and — to the surprise of many — offered strong support to Trump during the presidential election.\n\nGathered at Saado’s on Sunday, Wehbey, Shetayh and Shetayh’s wife, Georgette, took turns talking proudly about Syria and expressed pain at seeing the country split in two. Elias Shetayh’s view is a common refrain up and down the 6th Ward, where many agree with Trump’s decision to end the Syrian refu­gee program, even as they dispute the wisdom of his blanket ban on all legal immigration from Syria as too extreme.\n\n“We would not like to bring refugees for a simple reason: We do not know their background,” Wehbey said. “We’re concerned about, if God forbid a terrorist attack happened here . . . that we’re all labeled as bad people. I hate to say it.”\n\nThe national conversation about the U.S. position on accepting refugees of the Syrian civil war has hit a fever pitch in the days since Trump signed an order halting the program, amid fears that along with refugees, terrorists will seek to surreptitiously enter the country. In Allentown, there is an additional religious subtext: The established Syrians in the 6th Ward are Christian; the newcomers, refugees fleeing the war, tend to be Muslim.\n\n“We’re not by any means prejudiced against Islam. As long as you’re a good human being, you have the right to believe whatever you want to believe. But the majority of the population over here are Christian Syrian,” said Wehbey, who is regarded as a community leader. “Now they’re bringing new elements from Syria, refugees shook by a religious war. They may have hate in their heart because of whatever happened to them.”\n\n“And we don’t want to see a religious conflict over here,” he added.\n\n\n\nAziz Wehbey, president of the Syrian American Amarian Charity Society of Pennsylvania, in Allentown on Jan. 29. He came to the United States in 1991. (Mark Makela for The Washington Post)\n\nThe Shetayhs, who own the restaurant, have lived in the United States for decades — Elias for 46 years, Georgette for 30. Wehbey came to the United States in 1991, when he was 19 years old. All three are now U.S. citizens. They all describe a peaceful and multicultural community here, about 60 miles northwest of Philadelphia, that has embraced diversity without conflict.\n\nAs in most of the rest of the country, there is not consensus in Allentown that the United States should stop accepting refugees, even among those who continue to support Trump.\n\nTalking over baklava and cookies filled with dates, Fouad and Mouna Younes expressed concern about the families who will now be turned away. But even though they disagree with the decision to stop accepting refugees altogether, they insist that Trump is right that refugees must be rigorously screened.\n\n“These poor people are coming from war. For them to get here and all of a sudden to be told — and they’re legal and have visas — and all of a sudden you tell them, ‘You can’t come in. You have to go back’ — that’s a shame,” Fouad Younes said. “But instead of fighting amongst ourselves, let’s give the man a chance. Maybe he’s going to bring jobs back.”\n\nLike other pro-Trump Syrian Americans in Allentown, Younes was frustrated by President Barack Obama’s calls for Syrian President Bashar al-Assad to step down. Younes supported Obama and said he is “usually a liberal” but supported Trump during the election because of his stances on foreign policy. As a military veteran, Younes said, the controversy over the 2012 attack in Benghazi, Libya, soured him to Democrat Hillary Clinton’s candidacy.\n\n\n\nA 6th Ward street in Allentown, Pa. (Mark Makela for The Washington Post)\n\nLargely supportive of Assad’s regime, many of Allentown’s Syrian Christians have expressed skepticism that any moderate “rebels” in Syria exist, including the Free Syrian Army, with many emphasizing that they believe the rebels are hoping to covertly wage a religious war. There remains a strong sense among many of the Syrians in Allentown that Assad led the country reasonably and that things were going in the right direction before the civil war.\n\n“There’s no such thing as moderate rebels anymore. It’s all jihadis fighting the government. That’s the fear. You saw what happened in Paris and in other European countries,” Younes said, referring to terrorist attacks there. “But we’re worried about these poor people that are running away from war. These aren’t people that are going to hurt you.”\n\nThe Younes family’s story is typical for immigrants in Allentown; they arranged U.S. residency through family connections and marriage and in turn helped other family members enter the United States as permanent residents, including Mouna Younes’s mother. Her brother, Afif Salibi, immigrated to the United States in 2013 with his wife and four children. Mouna’s younger brother, who lives in Syria, has been unable to arrange a visa. The family was hoping he would be able to apply for refugee status, but the new ban has stalled their hope.\n\nEven if the refugee program permanently ends, Fouad said he won’t necessarily abandon his support for Trump. “It’s not going to necessarily turn me against him,” he said. “It just turns me against the policy. I’ve always been against the policy.”\n\nMouna added: “I’m with them. You have to decide if these people who are coming are good, are terrorist. They have to get their background.”\n\n\n\nMouna Younes with her children at home in Whitehall, Pa., a town outside of Allentown, on Jan. 29. (Mark Makela for The Washington Post)\n\nMany in the community believe that the U.S. government will make exceptions for Christian Syrians, particularly those with family members already in the United States. Wehbey has advised many in the community to be patient, noting that the travel-ban order is temporary.\n\n“We are being punished for something we didn’t do. And we’re being labeled as terrorists,” Elias Shetayh said. “I want the president to be tough on everyone, not single out a single people. For Trump to come out and label us as terrorists, it’s not fair to the Syrian people.”\n\nA Syrian refugee who moved to the United States with his wife and six children 16 months ago and now lives in Allentown expressed gratitude to the United States and to the residents of his new home. Speaking on the condition of anonymity out of fear that the Trump administration might retaliate against him for talking to the media, he said he believes Americans do not fully understand the depth of the violence wrought by war.\n\nWhen he still lived in Daraa, Syria, he was abducted by authorities one night from his bedroom and held for 37 days, he said. He described repeated beatings while he was detained. In his experience, Syrian Muslims and Christians have always gotten along well, but that all changed after the war started, and he blamed the Syrian government for stoking those tensions. But he said the tensions stay in Syria.\n\n“Radical Muslims don’t come to the United States,” he said. “The people that are coming here are people looking for a better life.”\n\nMouna and Fouad Younes also said that the Christian and Muslim divide was not an issue in Syria before the war. Mouna said that it wasn’t until after the war that she began to sense religious tensions.\n\nFouad added that he agrees with people who say suspicion of all Muslim refugees is wrong: “It is Islamophobic.”\n\nRead more:\n\nDenied Entry: Stories of refugees and immigrants barred from the U.S.\n\nFrom order to disorder: How Trump’s immigration directive exposed GOP rifts\n\nAngry Republicans lash out at Trump for not consulting them on travel ban", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["syrian", "travel", "right", "trump", "ban", "allentown", "syrians", "refugees", "united", "syria", "pa", "war", "states", "wehbey", "younes", "christian", "way"], "summary": "“Trump is right, in a way, to do what he’s doing,” Shetayh said, discussing the executive order banning certain immigrants from entry into the United States.\n(Mark Makela for The Washington Post)The Shetayhs, who own the restaurant, have lived in the United States for decades — Elias for 46 years, Georgette for 30.\nHer brother, Afif Salibi, immigrated to the United States in 2013 with his wife and four children.\n(Mark Makela for The Washington Post)Many in the community believe that the U.S. government will make exceptions for Christian Syrians, particularly those with family members already in the United States.\n“Radical Muslims don’t come to the United States,” he said."}