{"url": "https://www.washingtonpost.com/world/national-security/justice-dept-lays-out-defense-of-revised-travel-ban-as-key-court-hearings-loom/2017/03/13/7ae65764-07fc-11e7-93dc-00f9bdd74ed1_story.html", "id": "208", "title": "Justice Dept. lays out defense of revised travel ban as key court hearings loom", "text": "President Trump speaks at the White House on March 10. The Justice Department on Monday filed its first significant legal defense of Trump’s revised travel ban. (Olivier Douliery/Bloomberg News)\n\nThe Justice Department on Monday laid out its first significant legal defense of President Trump’s revised travel ban, arguing in a court filing that the harms opponents say it causes are “speculative” and that the president was well within his authority to issue the directive.\n\nResponding to a lawsuit from the state of Hawaii, Justice Department lawyers asserted that Trump’s new executive order solved any possible legal problems that came with the first one, because it was narrower in scope and outlined a robust list of people who might be exempted.\n\n“Plaintiffs therefore are not entitled to the sweeping relief they seek,” Justice Department lawyers wrote.\n\n[Why Hawaii says Trump’s new travel ban is still unconstitutional]\n\nOpponents of Trump’s executive order have asked federal judges in several states to block the administration from enforcing the directive, and two judges have scheduled hearings Wednesday to hear arguments on the matter. The order — which suspends the U.S.’s refu­gee program and bars the issuance of new visas to citizens of six Muslim-majority countries — is set to take effect Thursday, unless a court intervenes.\n\nHawaii was the first state to sue over the directive, arguing the new executive order — much like the old — violates the establishment clause of the First Amendment because it is essentially a Muslim ban, hurts the ability of state businesses and universities to recruit top talent and damages the state’s robust tourism industry.\n\nThey pointed particularly to the case of Ismail Elshikh, the imam of the Muslim Association of Hawaii, whose mother-in-law’s application for an immigrant visa was still being processed. Under the new executive order, lawyers for Hawaii said, Elshikh feared that his mother-in-law would ultimately be banned from entering the United States.\n\nJustice Department lawyers countered that the economic harms alleged by the state were “mere speculation” and that Elshikh’s mother-in-law had no reason to sue yet because she had not been denied a waiver to come into the country. The new executive order, unlike the old, spelled out a list of people who might be granted exemptions, including those seeking to visit or live with family in the United States.\n\n“The Order applies only to individuals outside the country who do not have a current visa, and even as to them, it sets forth robust waiver provisions,” Justice Department lawyers wrote. “Among other things, therefore, plaintiffs cannot show that any individual whom they seek to protect is in imminent risk of being denied entry due to the Order.”\n\nThe state will have to convince a judge that Trump’s ban is likely to be ultimately found unconstitutional and will impose immediate, irreparable harms unless it is stopped. A hearing in the case is scheduled for 3:30 p.m. Eastern time Wednesday.\n\nFederal judges in Washington state and Maryland are also considering separate challenges to the new ban, and either could preempt the need for action in Hawaii. A hearing in the Maryland case is scheduled for 9:30 a.m. Wednesday, and Washington on Monday formally asked a judge to enforce his freeze of the previous ban on the new one. The judge told the government to respond by Tuesday.\n\n[Judge in Maryland will weigh Trump travel ban the day before it takes effect]\n\n“While the new section differs from the original by excluding Iraqis, lawful permanent residents, and visa-holders, it bars entry for virtually all other individuals from the listed countries, including: relatives of U.S. citizens, students who have been admitted to state universities, prospective employees of state universities and private businesses, and many others,” lawyers for the state of Washington wrote. “This Court’s original injunction protected these individuals and institutions, and the Ninth Circuit rejected Defendants’ request to narrow the injunction to exclude them.”\n\nThe administration has argued the ban is necessary for national security reasons, though many diplomatic and national security professionals have said they disagree with that assessment, and the new ban would probably not have kept out anyone responsible for a fatal terrorist attack since 2001.\n\nIn their filing, Justice Department lawyers pointed to 300 people who entered the United States as refugees and are under investigation for terrorism-related crimes and asserted that hundreds of foreign-born individuals have been convicted of such offenses. They attached a letter from Attorney General Jeff Sessions and Homeland Security Secretary John Kelly asking President Trump to direct a “temporary pause” on people entering the U.S. from certain countries.\n\n“More fundamentally, plaintiffs miss the point,” Justice Department lawyers wrote. “The Order’s objective is to prevent future terrorist attacks before they occur. And that is precisely why the Order focuses on six countries that Congress and the prior Administration recently determined pose the greatest risk of terrorist infiltration in the future.”\n\nA federal judge in Wisconsin recently blocked the administration from enforcing with respect to one family. In that case, a man who had successfully fled Syria and been granted asylum in the United States sued so that the ban would not be applied to his wife and 3-year-old daughter, who are still in Aleppo and have asylum applications being processed.\n\nThe judge ruled that the family had “some likelihood of success on the merits” and that the man was “at great risk of suffering irreparable harm” if the order was not blocked, so far as it applied to his family.\n\n“The court appreciates that there may be important differences between the original executive order, and the revised executive order issued on March 6, 2017 — for example, the government points to a new waiver provision,” Judge William M. Conley wrote. “As the order applies to the plaintiff here, however, the court finds his claims have at least some chance of prevailing for the reasons articulated by other courts.”", "authors": [], "publish_date": "2017-03-13", "source": "washingtonpost", "top_words": ["executive", "travel", "hearings", "lawyers", "revised", "hawaii", "ban", "justice", "state", "loom", "judge", "dept", "court", "defense", "trumps", "key", "lays", "order", "department"], "summary": "The Justice Department on Monday filed its first significant legal defense of Trump’s revised travel ban.\n“Plaintiffs therefore are not entitled to the sweeping relief they seek,” Justice Department lawyers wrote.\nUnder the new executive order, lawyers for Hawaii said, Elshikh feared that his mother-in-law would ultimately be banned from entering the United States.\n“More fundamentally, plaintiffs miss the point,” Justice Department lawyers wrote.\n“The court appreciates that there may be important differences between the original executive order, and the revised executive order issued on March 6, 2017 — for example, the government points to a new waiver provision,” Judge William M. Conley wrote."}