{"url": "https://www.washingtonpost.com/news/volokh-conspiracy/wp/2017/09/07/appeals-court-rejects-trumps-enforcement-of-travel-ban-order-against-grandparents-and-refugees-with-formal-resettlement-assurances/", "id": "221", "title": "Appeals court rejects Trump's enforcement of travel ban order against grandparents and refugees with formal resettlement assurances", "text": "Earlier today, the US Court of Appeals for the Ninth Circuit rejected the Trump administration’s attempt to apply the president’s travel ban executive order to exclude potential visitors who are grandparents or otherwise close relatives of residents of the United States, and refugees who have received assurances of assistance from US resettlement organizations. The opinion is available here (you may need to download it to be able to read it).\n\nThe president’s order bars virtually all citizens of six Muslim-majority countries from entering the United States for 90 days, and also suspends all admissions of refugees for 120 days. Earlier in the year, a variety of plaintiffs including numerous state governments filed lawsuits challenging the legality of the order. Two federal appellate courts issued preliminary injunctions blocking its implementation: the Fourth Circuit because it ruled that the order was probably motivated by unconstitutional discrimination against Muslims; the Ninth Circuit because it concluded that Trump had exceeded the statutory authority granted to him by Congress. On June 26, the Supreme Court partly lifted the injunctions, but kept them in place with respect to “foreign nationals who have a credible claim of a bona fide relationship with a person or entity in the United States.” That includes people who have a “close familial relationship” with a US resident and refugees who had a bona fide relationship with an entity in the US.\n\nIn a move that verged on willful defiance of the Supreme Court ruling, the Trump administration decided that such relationships as being the grandparent, uncle, or aunt of a US resident do not count as a “close familial relationship,” despite the fact that the Supreme Court indicated that being a mother-in-law of a US resident is sufficient. The administration also barred refugees with formal assurances of resettlement assistance from American refugee sponsorship organizations.\n\nIn July, the administration’s position on both of these issues was rejected by federal district judge Derrick Watson. After the Trump administration unsuccessfully tried to get the Supreme Court to immediately overrule the district court, the case ended up in the Ninth Circuit Court of Appeals. A three judge panel of that appellate court has now unanimously rejected the administration position and affirmed the district judge on both questions. For reasons I explained here, this is clearly the right decision.\n\nOn the question of close familial relationships, the administration’s position is virtually indefensible. As the Ninth Circuit puts it:\n\nThe Government does not meaningfully argue how grandparents, grandchildren, brothers-in-law, sisters-in-law, aunts, uncles, nieces, nephews, and cousins of persons in the United States can be considered to have “no connection” to or “lack any bona fide relationship” with persons in the United States…. Stated simply, the Government does not offer a persuasive explanation for why a mother-in-law is clearly a bona fide relationship, in the Supreme Court’s prior reasoning, but a grandparent, grandchild, aunt, uncle, niece, nephew, or cousin is not.\n\nThe Ninth Circuit also does an excellent job of explaining why the administration’s efforts to justify its position by analogy to various federal immigration statutes make little sense.\n\nOn the refugee question, the appellate court endorses Judge Watson’s conclusion that a formal assurance from a sponsoring organization clearly meets the Supreme Court’s requirement that a “bona fide” connection with a US entity must be one that is “formal, documented, and formed in the ordinary course.” Judge Watson effectively summarized the issue as follows:\n\nAn assurance from a United States refugee resettlement agency, in fact, meets each of the Supreme Court’s touchstones: it is formal, it is a documented contract, it is binding, it triggers responsibilities and obligations, including compensation, it is issued specific to an individual refugee only when that refugee has been approved for entry by the Department of Homeland Security, and it is issued in the ordinary course, and historically has been for decades… Bona fide does not get any more bona fide than that.\n\nIt is possible that the administration will now appeal this issue to the Supreme Court. But any such appeal might soon be moot because the Court will soon hear the original cases against the travel ban order, on the merits. Moreover, most of the travel ban order is only intended to last for 90 days, and that time period is now nearly at an end in any event. By my count, 72 days have already passed since the Supreme Court’s June 26 ruling allowed the president’s order to partially go into effect. The refugee ban, however, is supposed to run for 120 days, so that part of the June 26 ruling will remain relevant for a longer period of time.\n\nIf the Supreme Court does review the Ninth Circuit decision applying the June 13 ruling, it would be extremely surprising if it endorsed the administration’s extremely weak position on the issue of grandparents and other relatives. Although the administration’s arguments on the the refugee question are only modestly stronger, they might have some chance of prevailing, because the Supreme Court did temporarily stay Judge Watson’s ruling on that part of the case, before sending it back to the Ninth Circuit.\n\nOverall, the Ninth Circuit ruling is a notable victory for the plaintiffs challenging the travel ban – and for the affected grandparents and refugees!\n\nUPDATE: The Justice Department has announced that they do indeed plan to appeal this decision to the Supreme Court.\n\nUPDATE #2 [September 11, 2017]: In the original version of this post, I erroneously stated that the Supreme Court’s ruling partly lifting the preliminary injunctions against the travel ban order occurred on June 13. In reality, it was on June 26. I apologize for the error, which I have now corrected. I also apologize for the fact that it took me more than three days to catch it.", "authors": ["Ilya Somin Is Professor Of Law At George Mason University. His Research Focuses On Constitutional Law", "Property Law", "Popular Political Participation. He Is The Author Of", "The Grasping Hand", "Kelo V. City Of New London", "The Limits Of Eminent Domain", "Democracy", "Political Ignorance", "Why Smaller Government Is Smarter."], "publish_date": "2017-09-07", "source": "washingtonpost", "top_words": ["ruling", "ninth", "travel", "fide", "supreme", "circuit", "bona", "refugee", "order", "formal", "enforcement", "resettlement", "trumps", "court", "united", "rejects", "refugees", "grandparents"], "summary": "After the Trump administration unsuccessfully tried to get the Supreme Court to immediately overrule the district court, the case ended up in the Ninth Circuit Court of Appeals.\nThe Ninth Circuit also does an excellent job of explaining why the administration’s efforts to justify its position by analogy to various federal immigration statutes make little sense.\nIt is possible that the administration will now appeal this issue to the Supreme Court.\nOverall, the Ninth Circuit ruling is a notable victory for the plaintiffs challenging the travel ban – and for the affected grandparents and refugees!\nUPDATE: The Justice Department has announced that they do indeed plan to appeal this decision to the Supreme Court."}