{"url": "https://www.washingtonpost.com/local/virginia-politics/va-mosque-sees-outpouring-of-support-as-state-fights-trump-travel-ban/2017/02/03/65e661d6-ea21-11e6-80c2-30e57e57e05d_story.html", "id": "212", "title": "Va. mosque sees outpouring of support as state fights Trump travel ban", "text": "Virginia Governor Terry McAuliffe (D) speaks to Muslims after attending a Muslim community leader roundtable and prayer service at the All Dulles Area Muslim Society mosque on Friday. (Ricky Carioti/The Washington Post)\n\nAshburn resident Amr Said came to the All Dulles Area Muslim Society mosque in Sterling to pray on Friday, seeking to restore his spirit a week after the unveiling of a Trump administration ban on travel that is keeping hundreds of fellow Muslims from entering the United States.\n\nAs he walked up the center stairs amid scores of other immigrants, Said, 35, saw a crowd of about 100 people holding signs that read “We are here for you” and “You belong.”\n\nInside, Virginia Gov. Terry McAuliffe and Attorney General Mark R. Herring delivered essentially the same message. Herring had come from the federal courthouse in Alexandria, where a judge agreed earlier Friday to move forward with a lawsuit seeking an injunction against the executive order that put the travel ban in place.\n\n“We are here to send a message to President Trump that we will not stand by and allow his unlawful, unconstitutional and morally repugnant executive order,” McAuliffe, like Herring a Democrat, bellowed to the cheering worshipers after they had finished the midday prayers.\n\nHis remarks, and the demonstration outside, filled Said with hope. “It makes a lot of difference, a lot of difference,” said Said, a software engineer who is originally from Egypt and who shook hands with several of the sign holders while exiting the mosque. “I feel that [the ban] is not going to continue if everyone speaks up.”\n\nSupporters of the Muslim community stand outside with signs as people arrive for Friday prayers. (Ricky Carioti/The Washington Post)\n\n[Who is affected by Trump travel ban]\n\nIn an area of Northern Virginia where the Muslim population has been increasing for more than two decades, the public reaction to Trump’s executive order so far has been mostly one of outrage.\n\nMany residents have come to know their Muslim neighbors through the 34-year-old Adams Center, one of the largest mosques in the country.\n\nSitting near a bustling Sterling shopping center, the Adams Center hosts 450 Boy Scouts and Girl Scouts, about a dozen of whom joined Friday’s protest wearing their uniforms.\n\nThe mosque partners with churches and synagogues to feed the poor, raises money to support U.S. military families and is a regular stopping point for local politicians seeking to win votes.\n\n“We believe in engagement, totally, at every level, “said Rizwan Jaka, chair of the center’s board of trustees. “At the same time, we will advocate for our rights.”\n\nOn Friday, Jaka and other local leaders urged those who came to the mosque to work to defeat the Trump executive order, which halts refu­gee visas and entry of citizens of seven majority-Muslim countries until stricter security vetting can be put in place.\n\nMcAuliffe, Herring and Lt. Gov. Ralph Northam (D), who is running for governor in November, showed up to express support.\n\nWhile their visit was carefully orchestrated, the demonstration outside the mosque was mostly spontaneous.\n\nIt started with a half-satirical social-media post written by Rasha Saad, 32, of Ashburn, after she watched television news reports this week showing distressed families waiting for their loved ones to appear at airports across the country.\n\n“I’m taking bets on how long you think I will be put in a camp,” Saad, who is Muslim, wrote to a Facebook group of Loudoun County women to which she belongs and whose members discuss politics. “One month? Six months?”\n\nThe post prompted scores of sympathetic messages. Then someone suggested that the group demonstrate its concern for all Muslims in the area by appearing with encouraging signs at the Adams Center during Friday prayers.\n\nThe women, most of them white, stood outside the mosque with their signs while the faithful prayed and the politicians preached. One placard showed an angry Statue of Liberty embracing a woman wearing a hijab. Another said, “We support our Muslim neighbors.”\n\n“I lived in Bahrain for a while,” said Brynn Quick, 32, who was among those who coordinated the demonstration. “I’m picturing the faces of my friends, and some of them were from those seven countries. I’m picturing them, and not some nebulous ‘other.’ ”\n\nMcAuliffe and the other elected officials heard about the impact of the ban when they sat with local leaders inside the Adams Center.\n\nAnab Ali, a registered nurse who is originally from Somalia, said both a nephew and a sister-in-law were kept from returning to the United States this week. Both are currently in the United Arab Emirates.\n\n“Ever since, our family is really, really hurting,” Ali, who lives in Ashburn, told McAuliffe.\n\nThe governor expressed his sympathy. Then, he encouraged everyone in the room to channel their frustration politically.\n\n“We’ve got to get people to run for office who stand for the beliefs that we stand for,” McAuliffe said, expressing frustration over people who chose not to vote in November’s presidential election. “Now, I run into them and they say: ‘I wish I’d voted.’ Boy, you bet.”", "authors": [], "publish_date": "2017-02-03", "source": "washingtonpost", "top_words": ["mosque", "travel", "mcauliffe", "trump", "ban", "state", "fights", "va", "support", "stand", "outside", "order", "herring", "outpouring", "signs", "muslim", "sees", "center"], "summary": "Virginia Governor Terry McAuliffe (D) speaks to Muslims after attending a Muslim community leader roundtable and prayer service at the All Dulles Area Muslim Society mosque on Friday.\n“I feel that [the ban] is not going to continue if everyone speaks up.”Supporters of the Muslim community stand outside with signs as people arrive for Friday prayers.\nMcAuliffe, Herring and Lt. Gov.\nWhile their visit was carefully orchestrated, the demonstration outside the mosque was mostly spontaneous.\nThe women, most of them white, stood outside the mosque with their signs while the faithful prayed and the politicians preached."}