{"url": "https://www.washingtonpost.com/news/sports/wp/2017/02/02/nfl-players-union-expresses-support-for-muslim-players-in-wake-of-trumps-travel-ban/", "id": "205", "title": "NFL players’ union expresses support for Muslim players in wake of Trump’s travel ban", "text": "\n\nDeMaurice Smith and NFLPA expressed support Thursday for the league’s Muslim players. (Damian Dovarganes)\n\nHOUSTON — The NFL Players Association expressed its support Thursday for Muslim players in the league amid the controversy generated by President Trump’s immigration order.\n\nNFLPA officials said the union reached out to the families of Muslim players in the NFL at the behest of Eric Winston, the veteran offensive lineman for the Cincinnati Bengals who serves as the union’s president. About 15 players and their families were contacted, a union official said.\n\n“At Eric’s direction, we notified and sent information to all of those families who are members of the National Football League just to tell them that if they need anything from their union that we’re there 100 percent,” said DeMaurice Smith, the NLFPA’s executive director.\n\n[Roger Goodell refuses to express a view on Trump’s immigration order]\n\nWinston expressed strong support publicly on Thursday for the league’s Muslim players. That came a day after NFL Commissioner Roger Goodell declined to express a view on the Trump administration’s order temporarily banning entry into the U.S. for citizens of seven Muslim-majority countries and refugees from around the world.\n\n“Our Muslim brothers that are in this league, we have their backs,” Winston said. “And that’s it. And we’re gonna do whatever we can. I’ll go stand with them. If people want to come to our house or family or whatever, I’ll be there with them. It’s simple. But the idea that — and not to get too broadly into this—but we’re starting to turn away from our values as a country. But these guys that are players in the National Football League, their families are our families. And I take that seriously.\n\n“I think about them like that, in that we are going to do whatever it takes to protect them and their families. And so they can call on us. They can call on me. They can call on De. They can call on any of these guys and we’ll be there for them. I don’t think that’s who we are as a people. But I’ll leave that discussion for another day.”\n\nWinston spoke at the union’s annual news conference during Super Bowl week.\n\n“Whether you agree or not, there’s a personal side,” Baltimore Ravens tight end Benjamin Watson, a member of the union’s ruling executive committee, said following the news conference. “I’m always aware of and have compassion for people’s feelings whether I agree with them or not. I think that obviously this is an issue that a lot of people feel very passionately about, and I think their voices should be heard. . . . My biggest thing with this whole issue is how it played out.\n\n“If you’re going to lay out something like this that is going to be received in this way and you know it’s going to be received in this way, I think it behooves you as the leader of our country to lay these things out practically, with uniformity. And it’s okay with taking your stand. But be considerate when you tell people the why and when you explain those things because the constituency wants to know.”\n\n[Mark Cuban on NBA Trump protests: “It’s country first, basketball second\"]\n\nWatson said he did not take issue with Goodell saying Wednesday that he was “singularly focused on the Super Bowl right now” when asked during his annual state-of-the-league news conference about the immigration order.\n\n“So far as the league and their response, whatever they want to say and not say, that’s up to them,” Watson said. “I think Eric said it best: We have guys on our panel who agree and disagree with politics. We’re all over the board on the political spectrum. But we all care about people’s feelings. We care about people’s lives. And we want people to know that even if we agree or don’t agree, we hear you and we love you regardless, and then we get to the other stuff later.”\n\nWinston also said during Thursday’s news conference that there must be better compliance with the NFL’s concussion protocols.\n\n[The NFL’s concussion protocol can’t protect Matt Moore from football, but it should have done better]\n\nThe Miami Dolphins were cited by the league and union for failing to comply fully with the concussion protocol with their handling of a case involving quarterback Matt Moore during the AFC playoffs. Moore left a game in Pittsburgh after absorbing a hit to his jaw but was allowed to return after only one play. The NFL and NFLPA found that Moore should have been taken to the locker room for further evaluation.\n\n“We have to work with the teams and the teams have to work and do their jobs when it comes to concussion protocol,” Winston said. “There has to be a better adherence to the concussion protocol. Even though it’s a handful of times that we’ve had to issue things or investigate, it’s still too many. We’ve got to get that number down to zero.”", "authors": [], "publish_date": "2017-02-02", "source": "washingtonpost", "top_words": ["expresses", "travel", "nfl", "wake", "players", "ban", "union", "league", "agree", "support", "think", "families", "trumps", "muslim", "protocol", "concussion"], "summary": "DeMaurice Smith and NFLPA expressed support Thursday for the league’s Muslim players.\n(Damian Dovarganes)HOUSTON — The NFL Players Association expressed its support Thursday for Muslim players in the league amid the controversy generated by President Trump’s immigration order.\n[Roger Goodell refuses to express a view on Trump’s immigration order]Winston expressed strong support publicly on Thursday for the league’s Muslim players.\n“We have to work with the teams and the teams have to work and do their jobs when it comes to concussion protocol,” Winston said.\n“There has to be a better adherence to the concussion protocol."}