{"url": "https://www.washingtonpost.com/blogs/plum-line/wp/2017/03/03/in-leaked-document-the-case-for-trumps-muslim-ban-takes-another-huge-hit/", "id": "232", "title": "In leaked document, the case for Trump’s ‘Muslim ban’ takes another huge hit", "text": "\n\n(Jim Lo Scalzo/AFP/Getty Images)\n\nTHE MORNING PLUM:\n\nWe keep hearing that President Trump will roll out the new version of his travel ban any day now. The White House delayed it earlier this week, because Trump advisers reportedly thought it could step on the good press he’d earned from his speech, thus inadvertently undercutting their own claims that enacting the ban is an urgent national security matter.\n\nHere’s the real reason for the delay: The Trump administration can’t solve the problem that has always bedeviled this policy, which is that there isn’t any credible national security rationale for it. Unlike on the campaign trail, when you’re governing, you actually have to have justification for what you’re proposing, or you often run into trouble.\n\nMSNBC’s Rachel Maddow had an important scoop on Thursday night that further undercuts the substantive case for Trump’s ban, which would restrict entry into the country by refugees and migrants from select Muslim-majority countries. Maddow obtained a new internal Department of Homeland Security document that reached this key judgment:\n\nWe assess that most foreign-born, US-based violent extremists likely radicalized several years after their entry to the United States, limiting the ability of screening and vetting officials to prevent their entry because of national security concerns.\n\nThis new document is separate from another DHS document that was leaked to the press last week. That one also undercut the case for the ban, concluding that “country of citizenship is unlikely to be a reliable indicator of potential terrorist activity.”\n\n[The evidence for Trump’s travel ban simply isn’t there]\n\nThe new document obtained by Maddow weakens the central rationale for the ban, which is to put a temporary delay on entry into the United States for the express purpose of tightening up our vetting procedures. DHS’s conclusion appears to be that vetting procedures in particular are not that useful in screening out people who radicalize later, and that most foreign-born emigrants to the United States who become violent extremists fall into that category.\n\nA new version of a Trump administration travel ban will not stop green card residency holders or travelers already on planes from entering the United States, according to Homeland Security Secretary John Kelly who spoke at the Munich Security Conference. (Reuters)\n\n“The national security justification for this whole ban — this setting up of extreme vetting — is bull-pucky,” Maddow said. “There’s nothing they can set up at the border to tell you years down the road who might become … a radical and violent person years from now.”\n\nThis complements the conclusion of the other leaked memo. Taken together, they appear to mean that DHS’s analysts believe that singling out those countries makes little sense and that the problem in preventing terrorism by immigrants does not lie in our vetting procedures as they are, which already screen out the immediate threats.\n\nNow, an important caveat is necessary here — one that sheds more light on the Trump administration’s actual rationale for the ban, which is crying out for more debate. The ban’s main architects — Stephen K. Bannon and Stephen Miller — would probably argue that these new documents don’t undercut their larger arguments for it.\n\n[What Trump’s travel ban ignores: Radicalized U.S. citizens pose the greatest threat]\n\nAs I have reported, the evidence is mounting that Bannon and Miller view the ban as part of a much broader, long-term demographic-reshaping project. Miller let slip in a recent interview that the ban isn’t just about national security, but also about protecting U.S. workers from foreign competition. And the Los Angeles Times reports that Bannon and Miller have privately argued that the ban is in keeping with the need to combat immigration by people who “will not assimilate”:\n\nInside the West Wing, the two men have pushed an ominous view of refugee and immigration flows, telling other policymakers that if large numbers of Muslims are allowed to enter the U.S., parts of American cities will begin to replicate marginalized immigrant neighborhoods in France, Germany and Belgium that have been home to plotters of terrorist attacks in recent years, according to a White House aide familiar with the discussions.\n\nThus, the ban is of a piece with the long-term goals of protecting American workers from economic competition and preventing European-style immigrant communities (which incubate terror plotters) from developing here. Bannon and Miller could argue that these arguments are partly about national security, too. But this is a case that centers on long-term demographics. That does not support the administration’s case for the immediate ban, since DHS has concluded that “extreme vetting” can’t screen out the threat of radicalization later. If anything, those larger motives undermine the case for the ban, by throwing its stated short-term motive into doubt.\n\nIt’s time for the Trump administration to kill the ban — the case for it is collapsing — and forthrightly debate this larger argument.\n\nPresident Trump defended his executive order on immigration, but said \"we had a bad court\" that stopped its enforcement, during a news conference on Feb. 16 at the White House. (Reuters)\n\n*****************************************************************\n\n* WHAT’S NEXT IN THE RUSSIA AFFAIR: NBC News reports that in the wake of Jeff Sessions’s recusal, the probe will now be overseen by Acting Deputy Attorney General Dana Boente or the permanent one, Rod Rosenstein, if confirmed. What about a special counsel?\n\nThe U.S. Code sets out specific criteria to justify appointing a special counsel. First the attorney general or his or her proxy must determine that a criminal investigation is warranted. … Second, the attorney general or his or her proxy must determine that it would be a conflict of interest for the department or a U.S. attorney’s office to conduct the investigation. Both determinations will now be up to Boente or [Rosenstein].\n\nWho thinks either of those things is likely to happen anytime soon?\n\n* REPUBLICANS WILL BLOCK A BIPARTISAN INQUIRY: Meanwhile, Carl Hulse reports that Republicans aren’t going to support a serious, independent probe anytime soon:\n\nHouse and Senate Republicans remain unwilling to budge from their opposition to a special bipartisan inquiry into the extent of Russian meddling in the 2016 election, and into any connections to President Trump or those close to him. Changing their mind would probably require significant revelations of the sort that would make their current stance politically untenable.\n\nEroding the protective wall that Republicans have built around Trump is going to be difficult, but it is not impossible, particularly if such revelations are in the offing.\n\n* GOP LEADERS WILL ‘STEAMROLL’ THE RIGHT ON OBAMACARE: Conservatives insist they will only support clean ACA repeal, but Politico reports that GOP leaders are set to force through a repeal-and-replace bill that does spend some money to cover some people:\n\nPrivately, senior Republican lawmakers … say they have no problem steamrolling conservatives by daring them to vote against an Obamacare repeal that their constituents have demanded for years. “Conservatives are going to be in a box,” said one senior Republican lawmaker. Trump, the source predicted, eventually will “go out front and … tell the conservatives … they’re either for this or for keeping Obamacare.”\n\nIt will be interesting to see whether conservatives decide to take on Trump, and related to that, whether there will be any serious clamor among conservative voters for total repeal.\n\n* TRUMP ADVISERS SPLIT ON PARIS DEAL: The New York Times reports that a split has emerged over whether to pull the United States out of the global climate accord, between Stephen K. Bannon for pulling out, and Secretary of State Rex Tillerson and Ivanka Trump against it:\n\nOn one side of that debate is Mr. Bannon, who as a former chief executive of Breitbart News published countless articles denouncing climate change as a hoax … On the other side are Ms. Trump, Mr. Tillerson, and a slew of foreign policy advisers and career diplomats who argue that the fallout of withdrawing from the accord could be severe, undercutting the United States’ credibility on other foreign policy issues and damaging relations with key allies.\n\nThat seems like an evenly matched set of arguments.\n\n* PARENTS FACING DEPORTATION MAKE PLANS FOR KIDS: Reuters delivers some important reporting:\n\nParents who immigrated illegally to the United States and now fear deportation under the Trump administration are inundating immigration advocates with requests for help in securing care for their children in the event they are expelled from the country. … About five million children under the age of 18 are living with at least one parent who is in the country illegally, according to a 2016 study … Most of the children, 79 percent, were U.S. citizens, the study found.\n\nRemember, one of the goals of expanding the pool of people subject to deportation is to frighten them into self-deporting. Looks like the effort to spread raw fear is having some success.\n\n* TRUMP IS GALVANIZING POLITICAL ACTION ON THE LEFT: NPR reports that Trump’s presidency is sparking an upsurge in political activity on both sides, but more so on the left. Note this, from Dana Fisher, a University of Maryland sociologist who studies protests:\n\nFisher surveyed more than 500 participants in the Women’s March on Washington the day after Trump’s inauguration. A third never had protested before.\n\nThis, plus sustained engagement from civil society, will be crucial to any hopes of limiting the damage Trump can do.\n\n* AND REPUBLICANS DWELL IN TRUMP’S ALTERNATIVE REALITY: Paul Krugman notes that Trump is far and away the most dishonest politician in recent memory, and adds:\n\nThe moral vacuity of Republicans in Congress, and the unlikelihood that they’ll act as any check on the president, becomes clearer with each passing day. … Meanwhile, Republican primary election voters, who are the real arbiters when polarized and/or gerrymandered districts make the general election irrelevant for many politicians, live in a Fox News bubble into which awkward truths never penetrate.\n\nIndeed, a recent poll found that 78 percent of Republican respondents trust Trump, rather than the news media, to tell them the truth, decreasing the pressure on GOP lawmakers to respond in a reality-based way to new revelations about him. Happy Friday!", "authors": [], "publish_date": "2017-03-03", "source": "washingtonpost", "top_words": ["case", "huge", "trump", "ban", "national", "security", "leaked", "vetting", "republicans", "hit", "reports", "united", "trumps", "takes", "document", "states", "muslim"], "summary": "MSNBC’s Rachel Maddow had an important scoop on Thursday night that further undercuts the substantive case for Trump’s ban, which would restrict entry into the country by refugees and migrants from select Muslim-majority countries.\nThis new document is separate from another DHS document that was leaked to the press last week.\n(Reuters)“The national security justification for this whole ban — this setting up of extreme vetting — is bull-pucky,” Maddow said.\nMiller let slip in a recent interview that the ban isn’t just about national security, but also about protecting U.S. workers from foreign competition.\nBannon and Miller could argue that these arguments are partly about national security, too."}