{"url": "https://www.washingtonpost.com/news/fact-checker/wp/2017/01/29/trumps-facile-claim-that-his-refugee-policy-is-similar-to-obama-in-2011/", "id": "281", "title": "Trump’s facile claim that his refugee policy is similar to Obama’s in 2011", "text": "President Trump signed an executive order halting all refugees from entering the U.S. for 120 days, among other provisions. Here's what the order says. (Peter Stevenson/The Washington Post)\n\n“My policy is similar to what President Obama did in 2011 when he banned visas for refugees from Iraq for six months.”\n\n— President Trump, statement on executive order, Jan. 29, 2017\n\nThe Pinocchio rating has been updated in light of new information.\n\nIn justifying his controversial executive order halting travelers from seven majority-Muslim countries, President Trump claimed that President Barack Obama did the same thing in 2011. But the comparison is a bit facile.\n\nHere’s what happened in 2011.\n\nThe Facts\n\nThe only news report that we could find that referred to a six-month ban was a 2013 ABC News article that included this line: “As a result of the Kentucky case, the State Department stopped processing Iraq refugees for six months in 2011, federal officials told ABC News — even for many who had heroically helped U.S. forces as interpreters and intelligence assets.”\n\nThe “Kentucky case” refers to two Iraqis in Kentucky who in May 2011 were arrested and faced federal terrorism charges after officials discovered from an informant that Waad Ramadan Alwan, before he had been granted asylum in the United States, had constructed improvised roadside bombs in Iraq. The FBI, after examining fragments from thousands of bomb parts, found Alwan’s fingerprints on a cordless phone that had been wired to detonate an improvised bomb in 2005.\n\nThe arrests caused an uproar in Congress, and the Obama administration pledged to reexamine the records of 58,000 Iraqis who had been settled in the United States. The administration also imposed new, more extensive background checks on Iraqi refugees. Media reports at the time focused on how the new screening procedures had delayed visa approvals, even as the United States was preparing to end its involvement in the Iraq War.\n\n“The enhanced screening procedures have caused a logjam in regular visa admissions from Iraq, even for those who risked their lives to aid American troops and who now fear reprisals as the Obama administration winds down the U.S. military presence,” the Baltimore Sun reported.\n\nThe Los Angeles Times reported that U.S. officials acknowledged delays but were trying to speed up the process:\n\nA U.S. Embassy official in Baghdad, speaking on condition he not be identified, acknowledged “unfortunate delays” in issuing special visas, the result of enhanced security clearance procedures, some instituted after the Kentucky arrests. But he said recent changes would speed the process.\n\nThe State Department’s National Visa Center has been ordered to flag special visa applications for expedited action, the official said. And a requirement that Iraqi applicants provide an original signature on certain forms sent to the U.S. has been dropped after Iraqis complained of logistical difficulties. “We are making changes, ordered at the very highest levels, that will help shave time off the application process,” the official said.\n\nAt a September 2011 congressional hearing, Sen. Susan Collins (R-Maine) asked Homeland Security Secretary Janet Napolitano if a hold had been placed on Iraqi visa applications.\n\nCOLLINS: “So my question is, is there a hold on that population until they can be more stringently vetted to ensure that we’re not letting into this country, people who would do us harm?” NAPOLITANO: “Yep. Let me, if I might, answer your question two parts. First part, with respect to the 56, 57,000 who were resettled pursuant to the original resettlement program, they have all been revetted against all of the DHS databases, all of the NCTC [National Counter Terrorism Center] databases and the Department of Defense’s biometric databases and so that work has now been done and focused.” COLLINS: “That’s completed?” NAPOLITANO: “That is completed. Moving forward, no one will be resettled without going through the same sort of vet. Now I don’t know if that equates to a hold, as you say, but I can say that having done the already resettled population moving forward, they will all be reviewed against those kinds of databases.”\n\nThe new rules were stringent, the Economist reported, and resulted in some turmoil.\n\n“Immigration authorities soon began rechecking all Iraqi refugees in America, reportedly comparing fingerprints and other records with military and intelligence documents in dusty archives. About 1,000 soon-to-be immigrants in Iraq were told that they would not be allowed to board flights already booked. Some were removed from planes. Thousands more Iraqi applicants had to restart the immigration process, because their security clearances expired when the program stalled. Men must now pass five separate checks, women four, and children three.”\n\nState Department records show there was a significant drop in refugee arrivals from Iraq in 2011. There were 18,251 in 2010, 6,339 in 2011 and 16,369 in 2012. But it’s unclear that equates to an actual six-month pause in visa processing, rather than a dramatic slowdown in approvals as new rules were put in place. One news report said “pace of visa approvals having slowed to a crawl,” indicating some were still being approved.\n\nUpdate: Former Obama administration official Jon Finer denied that any ban in Iraqi refugee admissions was put in place under Obama. “While the flow of Iraqi refugees slowed significantly during the Obama administration’s review, refugees continued to be admitted to the United States during that time, and there was not a single month in which no Iraqis arrived here,” he wrote in Foreign Policy. “In other words, while there were delays in processing, there was no outright ban.”\n\nAnother former official, Eric P. Schwartz, the assistant secretary of state for population, refugees and migration at the time, also told The Fact Checker that Trump’s statement is false:\n\n“President Obama never imposed a six-month ban on Iraqi processing. For several months in 2011, there was a lower level of Iraqi resettlement, as the government implemented certain security enhancements. Indeed, as we identified new and valuable opportunities to enhance screening, we did so. Nobody should object to a continual effort to identify legitimate enhancements, but it is disreputable to use that as a pretext to effectively shut down a program that is overwhelmingly safe and has enabled the United States to exercise world leadership. In any event, there was never a point during that period in which Iraqi resettlement was stopped, or banned.”\n\nThe Pinocchio Test\n\nSo what’s the difference with Trump’s action?\n\nFirst, Obama responded to an actual threat — the discovery that two Iraqi refugees had been implicated in bombmaking in Iraq that had targeted U.S. troops. (Iraq, after all, was a war zone.) Under congressional pressure, officials decided to reexamine all previous refugees and impose new screening procedures, which led to a slowdown in processing new applications. Trump, by contrast, issued his executive order without any known triggering threat. (His staff has pointed to attacks unrelated to the countries named in his order.)\n\nSecond, Obama did not announce a ban on visa applications. In fact, as seen in Napolitano’s answer to Collins, administration officials danced around that question. There was certainly a lot of news reporting that visa applications had slowed to a trickle. But the Obama administration never said it had a policy to halt all applications. Indeed, it is now clear that no ban was put in place. Even so, the delays did not go unnoticed, so there was a lot of critical news reporting at the time about the angst of Iraqis waiting for approval.\n\nThird, Obama’s policy did not prevent all citizens of that country, including green-card holders, from traveling to the United States. Trump’s policy is much more sweeping, though officials have appeared to pull back from barring permanent U.S. residents.\n\nWe have sought comment from the White House and from Obama administration officials and so may update this if more information becomes available. But so far this is worthy of at least Two Pinocchios.\n\nUpdate: In light of the response from Obama administration officials that there never was a point when Iraqi resettlement was stopped or banned, we are updating this ruling to Three Pinocchios. Iraqi refugee processing was slowed, in response to a specific threat, but it was not halted. The Trump White House, meanwhile, has failed to provide any evidence for its statement.\n\nThree Pinocchios\n\n\n\n\n\n(About our rating scale)\n\nSend us facts to check by filling out this form\n\nKeep tabs on Trump’s promises with our Trump Promise Tracker\n\nSign up for The Fact Checker weekly newsletter\n\n(About our rating scale)\n\n1 of 40 Full Screen Autoplay Close Skip Ad × How people reacted to Trump’s immigration ban View Photos Thousands protested the president’s executive order outside the White House, at Trump International Hotel and at Dulles International Airport. Caption Thousands protested the president’s executive order outside the White House, at Trump International Hotel and at Dulles International Airport. Feb. 1, 2017 Karen Sultan was among scores who came to the “Rally for Immigrants” held at Reagan National Airport. She brought flowers to give to “anyone who might need them.” She’s from Chevy Chase, Md. Michael S. Williamson/The Washington Post Buy Photo Wait 1 second to continue.\n\nSend us facts to check by filling out this form\n\nKeep tabs on Trump’s promises with our Trump Promise Tracker\n\nSign up for The Fact Checker weekly newsletter", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["administration", "iraqi", "trump", "2011", "refugee", "obamas", "visa", "iraq", "officials", "order", "trumps", "obama", "refugees", "claim", "facile", "policy", "similar"], "summary": "The arrests caused an uproar in Congress, and the Obama administration pledged to reexamine the records of 58,000 Iraqis who had been settled in the United States.\n“Immigration authorities soon began rechecking all Iraqi refugees in America, reportedly comparing fingerprints and other records with military and intelligence documents in dusty archives.\nUpdate: Former Obama administration official Jon Finer denied that any ban in Iraqi refugee admissions was put in place under Obama.\nBut the Obama administration never said it had a policy to halt all applications.\nWe have sought comment from the White House and from Obama administration officials and so may update this if more information becomes available."}