{"url": "https://www.washingtonpost.com/news/volokh-conspiracy/wp/2017/06/02/when-will-the-travel-ban-cases-become-moot/", "id": "241", "title": "When will the travel ban cases become moot?", "text": "As predicted, the United States has filed a cert petition and stay application in Trump v. IRAP, the Fourth Circuit litigation about the validity of his administration’s six-country travel ban. On the schedule that the United States proposes, the case would be briefed over the summer and argued this fall at the Supreme Court.\n\nBut commentators such as Marty Lederman and Mark Tushnet have suggested that the case either will soon be moot, or could be made moot without the entry ban ever going into effect. That might be right, but I’m not so sure, and because I found it tricky I thought I’d think through the possibilities here.\n\nPossibility One: The challenges will become moot on June 14, because the text of the order says that its effective date is March 16, and June 14 is 90 days after March 16. This assumes that the order’s start date and duration are unchanged by any of the court orders against it. This is Marty’s position. Possibility Two: The order’s “effective date” has been delayed by the court orders preventing it from going to effect. The order will become moot 90 days after it goes into effect, so the order will not become moot as long as it is stayed. Possibility Three: The order’s “effective date” is unchanged by the court orders, but it will not expire until it has been in effect for 90 days. The upshot is the same as in Possibility Two: The order will not become moot as long as the entry ban is stayed.\n\nMarty argues that the answer is Possibility One:\n\nSection 2(c) of the Order provides that “the entry into the United States of nationals of [the six designated] countries be suspended for 90 days from the effective date of this order.” And Section 14 of the Order specifically provides that the “effective date” of the Order was 12:01 a.m. on March 16. Accordingly, the E.O. itself provides that the suspension prescribed in Section 2(c) ends at 12:01 a.m. on Wednesday, June 14, whether or not any courts have enjoined its implementation in the interim.\n\nBut I am not so sure. I am inclined to think that Possibility Three and Possibility Two are both plausible, and that Possibility Three is probably the most natural interpretation of the order. Here’s that reading:\n\nThe order’s effective date is March 16. Section 2(c) of the order says that entry of designated nationals will “be suspended for 90 days from the effective date of this order.” Normally, that would result in the order lasting for 90 days, because a 90-day suspension normally takes 90 days. But because the relevant parts of the order have been preempted by a federal court judgment, it will take longer than 90 calendar days for the 90-day suspension to run. Or to put it more simply: The order will last until it has done what it says it is going to do, namely suspend entry for 90 days.\n\nI think Marty’s reading would be much stronger if the order contained an explicit expiration date of “June 14.” And it would be at least somewhat stronger, if not as much, if the order said something like “this order shall expire 90 days after its effective date.” But the order doesn’t quite do either of these things. Instead it announces that entry is suspended for 90 days, and so it is most natural to think that the order expires when entry has indeed been suspended for 90 days. No suspension, no expiration.\n\nNow, Marty is also quite right to point out that the United States seems to have implicitly taken his position in at least one legal filing. But until we know more, I am not convinced that is dispositive, because it doesn’t seem to be the United States’ position now, and I doubt that the filing satisfies the requirements for something like judicial estoppel. I’m not positive about any of that, but it isn’t obvious to me that the cases will all become moot in 12 days.\n\nFinally, one other set of things that puzzles me, apart from the best reading of the order, is what kind of standards apply to this mootness question:\n\nShould we think of this as a question of textual interpretation, analogous to interpretation of an agency regulation? And if so, does an analogy to Auer deference apply, giving the president’s deference as to the meaning of his own order?\n\nIs this more like a “voluntary cessation” case, where the question is whether it is “absolutely clear” that the suspension “could not reasonably be expected to recur” after June 14?\n\nOr is the order itself a distraction for purposes of justiciability? Perhaps the real mootness question is whether the United States keeps asserting its willingness to block entry after June 14, order or no order. On this view, Marty’s textual analysis of the order might be relevant to the lawfulness of that executive action under Section 212(f) of the INA, without controlling the justiciability question.\n\nI suspect we’ll see further briefing on this question, and perhaps the court will simply add this mootness question to the case if it hears argument in the fall.", "authors": [], "publish_date": "2017-06-02", "source": "washingtonpost", "top_words": ["travel", "ban", "moot", "cases", "days", "date", "possibility", "orders", "united", "entry", "order", "90", "effective"], "summary": "But commentators such as Marty Lederman and Mark Tushnet have suggested that the case either will soon be moot, or could be made moot without the entry ban ever going into effect.\nPossibility Two: The order’s “effective date” has been delayed by the court orders preventing it from going to effect.\nThe order will become moot 90 days after it goes into effect, so the order will not become moot as long as it is stayed.\nThe upshot is the same as in Possibility Two: The order will not become moot as long as the entry ban is stayed.\nHere’s that reading:The order’s effective date is March 16."}