{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/06/04/world-leaders-call-for-unity-after-london-attack-trump-tweets-the-complete-opposite/", "id": "299", "title": "World leaders call for unity after London attack. Trump tweets the complete opposite.", "text": "Three men in a speeding van mowed down pedestrians on London Bridge before getting out and stabbing patrons at nearby bars and restaurants on June 3. (The Washington Post)\n\nIn the early confusion of Saturday's attack in London, as police urged people not to spread rumors, those world leaders who did speak out early were largely circumspect. Restrained. Sympathetic.\n\n“My thoughts go out to the victims and their loved ones,” French President Emmanuel Macron said on Twitter. “Awful news,” wrote Canadian Prime Minister Justin Trudeau the same evening, adding, “We're monitoring the situation.”\n\nAnd then there was President Trump.\n\nBefore London police or anyone else had announced that the attack was linked to terrorism — the president of the United States retweeted an unsourced blurb from Drudge.com: “Fears of new terror attack after van 'mows down 20 people' on London Bridge.”\n\nLondon authorities at that point had confirmed only a few details. Shortly after the Drudge tweet, British police again warned against spreading unconfirmed information.\n\nKeep following this Twitter feed. We will release facts when we can - our info must be accurate — Metropolitan Police (@metpoliceuk) June 3, 2017\n\nFifteen minutes later, Trump issued his second tweet since the attack — promoting his administration's legally embattled “travel ban,” which hinders people from several Muslim-majority countries from entering the United States.\n\nWe need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety! — Donald J. Trump (@realDonaldTrump) June 3, 2017\n\nAs Philip Bump noted for The Washington Post, Trump tends to rush to weigh in on attacks connected to Islamist terrorism but is “remarkably late” in responding to others that are not.\n\nRepublicans and Democrats on June 4 commented on President Trump's tweets calling for a travel ban and criticizing the mayor of London after an attack in Britain's capital left seven people dead the day before. (Bastien Inzaurralde/The Washington Post)\n\n[London attack toll rises to 7 dead as Theresa May insists ‘things need to change’]\n\nBut at that point in the evening (and even by Sunday morning), London authorities had not released any information on the identities, ethnicities or nationalities of the suspects in the attack.\n\nTrump's final tweet of Saturday night was more in line with early statements from other world leaders — a show of unity and support.\n\nWhatever the United States can do to help out in London and the U. K., we will be there - WE ARE WITH YOU. GOD BLESS! — Donald J. Trump (@realDonaldTrump) June 3, 2017\n\nOne minute after he sent it, British authorities declared the attack to be a terrorist incident.\n\nOvernight, as Americans slept, leaders in Britain and around the world issued statements of condemnation.\n\nOn London Mayor Sadiq Khan's Twitter account, which had deferred to police in the early minutes of the attack, the mayor urged “all Londoners to remain calm and vigilant today and in the days ahead” and vowed that terrorists would not cow his city.\n\nOn the BBC, Khan also told Londoners to expect a heavy police presence in the days ahead. “No need to be alarmed,” he said. “One of the things the police, all of us, need to do is make sure we're as safe as we possibly can be.”\n\nIn Trump's first two tweets of the morning, he attacked political correctness — then quoted a fragment of Khan's statement to essentially upbraid the elected leader of a wounded city.\n\nWe must stop being politically correct and get down to the business of security for our people. If we don't get smart it will only get worse — Donald J. Trump (@realDonaldTrump) June 4, 2017\n\nAt least 7 dead and 48 wounded in terror attack and Mayor of London says there is \"no reason to be alarmed!\" — Donald J. Trump (@realDonaldTrump) June 4, 2017\n\nA spokesman for Khan later responded that the mayor “has more important things to do than respond to Donald Trump's ill-informed tweet that deliberately takes out of context his remarks.”\n\nThe president let 15 more minutes go by before he tweeted again. By now, many world leaders had spoken out on the attack. German Chancellor Angela Merkel had joined Britain in “horror and mourning,” and vowed to aid in the fight against terrorism. British Prime Minister Theresa May had laid out details of the attack that had been confirmed, along with her plan to prevent more like it.\n\nAt 7:43 a.m., Trump cited the attack to ridicule gun control.\n\nDo you notice we are not having a gun debate right now? That's because they used knives and a truck! — Donald J. Trump (@realDonaldTrump) June 4, 2017\n\nEven as authorities hunted for suspects in Britain on Sunday morning, a spat raged on Internet over whether Trump's tweets had been reckless and offensive or prescient and bold.\n\nThe president's critics made much of the NBC Nightly News's refusal to cite Trump's early retweet suggesting the attack was terrorism.\n\nPres. Trump has used Twitter to share news report on London incident. We aren't relaying president's retweet, as the info is unconfirmed. — NBC Nightly News (@NBCNightlyNews) June 3, 2017\n\nEvery single American should be embarrassed that a news organization had to issue this statement about the President of the United States. https://t.co/VU39uNxZxJ — Matt McDermott (@mattmfm) June 3, 2017\n\n\"Translation,\" CNN host Reza Aslan wrote about NBC's disclaimer: \"The president is a man baby that must be ignored in times of crisis.\"\n\nNoting that Trump had received an intelligence briefing minutes after the attack, the Guardian wondered if whatever he learned influenced his decision to retweet Drudge's speculation. The publication also noted that it was unclear whether the briefing had occurred before Trump's retweet.\n\nTrump-friendly websites, meanwhile, focused on the fact that later that evening, Drudge turned out to be right.\n\n\"CNN Host Reza Aslan Calls Trump ‘Piece of S---’ for Correctly Identifying London Terror Attack,\" Breitbart wrote, for example.\n\nBut nearly all of Trump's London tweets drew outrage from someone.\n\n\"Political point scoring is the absolute, LAST thing we need right now,\" a British barrister wrote Saturday, for example — after Trump promoted his executive orders banning visitors from Muslim-majority countries. Even the European Union's top security official called out the president.\n\nThere's every reason to stand together in defence of our values - you don't do that by spreading alarm https://t.co/kMnCbouJrg — Julian King (@JKingEU) June 4, 2017\n\nAnd the president's criticism of Khan, London's mayor, instigated a sort of flame war between British and American leaders — with Khan's spokesman and Trump's social-media director sparring as proxies for their bosses.\n\nSadiq Khan has \"more important things to do\" than respond to Trump's tweets, says an aide pic.twitter.com/COH4kxikfM — Matt Chorley (@MattChorley) June 4, 2017\n\n.@MayorofLondon- refer to below tweet 13 months ago, after you criticized ... now President @realDonaldTrump --- and WAKE UP!!!! https://t.co/RzGOHny37L — Dan Scavino Jr. (@Scavino45) June 4, 2017\n\n1 of 39 Full Screen Autoplay Close Skip Ad × Britain probes attack in central London that left 7 dead and dozens injured View Photos London Bridge and nearby Borough Market were the site of chaos after a van plowed into pedestrians and attackers with knives went into the crowd. At least 12 suspects have been arrested. Caption London Bridge and nearby Borough Market were the site of chaos after a van plowed into pedestrians and attackers with knives went into the crowd. At least 12 suspects have been arrested. June 5, 2017 People attend a vigil at Potters Field Park in London to remember the victims of the attack on London Bridge and Borough Market. Hannah Mckay/Reuters Buy Photo Wait 1 second to continue.\n\nRead more:\n\n‘London Bridge will never fall down’\n\nAnalysis: A terrorist attack in London and the all-too-familiar response", "authors": [], "publish_date": "2017-06-04", "source": "washingtonpost", "top_words": ["unity", "world", "trump", "tweets", "donald", "trumps", "london", "opposite", "complete", "need", "realdonaldtrump", "mayor", "leaders", "president", "attack"], "summary": "“Awful news,” wrote Canadian Prime Minister Justin Trudeau the same evening, adding, “We're monitoring the situation.”And then there was President Trump.\n— Donald J. Trump (@realDonaldTrump) June 3, 2017One minute after he sent it, British authorities declared the attack to be a terrorist incident.\nBut nearly all of Trump's London tweets drew outrage from someone.\nSadiq Khan has \"more important things to do\" than respond to Trump's tweets, says an aide pic.twitter.com/COH4kxikfM — Matt Chorley (@MattChorley) June 4, 2017.\n@MayorofLondon- refer to below tweet 13 months ago, after you criticized ... now President @realDonaldTrump --- and WAKE UP!!!!"}