{"url": "https://www.washingtonpost.com/news/soccer-insider/wp/2017/02/02/u-s-soccer-coach-bruce-arena-on-trumps-travel-ban-i-think-its-sad/", "id": "206", "title": "U.S. Soccer Coach Bruce Arena on Trump’s travel ban: ‘It’s sad’", "text": "CHATTANOOGA, Tenn. — Bruce Arena, who just began his second tenure in charge of the U.S. men’s national soccer team, became the latest high-profile coach to criticize President Trump’s executive order temporarily barring refugees and others seeking U.S. entry from seven predominantly Muslim countries.\n\n[Explaining Trump’s travel ban]\n\n“I think it’s sad because one thing we do in our sport is that we are a global sport,” he said during a wide-ranging interview Thursday. “We travel the world. We meet all kinds of people. And we conclude at the end that they are all beautiful people.\n\n“We have bad people in the world, we have bad people in our country, but clearly a large majority of people are good. It’s fabulous when we can give them an opportunity to be part of our country.”\n\nArena’s comments come after NBA coaches Steve Kerr and Gregg Popovich spoke out against the White House decisions.\n\n[Cuban on NBA protests of Trump order: ‘It’s country first, basketball second’]\n\nArena, 65, worked at the University of Virginia from 1978 to 1995 and is the most successful coach in the history of both the U.S. men’s program and Major League Soccer. In his second U.S. stint, which began in December, he will attempt to resurrect the Americans’ hopes of qualifying for the 2018 World Cup in Russia after a pair of defeats under his predecessor, Jurgen Klinsmann.\n\nDuring his first tour, which started in late 1998 and lasted almost eight years, Arena took the U.S. team to 22 countries, including Russia and Morocco.\n\n“I don’t think too many Americans would agree with banning Muslims, nor any other group of people based on religion or race,” said Arena, whose grandparents emigrated from Italy. “But there are some that believe that’s what we should be doing.”\n\nIn the latest Gallup poll, 55 percent of those interviewed disapprove of Trump’s temporary ban of entry for most people from the seven affected countries. Fifty-eight percent disapprove of the indefinite suspension of the Syrian refugee program.\n\nThe executive orders have been a topic of discussion among more than two-dozen U.S. players who have been together for the past three weeks.\n\n“It’s been a topic of discussion in our country. Our guys are not immune from the news,” Arena said. “They know what’s going on. I don’t think it’s the first thing they talk about, but it’s certainly an issue. I don’t think there’s one person on our team that thinks a ban on Muslims or any other group is right.”\n\n[Soccer has never known borders. Trump’s travel ban could change that.]\n\nCaptain Michael Bradley was the first to express himself, writing on Instagram last week that he was “sad and embarrassed” about the restrictions.\n\nHe also wrote “When Trump was elected, I only hoped [he] would be different than the campaigner. That the xenophobic, misogynistic and narcissistic rhetoric would be replaced by a more humble and measured approach to leading our country. I was wrong.”\n\nA post shared by Michael Bradley (@michaelbr4dley) on Jan 28, 2017 at 11:02pm PST\n\nAfter Sunday’s friendly against Serbia in San Diego, several other players spoke out.\n\nThe Americans will close their winter camp Friday against Jamaica at Chattanooga’s Finley Stadium, the final test before World Cup qualifying resumes in late March with critical matches against Honduras at San Jose’s Avaya Stadium and at Panama.\n\nArena said about half of the 26 players he plans to summon for the qualifiers will come from the current camp, which, with one exception, had an all-MLS makeup. Many regulars were unavailable for winter workouts because of in-season commitments in European and Mexican leagues.\n\nAmong the newer batch of candidates, Arena cited midfielders Darlington Nagbe and Sebastian Lletget, goalkeeper Nick Rimando, forward Jordan Morris and defender Jorge Villafaña as showing well in training camp.\n\nHe said Rimando, Real Salt Lake’s 37-year-old starter, is likely to join English-based Brad Guzan in the three-man keeper corps for the qualifiers. “He can still be a guy you can count on.”\n\nThe other goalkeeping slot remains unclear: Tim Howard is coming back from groin surgery, while Belgian-based Ethan Horvath, Mexican-based William Yarbrough and multiple MLS figures are in the mix.\n\nTime is running short on Geoff Cameron, the Premier League defender sidelined since October with a knee injury. He spent some time in U.S. camp for evaluation purposes when the players first reported to StubHub Center in Carson, Calif., last month.\n\n“We haven’t ruled him out yet,” Arena said. The absence of competitive action soon, however, would end Cameron’s hopes for the March matches. “I imagine,” Arena said sarcastically, “that would be a prerequisite before a World Cup qualifier that you’ve played soccer recently.”\n\nReviewing the camp at large, Arena said the time together, albeit without a complete group, has been beneficial.\n\n“I’ve gotten to know the players. I’ve known them from a distance but now I get to know them up close. That helps build the roster for March, which is basically the point of this camp.”", "authors": [], "publish_date": "2017-02-02", "source": "washingtonpost", "top_words": ["travel", "camp", "sad", "bruce", "world", "ban", "players", "soccer", "think", "trumps", "country", "arena", "coach", "team"], "summary": "CHATTANOOGA, Tenn. — Bruce Arena, who just began his second tenure in charge of the U.S. men’s national soccer team, became the latest high-profile coach to criticize President Trump’s executive order temporarily barring refugees and others seeking U.S. entry from seven predominantly Muslim countries.\n[Explaining Trump’s travel ban]“I think it’s sad because one thing we do in our sport is that we are a global sport,” he said during a wide-ranging interview Thursday.\n“We travel the world.\n“We have bad people in the world, we have bad people in our country, but clearly a large majority of people are good.\nTrump’s travel ban could change that.]"}