{"url": "https://www.washingtonpost.com/blogs/right-turn/wp/2017/03/16/trump-loses-again-on-muslim-ban-and-then-makes-it-worse/", "id": "275", "title": "Trump loses again on Muslim ban — and then makes it worse", "text": "The Post's Matt Zapotosky explains why a federal judge in Hawaii on March 15 ruled to freeze President Trump's second travel ban hours before it went into effect. (Bastien Inzaurralde/The Washington Post)\n\nPresident Trump suffered yet another loss on his Muslim ban when a district court in Hawaii issued an injunction preventing the second version of his executive order from going into effect. The Post reports:\n\nIn a blistering 43-page opinion, U.S. District Judge Derrick K. Watson pointed to Trump’s own comments and those of his close advisers as evidence that his order was meant to discriminate against Muslims and declared there was a “strong likelihood of success” that those suing would prove the directive violated the Constitution. Watson declared that “a reasonable, objective observer — enlightened by the specific historical context, contemporaneous public statements, and specific sequence of events leading to its issuance — would conclude that the Executive Order was issued with a purpose to disfavor a particular religion.”\n\n[Why is the Trump presidency such a rolling disaster?]\n\nThe court found that the state of Hawaii had established “standing” to bring the suit by showing injury to the state university system and lost revenue from tourism. (The individual plaintiff, a doctor of Egyptian descent, was also found to have satisfied the standing requirement insofar as he would not be able to obtain a visa for his mother-in-law.) In finding the ban violated the establishment clause, the court found “significant and unrebutted evidence of religious animus.” As it did in the Washington state case regarding the first ban, the court relied on Trump’s and Stephen Miller’s as well as adviser Rudy Giuliani’s own words to prove the motive was to exclude Muslims. The court allowed that Trump’s words did not necessarily “forever taint” national-security-related executive orders — but Trump’s latest utterance certainly does not help his cause.\n\nTrump and the ban defenders claimed once again that this was egregious overreach. “I think you can make a credible legal argument on both sides — both that the president has the authority to regulate immigration in this manner and that the way he has done so is discriminatory,” Matthew Miller, Justice Department spokesman during the Obama administration, told me. “And in a situation like this, judges look at what actually is happening and they know it isn’t on the level. They can tell from the president’s statements during the campaign and up until even today … that his intent was to institute a Muslim ban.”\n\nAnd then as if to underscore the judge’s point, Trump at a rally in Tennessee later Wednesday evening declared that this was just a “watered-down version” of the first ban. His lawyers should have their hands full explaining that, if they choose to appeal the ruling.\n\nOmar Jadwat, senior staff attorney with the ACLU’s Immigrants’ Rights Project, put out a statement Wednesday night in response to the decision. “The Constitution has once again put the brakes on President Trump’s disgraceful and discriminatory ban,” he said. “We are pleased but not surprised by this latest development and will continue working to ensure the Muslim ban never takes effect.”\n\n[What if every Republican started telling Trump that he is wrong?]\n\nSen. Benjamin L. Cardin (D-Md.), ranking member of the Senate Foreign Relations Committee, recognized that the decision came on the anniversary of the outbreak of the Syrian civil war. (“Today in the Senate Foreign Relations Committee, we marked the 6th anniversary of the brutal conflict in Syria in part by recognizing its toll on innocent civilians and acknowledging some of the Syrian refugees who have been resettled in communities in Maryland.”) Applauding the court’s decision, he lambasted the president’s approach: “President Trump still does not understand that our diversity makes us stronger as a country, not weaker. I urge the president to rescind his discriminatory executive orders targeting Muslim refugees and travelers. After more than two strikes against his travel ban, perhaps he now understands that the most effective route to keep our nation safe is to work with Congress on comprehensive immigration reform rather than continuing to damage our relationship with much of the world.”\n\nAt this point, one also has to question why the ban is needed at all. The stated purpose was to give the administration time to review current procedures and come up with “extreme vetting” procedures to protect against jihadists seeking to enter the United States, but where is the evidence that the review cannot be conducted without the ban? Trump moreover has had more than 50 days since taking office to conduct his review. One would think by now that review could be well underway. Miller agrees that it’s “been a month and a half since their initial three month ban was announced, but in that time, they apparently haven’t completed much of a review or they would have included updated information in the new ban. The only change in this regard was to delete Iraq, which had more to do with lobbying than substance.” (And there has never been any rationale for freezing entry of refugees, who undergo 18-24 months of vetting.)\n\nIndeed, the sole reason for the ban, as the court recognized, is to fulfill a xenophobic and Islamophobic campaign promise that fed Trump supporters’ fears and prejudices. The federal courts have determined, now multiple times, that he cannot do so. Maybe it is time to move on.", "authors": [], "publish_date": "2017-03-16", "source": "washingtonpost", "top_words": ["executive", "trump", "ban", "state", "makes", "worse", "court", "president", "trumps", "review", "refugees", "muslim", "loses"], "summary": "The Post's Matt Zapotosky explains why a federal judge in Hawaii on March 15 ruled to freeze President Trump's second travel ban hours before it went into effect.\n(Bastien Inzaurralde/The Washington Post)President Trump suffered yet another loss on his Muslim ban when a district court in Hawaii issued an injunction preventing the second version of his executive order from going into effect.\n“The Constitution has once again put the brakes on President Trump’s disgraceful and discriminatory ban,” he said.\n“We are pleased but not surprised by this latest development and will continue working to ensure the Muslim ban never takes effect.”[What if every Republican started telling Trump that he is wrong?]\nI urge the president to rescind his discriminatory executive orders targeting Muslim refugees and travelers."}