{"url": "https://www.washingtonpost.com/local/were-the-good-guys-lawyers-continue-airport-campouts-amid-trump-travel-ban/2017/02/03/7503dd94-e957-11e6-bf6f-301b6b443624_story.html", "id": "230", "title": "‘We’re the good guys’: Lawyers continue airport campouts amid Trump travel ban", "text": "International trade lawyers Deborah Wei and Sean Carlesimo chat as they wait to lend their legal assistance at the international arrivals area at Dulles International Airport on Feb. 1. (Ricky Carioti/The Washington Post)\n\nClaire Murphy saw the call go out on Twitter last Saturday, just after hearing about lawyers flocking to New York’s John F. Kennedy Airport to offer free legal aid amid reports that some arriving international travelers were being detained.\n\nLawyers were needed at Washington’s Dulles International Airport, too, the tweet said. Murphy, who usually works on legal transactions involving railroad equipment, scrapped her Saturday night plans and drove an hour to the airport in Northern Virginia. As she entered the international arrivals area about 10 p.m., she recalled, she felt a rush of pride.\n\nSeveral dozen lawyers were already there, pressing for access to an estimated 50 to 60 airline passengers being detained under President Trump’s new executive order temporarily banning citizens of seven majority-Muslim countries from entering the United States. Protesters had been chanting “Let them in!” as Customs and Border Protection officials refused to allow lawyers into the closed-door screening area, despite a federal court order issued that evening.\n\n(At a federal court hearing Friday, Erez Reuveni, an attorney from the Justice Department’s Office of Immigration Litigation, said security at Dulles bars lawyers from anything other than telephone access to people in screening. )\n\n[Government reveals more than 100,000 visas revoked due to travel ban]\n\nFamily lawyer Dana Rubin sits at the Dulles Justice Coalition table waiting to lend assistance to any international travelers who need help at Dulles Airport on Feb. 1. (Ricky Carioti/The Washington Post)\n\n“Seeing how many lawyers were here, I thought, ‘I don’t want to ever hear another lawyer joke,’ ” Murphy, 27, said a few days later. “I’m just really proud that lawyers were the people who showed up.”\n\nMurphy and dozens of other lawyers haven’t left Dulles much since.\n\n[Hundreds of lawyers descend on U.S. airports to offer free help]\n\nIn a profession often ranked among the most despised, the lawyers say it’s a welcome change to be viewed, at least by those who oppose Trump’s ban, as the good guys. While the American Bar Association recommends that lawyers provide at least 50 hours of free legal aid every year and many do much more, some of those at Dulles say rarely does pro bono work feel so immediate and public, let alone have international implications.\n\nA week after Trump signed the executive order, about a dozen lawyers remain on hand at Dulles from early morning to late night, many working in five-hour shifts. Most say they are there to protect travelers’ legal rights more than out of political protest, though many say they find the presidential order immoral.\n\nOn Friday, a federal judge in Washington state temporarily blocked enforcement of the order, though the practical implications of the ruling were unclear.\n\nMore than 1,200 lawyers, interpreters and other volunteers have signed up to assist with the newly formed Dulles Justice Coalition. The Capital Area Immigrants’ Rights Coalition, which has its own immigration lawyers staffing another table at the airport about 12 hours a day, estimates that more than 100 lawyers and interpreters have volunteered there since Saturday.\n\nPeople welcome arriving passengers at Dulles International Airport on Jan. 28, the day the executive order went into effect. (Astrid Riecken/For The Washington Post)\n\nIn addition to JFK and Dulles, lawyers are monitoring passengers arriving in Los Angeles, Boston and other international airports.\n\nThey are continuing to look for travelers who report being detained or mistreated during the entry process. The passengers’ reports, they said, could be used to support lawsuits and other kinds of legal pressure. They are also answering fearful questions.\n\nAt Dulles on Wednesday, an Iranian American man stopped by the Dulles Justice Coalition’s table near a luggage carousel.\n\n“I’m a U.S. citizen, but I’m going to the Dominican Republic on Monday,” the man said with a heavy accent. “Should I be worried about anything?”\n\nSome of the lawyers sit at collapsible plastic tables, tapping away on laptops amid boxes of donated yellow legal pads, pens and other office supplies. Someone hooked up a printer.\n\n“We went from a big group of lawyers trying to help, to a fully outfitted, pop-up legal clinic,” Murphy said.\n\nThey scan travel apps on their smartphones, searching for flights arriving from Saudi Arabia, Qatar, Dubai and European cities that are common transfer points from the Middle East and Africa. Some planes carry hundreds of passengers. They keep tabs on two airport monitors, one showing when international flights have landed and the other showing which ones are in customs.\n\nThey eye the crowd in the international arrivals area for anxious looking relatives and ask attendants pushing wheelchairs from the screening area if they’ve seen anyone who appeared stuck.\n\n[Members of Congress press for details about passengers being held]\n\nFor most, the work is a far cry from their typical days of tending to well-heeled corporate clients or scrutinizing government regulations. Some arrive in conservative suits and dresses, on loan from white-shoe Washington law firms. Most are not immigration lawyers but say they all know constitutional law and how to ask questions, do legal research and gather potential evidence.\n\nDay shifts are often filled by lawyers who are between jobs or on a career break to care for children, while those with office jobs often come in the evenings. Some are squeezing in their regular work at home or during lulls in flight arrivals. Many are donating time that they would typically bill to clients at $300 to $700 per hour. Some are children of immigrants or are themselves green-card holders.\n\nBy 2 p.m., Dulles’s international area is a near-constant parade of arriving travelers, many bleary-eyed from overnight flights and trips that in some cases have spanned 20 hours or longer.\n\nOn Wednesday, Kaitlin Welborn, 30, of the District held up a sign to passersby that read, “Free legal help. Tell us if somebody is being held!” Below it, the message was repeated in Arabic.\n\n“What flight were you on?” Welborn asked as travelers filed past.\n\nNext to her, Sam Dietle, 26, of Sterling, Va., asked, “How was customs?” as a man shrugged and said, “No big deal.”\n\nThey said their firm, Hogan Lovells, was sending lawyers to Dulles daily in three five-hour shifts.\n\n“We feel kind of like the paparazzi standing here asking people to talk to us,” Dietle said with a laugh.\n\nWelborn said she had come because it felt right. “Yeah, we are the good guys,” she said. “Sam and I were talking in the car on the way here, about how we’re proud that it will be the lawyers who will be the ones fighting on the front lines.”\n\nDietle, who usually advises food companies on government regulations, said she also had personal reasons. Her grandparents fled Cuba during the revolution, she said, and she converted to Islam six years ago. She is also worried about her Moroccan-born husband, even though he has dual U.S. citizenship.\n\n“I just think there are a lot of misconceptions about Muslims in this country,” she said.\n\nLawyers say Customs and Border Protection officials have reported that no one has been “detained” at Dulles since Sunday, when a Syrian woman who had been held overnight was released. Attorneys for two Yemeni brothers who were sent back on a return flight to Ethiopia last Saturday allege in a lawsuit that customs officials denied lawyers access to passengers at Dulles by saying they were in “processing,” not “detention.”\n\nBabak Akhlaghi, 37, took Wednesday morning off from his intellectual property law practice to linger around the Dulles arrivals area. As an Iranian who has lived in the United States for 20 years, he said that he’s particularly concerned about lawful permanent residents like him facing scrutiny that he believes the U.S. Constitution does not allow.\n\nHe’s planning to take his 2-year-old son, a U.S. citizen, to Dubai in two weeks to visit his brother and parents. What if, he asked, his toddler is allowed back into the United States and he isn’t?\n\n“When something makes you not sleep at night,” Akhlaghi said, “you have to do something.”\n\nAs of Thursday, lawyers said, they still had little concrete information from anyone in an official capacity at Dulles. The number of passengers reporting being held for more than two or so hours had dwindled to a few, and most with green cards said they hadn’t had any problems.\n\nEven so, the lawyers said, they’re still hearing stories they find troubling, including an Afghan family held for four hours on Tuesday and a Moroccan man with dual U.S. citizenship who said Tuesday that an officer required him to relinquish his cellphone for 10 minutes. Lawyers say they assume agents are checking some travelers’ Twitter, Facebook and other social media accounts.\n\nThe lawyers say they don’t know how long they’ll continue to camp out at Dulles. They are beginning to streamline operations, and more people have begun doing research and other work off site. Their airport presence, they say, probably will depend on what they continue to hear from passengers and whether the executive order is expanded.\n\nOn Wednesday, Fezan Rizvi and his wife, Sana, were anxiously awaiting the arrival of Sana’s mother. She had left for Pakistan last week to visit her older brother. On Sunday, the couple called to ask that she return home as soon as possible because of the order. Fezan Rizvi said they were worried she might have trouble getting back into the United States, even though she lives with them, she has had a green card since 2004 and Pakistan isn’t on the list of seven countries.\n\n“It’s a good feeling,” Fezan Rizvi, a psychiatrist who lives in Loudoun County, said as he nodded toward a half-dozen sign-holding lawyers amid the crowd. “If you have any questions, they’re right there, and it’s pro bono. That feels like America.”", "authors": [], "publish_date": "2017-02-03", "source": "washingtonpost", "top_words": ["passengers", "travel", "airport", "lawyers", "trump", "good", "ban", "campouts", "amid", "international", "area", "travelers", "say", "continue", "order", "dulles", "guys", "legal"], "summary": "International trade lawyers Deborah Wei and Sean Carlesimo chat as they wait to lend their legal assistance at the international arrivals area at Dulles International Airport on Feb. 1.\nLawyers were needed at Washington’s Dulles International Airport, too, the tweet said.\n[Hundreds of lawyers descend on U.S. airports to offer free help]In a profession often ranked among the most despised, the lawyers say it’s a welcome change to be viewed, at least by those who oppose Trump’s ban, as the good guys.\nPeople welcome arriving passengers at Dulles International Airport on Jan. 28, the day the executive order went into effect.\nThe lawyers say they don’t know how long they’ll continue to camp out at Dulles."}