{"url": "https://www.washingtonpost.com/politics/courts_law/trump-is-expected-to-visit-supreme-court-this-week-but-not-to-discuss-travel-ban/2017/06/14/00f874b2-5137-11e7-be25-3a519335381c_story.html", "id": "214", "title": "Trump is expected to visit Supreme Court this week, but not to discuss travel ban", "text": "The justices pose for a portrait in the east conference room of the building of the Supreme Court. (Matt McClain/The Washington Post)\n\nPresident Trump is expected to pay his first visit to the Supreme Court on Thursday. His words and actions precede him.\n\nTrump’s planned drop-by for the official investiture of Justice Neil M. Gorsuch comes as the president’s lawyers make almost daily filings with the justices in an attempt to revive his ban on refugees and travelers from six mostly Muslim countries.\n\n[Trump turns to Supreme Court on travel ban]\n\nThe court could decide by next week whether to allow Trump’s executive order to go into effect or follow the lead of lower courts that have stopped the order because they say it exceeds the president’s authority and discriminates unconstitutionally.\n\nIt’s unlikely the high-stakes legal maneuvering will be mentioned Thursday, nor Trump’s blasts at the federal judiciary in general and some of the justices specifically.\n\nTrump has called Chief Justice John G. Roberts Jr. “an absolute disaster” for conservatives. After Justice Ruth Bader Ginsburg in interviews last summer called Trump a “faker” and said she feared for the country if he were elected, Trump responded by saying that “her mind is shot” and that she should retire.\n\nSince then, Roberts administered the oath of office to Trump on Inauguration Day, and all of the justices attended a Rose Garden ceremony after the Senate confirmed Gorsuch’s nomination.\n\nDifferences traditionally are put aside for a new justice’s investiture, a short but formal and history-laden event that culminates in iconic photos of the chief justice and the new justice descending the Supreme Court’s famous marble steps. Gorsuch actually joined the court April 10 and earlier this week delivered his first opinion.\n\n[Kagan officially sworn in, says she is “set” for new term]\n\nAt the last investiture ceremony in 2010, for his nominee Elena Kagan, President Barack Obama mingled beforehand with the justices he had criticized in his previous State of the Union address for their decision in Citizens United v. Federal Election Commission.\n\n“You’re always welcome here,” the chief justice told the president during the ceremony.\n\nBut it is rare for the court and the president to get together when such an important executive branch priority is pending.\n\nTrump signed his first executive order imposing a travel ban just after he was inaugurated in January. It was struck down by a judge in Washington state, and that decision was affirmed by the U.S. Court of Appeals for the 9th Circuit.\n\nEven though Trump vowed to take his initial ban to the Supreme Court then, his administration instead issued in March what Trump later tweeted was a “watered-down” version.\n\nThe revised ban suspends travel from six predominantly Muslim countries for 90 days to give the administration time to conduct a review of whether proper vetting procedures are in place to ensure travelers are not a threat to national security.\n\nThe order also suspends the nation’s refu­gee program for 120 days and imposes a new limit on the number of refugees accepted.\n\nA three-judge panel of the 9th Circuit just this week upheld the decision of a federal judge in Hawaii to keep that executive order from going into effect. The judges said that Congress had given the president great power in immigration decisions but that Trump had not shown national security warranted the actions he had taken.\n\n[Appeals court keeps freeze on travel ban in place]\n\nThe U.S. Court of Appeals for the 4th Circuit, meanwhile, said banning travelers from the six countries was really just a way for Trump to make good on his campaign promise of a ban on Muslims. That was an unconstitutional form of discrimination, the court said in a 10-to-3 ruling.\n\nThe Supreme Court is now being asked to lift the stays and accept the case for oral argument. The court granted the administration’s request that briefing on the issue be extended to June 21.\n\nBut the court is scheduled to end its term June 26, so that would seem to mean even if the court accepted the case, it would not be scheduled for argument until the fall.\n\nSteve Vladeck, a University of Texas law professor who has closely followed the litigation, said the proposal is “not the kind of move you’d expect from a government in a hurry.”\n\nThe pause on immigration was supposed to be only so the administration could ensure proper vetting procedures were in place. The 9th Circuit opinion said the administration was free to undertake that study but without the travel ban.\n\nThat lessens the government’s need to lift the stays, Vladeck said, unless the real objective of the executive order is to block travelers, rather than to ensure the proper vetting procedures are in place.\n\nAbby Phillip contributed to this report.", "authors": [], "publish_date": "2017-06-14", "source": "washingtonpost", "top_words": ["executive", "travel", "trump", "ban", "supreme", "justice", "travelers", "visit", "discuss", "week", "court", "expected", "order", "justices"], "summary": "The justices pose for a portrait in the east conference room of the building of the Supreme Court.\n(Matt McClain/The Washington Post)President Trump is expected to pay his first visit to the Supreme Court on Thursday.\nTrump signed his first executive order imposing a travel ban just after he was inaugurated in January.\nThe Supreme Court is now being asked to lift the stays and accept the case for oral argument.\nThe 9th Circuit opinion said the administration was free to undertake that study but without the travel ban."}