{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/01/30/how-president-trump-turns-a-reasonably-popular-policy-into-a-mess/", "id": "290", "title": "How President Trump turns a reasonably popular policy into a mess", "text": "\n\nDonald Trump speaks to reporters after his meeting with television personality Steve Harvey at Trump Tower, Jan. 13, 2017, in New York City. (Photo by Drew Angerer/Getty Images)\n\nWhen President Trump signed an executive order Friday temporarily barring residents of seven countries from entry to the United States, he was doing something that shouldn't have been hugely controversial.\n\nA poll earlier this month, in fact, showed that about half of Americans liked the idea — at least in its broad strokes. The Quinnipiac poll showed that 48 percent supported \"suspending immigration from 'terror prone' regions, even if it means turning away refugees from those regions.\" Fewer — 42 percent — opposed it.\n\nAnd yet here we are, with plenty of Republicans revolting over the travel ban and the Trump administration having to play all kinds of defense.\n\nThe situation is a near-perfect example of Trump's penchant for turning political molehills into mountains and flat land into molehills. Through a combination of Trump's controversial rhetoric, a lack of thorough preparation and a frenzied implementation, he's turned a policy that Republicans support by a margin of 72 to 17 percent into something dozens of Republican members of Congress cannot support.\n\nI know we all like to search for Trump's secret political genius in stuff like this, but that's called an unforced error.\n\nTrump's team will undoubtedly ascribe this resistance to the media's coverage of the travel ban, which they say has been unfairly cast as a ban on all Muslims. That idea, of course, originated with Trump himself back in December 2015, and his rhetoric in the intervening months makes his banning of travel from seven predominantly Muslim countries very difficult to completely divorce from that early proposal.\n\nWhite House press secretary Sean Spicer addressed the media on Jan. 30, three days after President Trump signed an executive order halting the flow of refugees to the United States. (Peter Stevenson/The Washington Post)\n\nAnd the more that debate wears on, the worse it is for Trump. A Washington Post-ABC News poll in mid-January showed that, by a 2-to-1 margin, Americans opposed \"banning most Muslims who are not U.S. citizens from entering the United States.\" In other words, insofar as this is viewed as a Muslim ban, it's unpopular. Insofar as it's viewed as focusing on terror-prone countries, it's on firmer ground. Which is why its defenders are so adamant on this point.\n\nBut here's the key: While the Democratic opposition is focused on the religious implications of the executive order, that's not really what Republicans are worried about. Most GOP critics aren't citing the appearance of a religious test; they're talking about implementation and the lack of a heads-up.\n\n\"You have an extreme vetting proposal that didn't get the vetting it should have had,\" Sen. Rob Portman (R-Ohio) said.\n\nSen. Jerry Moran (R-Kan.) — a perhaps unlikely opponent in ruby-red Kansas — added in a stern statement that \"far-reaching national security policy should always be devised in consultation with Congress and relevant government agencies.\"\n\nTrump's White House press secretary, Sean Spicer, said Monday that the Trump team couldn't keep agencies and Congress in the loop because of the national security implications — which is an interesting defense.\n\nAnd this is really where the Trump executive order went off the rails. This is where it alienated Republicans. When green-card holders and those who helped the United States fight terrorism abroad were denied entry, it became a PR problem. And right now only three Republicans senators are on the record as clearly supporting the travel ban. When Trump is losing people like Moran, he's in trouble.\n\nPolitical analysts are always in search of some strategy behind what a politician is doing, and they continue to theorize that Trump's approach is a deliberately scorched-earth one; so do Trump critics who insist on seeing Machiavellian genius behind virtually every move he makes. Perhaps, say some, it's an effort to make himself more popular by purposefully botching something and hoping the media overreacts. Or maybe it's just causing a ton of controversy early on in order to lower the bar for the rest of his presidency.\n\nOr maybe it's simply that the construction and implementation of the executive order was just poorly handled.", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["executive", "showed", "travel", "reasonably", "trump", "ban", "policy", "republicans", "mess", "united", "states", "trumps", "turns", "order", "president", "popular"], "summary": "And yet here we are, with plenty of Republicans revolting over the travel ban and the Trump administration having to play all kinds of defense.\nWhite House press secretary Sean Spicer addressed the media on Jan. 30, three days after President Trump signed an executive order halting the flow of refugees to the United States.\nAnd this is really where the Trump executive order went off the rails.\nWhen green-card holders and those who helped the United States fight terrorism abroad were denied entry, it became a PR problem.\nOr maybe it's simply that the construction and implementation of the executive order was just poorly handled."}