{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/02/13/americans-arent-rejecting-trumps-immigration-ban-outright-but-it-has-a-tough-road-ahead/", "id": "25", "title": "Americans are more split on the Trump travel ban than you might think", "text": "A wave of new polls show how divided Americans are about President Trump's travel ban. (Peter Stevenson/The Washington Post)\n\nPresident Trump's travel ban, which is currently on hold because of a decision by the 9th Circuit Court of Appeals, is at the heart of a roaring debate about what kind of country we have — and what kind of country we want. It has set off huge protests and scads of legal challenges. And yet, the public at large remains relatively evenly divided on the ban (but don't call it a ban).\n\nNational polls using random telephone samples have found support for the proposal ranging from 42 to 47 percent with slight majorities opposed (51 to 55 percent); Trump has cited Web and automated polls that show support cresting in the mid-50s, though those polls rely on less rigorous samples of the public.\n\nThe varying levels of support should not surprise regular poll watchers given the complicated policy details, different question wordings and methods. But it’s also possible that initial opinions are largely driven by opinions of Trump himself rather than the policy. The New York Times’ Nate Cohn pointed to a telling sign of that pattern, with the early polls showing a tight connection between Trump’s job approval rating and support for the travel ban.\n\nThe dynamic is clear in the scatterplot below, with net support for the ban (support minus opposition) rising along with net job approval for Trump. While only nine polls are included in the analysis, the correlation of 0.91 is nearly as high as it can get (1.0 is the highest).\n\nGiven Trump’s well-established reputation, odds are that his approval ratings are doing more to influence support for the ban than the other way around. But as the political debate continues, attitudes toward the ban itself may take on heightened importance in driving its overall support as well as Trump’s popularity.\n\nBeyond current support for the travel ban, polls find many Americans’ agree with Trump’s arguments that screening for refugees is insufficient, but even larger numbers agree with criticisms of his travel ban and broader immigration policy.\n\nAgreement with arguments for the ban\n\nOn Trump’s side, a Monmouth University poll last fall found only 34 percent of registered voters saying the U.S. is doing enough to prevent future terrorist attacks on U.S. soil, while 57 percent said it is not. A poll released this week underscored persistent fears, with more than 7 in 10 adults saying they believe terrorists associated with the Islamic State are currently in the U.S. and have the resources to launch a major terrorist attack.\n\nTrump’s criticisms of screening processes for refugees also have a wide audience, according to a Washington Post-ABC News poll following the 2015 Paris terrorist attacks. Less than half of adults were at least somewhat confident the United States could identify and keep out potential terrorists who may be among refugees (47 percent), and only 13 percent were very confident.\n\nAgreement with arguments against the ban\n\nPolls asking about issues related to the ban have found agreement with a variety of arguments against the proposal, suggesting supporters must ward off several lines of criticism.\n\nWhile Trump has said the ban is necessary to keep the country safe from terrorist attacks, several polls find less than half of the broader public believes the travel ban will have this effect. A February Quinnipiac poll found 38 percent of registered voters saying Trump’s executive order would make the country more safe, while just as many (39 percent) said it would make the nation less safe and the rest predicted no effect or has no opinion. That mirrored two other polls asking the question, where between 36 (in a CBS News pol and 41 percent (in a CNN poll) said the policy would increase safety.\n\nRelated to effectiveness, the policy focuses on the threat of terrorists coming into the country to carry out attacks, which Americans fear less than homegrown attackers. The Quinnipiac poll found 56 percent of voters saying so-called homegrown jihadists pose the greatest terrorist threat to the U.S., while 17 percent cited radicalized foreign visitors and 14 percent chose Syrian refugees. Those findings were similar to the Monmouth poll last fall.\n\nBeyond practicality, polling finds many people objecting to Trump’s policies as against American values. The CBS poll found 57 percent saying the ban “goes against America’s founding principles.” And CNN found 49 percent saying the order does more to “harm American values by preventing those seeking asylum from entering the U.S.,” while 43 percent said it “does more to protect American values by keeping out people who don’t support them.”\n\nTrump’s support for giving persecuted Christians refugees from Syria preference over Muslim refugees appears to runs against a strong impulse for equal treatment. Fully 88 percent of adults in the CBS poll said the U.S. government should treat all potential immigrants the same regardless of religion, while 8 percent favored preference for Christians. Even 87 percent of self-described Christians agreed that religion shouldn’t matter.\n\nThere are also concerns that Trump’s current ban is a workaround to enact a Muslim ban, which Trump proposed during his campaign. The ban limits immigration from seven countries representing only 12 percent of the world’s Muslims, though 97 percent of their populations are Muslim. A 55 percent majority of Americans polled by CNN said Trump’s order is an attempt to ban Muslims from entering the U.S., as did 51 percent of registered voters in the Quinnipiac poll.\n\nAttitudes shift slowly, but so far movement hasn’t been in Trump’s direction\n\nQuinnipiac’s polling before and after Trump announced his policy asked whether registered voters support or oppose “suspending immigration from ’terror prone’ regions, even if it means turning away refugees from those regions?” In January the poll found support outpacing opposition by 48 to 42 percent, but in early February support dipped to 44 percent with opposition rising eight points to 50 percent.\n\nGallup’s tracking poll also shows a dip in Trump’s approval rating, with disapproval rising from the mid-40s in his first days in office to 50 percent or above since then, though the negative movement started before Trump announced the executive order on immigration.\n\nGallup polls of U.S. adults.\n\nThose shifts are small, though, and polling in the next few weeks can give us a clearer picture on what people think about the travel ban — and Trump’s presidency overall.\n\nEmily Guskin contributed to this report.", "authors": [], "publish_date": "2017-02-13", "source": "washingtonpost", "top_words": ["travel", "trump", "polls", "ban", "poll", "support", "think", "trumps", "voters", "saying", "refugees", "split", "americans"], "summary": "A wave of new polls show how divided Americans are about President Trump's travel ban.\nThe dynamic is clear in the scatterplot below, with net support for the ban (support minus opposition) rising along with net job approval for Trump.\nBeyond current support for the travel ban, polls find many Americans’ agree with Trump’s arguments that screening for refugees is insufficient, but even larger numbers agree with criticisms of his travel ban and broader immigration policy.\nThere are also concerns that Trump’s current ban is a workaround to enact a Muslim ban, which Trump proposed during his campaign.\nThose shifts are small, though, and polling in the next few weeks can give us a clearer picture on what people think about the travel ban — and Trump’s presidency overall."}