{"url": "https://www.washingtonpost.com/news/volokh-conspiracy/wp/2017/02/09/the-9th-circuits-dangerous-and-unprecedented-use-of-campaign-statements-to-block-presidential-policy/", "id": "283", "title": "The 9th Circuit’s dangerous and unprecedented use of campaign statements to block presidential policy", "text": "\n\nThe White House is seen as the U.S. Court of Appeals for the 9th Circuit ruled that President Trump’s travel order will remain blocked. (European Pressphoto Agency)\n\nThe U.S. Court of Appeals for the 9th Circuit has just upheld a nationwide temporary injunction on President Trump’s executive order relating to refugees and visas from certain countries. I think the court’s opinion is weak in most respects, but I will address one of the most interesting and potentially far-reaching aspects.\n\nGenerally, the president has vast discretion in issuing visas. One of the major arguments against the executive order is that while in principle a president can limit immigration from the seven affected countries, it would be unconstitutional for President Trump in particular to do so, because in his case the action is motivated by impermissible religious bias. The central exhibit for this argument is his campaign statements about a “Muslim ban.”\n\nWhile the 9th Circuit did not address this at great length, focusing instead on due-process arguments, it did accept the basic validity of the form of the states’ argument. “The States’ claims raise serious allegations and present significant constitutional questions,” wrote the court.\n\nThere is absolutely no precedent for courts looking to a politician’s statements from before he or she took office, let alone campaign promises, to establish any kind of impermissible motive. The 9th Circuit fairly disingenuously cites several Supreme Court cases that show “that evidence of purpose beyond the face of the challenged law may be considered in evaluating Establishment and Equal Protection Clause claims.” But the cases it mentions do nothing more than look at legislative history — the formal process of adopting the relevant measure. That itself goes too far for textualists, but it provides absolutely no support for looking before the start of the formal deliberations on the measure to the political process of electing its proponents.\n\nA federal appeals court ruled 3 to 0 against President Trump's controversial immigration ban that barred refugees and citizens from seven Muslim-majority countries from entering the United States. (Victoria Walker/The Washington Post)\n\nIndeed, a brief examination of cases suggests the idea has been too wild to suggest. For example, the 10th Circuit has rejected the use of a district attorney’s campaign statements against certain viewpoints to show that a prosecution he commenced a few days after office was “bad faith or harassment.” As the court explained, even looking at such statements would “chill debate during campaign[s].” If campaign statements can be policed, the court concluded, it would in short undermine democracy: “the political process for selecting prosecutors should reflect the public’s judgment as to the proper enforcement of the criminal laws.” Phelps v. Hamilton, 59 F.3d 1058, 1068 (10th Cir. 1995).\n\nThere are sound policy reasons for ignoring campaign statements or promises to shed light on subsequent official action. For one, campaign promises are often insincere, designed to appeal to voters. Indeed, they are explicitly instrumental, and their goal is not policy outputs, but election. Moreover, implemented laws or policies are often substantially different from promises, as is the case here.\n\nEven the use of legislative/administrative history, in its most expansive form, looks only at the actual process – and not the personal background of the legislators, let alone before they took office. As the 9th Circuit itself put it in a discrimination case, “statements by decisionmakers unrelated to the decisional process itself” do not prove a discriminatory motive. McGinest v. GTE Serv. Corp., 360 F.3d 1103, 1138 (9th Cir. 2004).\n\nThe 9th Circuit’s ruling Thursday throws open a huge door to examinations of the entire lives of political officials whose motives may be relevant to legal questions. This introduces more uncertainty and judicial power into legal interpretation than even the most robust use of legislative/administrative history. Without a clear cutoff at assumption of office, attacks on statutes will become deep dives into politicians’ histories.\n\nMore broadly, constitutional structure supports examining only executive statements to interpret executive action. When Trump made his most controversial statements, he was private citizen. He had not sworn to uphold the Constitution, or to take care that the laws be faithfully executed. He was, in this sense, a legally differently obligated person. His policies and their relation to the Constitution would presumably be affected by his oath — that is why the Constitution requires it.\n\nMoreover, the Constitution’s oft-forgotten opinion clause supports disregarding pre-inauguration statements. The Constitution puts at the president’s service the officials of the administration and requires they advise him as asked. What it means here is that the president must be seen as the unitary head of the executive branch and the pinnacle of a process of executive decision-making. That process is the only constitutionally recognized executive process. A candidate’s possible plans or promises are not part of the process. The opinion clause also suggests a president cannot be bound by the oral statements of federal officials (like Rudy Guiliani), especially when not “upon any Subject relating to the Duties of their respective Offices.”\n\nBy accepting the use of preelection statements to impeach and limit executive policy, the 9th Circuit is taking a dangerous step. The states’ argument is in essence that Trump is a bigot, and thus his winning presidential campaign in fact impeaches him from exercising key constitutional and statutory powers, such as administering the immigration laws.\n\nThis would mean that Trump is automatically disbarred, from the moment of his inauguration, of exercising certain presidential powers, not because of his actions as president, but because of who he is — that is, how he won the presidency.\n\nAt oral argument, the judges asked if Trump could ban travel from all majority-Muslim countries. The question should be reversed. If the plaintiffs cast Trump’s views of immigration as impermissible, by this reasoning he cannot take the otherwise clearly legal action of restricting immigration from any of the world’s 50-odd majority-Muslim countries. This would mean that immigration system as created by Congress — which depends on broad executive discretion — will have essentially been destroyed.", "authors": [], "publish_date": "2017-02-09", "source": "washingtonpost", "top_words": ["executive", "presidential", "unprecedented", "trump", "circuit", "immigration", "block", "circuits", "9th", "court", "dangerous", "statements", "president", "policy", "campaign", "process"], "summary": "The White House is seen as the U.S. Court of Appeals for the 9th Circuit ruled that President Trump’s travel order will remain blocked.\nThere are sound policy reasons for ignoring campaign statements or promises to shed light on subsequent official action.\nAs the 9th Circuit itself put it in a discrimination case, “statements by decisionmakers unrelated to the decisional process itself” do not prove a discriminatory motive.\nMore broadly, constitutional structure supports examining only executive statements to interpret executive action.\nThat process is the only constitutionally recognized executive process."}