{"url": "https://www.washingtonpost.com/politics/courts_law/trump-turns-to-supreme-court-to-move-forward-on-travel-ban/2017/06/01/f2be9456-46d9-11e7-bcde-624ad94170ab_story.html", "id": "20", "title": "Trump turns to Supreme Court to move forward on travel ban", "text": "The Trump administration late Thursday asked the Supreme Court to revive the president’s plan to temporarily ban citizens from six mostly Muslim countries, elevating a divisive legal battle involving national security and religious discrimination to the nation’s highest court.\n\nJustice Department lawyers asked the court to overturn a decision of the full U.S. Court of Appeals for the 4th Circuit that kept in place a freeze on President Trump’s revised ban.\n\n[Appeals court rules against Trump travel ban]\n\nThe 10-to-3 ruling last week was one in a series of legal defeats for the administration, as judges across the country have said Trump’s claim of protecting the nation was cover for making good on a campaign promise to ban Muslims from entry into the United States.\n\nThe government’s filing late Thursday asks the justices to set aside the 4th Circuit ruling and accept the case for oral arguments. It also asks the high court to lift an even broader nationwide injunction issued by a federal judge in a separate Hawaii case. A panel of the U.S. Court of Appeals for the 9th Circuit, which covers Hawaii, heard the government’s arguments in that case last month, but has not yet ruled.\n\nIn turning to the high court, Justice Department lawyers said the 4th Circuit should have considered only the language of the executive order and not second-guessed the president’s motivations.\n\n[Court says essentially that Trump is not to be believed. Will Supreme Court conclude the same?]\n\nThe Supreme Court “has never invalidated religion-neutral government action based on speculation about officials’ subjective motivations drawn from ­campaign-trail statements by a political candidate,” Acting Solicitor General Jeffrey B. Wall wrote in the government’s lawyers wrote in their filing.\n\nJustice Department spokeswoman Sarah Isgur Flores said Thursday that the administration is “confident that President Trump’s executive order is well within his lawful authority to keep the nation safe and protect our communities from terrorism.”\n\nOmar Jadwat, who is director of the American Civil Liberties Union’s Immigrants’ Rights Project and argued the 4th Circuit case, said the Supreme Court should not grant the government’s request.\n\n“There is no reason to disturb the Fourth Circuit’s ruling, which was supported by an overwhelming majority of the judges on the full court, is consistent with rulings from other courts across the nation, and enforces a fundamental principle that protects all of us from government condemnation of our religious beliefs,” Jadwat said in a statement.\n\nThe government would need the votes of five of the justices of the court, now returned to full strength following the confirmation of Trump’s nominee, Neil M. Gorsuch.\n\nBut the timing of the case is tricky: The process of briefing, arguing and deciding a case at the Supreme Court takes months. The justices are scheduled to end their work at the end of June.\n\nAnd the ban, if it is allowed to be enforced, is proposed as temporary, just to give the government 90 days to study and implement new vetting procedures. It imposes a 120-day halt to the nation’s refu­gee process.\n\nThe 4th Circuit decision covers only the entry program. The Hawaii order covers both, and Wall said at oral arguments in the 4th Circuit case that the order has prevented the government from moving forward on those objectives.\n\nThe Supreme Court on Friday told the travel ban’s challengers to respond to the government’s filing by June 12.\n\nIf the Supreme Court stayed one or both of the injunctions, the executive order could expire before the court was able to hear oral arguments in the fall.\n\nIn the filing Thursday, Wall said it was critical for the court to affirm the president’s broad authority when it comes to immigration.\n\n“The precedent set by this case for the judiciary’s proper role in reviewing the president’s ­national-security and immigration authority will transcend this debate, this order, and this constitutional moment,” the filing said. “The decision below departs from those rules, and calls into question the Executive and his authority in a way that warrants this Court’s review.”\n\nThe president’s travel order has been one of the most controversial of the Trump administration, as the first entry ban created chaos at airports around the world and prompted major protests here and abroad.\n\nTrump has denounced judicial decisions freezing the ban as unprecedented assaults on his power to fulfill his most important role, keeping the nation safe.\n\n[Appeals court says president not to be believed. Will Supreme Court agree?]\n\nTrump on Jan. 27, just a week after inauguration, issued the first travel ban executive order. It barred the entry of citizens of seven majority-Muslim nations (Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen), ordered a temporary halt to refu­gee arrivals and would have eventually given preference to those who were religious minorities in their countries, such as Christians.\n\nSeveral judges and a panel of the U.S. Court of Appeals for the 9th Circuit shut it down.\n\nTrump vowed to go to the Supreme Court that time, too, but eventually issued a new order. That order, the subject of the 4th Circuit ruling, removed Iraq from the list, deleted references to religion and added national security rationales for the policy.\n\n[Trump issues revised travel ban]\n\nBut it was stopped by federal district judges in Maryland and Hawaii.\n\nIn the 4th Circuit, which covers Maryland, six judges agreed in full with an opinion by Chief Judge Roger L. Gregory that the national security rationale advanced by the president was simply pretext for unlawful animosity toward Muslims and an attempt to make good on a campaign promise to bar Muslims from entry into the country.\n\nHe cited Trump’s campaign rhetoric and statements made when he signed the executive orders and said courts had an obligation to look beyond their seemingly neutral language.\n\nThe order “speaks with vague words of national security, but in context drips with religious intolerance, animus, and discrimination,” Gregory wrote.\n\n[There’s a word that no longer describes the federal appeals court in Richmond]\n\nAt the 4th Circuit, two of the judges agreed with the majority that the order probably violates the constitutional command that government not favor or disparage one religion over another. But they also said the order was not justified under the power that Congress gives the president by law.\n\nThat broad power says that “whenever the President finds that the entry of any aliens or of any class of aliens . . . would be detrimental to the interests of the United States, he may . . . suspend the entry of all aliens or any class of aliens as immigrants or non-immigrants.”\n\nCongress later added, though that “no person shall receive any preference or priority or be discriminated against in the issuance of an immigrant visa because of the person’s race, sex, nationality, place of birth, or place of residence.”\n\nJudge Barbara Milano Keenan said that Trump had made no finding that the citizens of the six countries provided a specific threat to the United States. And Judge James A. Wynn Jr. said Congress did not give the president power to take action based on “invidious discrimination.”\n\nAll of the judges ruling against Trump were nominated to the appeals court by Democratic presidents. The three dissenting judges were nominated by Republicans and said their colleagues had wandered into uncharted territory by relying on campaign statements to find an Establishment Clause violation.\n\n“The Supreme Court surely will shudder at the majority’s adoption of this new rule that has no limits or bounds — one that transforms the majority’s criticisms of a candidate’s various campaign statements into a constitutional violation,” wrote Judge Paul V. Niemeyer.", "authors": [], "publish_date": "2017-06-01", "source": "washingtonpost", "top_words": ["travel", "forward", "judges", "trump", "case", "ban", "supreme", "circuit", "court", "4th", "entry", "turns", "order", "president"], "summary": "Will Supreme Court conclude the same?]\nBut the timing of the case is tricky: The process of briefing, arguing and deciding a case at the Supreme Court takes months.\nThe Supreme Court on Friday told the travel ban’s challengers to respond to the government’s filing by June 12.\nWill Supreme Court agree?]\nTrump vowed to go to the Supreme Court that time, too, but eventually issued a new order."}