{"url": "https://www.washingtonpost.com/news/post-politics/wp/2017/01/29/unnamed-white-house-official-on-implementing-travel-ban-it-really-is-a-massive-success-story/", "id": "211", "title": "Unnamed White House official on implementing travel ban: ‘It really is a massive success story.’", "text": "President Trump signed an executive order to halt U.S. entry for refugees, migrants and foreign nationals for 120 days starting Jan. 27. Fiery protests and lawsuits made for a tumultuous weekend. Here's what you need to know. (Dalton Bennett,Erin Patrick O'Connor,Katherine Shaver,Monica Akhtar,McKenna Ewen/The Washington Post)\n\nTwo days into President Trump's new ban on refugees, migrants and foreign nationals from seven countries, there was still mass confusion about the details. On Sunday evening, the White House organized a briefing for reporters with two senior administration officials who agreed to explain the president's executive order — but only on the condition of anonymity.\n\nOne senior administration official explained the ground rules to reporters gathered at the White House and listening on a conference call, then said: “With that, I'll turn it over to a senior administration official.”\n\n“Thank you,” the other senior administration official said before beginning a 45-minute defense.\n\nTheir overarching message: Everything is going exactly according to plan, nothing has changed since the order was signed, and the news media need to calm down their “false, misleading, inaccurate, hyperventilating” coverage of the “fractional, marginal, minuscule percentage” of international travelers who have been simply “set aside for further questioning” for a couple hours on their way into the greatest country in the world.\n\n“It really is a massive success story in terms of implementation on every single level,” the administration official said at one point.\n\nThe administration official said the order was drafted with help from “several of the top immigration staff on Capitol Hill,” then was approved by the Justice Department's Office of Legal Counsel and reviewed by some government agencies. The White House purposely implemented the ban with no warning because “everybody here can use their imaginations to imagine 25 reasons that wouldn't make sense from a security standpoint, a management standpoint, from just an airport-safety standpoint, you name it,” the senior administration official said. (The other senior administration official jumped in at one point to make clear that the order “isn’t willy-nilly.\")\n\n[Amid protests and confusion, Trump defends executive order: ‘This is not a Muslim ban’]\n\nThere had been some confusion about how legal permanent residents — also known as green-card holders — would be treated under this new order. On Saturday, this same senior administration official told reporters that if a green-card holder from one the seven targeted countries is currently elsewhere in the world, that person would need to apply for a case-by-case waiver before returning to the United States. But then on Sunday morning, the president's chief of staff went onto a morning news show and said that the executive order “doesn’t affect them.”\n\nTrump administration officials defended the president's executive order temporarily banning entry to the U.S. from seven mostly Muslim countries, but lawmakers from both parties expressed strong concern or objection. (Bastien Inzaurralde/The Washington Post)\n\n“Nothing has changed,” the senior administration official explained, claiming that the White House has provided clear instructions from the beginning on how green-card holders should navigate the system. These green-card holders are “exempt” from the new restrictions, the senior administration official said.\n\nA reporter jumped in: “That's different from what you said when we were in here yesterday, right?”\n\n“No,” the senior administration official said.\n\n“Do you want me to pull the quote?” the reporter said.\n\n“You can do whatever you want,” the official said.\n\nThe official then explained that green-card holders are exempt because they can apply for and receive a waiver. As of Sunday afternoon, 170 legal permanent residents had applied for waivers to avoid the new restrictions and all 170 had been granted those waivers.\n\n“Some of the confusion stemming from the green-card issue is just semantic in nature,” the senior administration official said. “I think some of the confusion stems from the semantic debate about the meaning of the word 'exemption.' Again, internally, we've been clear on this from the beginning, and we've waived people through.”\n\nPlus, the senior administration official said, the number of people who have to deal with these new restrictions is “a fractional, marginal, minuscule percentage” of the approximately 325,000 residents of other countries who arrive in the United States each day. During the first 24 hours that the executive order was in place, 109 people were “set aside for further questioning,” a situation that many others would describe as being detained by authorities.\n\n“In terms of the operation of the executive order, at the implementation level, it has been done seamlessly and with extraordinary professionalism,” the senior administration official said at one point, later adding that these changes have been implemented with “minimal disruption for other travelers.”\n\n[Share your thoughts on the travel ban]\n\nA reporter asked the senior administration official to respond to Sen. Bob Corker (R-Tenn.), the chairman of the Senate Foreign Relations Committee who said Sunday: “We all share a desire to protect the American people, but this executive order has been poorly implemented, especially with respect to green card holders.” The senior administration official said the senator presumably misunderstands the order.\n\n“He might have read one of CNN's stories,” the senior administration official said. “And, for that, the only responsible party would be CNN.”\n\nAfter another jargon-filled explanation of how everything is working the way it should, the senior administration official noted that “processes for travel are always evolving” and that “travel is proceeding as it should for those who should be traveling.”\n\n“The important thing to keep in mind is that the United States runs the largest immigration system in the world,” the senior administration official said. “We have about 80 million people, give or take a few million, that enter the United States through an air, land or sea port in a given year. The complexity and scope and reach of the immigration system is beyond imagination and, then again, there's sort of a strange irony — I don't know if irony is the right word — but there's something immensely disproportionate about people protesting that this year 79,999,900 or whatever will be processed through instead of the 80 million. I mean, you're talking about letting in more people than the size of almost every country on earth every single year.”\n\nThe current immigration system is “woefully inadequate” and if it's not changed, the senior administration official warned that it could lead to “the kind of large and permanent domestic terror threat that becomes multidimensional and multi-generational and becomes sort of a permanent feature, in this case, it would become a permanent feature of American life.”\n\n“We don't want a situation where 20, 30 years from now, it's just like a given thing that on a fairly regular basis that there's domestic terror strikes, that stores are shut up or that airports have explosive devices planted or people are mowed down in the street by cars and automobiles and things of that nature,” the senior administration official said. “These are the realities that we're living in today.”\n\n[Inside Donald Trump’s strategic decision to target Muslims]\n\nThe senior administration official said that the administration still wants to welcome new people “who truly believe in the American values that we all hold dear,” but that it's the federal government's right to exclude those who would “not be able to be faithful to our tolerant way of life.”\n\n“Now, I don't want to get into a long debate or to distract from what we're all discussing,” the senior administration official said, “but I think that it's reasonable to say that you have to take a holistic look at applicants and that you could argue that if you admit say 50 people who aren't themselves terrorists but maybe who have sympathetic attitudes toward terrorists or who believe that there's an appropriate place for terrorism, that creates an environment where it's easy to radicalize people and to spread radical views and ideologies and, ultimately, to inculcate terrorism. ... You're removing a lot of the networks in which radicalization can take root and then at that point, again, become multi-generational.”\n\nAt one point, the other senior administration official jumped in to explain the ban in another way: “What would you rather have: Somebody delayed for a little while because we're taking the proper precautions... or a family member killed” in a terrorist attack. “Which one would you choose?”\n\nThe other senior administration official added this thought: “If I was welcomed to a new country and then just asked to wait for a few hours to have the review done, I wouldn't consider it a great injury.”\n\nA few minutes later, as the questions continued, the senior administration official tried to make this point again: “You have a hundred people who are given the greatest benefit imaginable, which is to spend time or to live permanently in the United States, but had to go through a little bit of extra delay. I want to make a point that — and I mean this very sincerely — which is that the United States chose not to be rigorous with respect to its immigration laws before Sept. 11, and 3,000 people were murdered. The United States chose not to be rigorous with its immigration law when the San Bernardino bride came in on a fiancee visa and 14 people were gunned down. ... And so on and on the examples go.”\n\n[Conservative suspicions of refugees grow in wake of Paris attacks]\n\n\n\n\n\nA reporter pointed out that none of the home countries of those terrorists are included in the list of seven countries that the administration is targeting.\n\n\n\n“If people in the media would like to recommend additional countries to be added, you can send us your suggestions,” the senior administration official said. “The point that I am making is that we are putting in place over the next 90 days procedures to try to prevent those things from happening. ... I think it's important to keep in mind the job of the president is to protect the lives of American citizens, and the job of the media is to report fairly.”\n\nThe other senior administration official then jumped in and ended the briefing.\n\n1 of 40 Full Screen Autoplay Close Skip Ad × How people reacted to Trump’s immigration ban View Photos Thousands protested the president’s executive order outside the White House, at Trump International Hotel and at Dulles International Airport. Caption Thousands protested the president’s executive order outside the White House, at Trump International Hotel and at Dulles International Airport. Feb. 1, 2017 Karen Sultan was among scores who came to the “Rally for Immigrants” held at Reagan National Airport. She brought flowers to give to “anyone who might need them.” She’s from Chevy Chase, Md. Michael S. Williamson/The Washington Post Buy Photo Wait 1 second to continue.\n\nRead more:\n\nQuestions multiply over Bannon’s role in Trump administration\n\nTrump asked for a ‘Muslim ban,’ Giuliani says — and ordered a commission to do it ‘legally’\n\nHere’s where Republicans stand on Trump’s controversial travel ban", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["executive", "unnamed", "travel", "official", "implementing", "ban", "immigration", "point", "senior", "united", "massive", "states", "countries", "success", "order", "house", "white", "really", "administration"], "summary": "One senior administration official explained the ground rules to reporters gathered at the White House and listening on a conference call, then said: “With that, I'll turn it over to a senior administration official.”“Thank you,” the other senior administration official said before beginning a 45-minute defense.\n“It really is a massive success story in terms of implementation on every single level,” the administration official said at one point.\nA reporter jumped in: “That's different from what you said when we were in here yesterday, right?”“No,” the senior administration official said.\n“Some of the confusion stemming from the green-card issue is just semantic in nature,” the senior administration official said.\nCaption Thousands protested the president’s executive order outside the White House, at Trump International Hotel and at Dulles International Airport."}