{"url": "https://www.washingtonpost.com/news/powerpost/wp/2017/02/12/stephen-miller-says-white-house-will-fight-for-travel-ban-advances-false-voter-fraud-claims/", "id": "202", "title": "Stephen Miller says White House will fight for travel ban, advances false voter fraud claims", "text": "After the U.S. Court of Appeals for the 9th Circuit ruled against reinstating President Trump's travel ban, White House senior policy adviser Stephen Miller on Feb. 12 defended the policy while Democratic senators continued to oppose it. (Bastien Inzaurralde/The Washington Post)\n\nThe White House is pursuing several options to reinstate President Trump’s travel ban on all refugees and travelers from seven majority-Muslim nations, fighting back against what one top adviser on Sunday called “judicial usurpation of power.”\n\nWhite House senior policy adviser Stephen Miller, the author of the controversial executive order, said the administration was weighing several legal options after the 9th Circuit Court of Appeals ruled unanimously on Thursday against reinstating the travel ban, which had been blocked temporarily by a federal judge in Washington state.\n\nMiller said that officials are considering appealing with the 9th Circuit and having an emergency hearing “en banc,” or before a larger panel of judges on the court; seeking an emergency stay at the Supreme Court; taking the case to trial at the district level; or writing a new executive order for Trump to sign that would withstand legal scrutiny.\n\nIn unusually combative interviews on the Sunday morning television shows, Miller also refused to say whether Trump still has confidence in his national security adviser amid controversy over his communications with Russian officials. Miller also advanced false claims that widespread voter fraud undermined Trump’s performance in November’s election.\n\n[National security adviser Flynn discussed sanctions with Russian ambassador, despite denials, officials say]\n\nMiller insisted that Trump has the constitutional authority to ban the entry of certain foreigners, saying the actions represent “the very apex of presidential authority.”\n\n“I want to say something very clearly, and this is going to be very disappointing to the people protesting the president and the people in Congress, like [Senate Democratic Leader Charles E.] Schumer, who have attacked the president for his lawful and necessary action: The president’s powers here are beyond question,” Miller said on Fox News.\n\nAppearing also on ABC News, Miller said, “A district judge in Seattle cannot force the president of the United States to change our laws and our Constitution because of their own personal views. The president has the power … to suspend the entry of aliens when it’s in the national interest.”\n\n[Trump considers writing ‘brand new’ immigration order]\n\nMiller said on CBS News that the judiciary was acting like “a supreme branch of government.”\n\n“One unelected judge in Seattle cannot make laws for the entire country,” Miller told anchor John Dickerson. “I mean, this is just crazy, John. The idea that you’re going to have a judge in Seattle say that a foreign national living in Libya has an effective right to enter the United States is beyond anything we’ve ever seen before.”\n\nMiller also suggested that the legal debate was not over the constitutionality of Trump’s action, but rather over ideology.\n\n“There is no constitutional right for a citizen in a foreign country, who has no status in America, to demand entry into our country,” the adviser said on ABC. “Such a right cannot exist. Such a right will never exist. This is an ideological disagreement between those who believe we should have borders and should have controls and those who believe there should be no borders and no controls.”\n\nMiller’s exchanges with the Sunday show hosts were testy on other subjects as well. He punted when ABC anchor George Stephanopoulos asked him about The Washington Post’s report that Michael Flynn discussed the then-Obama administration’s sanctions against Russia in conversations with that country’s ambassador before Flynn was sworn in as White House national security adviser.\n\n“I don’t have any news to make you today on this point,” Miller said, prompting Stephanopoulos to ask, “Then why are you coming in if you can’t answer the questions being posed about the White House?”\n\nOn NBC, when anchor Chuck Todd asked Miller whether Trump still had confidence in Flynn, Miller said he did not know. Miller said his colleagues in the White House “did not give me anything to say.”\n\n“It’s not for me to tell you what’s in the president’s mind,” he told Todd. “That’s a question for the president.”\n\n[Stephen Miller: A key engineer for Trump’s ‘America first’ agenda]\n\nMiller also repeated the false claim that Trump underperformed in the general election because of “massive voter fraud.” Miller provided no evidence to support his assertions in his ABC appearance — something Stephanopoulos pointed out to viewers.\n\nMiller repeated claims Trump made privately to senators this past week that he narrowly lost the general election in New Hampshire because thousands of Massachusetts residents were bused into New Hampshire to vote illegally there.\n\n“I can tell you that this issue of busing voters into New Hampshire is widely known by anyone who’s worked in New Hampshire politics,” Miller said. “It’s very real. It’s very serious.”\n\nThere is no known evidence of this happening.\n\nMiller went on to say that there is “enormous evidence” of people being registered to vote in more than one state, of “dead people voting” and noncitizens being registered to vote.\n\n“George, it is a fact — and you will not deny it — that there are massive numbers of noncitizens in this country who are registered to vote,” Miller said. “That is a scandal. We should stop the presses. And, as a country, we should be aghast about the fact that you have people who have no right to vote in this country registered to vote, canceling out the franchise of lawful citizens of this country.”\n\nAt that, Stephanopoulos intoned: “For the record, you have provided zero evidence that the president was the victim of massive voter fraud in New Hampshire. You provided zero evidence that the president’s claim that he would have won the popular vote if 3 million to 5 million illegal immigrants hadn’t voted — zero evidence for either one of those claims.”\n\nMiller’s combative appearances pleased his boss, who apparently was watching from Mar-a-Lago, his private club in Palm Beach, Fla. Trump tweeted: “Congratulations Stephen Miller- on representing me this morning on the various Sunday morning shows. Great job!”\n\nCongratulations Stephen Miller- on representing me this morning on the various Sunday morning shows. Great job! — Donald J. Trump (@realDonaldTrump) February 12, 2017", "authors": [], "publish_date": "2017-02-12", "source": "washingtonpost", "top_words": ["claims", "travel", "trump", "right", "fight", "false", "vote", "evidence", "adviser", "voter", "president", "trumps", "country", "stephen", "fraud", "miller", "house", "white"], "summary": "After the U.S. Court of Appeals for the 9th Circuit ruled against reinstating President Trump's travel ban, White House senior policy adviser Stephen Miller on Feb. 12 defended the policy while Democratic senators continued to oppose it.\nMiller also advanced false claims that widespread voter fraud undermined Trump’s performance in November’s election.\nMiller said his colleagues in the White House “did not give me anything to say.”“It’s not for me to tell you what’s in the president’s mind,” he told Todd.\n“George, it is a fact — and you will not deny it — that there are massive numbers of noncitizens in this country who are registered to vote,” Miller said.\nGreat job!”Congratulations Stephen Miller- on representing me this morning on the various Sunday morning shows."}