{"url": "https://www.washingtonpost.com/news/powerpost/wp/2017/01/31/house-judiciary-chairman-staffers-had-no-control-of-the-language-in-trump-travel-ban/", "id": "246", "title": "House Judiciary chairman: Staffers had ‘no control of the language’ in Trump travel ban", "text": "\n\nRep. Bob Goodlatte (R-Va.) is chairman of the House Judiciary Committee. (Jacquelyn Martin/AP)\n\nThe chairman of the House Judiciary Committee pushed back Tuesday on a news report suggesting that members of his staff went behind his back to work on President Trump’s executive order issued Friday barring citizens of seven Muslim-majority countries from entering the United States.\n\nThe Monday evening report in Politico said that senior committee staff members “helped Donald Trump’s top aides draft the executive order” and signed a nondisclosure agreement that would prevent them from sharing their work with members of Congress or colleagues on Capitol Hill.\n\nBut in remarks to fellow lawmakers and a press statement issued Tuesday morning, Judiciary Committee Chairman Bob Goodlatte (R-Va.) said the staffers had his blessing to work on the Trump transition effort, much as congressional staffers of both parties have assisted this transition and previous transitions.\n\nGoodlatte said in the statement said the staffers are “some of the best on Capitol Hill” and are “experts in their respective fields.”\n\n“I proudly allowed them to provide their expertise to the Trump transition team on immigration law,” he said. “To be clear, while they gave advice to the new Administration, they did not have decision making authority on the policy. The final decision was made at the highest levels of the Trump Administration, and I support the President’s executive order. My staff had no control of the language contained in the President’s executive order, the timing of the announcement, the rollout and subsequent implementation, and the coordination with Congress.”\n\nInside the private House GOP conference meeting, Goodlatte made a similar statement, according to multiple people present, acknowledging that staff had assisted the Trump campaign and transition going back well into 2016 in adherence with ethics rules. According to the people present, Goodlatte did not leave his colleagues with the impression that the staffers had done anything wrong.\n\nGoodlatte’s statement did not mention nondisclosure agreements, and a committee spokeswoman did not confirm they existed or answer questions about whether Goodlatte knew about them if they did. Media outlets, including The Washington Post, reported throughout the campaign and transition on Trump’s insistence on making employees and advisers sign such agreements as a matter of course. It would be unusual for a congressional staffer to sign a nondisclosure agreement under those circumstances, said aides asked about the possible arrangement, but would not necessarily break any laws or congressional rules.\n\nWhat is not unusual is the practice of congressional aides members advising a presidential transition. The practice is routine enough that the House Ethics Committee issued guidance last year, as it has done during previous transitions, for staff members who wish to participate. The Ethics Committee memo lays out three options for staffers: provide assistance as a congressional aide, serve a “reimbursed detailee” to the transition or take vacation or unpaid leave to serve as a volunteer.\n\nThe committee spokeswoman, Kathryn Rexrode, did not respond to questions about how the staffers in question handled their transition service.\n\nGoodlatte’s aides were not the only staffers to have advised the Trump transition on immigration matters.\n\nAt least one Senate Judiciary Committee staff member was also involved as a “legislative coordinator,” according to a Senate GOP aide. That aide was part of a team “involved in the drafting” of immigration policy but was not involved in writing the final order issued Friday. The Senate aide added that, “while there was knowledge that an order was being worked on, no details were shared with the committee prior to it being released.”", "authors": [], "publish_date": "2017-01-31", "source": "washingtonpost", "top_words": ["travel", "trump", "control", "ban", "goodlatte", "congressional", "statement", "members", "transition", "committee", "chairman", "staff", "order", "house", "staffers", "language", "judiciary"], "summary": "Rep. Bob Goodlatte (R-Va.) is chairman of the House Judiciary Committee.\nThe practice is routine enough that the House Ethics Committee issued guidance last year, as it has done during previous transitions, for staff members who wish to participate.\nThe committee spokeswoman, Kathryn Rexrode, did not respond to questions about how the staffers in question handled their transition service.\nGoodlatte’s aides were not the only staffers to have advised the Trump transition on immigration matters.\nAt least one Senate Judiciary Committee staff member was also involved as a “legislative coordinator,” according to a Senate GOP aide."}