{"url": "https://www.washingtonpost.com/local/social-issues/refugees-detained-at-us-airports-challenge-trumps-executive-order/2017/01/28/e69501a2-e562-11e6-a547-5fb9411d332c_story.html", "id": "272", "title": "Judge halts deportations as refugee ban causes worldwide furor", "text": "A federal judge in New York blocked deportations nationwide late Saturday of those detained on entry to the United States after an executive order from President Trump targeted citizens from seven predominantly Muslim countries.\n\nJudge Ann Donnelly of the U.S. District Court in Brooklyn granted a request from the American Civil Liberties Union to stop the deportations after determining that the risk of injury to those detained by being returned to their home countries necessitated the decision.\n\nMinutes after the judge’s ruling in New York, another came in Alexandria when U.S. District Judge Leonie Brinkema issued a temporary restraining order to block for seven days the removal of any green-card holders being detained at Dulles International Airport. Brinkema’s action also ordered that lawyers have access to those held there because of the ban.\n\nSeveral hours after the judicial rulings, the Department of Homeland Security said it would continue to implement Trump’s executive order. In a statement released early Sunday, the agency said “less than one percent” of international air travelers arriving Saturday in the U.S. were “inconvenienced” by the executive order.\n\n“President Trump’s Executive Orders remain in place — prohibited travel will remain prohibited, and the U.S. government retains its right to revoke visas at any time if required for national security or public safety,” the statement said. “No foreign national in a foreign land, without ties to the United States, has any unfettered right to demand entry into the United States or to demand immigration benefits in the United States.”\n\n\n\n\n\nWhile the statement said the administration “will comply with judicial orders,” the fate of travelers detained at U.S. airports was not immediately clear.\n\nTrump’s order reverberated across the world Saturday, making it increasingly clear that the measure he had promised during his presidential campaign was casting a wider net than even his opponents had feared.\n\nConfusion and concern among immigrant advocates mounted throughout the day as travelers from the Middle East were detained at U.S. airports or sent home. A lawsuit filed on behalf of two Iraqi men challenged Trump’s executive action, which was signed Friday and initially cast as applying to refugees and migrants.\n\nBut as the day progressed, administration officials confirmed that the sweeping order also targeted U.S. legal residents from the named countries — green-card holders — who were abroad when it was signed. Also subject to being barred entry into the United States are dual nationals, or people born in one of the seven countries who hold passports even from U.S. allies, such as the United Kingdom.\n\n[Are you, or someone you know, affected by President Trump’s travel restrictions? Tell The Post.]\n\nThe virtually unprecedented measures triggered harsh reactions from not only Democrats and others who typically advocate for immigrants but also key sectors of the U.S. business community. Leading technology companies recalled scores of overseas employees and sharply criticized the president. Legal experts forecast a wave of litigation over the order, calling it unconstitutional. Lawyers and advocates for immigrants are advising them to seek asylum in Canada.\n\nYet Trump, who centered his campaign in part on his vow to crack down on illegal immigrants and impose what became known as his “Muslim ban,’’ was unbowed. As White House officials insisted that the measure strengthens national security, the president stood squarely behind it.\n\n1 of 23 Full Screen Autoplay Close Skip Ad × Photos from the scene of protest at New York’s JFK airport against Trump’s executive order halting refu­gee admissions View Photos Entry to the United States is being refused to legal residents, including green-card holders, from seven mostly Muslim countries who were abroad when the executive order was signed Friday by the president, and some travelers were detained at U.S. airports. Caption Entry to the United States is being refused to legal residents, including green-card holders, from seven mostly Muslim countries who were abroad when the executive order was signed Friday by the president. Jan. 28, 2017 People protest the Muslim immigration ban at John F. Kennedy International Airport in New York. President Trump signed an executive order that halted refugees and residents from certain predominantly Muslim countries from entering the United States. Stephanie Keith/Getty Images Buy Photo Wait 1 second to continue.\n\n“It’s not a Muslim ban, but we were totally prepared,” Trump told reporters in the Oval Office. “You see it at the airports, you see it all over. It’s working out very nicely, and we’re going to have a very, very strict ban, and we’re going to have extreme vetting, which we should have had in this country for many years.”\n\nIn New York, Donnelly seemed to have little patience for the government’s arguments, which focused heavily on the fact that the two defendants named in the lawsuit had already been released.\n\nDonnelly noted that those detained were suffering mostly from the bad fortune of traveling while the ban went into effect. “Our own government presumably approved their entry to the country,” she said at one point, noting that, had it been two days prior, those detained would have been granted admission without question.\n\nDuring the hearing, ACLU attorney Lee Gelernt informed the court that he had received word of a deportation to Syria, scheduled within the hour. That prompted Donnelly to ask if the government could assure that the person would not suffer irreparable harm. Receiving no such assurance, she granted the stay to the broad group included in the ACLU’s request.\n\nA senior Department of Homeland Security official had no comment about the rulings late Saturday and said the department was consulting with its lawyers.\n\nThe official said enforcement of the president’s order on Saturday had created minimal disruption, given that only a small number of the several hundred thousand travelers arriving at U.S. airports daily had been affected.\n\nNationwide, he said, 109 people had been denied entry into the United States. All had been in transit when Trump signed the order, and some had already departed the United States on flights by late Saturday while others were still being detained awaiting flights. Also, 173 people had not been allowed to board U.S.-bound planes at foreign airports.\n\nThe official said that officers doing case-by-case reviews had granted 81 waivers so far to green-card holders.\n\nDHS began implementing the president’s order immediately after he signed it, according to the official. He declined to say whether the department had an operational plan ready at that time.\n\nIn New York, when news of the decision to block the deportations reached the crowd outside the courthouse, a roar of approval went up. For some time after, hundreds of people chanted and danced along with a drum circle. “Get up! Get down! New York is an immigrant town,” the crowd said. The diverse group of mostly young people continued to grow despite the cold weather. “No hate! No bigotry! No Muslim registry.”\n\nJonah Baum, 11, was at the protest with his mother, Terri Gerstein, 48. Asked why he thought it was important to come, Baum said, “It's so bad what he's been doing to this country. I felt like I needed to do something about it.” Baum's grandfather was a Jewish refugee from Germany.\n\nDemocratic presidential candidate Hillary Clinton tweeted late Saturday, “I stand with the people gathered across the country tonight defending our values & our Constitution. This is not who we are.”\n\nThough several congressional Republicans denounced the order, the majority remained silent, and a few voiced crucial support — including, most prominently, House Speaker Paul D. Ryan (R-Wis.), who had rejected Trump’s anti-Muslim proposals during the campaign. “This is not a religious test, and it is not a ban on people of any religion,’’ Ryan said Saturday. “This order does not affect the vast majority of Muslims in the world.”\n\nThe president’s order, signed Friday, suspends admission to the United States of all refugees for 120 days and bars for 90 days the entry of any citizen from Iraq, Iran, Syria, Yemen, Sudan, Libya and Somalia. That list excludes several majority-Muslim nations — notably Turkey, the United Arab Emirates and Indonesia — where the Trump Organization, now run by the president’s adult sons, is active and which in some cases have also faced troublesome issues with terrorism.\n\nAccording to the text of the order, the restriction applies to countries that have already been excluded from programs allowing people to travel to the United States without a visa because of terrorism concerns. Hewing closely to nations already named as terrorism concerns elsewhere in law might have allowed the White House to avoid angering powerful and wealthy majority-Muslim allies, such as Egypt and Saudi Arabia.\n\nAmid widespread confusion on Saturday about how the order will be enforced, some administration officials acknowledged that its rollout had been chaotic. Officials tried to reassure travelers and their families, pointing out that green-card holders in the United States will not be affected and noting that the DHS is allowed to grant waivers to those individuals and others deemed to not pose a security threat. It can take years for someone to become a green-card holder, or lawful permanent resident authorized to permanently live and work in the country.\n\n“If you’ve been living in the United States for 15 years and you own a business and your family is here, will you be granted a waiver? I’m assuming yes, but we are working that out,’’ said one official, who could not be more specific because details remained so cloudy. A senior White House official later said that waivers will be evaluated on a case-by-case basis and that green-card holders in the United States will have to meet with a consular officer before leaving the country.\n\nBut officials made clear that the federal officers detaining refugees and migrants with valid U.S. visas and restricting them from entering the country were following orders handed down by top DHS officials, at the White House’s behest.\n\nThe order drew outrage from a range of activist and advocates for Muslims, Arabs and immigrants. More than 4,000 academics from universities nationwide signed a statement of opposition and voiced concern the ban would become permanent. They described it as discriminatory and “inhumane, ineffective and un-American.”\n\nThe executive action has caused “complete chaos” and torn apart families, said Abed Ayoub, legal and policy director of the American-Arab Anti-Discrimination Committee.\n\nAt Dulles, Virginia Gov. Terry McAuliffe (D) addressed more than 100 people protesting Trump’s order. He said: “I remind everybody we are a land of immigrants … Discriminatory tactics breed hatred.’’\n\nIn New York, lawyers for two Iraqi men detained at John F. Kennedy International Airport — one of whom served the U.S. military mission in Iraq — filed a federal lawsuit challenging the order as unconstitutional.\n\n[Read the complaint]\n\nOne of the men, Hameed Khalid Darweesh, was released Saturday afternoon without explanation from federal officials. “This is the humanity, this is the soul of America,’’ he told reporters. “This is what pushed me to move, to leave my country and come here … America is the land of freedom — the land of freedom, the land of the right.’’\n\nOther advocates promised further legal challenges. The Council on American-Islamic Relations (CAIR) denounced the order and said it would file a lawsuit challenging it as unconstitutional.\n\nIn a conference call with reporters, immigration lawyers and advocates said Trump’s order violated the Constitution, along with U.S. and international laws that guarantee migrants the right to apply for asylum at the border and the Immigration and Nationality Act, which forbids discrimination in the issuance of visas based on race, nationality, place of birth or place of residence.\n\nBut Mark Krikorian, executive director of the Center for Immigration Studies, which advocates for lower immigration levels, praised Trump.\n\n“It’s a prudent measure,” he said. “It’s not the end of the world. It’s not the Statue of Liberty crying. The reaction has been hyperbolic.”\n\nAt Dulles, at 10:30 p.m., cheers erupted as a couple emerged from the gray doors blocking the Customs and Border Protection screening area. “Go see the lawyers!” about 150 protesters chanted, directing them toward a throng of volunteer lawyers.\n\nThe young woman was teary as she pushed a full luggage cart toward the terminal exit. Another woman, who also was crying, ran up to her. “I'm looking for my parents! They are elderly!”\n\nAs his wife headed out, Javad Fotouha said he is Iranian but has a green card. He said he and his wife had been detained for four hours after landing at Dulles around 6:30 p.m.\n\n“We saw elderly people and disabled people” being detained, Fotouha said.\n\nHe said he and his wife had read on their phones during their layover in Istanbul that Trump had signed the executive order about five hours earlier. “Yes, I was scared,” Fotouha said.\n\nAt 11:35 p.m., about 80 protesters and lawyers started chanting “Contempt of court!” and “Let them in!” as lawyers said officials were ignoring the federal judge's order requiring that they have access to people being detained.\n\nFatemeh Ebrahimi, an Iranian who now lives in Montgomery County, was released at Dulles just before midnight, following a nearly six-hour wait with her two children after their plane landed. She said they traveled to Iran 10 days ago to celebrate her daughter’s and her birthdays with friends and family.\n\nEbrahimi said she has a green card, and her children, ages 21 and 7, are U.S. citizens. Her son emerged in a wheelchair with his sister on his lap, saying authorities had given them soup to eat while they waited.\n\n“My kids are so tired right now,” a weary looking Ebrahimi said as she made her way through a thicket of lawyers and reporters toward the terminal doors. “They just kept us waiting.”\n\nShortly after midnight, Sen. Cory Booker (D-N.J.) emerged from a Dulles airport hallway being guarded by police officers near the customs screening area. Speaking to a crowd of more than 100 protesters, Booker said federal officials had told him that the remaining detainees would be released “momentarily.”\n\nVolunteer lawyers said one person remained to be released as of 12:30 a.m. The lawyers said others who had been released had told them two additional men had been handcuffed after they refused to give authorities their green cards, and their status was unknown. Lawyers said they still had not been permitted to speak with those being detained — what they called a violation of the federal judge’s court order.\n\nBooker told protesters he agreed with the attorneys and predicted a “long, arduous and tough fight” over the executive order. “This is not a one-night thing and it’s not a one-day thing,” he said.\n\nAfter most protesters and lawyers had gone home for the night, Binto Adan and her two young children, an 8-year-old boy and 9-year-old girl, emerged at 1:20 am Sunday from the customs screening area. Adan ducked under the ropes lining the walkway and hugged two relatives who were waiting for them.\n\nAdan’s daughter had tears in her eyes as her mother led the children toward the terminal exit. Adan did not speak to reporters, but one of her relatives said the family endured a 17-hour ordeal.\n\nA nephew of Adan’s, Najib Abi, said his aunt and her children arrived at Dulles at 8 a.m. Saturday from Kenya. They were supposed to transfer to another flight to live in Minnesota, where her husband was waiting for them. The family is Somali, but the children and their father are U.S. citizens, Abi said. Adan has an I-130 visa for relatives of U.S. citizens, he said.\n\nAbi said immigration officials called his uncle on Saturday, saying his wife and children were detained. Abi said his uncle was told that someone would need to retrieve the children by 9:30 a.m. Sunday or they would be sent back to Kenya with their mother.\n\nAbi said he and other relatives arrived at Dulles from Minnesota late Saturday night. He said Adan didn't have a cell phone. “We weren’t allowed to talk to them,” Abi said.\n\nThen, without any explanation, Adan and her children were released.\n\nAs of 2 a.m., one Syrian woman was still detained at Dulles, said Mirriam Seddiq, a volunteer lawyer. Attorneys were told the woman would be held overnight and would have an initial asylum hearing Sunday morning, Seddiq said.\n\nThe woman arrived at Dulles at 7 p.m. Saturday with a non-immigrant J2 visa, Seddiq said. Her husband is in the United States on a J1 visa for professional training, Seddiq said.\n\nSeveral lawyers would spend the night at Dulles, Seddiq said, with more returning Sunday morning to try to get access to any international passengers detained. Immigration officials did not allow lawyers to visit with detainees Saturday, despite a federal judge’s order that they be allowed to do so.\n\nA Customs and Border Protection official at Dulles told lawyers that they were awaiting directions from the Department of Homeland Security's counsel office, Seddiq said.\n\nPhilip Bump in Brooklyn, Louisa Loveluck in Beirut, and David Nakamura, Philip Rucker, Mike DeBonis, Lori Aratani, Carol Morello and Rachel Weiner in Washington contributed to this report.", "authors": [], "publish_date": "2017-01-28", "source": "washingtonpost", "top_words": ["executive", "lawyers", "deportations", "ban", "refugee", "judge", "order", "officials", "united", "states", "signed", "furor", "children", "worldwide", "halts", "dulles", "detained", "causes"], "summary": "Several hours after the judicial rulings, the Department of Homeland Security said it would continue to implement Trump’s executive order.\nPresident Trump signed an executive order that halted refugees and residents from certain predominantly Muslim countries from entering the United States.\nNationwide, he said, 109 people had been denied entry into the United States.\nBooker told protesters he agreed with the attorneys and predicted a “long, arduous and tough fight” over the executive order.\nHer husband is in the United States on a J1 visa for professional training, Seddiq said."}