{"url": "https://www.washingtonpost.com/news/tripping/wp/2017/02/01/what-should-travelers-expect-following-trumps-travel-ban-even-experts-say-its-hard-to-know/", "id": "217", "title": "What should travelers expect following Trump’s travel ban? Even experts say it’s hard to know.", "text": "\n\nDemonstrators protest President Trump’s executive order which imposes a freeze on admitting refugees into the United States and a ban on travel from seven Muslim-majority countries at the international terminal at O’Hare Airport on Jan. 29, 2017. Similar protests have been staged at airports nationwide. (Photo by Scott Olson/Getty Images)\n\nPresident Trump’s executive order banning people from seven Muslim-majority nations from entering the country has created political turmoil, protest, and confusion for air travelers around the globe.\n\nAmid all the tumult, even some travel experts and travelers’ advocates have been struggling to provide insight and guidance in a quickly changing situation. The original order – which has been the subject of legal challenges — has undergone changes in the way it’s been enforced. Meanwhile, airlines have been working to comply with the directive and some, such as United, American Airlines, and others, have taken steps to accommodate affected travelers by refunding and rebooking flights.\n\nSo what will the impact be on tourism and travel? What rights do travelers have? And what should you expect now if you’re traveling overseas?\n\n“To be honest with you, I don’t know,” Charles Leocha, president of Travelers United, a Washington nonprofit organization that advocates for airline passengers. “And that’s part of the problem. The way it was crafted, we have a presidential directive that didn’t take into account a lot of unintended consequences, and now they’re dealing with a lot of unintended consequences piece by piece.”\n\n[Here’s why airlines were scrambling after Trump’s travel ban]\n\nLeocha said such chaos should have been predictable given the nature of sudden policy shifts on a complex subject. Even travel-related legislation and policies that undergo years of debate and development often contain unforeseen problems once they go into effect.\n\nInitially, the president’s order caused U.S. permanent residents who hold green cards to be halted from entry, but that’s since been lifted, and the military has put together lists of people from the affected countries who have been working with the services and have been vetted for entry, he said.\n\nAirlines for America, an industry trade organization, says through a spokesman Tuesday that the industry remains committed to the well-being of all its customers and has been working diligently to accommodate travelers affected by the ban. Airlines have also been in touch with the Department of Homeland Security and U.S. Customs and Border Protection in seeking to comply with the executive order.\n\n“At this point, we are not seeing any significant operational impact to the system,” A4A spokesman Vaughn Jennings said in an email.\n\nLeocha’s best advice for U.S. travelers is to sign up for Global Entry, a program of Customs and Border Protection (CBP) that’s similar to the Transportation Security Administration’s (TSA) PreCheck program. Global Entry can take a few months to obtain, Leocha said, but it allows people expedited movement through passport and customs controls, and that could come in handy for the next few months until questions about Trump’s order are sorted out.\n\n“Something tells me the lines are going to be a mess for at least the next 90 days,” Leocha said. “When I land at JFK and there’s a 45 minute wait to get through passports, basically, it takes me about 45 seconds to go through. It’s like magic,” he said referring to Global Entry.\n\nPaul Hudson, president of Flyersrights.org, said the biggest impact on travelers could come when and if other countries react to the U.S. ban with stricter travel policies of their own. That’s what happened after the Sept. 11, 2001 terrorist attacks when the United States imposed stricter visa and entry rules on foreign nationals. Other countries retaliated by making it harder and more expensive for U.S. citizens to obtain visas, Hudson said.\n\n“There will be some blowback from certain countries,” Hudson said. “When people travel abroad, there’s an assumption that with an American passport you can pretty much go anywhere. But more and more countries require Americans to have visas.”\n\nHudson also said that it’s a pretty safe bet that Trump’s order will depress tourism and travel.\n\n“Obviously, there’s going to be a big drop from countries represented in this order, but that only represents 13 percent of the world’s Muslims,” he said. “There may be many others that just decide they don’t feel welcome coming here and they don’t want to come.”\n\nRead more of Tripping:\n\n[Trump was among record numbers taking a gun through TSA checkpoint]\n\n[Uber drivers earn about $15.68 an hour but disparities are significant, survey finds]\n\n[Virginia bill addresses the scourge of drunken Segway drivers on roads. Yes, you read that right.]", "authors": [], "publish_date": "2017-02-01", "source": "washingtonpost", "top_words": ["thats", "travel", "ban", "expect", "know", "travelers", "airlines", "working", "following", "united", "trumps", "countries", "entry", "experts", "order", "hard", "say"], "summary": "(Photo by Scott Olson/Getty Images)President Trump’s executive order banning people from seven Muslim-majority nations from entering the country has created political turmoil, protest, and confusion for air travelers around the globe.\nAmid all the tumult, even some travel experts and travelers’ advocates have been struggling to provide insight and guidance in a quickly changing situation.\nThe original order – which has been the subject of legal challenges — has undergone changes in the way it’s been enforced.\n“To be honest with you, I don’t know,” Charles Leocha, president of Travelers United, a Washington nonprofit organization that advocates for airline passengers.\nBut more and more countries require Americans to have visas.”Hudson also said that it’s a pretty safe bet that Trump’s order will depress tourism and travel."}