{"url": "https://www.washingtonpost.com/news/worldviews/wp/2017/02/15/a-breakaway-region-of-somalia-begs-the-trump-administration-for-travel-ban-exemption/", "id": "226", "title": "A breakaway region of Somalia begs the Trump administration for travel ban exemption", "text": "\n\nThe top portion of a news release sent by the Somaliland government describing a letter it sent to top U.S. officials.\n\nA region that claims independence from Somalia is feeling as though it is wheat thrown in with the chaff.\n\nPresident Trump's Jan. 27 executive order temporarily barring citizens of seven majority-Muslim nations from traveling to the United States includes Somalia, and thus Somaliland, whose independence is not recognized by any country.\n\nBut for 26 years, the breakaway region has operated as an autonomous republic. It has shielded itself from the disorder and violence that has led many to characterize Somalia as a “failed state.” Somaliland has its own police, army, flag and currency, and has held regular elections for parliament and president.\n\nAnd while the executive order has been struck down by federal courts, Trump administration officials have said they intend to write a new one that would presumably target the same countries — although with caveats to avoid further legal action.\n\n\n\n\n\nOn Monday, Somaliland's government wrote a letter to Secretary of State Rex Tillerson and Homeland Security Secretary John F. Kelly pleading for an exemption from the executive order. In it, Somaliland's foreign minister, Sa'ad Ali Shire, argues that his region does not have the “deteriorating conditions … [that] due to war, strife, disaster, and civil unrest increase the likelihood that terrorists will use any means possible to enter the United States,” as described in the order.\n\nIn fact, Somaliland fought bitterly against its southern neighbor to win its sustained peace. There hasn't been a terrorist attack there since 2008. Meanwhile, Somalia's government struggles to control much of its own territory beyond its capital, Mogadishu. A fight against the extremist al-Shabab group has been hampered by corruption and division in the government.\n\nLast week, however, lawmakers in Somalia elected a new president, Mohamed Abdullahi Farmajo, a U.S. dual citizen and former prime minister, who is seen as less corruptible and has wider popular support than his predecessor.\n\n[Expectations run high for Somalia’s new president]\n\nSomaliland's relative stability hasn't meant that the United States will consider recognizing its independence. The official Washington line has long been that it will work with Mogadishu to reunify the country. It could be years, if not decades, before Somalia is strong enough to control its own territory, let alone Somaliland's. And even then, resentment runs deep between the regions.\n\nUnfortunately for residents of Somaliland, that policy will likely mean that they will continue to be considered part of Somalia. Should the Trump administration provide the exemption, it might be seen as the first step toward acknowledging Somaliland's independence, and thus giving up on the possibility of a unified Somalia.\n\nAs such, Shire's letter is not just an appeal for leniency, but a request to be rewarded for sharing fundamental values with the United States. Providing the exemption, he argues, would reaffirm “that strong and responsible governance provides a foundation upon which America’s partners can secure progress for their citizens and contribute to shared international objectives.”\n\nRead More:\n\nHow a breakaway region of Somalia hopes to build a new country\n\nSomaliland agrees to UAE military base in northern port", "authors": [], "publish_date": "2017-02-15", "source": "washingtonpost", "top_words": ["travel", "breakaway", "independence", "trump", "ban", "somalilands", "somalia", "exemption", "order", "united", "region", "states", "begs", "administration", "somaliland", "letter"], "summary": "A region that claims independence from Somalia is feeling as though it is wheat thrown in with the chaff.\n[Expectations run high for Somalia’s new president]Somaliland's relative stability hasn't meant that the United States will consider recognizing its independence.\nIt could be years, if not decades, before Somalia is strong enough to control its own territory, let alone Somaliland's.\nShould the Trump administration provide the exemption, it might be seen as the first step toward acknowledging Somaliland's independence, and thus giving up on the possibility of a unified Somalia.\nAs such, Shire's letter is not just an appeal for leniency, but a request to be rewarded for sharing fundamental values with the United States."}