{"url": "https://www.washingtonpost.com/news/post-nation/wp/2017/01/31/872-refugees-will-be-allowed-in-the-u-s-this-week-dhs-says/", "id": "298", "title": "Trump administration says 872 refugees will be allowed in the U.S. this week", "text": "Secretary of Homeland Security John Kelly appeared before the media, seeking to clarify how President Trump's executive order is being implemented, on Jan. 31. (The Washington Post)\n\nThe Department of Homeland Security said Tuesday that it would allow more than 800 refugees to enter the United States this week, an announcement that comes amid widespread anger and confusion following President Trump’s sweeping immigration order.\n\nTrump’s order temporarily bans citizens from seven Muslim-majority countries from entering the United States and halts refugee resettlement for a 120-day period.\n\nHowever, officials said at a briefing Tuesday afternoon that they would allow 872 refugees into the country.\n\nThese refugees were ready to travel and would face “undue hardship” if not able to do so, Kevin K. McAleenan, acting commissioner of U.S. Customs and Border Protection, said at a briefing Tuesday afternoon. They will be processed with waivers through the end of the week, he said.\n\n[Hundreds of lawyers descend on airports to offer free help after Trump’s executive order]\n\nAccording to a Homeland Security Web page about the immigration order, the 872 refugees are “considered to be in transit.” In the order signed by Trump last week, the temporary suspension of refugee entry to the country allows an exception for refugees “already in transit” and who would face “undue hardship” if denied admission.\n\nThe immigration order has created chaos and uncertainty around the globe, stranding some people at airports, causing others to be detained and raising questions about its scope.\n\nGroups that work with refugees expressed grave concerns about what the entry bans would mean. On Monday, the United Nations High Commissioner for Refugees said in a statement that 800 refugees “set to make America their new home … [found] themselves barred from traveling to the U.S.”\n\n“Refugees are anxious, confused and heartbroken at this suspension in what is already a lengthy process,” the U.N. refugee agency said in a statement. The agency estimated that 20,000 refugees who might have been resettled in the United States over the 120-day period would be affected by the ban.\n\nReuters first reported that federal officials planned to grant waivers to the 872 refugees.\n\n[Trump’s refugee ban is a matter of life and death for some, including a 1-year-old with cancer]\n\nAt the same Tuesday briefing, Homeland Security Secretary John F. Kelly echoed remarks from Trump in saying that the order is not a “Muslim ban.”\n\nTrump’s sweeping order, signed Friday, follows his announcement during the presidential campaign that there should be a ban on Muslims entering the United States. In an interview the day after Trump signed the order, former New York mayor Rudy W. Giuliani, who has advised Trump, said he was asked by Trump to find a way to create a Muslim ban “legally.”\n\nPresident Trump signed an executive order to halt U.S. entry for refugees, migrants and foreign nationals for 120 days starting Jan. 27. Fiery protests and lawsuits made for a tumultuous weekend. Here's what you need to know. (Dalton Bennett,Erin Patrick O'Connor,Katherine Shaver,Monica Akhtar,McKenna Ewen/The Washington Post)\n\nThe Trump administration has argued that it selected the seven countries on the travel ban based on the Obama administration’s actions identifying those nations as harboring potential terrorism threats. Former president Barack Obama on Monday rejected the contention that the new order was similar to actions taken by his administration.\n\nKelly also said that DHS would comply with judicial orders regarding the travel ban, despite cases where lawyers were prevented from talking to detainees, directly contradicting a court order.\n\n“We would not ignore a court order,” Kelly said.\n\nKelly said during the briefing that as far as officials knew, no Customs official “knowingly” violated a court order.\n\nThis story, posted at 12:58 p.m., has been updated.\n\nFurther reading:\n\nTrump has fired the acting attorney general who ordered Justice Dept. not to defend president’s travel ban\n\nJudge halts deportations as refugee ban causes worldwide furor", "authors": [], "publish_date": "2017-01-31", "source": "washingtonpost", "top_words": ["travel", "trump", "allowed", "ban", "security", "refugee", "order", "week", "872", "united", "states", "signed", "refugees", "administration"], "summary": "Trump’s order temporarily bans citizens from seven Muslim-majority countries from entering the United States and halts refugee resettlement for a 120-day period.\nHowever, officials said at a briefing Tuesday afternoon that they would allow 872 refugees into the country.\nThe agency estimated that 20,000 refugees who might have been resettled in the United States over the 120-day period would be affected by the ban.\nReuters first reported that federal officials planned to grant waivers to the 872 refugees.\nnot to defend president’s travel banJudge halts deportations as refugee ban causes worldwide furor"}