{"url": "https://www.washingtonpost.com/news/inspired-life/wp/2017/02/15/to-counter-trumps-travel-ban-this-jewish-filmmaker-wants-to-give-american-muslims-a-voice/", "id": "207", "title": "To counter Trump’s travel ban, this Jewish filmmaker wants to give American Muslims a voice", "text": "\n\nIman Zawahry is helping support a new grant program for Muslim filmmakers. (Courtesy of Islamic Scholarship Fund)\n\nThe weekend of the presidential inauguration, during his opening monologue on “Saturday Night Live,” host Aziz Ansari made the compelling observation that Islamophobia is largely a result of lack of exposure to Muslims beyond how they are portrayed by Hollywood and in the news. He joked that the news should consider counter programming just showing four Muslim people eating nachos in Chicago.\n\n“Maybe what needs to happen is when they do the news report, they should do a second report about some other brown people that are just up to normal stuff — just to calm those people down,” Ansari said. “A lot of people are Islamophobic … because any time they watch movies and TV shows, and a character is Arabic or they’re praying or something like that, that scary-ass music from ‘Homeland’ is underneath it, it’s terrifying.”\n\nThis is something Iman Zawahry, a Muslim filmmaker, has thought about her whole life. Often her projects have been turned down because “America isn’t ready for a Muslim cast” or “there’s too many brown people in this film,” she said. Her life goal, she said is to “have characters that have the same wants as in any creative story but just happen to be Muslim, they are just relatable stories.”\n\n[‘I’ve never felt more welcome or more American than during Trump’s rise,’ this Muslim teen says]\n\nMeanwhile, after President Trump announced his now-stalled travel ban on people from seven majority-Muslim countries, Michael Morgenstern, a Jewish filmmaker in California, said he was appalled and wanted to find a way to support the Muslim American community. The answer was simple: Give them a chance to tell their own stories that would challenge false narratives and celebrate their community.\n\nSo, he reached out to the Islamic Scholarship Fund where Zawahry is a director of its film grant program, and suggested creating a fund for Muslim filmmakers. Days later, they launched the American Muslim Storytellers grant and kicked off a crowdfunding campaign on Indiegogo, which ends Feb. 25, in hopes of raising enough money to support several projects.\n\nFilm has the power to build empathy and humanize its characters. By giving Muslims a voice in how their stories are told, there’s a chance to change public perception and prejudice, Zawahry said. They envision short and long films, documentaries, animation or even commercials, that show Muslims as human beings, rather than people to fear, Zawahry said.\n\n“The ban was, to me, an opportunity to get people’s attention, but the thing we’re trying to address has been happening for decades. But when these issues enter the public consciousness, it’s a time to talk about them and a time we don’t want to miss,” Morgenstern said. “After Trump’s election, a lot of my friends came together to talk about what can be done. This is a campaign that people can respond to that will target the change we want to see.”\n\nRead more Inspired Life:\n\nWhy these Philadelphia lawyers are helping immigrants seek a green card for only $1\n\n‘Now they live in the light’: A Syrian refugee family finds only love and compassion in America\n\nThe incredibly gracious way Muslims welcomed a man who had drunkenly shot their mosque", "authors": [], "publish_date": "2017-02-15", "source": "washingtonpost", "top_words": ["theres", "zawahry", "travel", "wants", "ban", "voice", "filmmaker", "support", "trumps", "counter", "grant", "talk", "jewish", "muslim", "muslims", "american", "way"], "summary": "Iman Zawahry is helping support a new grant program for Muslim filmmakers.\nHe joked that the news should consider counter programming just showing four Muslim people eating nachos in Chicago.\nDays later, they launched the American Muslim Storytellers grant and kicked off a crowdfunding campaign on Indiegogo, which ends Feb. 25, in hopes of raising enough money to support several projects.\nBy giving Muslims a voice in how their stories are told, there’s a chance to change public perception and prejudice, Zawahry said.\n“After Trump’s election, a lot of my friends came together to talk about what can be done."}