{"url": "https://www.washingtonpost.com/world/national-security/trump-says-hell-issue-a-new-executive-order-on-immigration-by-next-week/2017/02/16/4b65e7d6-f463-11e6-a9b0-ecee7ce475fc_story.html", "id": "271", "title": "Trump says he’ll issue a new executive order on immigration by next week", "text": "President Trump said Thursday that he will issue a new executive order on immigration by next week, and Justice Department lawyers asked a federal appeals court to hold off on taking action in the legal battle over his initial travel ban until that new order is in place.\n\nIn a news conference at the White House, Trump said the new order would “comprehensively protect our country,” and he hinted that it might contain new vetting measures for travelers. Trump’s first order temporarily barred citizens of seven Muslim-majority countries and refugees from entering the United States, ostensibly so officials could review and tighten screening procedures.\n\n“Extreme vetting will be put in place, and it already is in place in many places,” Trump said. He said the administration “had to go quicker than we thought” because a federal appeals court refused to lift the suspension on his travel ban.\n\n[4 ways the Trump administration could fight for its travel ban]\n\nThe president’s comments and the Justice Department’s request to the U.S. Court of Appeals for the 9th Circuit mean that the administration — at least for now — is pumping the brakes on the furious court battle to restore the travel ban. Instead, the administration indicated in its filing that it expects that a revamped executive order will eliminate judges’ concerns, even those the Justice Department views as unfounded. The 9th Circuit agreed late Thursday to wait until a new order was issued to potentially reconsider the matter before a larger group of judges.\n\n(Reuters)\n\nWashington state Attorney General Bob Ferguson, who had successfully sued to block the travel ban, wrote on Twitter that the Justice Department filing, in particular, “recognizes the obvious — the President’s current Exec Order violates the Constitution.”\n\n“President Trump could have sought review of this flawed Order in the Supreme Court but declined to face yet another defeat,” Ferguson wrote.\n\nThe legal wrangling, though, is far from over, and even a new executive order will not necessarily end the need for it. What happens next will largely depend on how significantly the rewritten order departs from the original. Justice Department lawyers wrote that the revisions would be meaningful.\n\n“Rather than continuing this litigation, the President intends in the near future to rescind the Order and replace it with a new, substantially revised Executive Order to eliminate what the panel erroneously thought were constitutional concerns,” the lawyers wrote. “In so doing, the President will clear the way for immediately protecting the country rather than pursuing further, potentially time-consuming litigation.”\n\nTrump could make clear that his order no longer applies to green-card holders — who probably have the strongest case to sue — or he could craft an order that would affect only people who have not yet applied for visas. But a three-judge panel with the U.S. Court of Appeals for the 9th Circuit said even those modifications would not necessarily persuade them to lift a suspension of the ban, because such changes would not help U.S. citizens who “have an interest in specific noncitizens’ ability to travel to the United States.”\n\nLee Gelernt, who is deputy director of the American Civil Liberties Union’s national Immigrants’ Rights Project and is involved in another legal challenge to Trump’s order in federal court in New York, said it is difficult to assess a new order without seeing it, “but I think any type of ban is going to be legally problematic, and I also don’t think that the taint of religious discrimination is going to go away.”\n\nThe original executive order, signed Jan. 27, barred refugees from entering the country for 120 days; citizens of Iran, Iraq, Libya, Somalia, Sudan and Yemen for 90 days; and citizens of Syria indefinitely. A federal judge in Seattle first ordered the ban suspended Feb. 3, and the three-judge panel with the 9th Circuit last week unanimously rejected the administration’s request to undo that freeze. That left Justice Department lawyers with two options in the short run: rush immediately to the Supreme Court, or ask the full 9th Circuit to take up the matter in what is known as a rehearing “en banc.”\n\nThey had yet to make a choice when a judge on the 9th Circuit asked the judges to take a vote on their own, and the circuit’s chief judge asked the parties to file their positions on the matter by Thursday.\n\nThe Justice Department, representing the Trump administration, argued in its filing that the three-judge panel was wrong, but — given that a new executive order was coming anyway — the 9th Circuit should hold off on taking up the matter en banc.\n\nWashington state and Minnesota, which are suing over the ban, also argued against en banc consideration, but they asserted that the three-judge panel got it right.\n\nAt issue has not been whether Trump’s ban is ultimately legal — although that has been part of the consideration. The judges have been asked to consider only whether national security concerns necessitate an immediate restoration of the travel ban, when weighed against the economic and other harms Washington and Minnesota officials say it is imposing on their states.\n\nThe president has broad authority to set immigration policy, but federal judges nationwide have ruled against Trump’s particular travel ban. This week, a federal judge in Virginia handed down perhaps the most stinging rebuke of the executive order, declaring that there was evidence that it was motivated not by national security concerns but instead by “religious prejudice” toward Muslims.", "authors": [], "publish_date": "2017-02-16", "source": "washingtonpost", "top_words": ["executive", "travel", "trump", "ban", "justice", "immigration", "circuit", "court", "9th", "week", "federal", "hell", "issue", "order"], "summary": "President Trump said Thursday that he will issue a new executive order on immigration by next week, and Justice Department lawyers asked a federal appeals court to hold off on taking action in the legal battle over his initial travel ban until that new order is in place.\nInstead, the administration indicated in its filing that it expects that a revamped executive order will eliminate judges’ concerns, even those the Justice Department views as unfounded.\nThe legal wrangling, though, is far from over, and even a new executive order will not necessarily end the need for it.\n“Rather than continuing this litigation, the President intends in the near future to rescind the Order and replace it with a new, substantially revised Executive Order to eliminate what the panel erroneously thought were constitutional concerns,” the lawyers wrote.\nThe president has broad authority to set immigration policy, but federal judges nationwide have ruled against Trump’s particular travel ban."}