{"url": "https://www.washingtonpost.com/world/national-security/federal-judge-temporarily-blocks-trumps-immigration-order-nationwide/2017/02/03/9b734e1c-ea54-11e6-bf6f-301b6b443624_story.html", "id": "204", "title": "Federal judge temporarily blocks Trump’s entry order nationwide", "text": "A federal judge in Washington state on Friday temporarily blocked enforcement of President Trump’s controversial ban on entry to the United States, and airlines planned to begin allowing passengers from banned countries to board, according to a person familiar with the matter.\n\nFollowing the ruling, government authorities immediately began communicating with airlines and taking steps that would allow travel by those previously barred from doing so, according to a U.S. official. At the same time, though, the White House said in a statement that the Justice Department would “at the earliest possible time” file for an emergency stay of the “outrageous” ruling from the judge. Minutes later, it issued a similar statement omitting the word “outrageous.”\n\n“The president’s order is intended to protect the homeland and he has the constitutional authority and responsibility to protect the American people,” the White House said.\n\nThe president, however, was less cordial on Twitter.\n\n“The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!” Trump posted in a Saturday morning tweet.\n\n(Reuters)\n\nHe also claimed that “certain Middle-Eastern countries agree with the ban.”\n\n“They know if certain people are allowed in it’s death & destruction!” he posted.\n\nThe federal judge’s ruling, which was broader than similar ones before it, set up a high-stakes legal confrontation between the new president and the judicial branch over his temporary ban on entry by citizens of seven majority-Muslim countries as well as refugees. In his opinion, U.S. District Judge James L. Robart wrote that “fundamental” to the court’s work was “a vigilant recognition that it is but one of three equal branches of our federal government.”\n\n“The court concludes that the circumstances brought before it today are such that it must intervene to fulfill its constitutional role in our tripart government,” he wrote.\n\nThe ruling is temporary, and the ultimate question of whether Trump’s executive order will pass constitutional muster will fall to higher-level courts. Legal analysts have said the ban could be difficult to permanently undo because the president has broad authority to set immigration policy.\n\nRobart granted a request from lawyers for the state of Washington who had asked him to stop the government from acting on critical sections of Trump’s order. Justice and State department officials had revealed earlier Friday that about 60,000 — and possibly as many as 100,000 — visas already have been provisionally revoked as a result of Trump’s order. A U.S. official said that because of the court case, officials would examine the revoking of those visas so that people would be allowed to travel.\n\nWashington Attorney General Bob Ferguson hailed the case as “the first of its kind” and declared that it “shuts down the executive order immediately.” Robart, a judge appointed by George W. Bush, said in his written order that U.S. officials should stop enforcing the key aspects of the ban: the halting of entry by refugees and citizens from certain countries. He did not specifically address the matter of those whose visas already had been revoked.\n\nThe Justice Department said in a statement that it was “reviewing the court’s order and will determine next steps.” A State Department official said the agency was “working closely with the Department of Homeland Security and our legal teams to determine how this affects our operations.”\n\n“We will announce any changes affecting travelers to the United States as soon as that information is available,” the official said.\n\nImmigration lawyers said Friday night that they were still assessing the Washington case but were heartened by it.\n\n“The order makes it clear that all of the main provisions of the executive order cannot be enforced at this time,” said Lee Gelernt, deputy director of the American Civil Liberties Union’s Immigrants’ Rights Project. “That means that a lot will have to change immediately, and the government will have to make clear how they intend to follow the order with respect to all of the ways in which immigrants here and abroad are being affected at the moment.”\n\nSince it was first rolled out a week ago, Trump’s travel ban has been evolving — both because of legal challenges and as a result of decisions by the administration to walk back aspects of it. Green-card holders from the affected countries, for example, no longer need waivers to get into the United States, as they did when the order took effect. And the Department of Homeland Security asserted Friday that the order does not apply to dual citizens with passports from countries other than the seven listed.\n\n[Has your visa been affected by Trump’s travel ban? Tell us about it.]\n\nThe numbers of visas revoked, too, demonstrated the far-reaching impact of the order. Families have been split, students unable to pursue their education, and those in the United States unable to leave for fear of not being able to return — and not by the handful, but by the tens of thousands.\n\nDuring a hearing in a lawsuit by two Yemeni brothers who arrived at Dulles International Airport last Saturday and were quickly put on a return flight to Ethi­o­pia because of the new restrictions, a Justice Department lawyer said 100,000 visas had been revoked.\n\nThe figure, though, was immediately disputed by the State Department, which said the number of visas revoked was roughly 60,000. A spokeswoman said earlier Friday the revocations have no impact on the legal status of people already in the United States, but if those people left the country, their visas would no longer be valid.\n\nAbout the same time, in Boston, a group of four students enrolled in area colleges, a researcher and the spouse of a permanent resident — all of whom came from countries affected by the ban — flew into the United States.\n\nThe group that entered was aboard the same flight from Frankfurt operated by the German airline Lufthansa, which a day earlier had noted on its website a court decision from last weekend that it claimed had “suspended” Trump’s decree on flights to Boston. Lawyers hailed the development as good news.\n\n“We’ve got six more today than we had yesterday,” said Susan Church, an attorney for the American Immigration Lawyers Association of New England.\n\n[No matter what you call it, Trump’s executive order on immigration will be tough to overturn]\n\nAmong those who made their way back to the United States were two undergraduate Massachusetts Institute of Technology students who had been visiting their families for winter break; as well as 27-year-old Behnam Partopour, a PhD student from Iran studying chemical engineering at Worcester Polytechnic Institute who had been working on a project in Germany; and Samira Asgari, an Iranian scientist who was headed to Boston to conduct research at Brigham and Women’s Hospital.\n\nColleen Wamback of Worcester Polytechnic Institute said Partopour had a student visa which was issued before the executive order but was delayed in getting to him. Asgari, on the other hand, had tried twice to board flights to the United States but was turned away because of the ban. She had filed a lawsuit over the matter.\n\nWashington and Minnesota had filed a broad legal challenge to Trump’s order, alleging it was “separating families, harming thousands of the States’ residents, damaging the States’ economies, hurting State-based companies, and undermining both States’ sovereign interest in remaining a welcoming place for immigrants and refugees.” Jeffrey P. Bezos, the owner of The Washington Post and a Washington state resident, has spoken out against the ban.\n\nIn the past several days, federal judges in New York, California, Massachusetts and Virginia have issued rulings temporarily blocking aspects of the Trump order — though the orders all seemed to be limited to people who had made their way to U.S. airports, or, in Virginia’s case, to certain people.\n\nThe New York and Massachusetts rulings both blocked the government from detaining or deporting anyone from the seven affected countries who could legally enter the U.S., and the Massachusetts ruling added the critical phrase “absent the executive order.” In California, a judge declared that U.S. officials were also prevented from “blocking” people from entering who had a valid visa.\n\nDoug Struck, Rachel Weiner, Ann Marimow, Abigail Hauslohner and Sari Horwitz contributed to this report.", "authors": [], "publish_date": "2017-02-03", "source": "washingtonpost", "top_words": ["blocks", "temporarily", "ban", "visas", "state", "judge", "united", "states", "trumps", "nationwide", "entry", "countries", "federal", "order", "department", "legal"], "summary": "The ruling is temporary, and the ultimate question of whether Trump’s executive order will pass constitutional muster will fall to higher-level courts.\nRobart granted a request from lawyers for the state of Washington who had asked him to stop the government from acting on critical sections of Trump’s order.\nJustice and State department officials had revealed earlier Friday that about 60,000 — and possibly as many as 100,000 — visas already have been provisionally revoked as a result of Trump’s order.\nThe figure, though, was immediately disputed by the State Department, which said the number of visas revoked was roughly 60,000.\nAsgari, on the other hand, had tried twice to board flights to the United States but was turned away because of the ban."}