{"url": "https://www.washingtonpost.com/world/national-security/dhs-secretary-trump-administration-considering-more-streamlined-version-of-travel-ban/2017/02/18/4f8cb56c-f5f6-11e6-b9c9-e83fce42fb61_story.html", "id": "234", "title": "DHS secretary: Trump administration considering ‘more streamlined’ version of travel ban", "text": "Homeland Security Secretary John F. Kelly said Saturday that the Trump administration is considering a new version of the executive order banning travel of citizens from seven Muslim-majority nations that would allow travelers who were already on airplanes bound for the United States into the country but would bar those who had not yet boarded.\n\n“The president is contemplating releasing a tighter, more streamlined version of the first E.O.,” Kelly told a gathering of the Munich Security Conference. That order, issued a week into Trump’s presidency, was quickly stayed by courts, prompting the president to criticize the workings of the justice system.\n\n“We will have this time the opportunity . . . of input on the rollout plan, in particular that no one’s caught in the system coming overseas to our airports,” Kelly said. “It’s a good assumption” that green-card holders will be exempt, he said, referring to legal permanent residents.\n\n“If they’re in motion from some distant land to the United States, when they arrive, they will be allowed in,” he said. “That being said, we will have a short phase-in period to make sure that they don’t get on the airplane.”\n\nThat would spare U.S. airports some of the chaos in the days after the travel ban on citizens of seven Muslim-majority countries was imposed Jan. 27, but it may simply export the confusion to foreign airports.\n\n(Thomas Johnson/The Washington Post)\n\nLegal analysts have said a new executive order that maintains bans would not likely allay the concerns of federal judges who put the original order on hold. Even if President Trump made clear his order did not apply to green-card holders, or limited it so that it affected only those applying for visas, a three-judge panel with the U.S. Court of Appeals for the 9th Circuit said that would not necessarily persuade them to lift their freeze. That is because such changes would not help U.S. citizens who “have an interest in specific noncitizens’ ability to travel to the United States,” the judges wrote.\n\n[4 ways the Trump administration could fight for its travel ban]\n\nTrump, too, still must convince judges that whatever he does is not a Muslim ban disguised as a national security measure. Challengers could point to his campaign trail comments and those from ally Rudolph W. Giuliani as evidence that even the new order is meant to discriminate on the basis of religion and thus runs afoul of the Constitution. A federal judge in Virginia recently cited those comments in a forceful order declaring that the ban should be put on hold.\n\nU.S. homeland security officials denied entry to least 141 people in the week after Trump issued his executive order, according to a federal court document filed last week.\n\nThe affidavit from a top U.S. customs official provides the government’s first public release of the number of people it says were denied entry and returned to their home countries during the eight days the ban was in place.\n\nThe affidavit was filed Thursday in federal court in Brooklyn in a case challenging Trump’s ban. One of the lead plaintiffs, Hameed Darweesh, an Iraqi husband and father of three who worked for the U.S. military and was issued a valid visa, was detained at John F. Kennedy International Airport for more than 18 hours.\n\nAccording to the U.S. customs official, 44 people were denied entry at U.S. airports and another 97 were denied entry at land border ports of entry between Jan. 27, when Trump signed the executive order, and Feb. 3, when a federal judge in Washington state blocked its enforcement.\n\nThe 44 airport denials all took place on two days, Jan. 27 and 28, according to Todd Hoffman, who oversees admissions and processing of international visitors and travelers for the U.S. Customs and Border Protection agency. At the land border ports of entry, 97 people were turned back.\n\nThe affidavit says U.S. customs officials have been working with airlines to help affected travelers return to the United States. Already, 24 individuals who were turned back at airports have since returned, and 14 denied entry at land border points have been admitted.\n\nRebecca Heller, director of the International Refugee Assistance Project, part of the legal team representing the plaintiffs, said the numbers and circumstances do not reflect what immigration attorneys have been told by individuals who were detained.\n\n“I think these numbers are low because we continued to receive people who were threatened with deportation after Jan. 28,” she said in an interview Saturday.\n\n“Their claim that everyone left voluntarily and this idea that anyone who wants come back can just call up [U.S. customs officials] is just ludicrous,” she said.\n\nThe affidavit does not identify the individuals or what countries they are from. That leaves at least 103 people who were deported, with no public information on their whereabouts, Heller said.\n\nThe affidavit said the list of 141 individuals has been provided to the State Department.\n\nSun reported from Washington. Matt Zapotosky contributed to this report.", "authors": [], "publish_date": "2017-02-18", "source": "washingtonpost", "top_words": ["travel", "trump", "ban", "considering", "customs", "denied", "version", "united", "secretary", "dhs", "entry", "streamlined", "federal", "affidavit", "order", "administration"], "summary": "“The president is contemplating releasing a tighter, more streamlined version of the first E.O.,” Kelly told a gathering of the Munich Security Conference.\n[4 ways the Trump administration could fight for its travel ban]Trump, too, still must convince judges that whatever he does is not a Muslim ban disguised as a national security measure.\nA federal judge in Virginia recently cited those comments in a forceful order declaring that the ban should be put on hold.\nU.S. homeland security officials denied entry to least 141 people in the week after Trump issued his executive order, according to a federal court document filed last week.\nAlready, 24 individuals who were turned back at airports have since returned, and 14 denied entry at land border points have been admitted."}