{"url": "https://www.washingtonpost.com/news/dr-gridlock/wp/2017/02/02/trumps-travel-order-could-make-it-difficult-for-americans-who-travel-abroad-survey-finds/", "id": "314", "title": "Trump’s travel order could make it difficult for Americans who travel abroad, survey finds", "text": "\n\nTraffic backs up at Los Angeles International Airport on Jan. 29, 2017, due to a demonstration against the immigration ban that was imposed by President Trump. (Photo by Justin Sullivan/Getty Images)\n\nAs airlines adjust to new rules governing who can and can’t enter the U.S., travel industry professionals are concerned the ban could make it more difficult for Americans who travel abroad, according to results of an online survey released Thursday.\n\nNearly two-thirds of the corporate travel managers and travel service professionals surveyed by the Global Business Travel Association said they were worried that travel might become more difficult for Americans traveling outside the U.S.\n\nRoughly 56 percent said they were concerned the new restrictions would make travel to the U.S. more difficult, while 54 percent said they were worried the new policy could increase threats to U.S. citizens traveling abroad.\n\nThe online survey was conducted shortly after President Trump signed the executive order barring refugees and people from seven Muslim-majority counties from entering the United States. And while the sample size was relatively small, the results illuminate some of the challenges that travel professional are anticipating.\n\n[Trump’s immigration order will be difficult to overturn, legal analysts say]\n\nIt’s too soon to tell what economic impact the ban might have on the travel industry. Airlines for America, a trade group that represents many of the largest U.S. carriers said is has not seen any major disruptions as a result of the new rules.\n\nBut GBTA’s survey found that many members expect to see a pull back in the amount of travel by their companies.\n\nNearly three in 10 travel managers and professionals surveyed, said they expected to see a reduction in business travel at their company over the next 90 days. Roughly the same percentage said the ban could affect travel for the next six to 12 months and beyond.\n\n“With 30 percent of companies expected to reduce travel, the economy will most certainly take a hit,” said Michael W. McCormick, GBTA’s executive director. “While we understand the need for security, GBTA is a strong proponent of risk-based security programs like the Visa Waiver Program.”\n\nThe survey found mixed views of the travel ban. Half of those surveyed said they “strongly” or “somewhat oppose” the president’s action, while 38 percent said they “strongly” or “somewhat supported” the new policy.", "authors": [], "publish_date": "2017-02-02", "source": "washingtonpost", "top_words": ["travel", "surveyed", "survey", "abroad", "ban", "worried", "trump", "finds", "strongly", "trumps", "difficult", "traveling", "professionals", "order", "americans"], "summary": "Nearly two-thirds of the corporate travel managers and travel service professionals surveyed by the Global Business Travel Association said they were worried that travel might become more difficult for Americans traveling outside the U.S.\n[Trump’s immigration order will be difficult to overturn, legal analysts say]It’s too soon to tell what economic impact the ban might have on the travel industry.\nBut GBTA’s survey found that many members expect to see a pull back in the amount of travel by their companies.\nNearly three in 10 travel managers and professionals surveyed, said they expected to see a reduction in business travel at their company over the next 90 days.\n“While we understand the need for security, GBTA is a strong proponent of risk-based security programs like the Visa Waiver Program.”The survey found mixed views of the travel ban."}