{"url": "https://www.washingtonpost.com/world/middle_east/immigration-ban-sows-panic-anguish-and-confusion-at-airports-around-the-globe/2017/01/28/363093fc-e568-11e6-a419-eefe8eff0835_story.html", "id": "343", "title": "‘These are people’s lives they are playing with’: World’s airports turn into limbo for many under Trump order", "text": "A Syrian man walks down a road after a storm at a makeshift refugee camp near the village of Burayqah on the outskirts of southeastern Syrian border town of Quneitra on Jan. 28, 2017. (Mohamad Abazeed/Agence France-Presse via Getty Images)\n\nAfter working as an interpreter for an American security company in Iraq and enduring years of background checks after applying for a U.S. visa, Labeeb Ali’s hopes of moving to the United States ended abruptly in Qatar’s international airport on Saturday, when officials prevented him from boarding a flight to Texas.\n\n“I have the visa in my passport,” he said hours later, after he had stopped yelling at the airport staff and his rage had given way to despair and regret at having already sold his business and belongings in Iraq.\n\n“They have killed my dream,” he said. “They took it all away from me, in the last minutes.”\n\nPresident Trump’s order on Friday to temporarily ban citizens of several Muslim countries from entering the United States sowed panic, confusion and anguish in airports across the globe Saturday, as nationals of the affected countries were either barred by airlines from traveling or detained upon arrival in the United States.\n\n[‘Donald Trump destroyed my life,’ says barred Iraqi who worked for U.S.]\n\n(McKenna Ewen/The Washington Post)\n\nThose prevented from boarding U.S.-bound planes included Iraqis such as Ali, who said he had been granted a special immigration visa on Jan. 24 reserved for interpreters and translators who had worked for American forces in Iraq or Afghanistan. Others had fled war in Yemen or Syria or repression in Sudan or Iran. Taken together, Saturday’s restrictions amounted to another cruel trial for people who had escaped conflict and overcame the hurdles to win coveted American visas, only to be turned back on what should have been their journeys’ final leg.\n\nCountless others were left in a paralyzing limbo as they struggled to understand the president’s edict. They included Syrian students granted admission in American universities and facing the certainty that they would not be able to attend, and Iraqi or Iranian green-card holders traveling abroad and terrified at the possibility that they would not be able to return home.\n\n[Are you, or someone you know, affected by President Trump’s travel restrictions? Tell The Post.]\n\nSarah Amer, an Iraqi who lives in New York, had left her daughter at home and was visiting friends in Iraq when Trump signed the executive order. “They can’t just change the rules in one night,” she said Saturday, amid confusion about whether green-card holders from Iraq could return to the United States.\n\n“These are people’s lives they are playing with,” she said.\n\nThe executive order, titled “Protecting the Nation from Foreign Terrorist Entry into the United States,” bars citizens from Syria, Iran, Iraq, Yemen, Sudan, Somalia and Libya, all predominantly Muslim nations, from entering the United States for the next 90 days. The order also indefinitely bars Syrian refugees from resettling in the United States and suspends the entry of all refugees from any country for 120 days.\n\nThe order followed Trump’s repeated campaign pledges to restrict Muslim immigration to the United States. But the speed with which it was promulgated — a week after the president took office — still caught those most affected by surprise.\n\n(Reuters)\n\nThe confusion extended to airlines, which issued contradictory or vague rules about who would be allowed to fly. Lufthansa, the German carrier, released a statement saying it was “obliged by law to strictly adhere to U.S. immigration requirements.” But, reflecting the uncertainty over the American directive, the airline said only that citizens of the affected countries “might not be accepted onboard U.S. flights.”\n\nQatar Airways said that passengers would be allowed to travel only if they were permanent green-card holders or had visas that were exempt from the order.\n\nManel Vrijenhoek, a spokeswoman for KLM, the Dutch carrier, said, “It’s not 100 percent clear who is allowed in and who is not.” The airline had barred seven passengers from traveling to the United States on Saturday, she said, after informing them “that there is no use in flying to the U.S. because you will be rejected. You won’t even be able to leave the plane.”\n\nShe would not say which country the passengers had come from, only that they were from one of the seven countries named in the presidential order.\n\n[As Trump bars Syrian refugees, life in their camps is getting harder]\n\nAli, the Iraqi citizen, said that two Syrians were also prevented from traveling on his flight to Texas. In Egypt, security officials stopped five Iraqis and a Yemeni national from boarding a flight to New York. There were unconfirmed reports that Iranian visitors as well as permanent green-card holders were restricted from traveling to the United States by officials at airports in Amsterdam, Abu Dhabi as well as Qatar, according to Hazhir Rahmandad, an Iranian American professor at the Massachusetts Institute of Technology who created a crowdsourced database to track Iranian travelers affected by the ban.\n\nAlthough the details in the database could not be independently verified, the reports also suggested scores of Iranian visitors and green-card holders were also being turned away at several U.S. airports upon arrival.\n\nThe data and reports so far “suggest there is confusion among border agents about how to treat” the various categories of visa holders, Rahmandad said.\n\nAnd there was consternation for Iranians who received the news while on the road. On Saturday, Ali Abdi, a 30-year-old Iranian green-card holder who studies at Yale University, was in transit in Dubai, on his way to Afghanistan to do research for his doctoral thesis, but he was suddenly worried that Trump’s directive had left him stranded.\n\nHe had received reports from friends and acquaintances that green-card holders were subject to the ban. Abdi, a human rights activist who claimed asylum in the United States in 2011, said he would not be able to return to Iran if he was denied reentry to the United States.\n\n“I’ll be stateless,” he said. “I left Iran eight years ago, and I have been looking for a home. I don’t think of the U.S. as that kind of place anymore,” he said.\n\n[He risked his life working for the U.S. in Iraq. Now his visa’s no good.]\n\nAbed Ayoub, the legal director of the American-Arab Anti-Discrimination Committee, an advocacy group that was counseling citizens from the affected countries, said the majority of the calls the group had received were from people overseas wondering whether they should even bother boarding a plane. They included an Iraqi woman who was flying to visit her family in the United States but at the last minute decided to go to Canada instead.\n\nCalls had also come from citizens of countries that were not affected by the ban, including Saudi Arabia, Pakistan and Morocco — part of what Ayoub called a broader “chilling effect” the presidential order had imposed across the Muslim world.\n\nThe group had advised the callers to double-check the latest rules before they begin their travels. “That list can be expanded at any point,” Ayoub said. “You want to be aware before you board the plane.”\n\nWhen Fuad Sharef and his family landed at Cairo airport Saturday morning, they were clutching boarding passes for their connecting flight to New York and valid one-year visas to the United States. They were headed, eventually, to Nashville, to start a new life.\n\nBut soon after they entered the terminal, Egyptian airport authorities stopped them and ordered them to hand over their passports. They informed him that the American Embassy in Baghdad had sent a communique saying the family could no longer travel on to the United States.\n\n“They didn’t explain why,” said Sharef, 51, who spoke by phone because he and his family were inside the transit section of the terminal and not allowed to leave. “But I knew this was because of the executive order signed by Donald Trump.”\n\nHe was traveling with his wife, Arazoo, 41; his son Bnyad, 19; his daughter Yad, 17; and another daughter, Shad, 10.\n\nLike many Iraqis wanting to resettle in the United States, Sharef took advantage of a program to assist Iraqis who worked for the U.S. government and American media in Iraq. Sharef had worked for Research Triangle Institute (RTI), a USAID subcontractor, for several years after the 2003 U.S.-led invasion, first as translator and later running a program that gave out microbusiness loans to Iraqis.\n\nWorking for the Americans was filled with perils, he said. He and other colleagues faced death threats — he knew co-workers who were kidnapped or killed. His work and background swayed the U.S. Embassy in Baghdad, and after two years of vetting, they deemed him safe enough to be resettled in the United States.\n\n[Trump’s refu­gee ban would alienate allies for U.S. troops, experts say]\n\nSharef sold his house, his car and his remaining possessions. He pulled his three children out of their schools. He spent $5,000 for air tickets and quit his job as a supply-chain manager for a large pharmaceutical firm. He was confident he would find an opportunity in Nashville, with his three degrees, including an MBA.\n\nSharef admits that he took a gamble. When he heard of Trump’s impending visa ban, he pushed their trip to the United States forward by a few days. The family is now scheduled to be placed on a flight back to Irbil on Sunday morning — after spending the night inside the airport terminal.\n\n“Donald Trump destroyed my life,” said Sharef. “How can he do this to people who risked their lives to help America?”\n\nSalim reported from Baghdad, and Raghavan reported from Cairo. Erin Cunningham in Istanbul, Louisa Loveluck in Beirut, Heba Farouk Mahfouz in Cairo and Heba Habib in Stockholm contributed to this report.\n\nRead more:\n\nOpen doors, slamming gates: The tumultuous politics of U.S. immigration policy\n\nHere’s how the world is responding to Trump’s ban on refugees, travelers from 7 Muslim nations\n\nAnne Frank and her family were also denied entry as refugees to the U.S.\n\nEgyptian court rejects government attempt to give islands to Saudi Arabia\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "authors": [], "publish_date": "2017-01-28", "source": "washingtonpost", "top_words": ["playing", "lives", "limbo", "turn", "trump", "airports", "affected", "holders", "iraq", "united", "states", "trumps", "traveling", "peoples", "order", "greencard", "american", "worlds"], "summary": "The order also indefinitely bars Syrian refugees from resettling in the United States and suspends the entry of all refugees from any country for 120 days.\nThe order followed Trump’s repeated campaign pledges to restrict Muslim immigration to the United States.\nHe had received reports from friends and acquaintances that green-card holders were subject to the ban.\nAbdi, a human rights activist who claimed asylum in the United States in 2011, said he would not be able to return to Iran if he was denied reentry to the United States.\nWhen he heard of Trump’s impending visa ban, he pushed their trip to the United States forward by a few days."}