{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/02/09/donald-trump-finally-met-his-match-the-courts/", "id": "340", "title": "Donald Trump just lost, bigly", "text": "President Trump said on Feb. 9 that he looked forward to seeing the judges \"in court\" after a federal appeals court upheld the suspension of his controversial immigration order. (Editor's note: Audio only.) (The Washington Post)\n\nPresident Trump has been on an 18-month winning streak. That streak ended Thursday night when a federal appeals court upheld a lower-court ruling lifting Trump's travel ban on refugees and all visitors from seven predominantly Muslim states.\n\n“The Government has taken the position that the President’s decisions about immigration policy, particularly when motivated by national security concerns, are unreviewable, even if those actions potentially contravene constitutional rights and protections,” read the unanimous ruling of the three judges. “There is no precedent to support this claimed unreviewability, which runs contrary to the fundamental structure of our constitutional democracy.”\n\nTrump, as is his way, reacted angrily via Twitter:\n\nSEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE! — Donald J. Trump (@realDonaldTrump) February 9, 2017\n\nA federal appeals court upheld a lower court ruling suspending President Trump's controversial immigration order barring refugees and citizens from seven Muslim-majority countries from entering the U.S. The White House said on Feb. 10 that it is \"reviewing all options,\" including possibly going to the Supreme Court. (Peter Stevenson,Victoria Walker/The Washington Post)\n\nThe government will probably ask the Supreme Court to intervene in the travel ban.\n\nBut, all caps aside, this is a major setback for not only one of Trump's signature campaign promises but also for his conception of a presidency with nearly unlimited power.\n\nDuring his campaign for president, Trump regularly promised that he would install a system of “extreme vetting” if elected, casting it as a necessary step to keep the country safe. When he signed the executive order 13 days ago that took steps toward instituting just that policy, Democrats immediately began to work through the legal system to undo it.\n\nAs is his pattern, Trump first scoffed at those efforts, then went on the attack — tweeting out a barrage of hits on the Washington state judge who initially ordered the ban lifted.\n\nThe opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned! — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nTo Trump, it was an open-and-shut case: He was the president. The president is tasked with keeping the country safe. This ban would keep the country safe.\n\nThe appeals court didn't see it that way, leaving Trump with the very real possibility that even an appeal to the Supreme Court will change nothing. Remember that the Supreme Court is divided between four more-liberal justices and four more-conservative ones. The ninth seat is open as a result of the death of Antonin Scalia and the blockade Republicans put up on then-President Barack Obama's nomination of Merrick Garland. Trump court nominee Neil Gorsuch is in the very early stages of the process and wouldn't be seated — even if he is eventually confirmed — in time to break the tie.\n\nAnd a tie would mean the ruling of the appeals court would hold — and Trump's travel ban would be no more.\n\nThat's a big deal for a man who promised during the 2016 campaign that he could change everything that people hated about Washington, bringing his business savvy to its bloated bureaucracy. What Trump is learning — or should learn — from this latest court ruling is that the government isn't like a business in one critical way: There are checks and balances built into the system. The judiciary is not something he can control or cajole. He is, quite literally, not the boss of the federal court system.\n\nTrump has changed Washington more than Washington has changed him in his first three weeks in office. But tonight's ruling proves that even someone like Trump, who views the executive branch with the most expansive powers possible, cannot simply dictate how he wants the country to run or whom the country is allowed to accept within its borders.\n\nHis initial reaction was, in a word, Trumpian. But tweets — even those in all caps — don't change the separation of power in our system of government, a fact that Trump is being forced to acknowledge with his presidency less than three weeks old.", "authors": [], "publish_date": "2017-02-09", "source": "washingtonpost", "top_words": ["ruling", "trump", "appeals", "supreme", "court", "donald", "trumps", "country", "bigly", "system", "president", "washington", "lost"], "summary": "President Trump said on Feb. 9 that he looked forward to seeing the judges \"in court\" after a federal appeals court upheld the suspension of his controversial immigration order.\n— Donald J. Trump (@realDonaldTrump) February 9, 2017A federal appeals court upheld a lower court ruling suspending President Trump's controversial immigration order barring refugees and citizens from seven Muslim-majority countries from entering the U.S.\nThe White House said on Feb. 10 that it is \"reviewing all options,\" including possibly going to the Supreme Court.\n— Donald J. Trump (@realDonaldTrump) February 4, 2017To Trump, it was an open-and-shut case: He was the president.\nThe appeals court didn't see it that way, leaving Trump with the very real possibility that even an appeal to the Supreme Court will change nothing."}