{"url": "https://www.washingtonpost.com/politics/from-order-to-disorder-how-trumps-immigration-directive-exposed-gop-rifts/2017/01/30/b4e42044-e70f-11e6-b82f-687d6e6a3e7c_story.html", "id": "332", "title": "From order to disorder: How Trump’s immigration directive exposed GOP rifts", "text": "White House Chief of Staff Reince Priebus, left, speaks Saturday with White House chief strategist Steve Bannon in the Oval office as President Trump speaks on the phone with German Chancellor Angela Merkel. (Drew Angerer/Getty Images)\n\nThe fallout Monday from President Trump’s sweeping immigration order exposed painful rifts within the Republican Party, alarmed members of his Cabinet and fueled suspicions among his top advisers.\n\nThat left the defiant commander in chief stewing over who was to blame — capped by Trump’s remarkable decision late Monday to fire the acting attorney general because she refused to enforce the order as potentially unlawful.\n\nFor all the promises of Republican bonhomie, Trump and his aides kept GOP congressional leaders almost completely in the dark about the most consequential act of his young presidency: a temporary ban on refugees and on anyone from seven majority-Muslim nations.\n\nDefense Secretary James Mattis and Homeland Security Secretary John Kelly fumed privately to associates over the weekend because they had been caught unaware by a travel ban that was drafted and set into action largely in secret by the White House, according to three people who have spoken with them.\n\nInside the West Wing, tensions flared as differences in management style emerged between two factions: one led by chief strategist Stephen K. Bannon and senior policy adviser Stephen Miller, who wrote the immigration order, and the other composed of Chief of Staff Reince Priebus and his deputies, who are accustomed to operating with a more traditional chain of command.\n\n(Peter Stevenson/The Washington Post)\n\nMiller, 31, was the public face of the order and the populist wing of the White House over the weekend, directing department and agency chiefs as well as explaining and defending the move in television interviews.\n\nAs it became evident that the rollout of the executive order bordered between clumsy and dysfunctional, people in Trump’s orbit divided over who was at fault, with some blaming Miller. Others said it was Priebus who should have taken charge of better coordinating with the departments and communicating with lawmakers and the public.\n\n“The problem they’ve got is this is an off-Broadway performance of a show that is now the number one hit on Broadway,” said former House speaker Newt Gingrich, an informal adviser to Trump.\n\n[The first days inside Trump’s White House: Fury, tumult and a reboot]\n\nThe infighting spilled into public view Monday morning on MSNBC’s “Morning Joe.” Host Joe Scarborough, who spent part of Sunday visiting Trump at the White House, looked into the camera and directly challenged Miller.\n\n“This weekend was a disgrace and it’s all on your shoulders,” Scarborough intoned.\n\nHis commentary was all but certain to be noticed by the president himself; Trump is such an avid watcher of the show that when Sen. Joe Manchin III (D-W.Va.) recently appeared, he received a congratulatory call from Trump just moments later.\n\n1 of 23 Full Screen Autoplay Close Skip Ad × Protest at New York’s JFK airport against Trump’s order halting refu­gee admissions View Photos Entry to the United States is being refused to legal residents, including green-card holders, from seven mostly Muslim countries who were abroad when the executive order was signed Friday by the president, and some travelers were detained at U.S. airports. Caption Entry to the United States is being refused to legal residents, including green-card holders, from seven mostly Muslim countries who were abroad when the executive order was signed Friday by the president. Jan. 28, 2017 People protest the Muslim immigration ban at John F. Kennedy International Airport in New York. President Trump signed an executive order that halted refugees and residents from certain predominantly Muslim countries from entering the United States. Stephanie Keith/Getty Images Buy Photo Wait 1 second to continue.\n\nScarborough’s monologue encapsulated many of the hallmarks of the new White House: It was direct, passionate and provocative, and it played out on live television.\n\nScarborough’s analysis aligned with a faction of the West Wing that has grown concerned about the ascent of Miller and Bannon, close partners in driving Trump to make good on his most populist and nationalistic campaign promises, however incendiary.\n\nOne area of heated debate is the Deferred Action for Childhood Arrivals program, which grants legal protection to undocumented immigrants who are brought to the United States as children — commonly known as “dreamers.” Hard-line conservatives have been urging Trump to rescind DACA, while other advisers, including Gingrich, are counseling him to keep it in place and avoid a politically treacherous confrontation, according to people involved in the deliberations.\n\n“Why pick a fight over this group of people who have a lot of emotional stories to tell? It’s not realistic. It’s not practical,” Gingrich said. “I strongly agree with the general direction we’re going, but I think this particular fight doesn’t emotionally make any sense.”\n\nIn many ways, Trump’s leading advisers are simply operating within the power parameters the president established. Some officials — Bannon and Miller chief among them — are actively shaping policy and guiding the president’s decisions. Others — such as Priebus, the deputy chiefs of staff and White House press secretary Sean Spicer — function in a more reactive capacity, left trying to find order in chaos and explain away slapdash actions.\n\nThe Priebus-Bannon relationship has had its warm moments. When Priebus’s wife was recently baptized into the Greek Orthodox Church, Bannon attended the reception.\n\nThe competing power dynamic appears to have made Priebus, in particular, suspicious of his colleagues’ motives, especially as Bannon asserts his influence, according to several people with knowledge of the situation.\n\n“A little bit of under-competence and a slight amount of insecurity can breed some paranoia and backstabbing,” one White House official, who was granted anonymity to speak candidly, said of Priebus. “We have to get Reince to relax into the job and become more competent, because he’s seeing shadows where there are no shadows.”\n\nDuring the transition phase, for instance, Priebus maneuvered to sideline perceived threats. He suggested that Anthony Scaramucci, a prominent New York financier who is close to Trump and Bannon, serve outside the administration, as finance chairman of the Republican National Committee, according to two people aware of the discussions.\n\nBut Scaramucci demurred, opting for a senior White House job directing the Office of Public Liaison and Intergovernmental Affairs, a similar role to the one played by Valerie Jarrett in the Obama White House.\n\nWhite House officials reject the notion that chaos has overshadowed the early days of Trump’s presidency. They say the media refuse to acknowledge his achievements and intentionally tried to stoke public dissent, even hysteria, with reports about the immigration order.\n\n“While false narratives circulate, the White House staff is busy working, together, to implement President Trump’s agenda for the betterment of our country,” said a White House spokesman who was not authorized to speak on the record.\n\nTrump fired off angry tweets attacking the media and lawmakers who criticized his ban, from mocking Senate Minority Leader Charles E. Schumer (D-N.Y.) for his “tears” to labeling Sens. John McCain (R-Ariz.) and Lindsey O. Graham (R-S.C.) “sadly weak.”\n\nLate Monday evening, Trump fired acting attorney general Sally Yates, who had instructed Justice Department lawyers not to defend Trump’s immigration order. The White House said in a statement that Yates had “betrayed” the Justice Department and called her “very weak on illegal immigration.”\n\nPrivately, the president seethed, venting about what he saw as unfair news coverage on a second straight weekend of mass protests, and quizzing confidants about their impressions of how his senior staffers were performing.\n\n[Donald Trump waits in his tower — accessible, yet isolated]\n\nAs the controversy swirled, Trump, who has taken to giving visitors mini-tours of his new residence, found comfort in a trio of loyalists who share a room just steps from the Oval Office — Hope Hicks, the spokeswoman who has been at Trump’s side since before his campaign launch; Johnny McEntee, a former college football quarterback who is now the president’s personal aide; and Keith Schiller, a retired New York police officer and head of Trump’s personal security detail who now directs Oval Office operations.\n\nNonetheless, some of Trump’s friends as well as his critics fear that his agenda may be compromised by mismanagement.\n\n“Frankly, when I look at this, I think he was ill-served by his staff,” said Ohio Gov. John Kasich, one of Trump’s primary rivals. “If I were the president, I’d be very upset with the staff — that they didn’t say, ‘Hey, wait, hold on a second.’ Because that’s what executives do. They have people around them that help them to understand, ‘Hey, your message is fine but here is what’s going to come from it.’ ”\n\nOn Capitol Hill, many Republicans close to leadership were frustrated that they received little to no guidance, or advance notice, about Trump’s immigration and refu­gee directive. One top House office said it was able to glean the president’s plan only through unofficial back channels to the Department of Homeland Security.\n\nAsked if he was consulted in drafting the order, Senate Majority Whip John Cornyn (R-Tex.) replied simply, “I wasn’t” — an echo of Senate Foreign Relations Committee Chairman Bob Corker (R-Tenn.), who told reporters Monday that the White House had not briefed him before signing the order.\n\nThe first substantive guidance to congressional Republicans came late Saturday — well after protesters had descended on the nation’s airports — in a two-page memo that offered some details on the policy but, to the chagrin of several Capitol Hill aides, very little political guidance. At the end was a pledge for the secretary of state to report regularly on “victims of female genital mutilation or honor killing by foreign-born nationals.”\n\nIt was not only Trump’s immigration order that rankled official Washington. His presidential memorandum that restructured the National Security Council to elevate Bannon to a seat on the Principals Committee, alongside the secretaries of state and defense, worried many in the national security community. Also concerning was language suggesting that the director of national intelligence and the chairman of the Joint Chiefs of Staff could only attend certain Principals Committee meetings.\n\nBut Spicer told reporters Monday that Trump was revising the directive to also include the director of the Central Intelligence Agency. And he insisted that the DNI and Joint Chiefs chairman would be included in any Principals Committee meeting they wish to attend.\n\nThe confusion out of the White House about the president’s intentions left some of the government’s most decorated officials scrambling to assert their relevance. Gen. Joseph F. Dunford Jr., chairman of the Joint Chiefs, took the unusual step of issuing a statement to emphasize that he will “fully participate” in giving the president military advice.\n\n“I remain honored and humbled to represent the extraordinary men and women of the Joint Force in serving the president and our nation,” Dunford wrote.\n\nKaren DeYoung, Kelsey Snell and Sean Sullivan contributed to this report.", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["trump", "bannon", "gop", "priebus", "immigration", "president", "trumps", "directive", "rifts", "disorder", "staff", "order", "white", "house", "exposed"], "summary": "(Drew Angerer/Getty Images)The fallout Monday from President Trump’s sweeping immigration order exposed painful rifts within the Republican Party, alarmed members of his Cabinet and fueled suspicions among his top advisers.\nPresident Trump signed an executive order that halted refugees and residents from certain predominantly Muslim countries from entering the United States.\nBut Scaramucci demurred, opting for a senior White House job directing the Office of Public Liaison and Intergovernmental Affairs, a similar role to the one played by Valerie Jarrett in the Obama White House.\nThey say the media refuse to acknowledge his achievements and intentionally tried to stoke public dissent, even hysteria, with reports about the immigration order.\nAt the end was a pledge for the secretary of state to report regularly on “victims of female genital mutilation or honor killing by foreign-born nationals.”It was not only Trump’s immigration order that rankled official Washington."}