{"url": "https://www.washingtonpost.com/news/politics/wp/2017/02/02/do-americans-support-trumps-immigration-action-depends-on-whos-asking-and-how/", "id": "349", "title": "Do Americans support Trump’s immigration action? Depends on who’s asking, and how.", "text": "\n\nPro-Trump counter-demonstrators yell slogans during a protest against the travel ban imposed by President Trump’s executive order at Los Angeles International Airport on Jan. 29. (Ted Soqui/Reuters)\n\nPolling occupies a nifty space in the political consciousness. Polls that support people’s political positions are often presented uncritically as evidence that the positions are correct. Polls that run contrary to those positions are lumped into the hazy “polls are unreliable” criticism that’s become increasingly prevalent over the past few years.\n\nThat prevalence stems in part from President Trump’s embrace of the uncertainty of polls in the general election. During the primaries, when he consistently led, polls were correct and proved that his victory was inevitable. During the general, when he consistently trailed, polls were incorrect, skewed, fraudulent — and missed that his victory was inevitable. (In a weird twist of fate, the polls were both correct — Trump lost the popular vote by about the predicted margin — and missed his victory.)\n\nIn the wake of a weekend of protests over Trump’s executive order blocking new refugees and halting migration from seven countries in the Middle East and Africa, the Trump administration has pointed to polling proving that the American public stands with it.\n\n“A new Rasmussen Report poll finds that 57 percent, which is a clear majority, of likely U.S. voters, favor a temporary ban on refugees from Syria, Iraq, Iran, Libya, Somalia, Sudan, Yemen,” press secretary Sean Spicer said Wednesday, “until the government can do a better job of keeping these individuals out who pose a threat.” That’s true; you can see the poll here.\n\nSpicer also pointed to a poll from Reuters and its pollster, Ipsos. He highlighted a related detail, but the Reuters-Ipsos poll got a lot of press earlier this week for the results of a question similar to Rasmussen’s. About half the country agreed with the president’s policy — a plurality of respondents.\n\nBut wait! On Thursday, Gallup weighed in. According to its data, most Americans disagreed with the ban.\n\nSo that’s three results: one strongly for, one about split, one strongly against. How’s that possible?\n\nOne answer lies in the questions being asked.\n\nRasmussen asked whether people favored a temporary ban from seven countries until the government improves its screening for potential terrorists .\n\na ban from until the government its screening for . Reuters-Ipsos — after a battery of questions about immigration and refugees — asked whether people agreed or disagreed with an order signed by Trump blocking refugees and banning people from seven Muslim- majority countries.\n\nwith an order refugees and from seven countries. Gallup asked whether people approved of Trump ordering a temporary ban for most people from seven predominantly Muslim countries.\n\nThose are very different phrasings, with Rasmussen’s the most friendly. When Rasmussen asked a slightly different (and more accurate) version of that question later in the week, the response was less supportive.\n\n(It’s also worth noting that Rasmussen typically generates poll results that are friendlier to Republicans than other pollsters.)\n\nPart of the problem is also that many poll respondents don’t really have strong feelings about the intricacies of policy proposals — even proposals that have dominated the news for a week. How those ideas are presented may constitute most of the respondents’ knowledge of the issue; how those questions are asked in relation to other questions can play a role, too. Mention a president who some people love and some people hate, and that shifts things further.\n\nIt’s safe to assume that there’s a split in how Americans feel about Trump’s executive order on immigration. Different parts of the order — assuring robust scrutiny of migrants’ backgrounds — are certainly more popular than others, like barring children from entry simply because they were born in Iran. Those differences yield complicated attitudes.", "authors": [], "publish_date": "2017-02-02", "source": "washingtonpost", "top_words": ["asking", "seven", "questions", "trump", "polls", "ban", "immigration", "poll", "support", "depends", "refugees", "trumps", "asked", "action", "order", "americans", "whos"], "summary": "Pro-Trump counter-demonstrators yell slogans during a protest against the travel ban imposed by President Trump’s executive order at Los Angeles International Airport on Jan. 29.\nThat prevalence stems in part from President Trump’s embrace of the uncertainty of polls in the general election.\nRasmussen asked whether people favored a temporary ban from seven countries until the government improves its screening for potential terrorists .\nwith an order refugees and from seven countries.\nIt’s safe to assume that there’s a split in how Americans feel about Trump’s executive order on immigration."}