{"url": "https://www.washingtonpost.com/blogs/plum-line/wp/2017/01/31/is-this-a-muslim-ban-look-at-the-history-and-at-trumps-own-words/", "id": "322", "title": "Is this a ‘Muslim ban’? Look at the history — and at Trump’s own words.", "text": "\n\nPresident Trump (Nicholas Kamm/AFP via Getty Images)\n\nThe battle over whether President Trump’s new executive order on immigration is a “Muslim ban” continued Tuesday, as the Trump White House sparred with reporters over Trump’s firing of acting attorney general Sally Yates, who had concluded that the executive order was intended to discriminate based on religion. But at Tuesday’s media briefing White House press secretary Sean Spicer defended her firing.\n\nHouse Speaker Paul Ryan (R-Wis.) also stepped forward Tuesday to voice support for Trump’s new executive order. Ryan, too, has rejected the notion that it is a Muslim ban, stating that it is “not a religious test and it is not a ban on people of any religion.” Thus, Ryan rejects the idea that it is inconsistent of him to criticize Trump, after having criticized his proposed Muslim ban during the campaign.\n\nIt’s true that Trump’s new executive order does not flatly ban all Muslims from entry into the United States. It’s also true that it applies to some non-Muslims. But these pat statements elide the question of whether this is discriminatory in intent and in effect. One of the threshold questions here should be whether Trump’s ban is intended to temporarily ban a predominantly Muslim population of immigrants from entering the United States — but in a manner designed to pass legal muster.\n\nIn that context, the history here matters. After the San Bernadino shooting in December 2015, Trump explicitly called for “a total and complete shutdown of Muslims entering the United States.” Trump subsequently tweaked the proposal so it targeted specific countries (as the new executive order does). And then, as we have pointed out, in his big speech on terrorism in June, Trump discussed his own original proposed Muslim ban and the new proposal to target select countries as, in effect, one and the same proposal.\n\nNow here’s another similar example.\n\nOn July 24 last year, Trump sat for an interview with Chuck Todd on “Meet the Press”. Todd prodded Trump on whether his new proposal targeting specific countries represents a “rollback” of his original Muslim ban. Trump denied that it was a rollback at all:\n\nTRUMP: I don’t think so. I actually don’t think it’s a rollback. In fact, you could say it’s an expansion. I’m looking now at territories. People were so upset when I used the word Muslim. Oh, you can’t use the word Muslim. Remember this. And I’m okay with that, because I’m talking territory instead of Muslim. But just remember this: Our Constitution is great. But it doesn’t necessarily give us the right to commit suicide, okay? Now, we have a religious, you know, everybody wants to be protected. And that’s great. And that’s the wonderful part of our Constitution. I view it differently. Why are we committing suicide? Why are we doing that? But you know what? I live with our Constitution. I love our Constitution. I cherish our Constitution. We’re making it territorial. We have nations and we’ll come out, I’m going to be coming out over the next few weeks with a number of the places.\n\nNow, in one sense, Trump is indeed saying his new proposal is different from the old one: He explicitly confirms that he’s now expanding it — he’s talking about “territory instead of Muslim.” But Trump also mocks the criticism of his original proposal as politically correct — “oh, you can’t use the word Muslim” — and then appears to suggest that the new proposal is designed to get around that criticism and vault it over constitutional hurdles.\n\nDuring the White House daily briefing on Jan. 31, NBC's Kristen Welker asked press secretary Sean Spicer why the administration is lashing out against calling President Trump's executive order on immigration a \"travel ban,\" when that's in fact what the president is calling it on Twitter. (Reuters)\n\nThe point is not that this proves Trump’s current executive order is, in fact, a Muslim ban. It doesn’t. Rather, the point is that the new measure does not have to be a flat-out explicit Muslim ban in order to be challenged — morally, substantively, or even legally — as deliberately discriminatory in intent and effect.\n\nNow, to be fair, it remains to be seen how much legal significance quotes like this will have. The ACLU is expected soon to file a broad lawsuit that seeks to overturn the entire executive order as unconstitutional. The lawsuit is expected to make many arguments, but one of them will likely focus on Trump quotes conflating his original Muslim ban with more updated versions of the proposal that ended up being the executive order itself.\n\n“We’ll be offering a variety of constitutional and non-constitutional arguments, but one principal argument will be that this executive order discriminates on the basis of religion,” Lee Gelernt, a senior lawyer at the ACLU’s national office and one of the main lawyers on the case, tells me. “President Trump has made numerous statements that show he intended this to be a Muslim ban.”\n\nIt may be that no one quote from Trump or any of his advisers sufficiently proves the point, but rather that the totality of his statements throughout the campaign do. “Even if the government were to try to pick apart ambiguities in each individual statement, there’s no question that all of the statements together prove discriminatory intent,” Gelernt added.\n\nThe lawsuit is also likely to argue that the measure is illegal on the grounds that it violates the 1965 Immigration and Nationality Act, which bans discrimination in the issuance of an immigrant visa on the basis of nationality.\n\nBut beyond the legal battle to come, the argument over the true motive driving the measure also matters for the purposes of our political argument. That argument will continue — not just in the courts, but also in the political arena — and this will be particularly true if it is ultimately extended or even expanded to other countries, which Trump might be tempted to do if there were a major terrorist attack.\n\nThe Trump White House has flatly dismissed the idea that the executive order is discriminatory on the basis of religion, in part because even some Republicans in Congress cannot support such a thing. Indeed, some Republicans have stated outright that, contrary to the White House’s assurances, the measure at a minimum creates the appearance that the United States is discriminating against Muslim immigrants. And as those Republicans note, this matters, because of the message it sends to the rest of the world, particularly to mainstream Muslims.\n\nWhatever assurances the White House now offers, this measure is hopelessly tainted by its own history — including Trump’s own rhetoric about it.", "authors": [], "publish_date": "2017-01-31", "source": "washingtonpost", "top_words": ["executive", "measure", "trump", "ban", "proposal", "president", "trumps", "history", "words", "order", "muslim", "white", "look"], "summary": "House Speaker Paul Ryan (R-Wis.) also stepped forward Tuesday to voice support for Trump’s new executive order.\nIt’s true that Trump’s new executive order does not flatly ban all Muslims from entry into the United States.\nOne of the threshold questions here should be whether Trump’s ban is intended to temporarily ban a predominantly Muslim population of immigrants from entering the United States — but in a manner designed to pass legal muster.\nTodd prodded Trump on whether his new proposal targeting specific countries represents a “rollback” of his original Muslim ban.\n(Reuters)The point is not that this proves Trump’s current executive order is, in fact, a Muslim ban."}