{"url": "https://www.washingtonpost.com/news/dr-gridlock/wp/2017/01/29/uber-triggers-protest-for-not-supporting-taxi-strike-against-refugee-ban/", "id": "300", "title": "Uber triggers protest for collecting fares during taxi strike against refugee ban", "text": "\n\nTwitter users rallied against Uber after the service continued to operate during a taxi strike at JFK Airport. (Mike Blake / Reuters)\n\nUber became the center of a political battleground Saturday after hundreds of Twitter users rallied behind the #DeleteUber hashtag to protest the company’s decision to continue operating while taxis decided to strike — refusing to pick up passengers at John F. Kennedy International Airport in opposition to President Trump’s refugee ban.\n\nBy Sunday morning, rival Lyft had quickly seized on the issue, pledging to donate $1 million to the American Civil Liberties Union, which successfully fought for a stay of the ban and secured the release of refugees who had been stranded in transit.\n\nLyft drivers also gave rides during the strike, but #DeleteUber began trending after Uber tweeted it was lifting surge pricing at JFK International Airport, where thousands had gathered to demonstrate against the ban.\n\n[Judge halts deportations as refugee ban causes worldwide furor]\n\nCustomers took it as evidence the company was trying to profit off of striking workers. Lyft had continued to operate as well but did not turn off its surge pricing, a company spokeswoman said; dozens of Uber customers said they would instead turn to that service.\n\nUber CEO Travis Kalanick is a member of President Trump’s economic advisory group and has repeatedly pledged to work with the president to solve issues related to urban mobility, drawing the ire of activists who say such attitudes enable Trump’s actions. Kalanick expressed concern with the ban in a memo to employees Saturday, saying it would affect “many innocent people,” and that the company would explore how to compensate impacted employees for three months.\n\nThe order “affects thousands of drivers who use Uber and come from the listed countries, many of whom take long breaks to go back home to see their extended family,” Kalanick said. “That means they will not be able to earn a living and support their families—and of course they will be separated from their loved ones during that time.”\n\nKalanick said he planned to raise the issue with Trump at a Friday meeting of the advisory group.\n\nBut his explanation didn’t satisfy many customers, who flooded Uber’s site with complaints.\n\n“You work with Trump, I’ll work with Lyft,” read one complaint.\n\n“You collude with facists,” read another.\n\nHours after sending the Tweet, Uber was forced to respond to their complaints.\n\n“We’re sorry for any confusion about our earlier tweet—it was not meant to break up any strike,” read a statement from Uber. “We wanted people to know they could use Uber to get to and from JFK at normal prices, especially tonight.”\n\nDemonstrators gathered at New York's JFK airport to protest against President Trump's executive order on refugees. (Dalton Bennett/The Washington Post)\n\nThe New York Taxi Workers Alliance, which represents more than 19,000 workers, held the strike in solidarity with the demonstrations, citing its “largely Muslim” membership. The strike was planned to last from 6 to 7 p.m.; Uber’s tweet went out about 30 minutes later.\n\n[Read the complaint]\n\n“Today, drivers are joining the protest at JFK Airport in support of all those who are currently being detained at the airport because of Trump’s unconstitutional executive order,” read a statement from the union. “We stand in solidarity with all of our peace-loving neighbors against this inhumane, cruel, and unconstitutional pure act of bigotry.”\n\nLyft’s founders said in an email accompanying the announcement that the company fiercely opposes the ban and will stand up for its political values, announcing the donation of $1 million over four years.\n\n“This weekend, Trump closed the country’s borders to refugees, immigrants, and even documented residents from around the world based on their country of origin,” co-founders John Zimmer and Logan Green said. “Banning people of a particular faith or creed, race or identity, sexuality or ethnicity, from entering the U.S. is antithetical to both Lyft‘s and our nation’s core values. We stand firmly against these actions, and will not be silent on issues that threaten the values of our community.”\n\n[Are you, or someone you know, affected by President Trump’s travel restrictions?]\n\nAnother group, United for Equal Access New York, urged New York Gov. Andrew Cuomo (D) to pull his support for a statewide expansion of Uber in light of its decision to continue service during the strike.\n\n“When Gov. Cuomo stood against Trump’s Muslim ban, Uber just saw another way to profit,” founder Dustin Jones said. “Any company that chooses to profit off Trump’s un-American decrees is not worthy of operating in New York State.”\n\nFollowing Lyft’s announcement of a contribution to the ACLU, Uber said Sunday it would establish a $3 million fund to assist drivers affected by the refugee ban. Kalanick announced the fund in a Facebook post, where he decried what he called Trump’s “wrong and unjust immigration ban,” a day after customers began fleeing with the hashtag #DeleteUber.\n\nKalanick reiterated a commitment to cover drivers’ lost earnings while they are barred from entering the country, but did not walk back his pledge to work with the Trump administration — as the disgruntled customers sought.\n\n(Washington Post owner Jeff Bezos is an investor in Uber.)\n\nCorrection: Lyft did not turn off its surge pricing at JFK Airport Saturday, as this post previously said. This post has been updated.", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["taxi", "airport", "ban", "strike", "refugee", "fares", "collecting", "uber", "protest", "trumps", "company", "triggers", "president", "york", "drivers", "jfk"], "summary": "Twitter users rallied against Uber after the service continued to operate during a taxi strike at JFK Airport.\n[Judge halts deportations as refugee ban causes worldwide furor]Customers took it as evidence the company was trying to profit off of striking workers.\n“We’re sorry for any confusion about our earlier tweet—it was not meant to break up any strike,” read a statement from Uber.\nCuomo stood against Trump’s Muslim ban, Uber just saw another way to profit,” founder Dustin Jones said.\nCorrection: Lyft did not turn off its surge pricing at JFK Airport Saturday, as this post previously said."}