{"url": "https://www.washingtonpost.com/world/africa/inside-the-worlds-largest-refugee-camp-trumps-travel-ban-is-causing-despair/2017/02/04/b5f1058e-e4c0-11e6-a419-eefe8eff0835_story.html", "id": "312", "title": "Inside the world’s largest refugee camp, one man’s quest to explain Donald Trump to those now banned from America", "text": "He had become a minor celebrity in the world’s biggest refugee camp, the small man staring at his battered cellphone, who had somehow managed to become an expert on America from inside his tiny hut in the desert.\n\nHis fame was attached to one particularly arcane category of knowledge. Mohammed Rashid, a refugee since age 14 and now 38 years old, had become an authority on the U.S. process of screening and resettling refugees. It was a niche that begot his nickname, which stirred some mixture of pride and sadness in him each time he heard it: “Mr. Resettlement.”\n\nNow, in the wake of President Trump’s executive order suspending admission of refugees, Rashid’s expertise had become even more vital to the people of Dadaab, asprawling agglomeration of tents and stick huts the size of 12,000 football fields. It was his role to translate Trump’s policy to those who had been waiting years for their flights to the United States. About 14,500 people in the camp are in the U.S. refugee pipeline, including Rashid’s family of five.\n\n“What will happen with Trump?” Rahma Noor Farrah, a 25-year-old with bright purple eye shadow and a pink headscarf, asked Rashid. It was three days after the executive order had been issued, and she had spotted him in the camp’s market, a dusty street lined by corrugated metal stalls.\n\n\n\n\n\n“We are going to have a rough time together,” he said.\n\nRashid had applied for resettlement in 2010. Farrah had applied in 2007. They had inched forward in the process, interview after interview, promising that they weren’t terrorists, recounting the horrors that had broken their families.\n\n“There’s no hope as long as Trump is there,” Farrah said.\n\n“We need to see what happens after 120 days,” Rashid said, feigning optimism. That was how long Trump had said he would suspend the refu­gee program, while U.S. officials reviewed its anti-terrorist provisions. The order also banned most visitors from seven majority-Muslim countries for 90 days.\n\nRashid had stayed up late over the weekend, reading about the new policy on his 5-year-old Nokia phone, a quest he began by typing “Trump News” into Google.\n\nHe read about travelers stuck at U.S. airports and protests at arrival terminals, trying his best to imagine those places, even though he’d never been on an airplane. He read @SenJohnMcCain criticizing the order. He read @realDonaldTrump saying the United States was now safer. He tried not to curse.\n\nAt night, during the few hours of electricity in the camp, Rashid watched CNN on his television, a gift from his brother, who had been resettled in Seattle four years ago and told Rashid upon arriving there, “We are behind the world, brother.”\n\nNow, Rashid waited for any indication that the airport protests had been successful. He would fall asleep in front of the TV, then wake up and check his phone.\n\n“All day with him it is news, news, news,” said his wife, Dahabo Abdulahi, shaking her head.\n\n***\n\nDadaab is a constellation of four camps, separated by bursts of thorny acacia trees and wide expanses of orange sand. Some areas remain as empty as they were when Rashid fled Somalia in 1992, as it was devoured by a civil war that left his mother and two sisters dead. But much of Dadaab is now a vast city of mud huts, tents, market stalls and U.N. offices. Nearly 300,000 refugees live here, most of them Somalis.\n\nThe Kenyan government has threatened for years to close the camp. Its new deadline is May.\n\nRashid grew up in the camp, attending school in white tents donated by foreign aid groups. But even after 25 years, it doesn’t feel like home. His wife was raped here in the late 1990s when she went to collect firewood. His father was beaten and robbed while transporting food on a donkey cart. Rashid secures his hut, made of mud, sticks and corrugated metal, with a makeshift fence of tree branches and a metal door with a padlock.\n\n\n\nFood distribution at Dadaab becomes violent as men run for their rations. Food rations at the camp were recently cut in half, making life for the 270,000 refugees there even more difficult. (Kevin Sieff/The Washington Post)\n\nIn 2010, the United Nations acknowledged his family’s procession of traumas with a one-page letter — they had been chosen for resettlement in America.\n\nRashid learned as much as he could about the U.S. refu­gee screening system, a labyrinthine process that involves eight federal agencies, six security databases, five background checks and four biometric security checks. His family got their medical exams. They sat for interviews with American caseworkers, who asked whether he had ever been a terrorist. Rashid said no. He said he was an English teacher.\n\nWhile he was waiting for his final approval in 2015, Rashid and his wife had a third child. According to U.S. policy, American officials would have to meet the baby before Rashid’s family got on a plane. The visit still hasn’t happened, because of the limited number of caseworkers and the many people waiting for the relatively few refu­gee approvals each year.\n\nOn his Nokia, Rashid checked his status on the U.S. refu­gee resettlement website every other day. The words never changed.\n\n“Security status: currently clear,” it said.\n\n“On hold.”\n\n“Please be patient.”\n\n***\n\nOn Tuesday, four days after Trump’s travel ban announcement, Rashid rode his bicycle, a clunky brown contraption with a red plastic flower on the handlebars, to the Horyaal Primary School.\n\nOn the blackboard he wrote: “The eye is a sense organ. It is used for seeing.”\n\nThe students read the line aloud. Rashid walked around the room, where 40 children, all native Somali speakers, were crammed onto eight benches.\n\n\n\nMohammed Rashid teaches an English class in the Dadaab refugee camp. (Kevin Sieff/The Washington Post)\n\nHe was trying to focus on the lesson, but his mind was on Trump’s new policy. While the children copied notes from the board, Rashid pulled out his Nokia.\n\nHe read on CNN.com that the protests were gaining strength.\n\nHe read on Facebook that more than 100 Somali refugees, whose flights were scheduled for the following week, were stuck in Nairobi.\n\nAfter class, he walked outside.\n\n“Mr. Resettlement,” Abdi Nasir Abukar, another teacher, called to him from a bench. “You’re going to go crazy thinking about America. You’re going to become a mad old man picking rubbish from the ground.”\n\nAbukar, 29, had a different plan. He was going back to Somalia. The United Nations was offering about $400 as humanitarian assistance for each person who returned to parts of Somalia it considered relatively secure.\n\nRashid thought a move back to Somalia was too risky. In late January, al-Shabab militants had set off a car bomb at a hotel in Mogadishu, killing 28. Weeks earlier, they had attacked the city’s port, leaving 16 dead.\n\n“You made your own choice,” he said to Abukar.\n\nOut of earshot, Rashid said softly:\n\n“He’s the crazy one.”\n\n***\n\n\n\nMohammed Rashid talks to two young women who also applied for refugee status in the United States. (Kevin Sieff/The Washington Post)\n\nDuring a lunch break, Rashid went to a restaurant in the camp with sky-blue wallpaper and a television playing a Somali-language news channel.\n\n“Put on CNN,” Rashid said.\n\nA waiter slid a metal plate of rice on his table as the television flashed to a reporter at an American diner, asking a bearded man what he thought about Trump’s travel ban.\n\n“There’s a lot of bad people in those countries,” the man said.\n\nRashid looked down at his rice.\n\n“Some Americans don’t seem like they know anything about the world,” he said.\n\nBehind him, at a different table, an old man recognized Rashid.\n\n“What can we expect to happen?” the man asked. “Will the Europeans take us?”\n\n“I am advising everyone to be patient,” Rashid said, and then he thumbed his phone again.\n\nA stream of pictures and headlines passed in front of him. White House press secretary Sean Spicer had said the executive order wasn’t a Muslim ban. The Somali-born British track star Mo Farah had been detained at an airport. On Facebook, Rashid’s friends in Seattle had posted a photo in front of the Space Needle.\n\n“Look at them enjoying,” he said.\n\nThen he pulled up the U.S. refugee resettlement website. It took a long time to load. His hands shook.\n\n“Please be patient,” it said.\n\n***\n\nAs the week continued, it appeared to Rashid that the world’s interest in the refugee suspension was fading.\n\nOn his phone, he read that the protests were shrinking. On television, the coverage shifted to Trump’s Supreme Court pick.\n\nHe was running out of answers for the people who stopped him in the camp.\n\n“People keep asking me, ‘What do you think?’ ” Rashid said, his expression suddenly severe. “But I’m just a refugee like them.”\n\nBut then Saturday morning, he woke up to a flurry of news articles about a judge’s decision to halt the executive order. He read as much as he could. Then he went to the monthly food distribution, where he and hundreds of other refugees waited for bags of donated corn and beans in the 100-degree heat.\n\nWhile they waited, people kept coming up to Rashid, he recalled.\n\n“I told them: ‘It’s finally good news. The judge has stopped Trump.’ ”\n\nHe knew the court order was tenuous. He kept checking his phone to see whether the news had changed again. But by late afternoon, he read that passengers from the seven banned countries were allowed to board their fights to the United States.\n\nThe door had cracked open again. This time, Rashid hoped, it would last long enough for his family to pass through.\n\n“That’s one of the things I love about America,” he explained over the phone. “No one is above the law.”\n\nRead more:\n\nTrump’s refu­gee ban is a matter of life and death for some\n\nThey were freed from Boko Haram’s rape camps. But their nightmare isn’t over.\n\nU.S.-funded Somali intelligence agency has been using kids as spies\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "authors": [], "publish_date": "2017-02-04", "source": "washingtonpost", "top_words": ["explain", "camp", "trump", "rashid", "largest", "refugee", "read", "refugees", "man", "donald", "inside", "united", "trumps", "mans", "order", "quest", "worlds"], "summary": "He had become a minor celebrity in the world’s biggest refugee camp, the small man staring at his battered cellphone, who had somehow managed to become an expert on America from inside his tiny hut in the desert.\nAbout 14,500 people in the camp are in the U.S. refugee pipeline, including Rashid’s family of five.\n“What will happen with Trump?” Rahma Noor Farrah, a 25-year-old with bright purple eye shadow and a pink headscarf, asked Rashid.\nThat was how long Trump had said he would suspend the refu­gee program, while U.S. officials reviewed its anti-terrorist provisions.\nMohammed Rashid teaches an English class in the Dadaab refugee camp."}