{"url": "https://www.washingtonpost.com/news/volokh-conspiracy/wp/2017/02/10/thoughts-on-the-appellate-court-ruling-against-trumps-refugee-order/", "id": "367", "title": "Thoughts on the appellate court ruling against Trump’s immigration order", "text": "\n\nKaren Shore holds up a sign outside of the 9th U.S. Circuit Court of Appeals in San Francisco, Tuesday, Feb. 7, 2017. A panel of appeals court judges reviewing President Donald Trump’s travel ban hammered away Tuesday at the federal government’s arguments that the states cannot challenge the order. (AP Photo/Jeff Chiu)\n\nThe Ninth Circuit federal Court of Appeals recently issued a ruling against President Trump’s executive order barring refugees and migrants from seven Muslim-majority nations. The decision is not a final ruling on the legality of Trump’s order. All it does is deny the administration’s motion to lift the temporary restraining order against the executive order, imposed by the trial court. Nonetheless, this decision is important both because it prevents the order from being implemented, at least temporarily, and because of what it reveals about the judges’ views about the issues at stake.\n\nI. Some Key Elements of the Ruling.\n\nThe three judges unanimously concluded that the Washington and the other states suing the president have standing to file the case, and that are “likely to succeed on the merits” of their claim that the order violates the Due Process Clause of the Fifth Amendment. The former decision eliminates a possible procedural obstacle to the lawsuit. The latter signals that the states are likely to win on this issue in future proceedings when the court does in fact reach the merits.\n\nIt is also extremely important that the court rejected Trump’s position that the president’s decisions on immigration and national security policy matters are exempt from judicial review. As the ruling notes, “federal courts routinely review the constitutionality of — and even invalidate — actions taken by the executive to promote national security, and have done so even in times of conflict [citations to numerous cases omitted].” They further emphasized that “although courts owe considerable deference to the President’s policy determinations with respect to immigration and national security, it is beyond question that the federal judiciary retains the authority to adjudicate constitutional challenges to executive action.” This is a clear rejection of claims that the so-called “plenary power” doctrine completely exempts immigration policy decisions from the limitations of constitutional rights that constrain other government policies. It reinforces my view that the plenary power doctrine, while certainly still on the books, is not as robust and comprehensive as some defenders of it claim. I certaily do not expect this case to result in the complete abolition of the doctrine, though I would welcome such an outcome. But it might potentially end up enforcing some meaningful limits on it.\n\nII. Why Trump’s Statements are Legitimate Evidence of Discriminatory Motive.\n\nThe Ninth Circuit did not fully address the claims that Trump’s order is unconstitutional because it discriminates against Muslims on the basis of religion, as argued by Corey Brettschneider and myself, among others. But the judges do emphasize that “[i]t is well established that evidence of purpose beyond the face of the challenged law may be considered in evaluating Establishment and Equal Protection Clause claims.” In other words, Trump’s numerous statements advocating a “Muslim ban” and his advisers’ statements indicating that the executive order is an outgrowth of that earlier proposal, are probably relevant to determining whether the order is the result of unconstitutional discriminatory intent.\n\nThe Supreme Court has long held that facially neutral laws and regulations may be invalidated if the true purpose behind them is to discriminate on the basis of race, ethnicity, religion, or some other suspect classification. If facially neutral policies are exempt from scrutiny for discriminatory motive, then a wide range of prejudicial policies would have to be upheld. For example, many Jim Crow-era policies targeting African-Americans were facially neutral, including poll taxes and literacy tests intended to keep blacks from voting.\n\nIn determining whether discrimination was the motivation behind the challenged action, the Supreme Court requires judges to make “a sensitive inquiry into such circumstantial and direct evidence of intent as may be available,” including “[t]he historical background of the decision” and “[t]he specific sequence of events leading up to the challenged decision.”\n\nDespite Eugene Kontorovich’s contrary view, there is no reason to exempt campaign statements from this kind of inquiry. When a policy is a direct outgrowth of a major theme of a candidate’s campaign, as is surely true here, campaign statements are clearly part of “the historical background of the decision” and “[t]he specific sequence of events leading up to [it].” As Trump himself likes to emphasize, campaign promises are often an important indication of political leaders’ intentions. For courts to ignore that would be to close judicial eyes to obvious political realities.\n\nThat does not mean that any Trump administration policy that seems to harm Muslims should automatically be ruled unconstitutional. A policy less clearly linked to his bigoted statements and backed by a stronger security justification than the extremely weak one here, would be more likely to be upheld. As the Ninth Circuit notes, the administration has presented only very flimsy evidence that its order is backed by legitimate security needs, which is one of the reasons why it refused to lift the trial court’s order staying implementation. Things might be different in a case where the government could more plausibly point to a genuine nondiscriminatory rationale for its policies.\n\nIt is true, as Eugene notes, that taking account of campaign statements in cases like this might “chill” some candidates’ bigoted speech. But I don’t see this as a weighty objection. Any inquiry into the discriminatory motives of government officials might potentially chill their speech, because speech indicating a discriminatory motivation is inevitably going to be relevant evidence in such a case. It is both unjust and (in most cases) unconstitutional to chill speech by threatening the lives, liberty, or property of speakers. The situation is very different when the only adverse consequence they suffer is limitations on their ability to wield the coercive powers of government while serving in public office. If the powers of officials with a history of bigoted statements are subject to tighter constraints at the margin, that strikes me as a feature rather than a bug.\n\nI discussed the discrimination issue in the case, and rebutted various possible counterarguments, in this post.\n\nIII. Why the States Have Standing.\n\nThe court’s ruling on standing also deserves some discussion. The doctrine of standing requires plaintiffs to prove that they are likely to suffer some kind of material injury before they can challenge a government action in federal court. The Ninth Circuit concludes that the plaintiff states have a sufficient injury because, among other things, the order would bar the entry of some students and employees at their state universities.\n\nThat may be only a small harm to the states. But many precedents indicate that a small injury is enough. The Ninth Circuit correctly points out that the injuries claimed by the states in this case are comparable to those claimed by Texas and other conservative states in their lawsuit challenging President Obama’s executive action on immigration, where the states got standing on the ground that they might end up bearing administrative costs from issuing drivers’ license to the immigrants in question. They got it despite the fact that the injury was likely to be small, and could even potentially be avoided by changing the states’ licensing policies. Although I opposed the Texas lawsuit on the merits, I argued at the time that the conservative states were entitled to standing. The same goes for the liberal states suing in this case.\n\nIt is also notable that today’s ruling was joined in full by Republican George W. Bush appointee Judge Richard Clifton, as well as by two Democratic judges. James Robart, the trial judge who issued the restraining order upheld by the Ninth Circuit, is also a Republican appointee. That does not mean the ruling is necessarily correct. But it does underscore the fact that doubts about the constitutionality of Trump’s order are not limited to liberal Democrats.\n\nAs Will Baude explains, this is just a preliminary decision that leaves a number of key issues for the future. Among other things, it does not address the important question of whether President Trump even had statutory authorization to issue this order. If he did not, the order would be illegal even if it is constitutional.\n\nThe Ninth Circuit ruling is far from the end of the legal battle over Trump’s order. But it is still a significant victory for the states challenging his policy.", "authors": [], "publish_date": "2017-02-10", "source": "washingtonpost", "top_words": ["ruling", "ninth", "judges", "circuit", "immigration", "court", "appellate", "states", "trumps", "thoughts", "statements", "order", "policy"], "summary": "Circuit Court of Appeals in San Francisco, Tuesday, Feb. 7, 2017.\n(AP Photo/Jeff Chiu)The Ninth Circuit federal Court of Appeals recently issued a ruling against President Trump’s executive order barring refugees and migrants from seven Muslim-majority nations.\nThe decision is not a final ruling on the legality of Trump’s order.\nBut it does underscore the fact that doubts about the constitutionality of Trump’s order are not limited to liberal Democrats.\nThe Ninth Circuit ruling is far from the end of the legal battle over Trump’s order."}