{"url": "https://www.washingtonpost.com/world/national-security/trump-administration-circulates-more-draft-immigration-restrictions-focusing-on-protecting-us-jobs/2017/01/31/38529236-e741-11e6-80c2-30e57e57e05d_story.html", "id": "326", "title": "Trump administration circulates more draft immigration restrictions, focusing on protecting U.S. jobs", "text": "Day laborers vote on a measure in Bay Parkway Community Job Center in the Brooklyn borough of New York City in 2013. (John Moore/Getty Images)\n\nThe Trump administration is considering a plan to weed out would-be immigrants who are likely to require public assistance, as well as to deport — when possible — immigrants already living in the United States who depend on taxpayer help, according to a draft executive order obtained by The Washington Post.\n\nA second draft order under consideration calls for a substantial shake-up in the system through which the United States administers immigrant and nonimmigrant visas, with the aim of tightly controlling who enters the country and who can enter the workforce, and reducing the social services burden on U.S. taxpayers.\n\n[Read the draft executive orders]\n\nThe drafts are circulating among administration officials, and it is unclear whether President Trump has decided to move forward with them or when he might sign them if he does decide to put them in place. The White House would not confirm or deny the authenticity of the orders, and White House officials did not respond to requests for comment about the drafts Monday and Tuesday.\n\n[Trump fired acting attorney general who ordered Justice Dept. not to defend president’s travel ban]\n\nIf enacted, the executive orders would appear to significantly restrict all types of immigration and foreign travel to the United States, expanding bars on entry to the country that Trump ordered last week with his temporary ban on refugees and people from seven Muslim-majority countries.\n\nWhile last week’s move focused on national security and preventing terrorism, the new draft orders would be focused on Trump’s campaign promises to protect American workers and to create jobs, immediately restricting the flow of immigrants and temporary laborers into the U.S. workforce. The administration has accused immigrants who end up receiving U.S. social services of eating up federal resources, and it has said that immigrant workers contribute to unemployment among workers who are U.S. citizens.\n\n“Our country’s immigration laws are designed to protect American taxpayers and promote immigrant self-sufficiency. Yet households headed by aliens are much more likely than those headed by citizens to use Federal ­means-tested public benefits,” reads one draft order obtained by The Post, titled “Executive Order on Protecting Taxpayer Resources by Ensuring Our Immigration Laws Promote Accountability and Responsibility.”\n\nThe draft order provides no evidence to support the claim that immigrant households are more likely to use welfare benefits, and there is no consensus among experts about immigration’s impact on such benefits or on U.S. jobs.\n\n[From order to disorder: How Trump’s immigration directive exposed GOP rifts]\n\nThe administration would be seeking to “deny admission to any alien who is likely to become a public charge” and to develop standards for “determining whether an alien is deportable . . . for having become a public charge within five years of entry” — receiving a certain amount of public assistance, including food stamps, Temporary Assistance for Needy Families (TANF) and Medicaid.\n\nThe second order, titled “Executive Order on Protecting American Jobs and Workers by Strengthening the Integrity of Foreign Worker Visa Programs” calls for “eliminating” the “jobs magnet” that is driving illegal immigration to the United States, according to a copy obtained by The Post. The order would rescind any work visa provisions for foreign nationals found not to be in “the national interest” or found to be in violation of U.S. immigration laws.\n\n(Reuters)\n\n[Scholars: Many more legal challenges likely for Trump’s executive order on immigration]\n\nThe order weighs how to make the country’s immigration program “more merit based,” calls for site visits at companies that employ foreign workers, and tasks the Department of Homeland Security with producing a report twice a year on the total number of foreign-born people — not just nonimmigrant visa holders — who are authorized to work in the United States.\n\nIt also instructs DHS and the State Department to submit a report on “the steps they are taking to combat the birth tourism phenomenon,” meaning instances in which noncitizens come to the U.S. to have children who in turn gain citizenship, a popular conservative refrain but one that is dismissed by immigration experts as a relatively minor problem.\n\nTogether, the orders would aim to give U.S. citizens priority in the job market by preventing immigrants from taking jobs and by pushing some immigrants out of jobs.\n\n“The unlawful employment of aliens has had a devastating impact on the wages and jobs of American workers, especially low-skilled, teenage, and African American and Hispanic workers,” the draft order says.\n\nImmigration advocates reacted with outrage to the draft documents, warning that if enacted the executive orders could harm the U.S. citizen children of undocumented immigrants whose parents could be stripped of public assistance.\n\n“He’s loaded his anti-immigrant Uzi and is firing off another round,” said Angela Maria Kelley, an immigration expert at the Center for American Progress, a liberal think tank. “This time he’s aiming at U.S. citizen kids who have an undocumented parent, and depending how broad the reach of his order, he could deport kids who have received reduced lunches in school. It’s stunning the depth of disruption and chaos he seems hellbent on inflicting on our communities.”\n\nLong-standing U.S. law already makes it difficult for noncitizens to receive most forms of public assistance, which limits how many immigrants receive such taxpayer-funded help. For more than 100 years, the country has had a provision that allows federal officials to bar immigrants who, based on a specific formula, seem likely to need public assistance after arrival.\n\nThat test is known as the “public charge” law, which allows federal immigration authorities to deport immigrants who become dependent on social programs; they also can prevent legal immigrants applying for green cards from obtaining them for the same reasons. Individuals living in the United States whose relationships with family members make it possible for their relatives to apply for entry into the United States are required to sign an affidavit attesting to the fact that they earn a sufficient income to support themselves and any family members hoping to immigrate. Anyone signing such an affidavit also agrees to pay back certain public assistance should their relatives who hope to immigrate ever receive it.\n\nIn 1996, President Bill Clinton signed the Personal Responsibility and Work Opportunity Reconciliation Act, popularly known as “welfare reform.” The law severely restricted all immigrant access to social assistance; those who are in the country illegally are barred from almost any federal program designed for the poor. Legal immigrants must live in the United States for a minimum of five years to become eligible for a limited set of social aid programs, and access to Social Security assistance is rarely granted.\n\nEconomists are divided on the extent to which illegal immigration impacts wages, but in general they find that immigration, including by low-skilled workers, is good for the economy.\n\n“The overwhelming consensus in the economics academic literature is that immigrants add more to the economy than they take, they create more jobs for Americans, and they are a net benefit to the American economy,” said Alex Nowrasteh, an immigration policy analyst at the Cato Institute, a libertarian think tank.\n\nNor have studies shown immigrants to be a greater drain on federal benefits relative to U.S. citizens, he said: “When you compare poor immigrants to poor natives, poor immigrants are less likely to use welfare, and when they do, the dollar value of the benefits they use is lower.”\n\nThat is partly because under existing federal law, new permanent residents, or green-card holders, are unable to qualify for welfare and other public benefits during their first five years of residency. Immigrants who entered the United States illegally also are unable to obtain federal welfare benefits.\n\nRefugees are an exception, and advocates note that while those fleeing war and strife at home tend to need assistance upon arrival, they generally begin contributing to the economy within a few years.\n\nThe Migration Policy Institute has found that dependence on public assistance falls over time and that “refugee men are employed at a higher rate than their U.S.-born peers.”\n\nDavid Nakamura contributed to this report.", "authors": [], "publish_date": "2017-01-31", "source": "washingtonpost", "top_words": ["restrictions", "trump", "immigrants", "focusing", "immigration", "public", "jobs", "assistance", "protecting", "workers", "united", "states", "circulates", "federal", "order", "draft", "administration"], "summary": "for having become a public charge within five years of entry” — receiving a certain amount of public assistance, including food stamps, Temporary Assistance for Needy Families (TANF) and Medicaid.\n“The unlawful employment of aliens has had a devastating impact on the wages and jobs of American workers, especially low-skilled, teenage, and African American and Hispanic workers,” the draft order says.\nAnyone signing such an affidavit also agrees to pay back certain public assistance should their relatives who hope to immigrate ever receive it.\nImmigrants who entered the United States illegally also are unable to obtain federal welfare benefits.\nThe Migration Policy Institute has found that dependence on public assistance falls over time and that “refugee men are employed at a higher rate than their U.S.-born peers.”David Nakamura contributed to this report."}