{"url": "https://www.washingtonpost.com/opinions/trump-is-out-of-control/2017/06/05/9665c9a4-4a21-11e7-9669-250d0b15f83b_story.html", "id": "359", "title": "Trump is out of control", "text": "Trump signs an executive order for border security and immigration enforcement improvements at the Department of Homeland Security in Washington.\n\nJan. 25, 2017 Trump signs an executive order for border security and immigration enforcement improvements at the Department of Homeland Security in Washington. Chip Somodevilla/Pool photo via Bloomberg News\n\nThe statements President Trump issued on Twitter in recent days lead to a chilling conclusion: The man is out of control.\n\nI know that is a radical thing to say about the elected leader of the United States, the most powerful individual in the world. And I know his unorthodox use of social media is thought by some, including the president himself, to be brilliant. But I don’t see political genius in the invective coming from Trump these days. I see an angry man lashing out at enemies real and imagined — a man dangerously overwhelmed.\n\nOn Monday, he started at 6:25 a.m. to comprehensively undermine his own legal team in its quest to win Supreme Court approval for a travel ban targeting Muslims. I can call it that, without legalistic hemming and hawing, because the president did so. Emphatically.\n\n“People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN,” Trump wrote.\n\nMaybe he thinks that tweets, somehow, don’t count. But of course they do. These are written statements typed by the president himself, and as such should carry more weight than a processed release from the White House press office, not less. Trump’s lawyers — arguing in support of the blocked measure, which would bar visitors from six majority-Muslim countries — contend it is not a “travel ban” as such. Attorneys on the other side will surely use Trump’s own words against him.\n\n(Jenny Starrs/The Washington Post)\n\nAnd he had plenty more to say:\n\n“The Justice Dept. should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C. [Supreme Court]”\n\n“The Justice Dept. should ask for an expedited hearing of the watered down Travel Ban before the Supreme Court — & seek much tougher version!”\n\n“In any event we are EXTREME VETTING people coming into the U.S. in order to help keep our country safe. The courts are slow and political!”\n\nLet that last one settle in for a moment. Has a president ever publicly dismissed the entire judicial branch of our government as “slow and political,” even in a moment of pique? Does Trump grasp the concept of separation of powers? Has he even read the Constitution he swore to preserve, protect and defend?\n\nWhether Trump’s statements during the campaign — calling for a surely unconstitutional blanket ban on Muslim visitors from anywhere — should be taken into account by courts considering the current “watered down” version is debatable. His written statements as president, however, are clearly germane. Opponents of the ban might want to send him flowers.\n\nTrump first let the cat out of the bag Saturday night, following the terrorist attack in London, when he wrote, “We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!”\n\n(Bastien Inzaurralde/The Washington Post)\n\nHe went on to express compassion and support for “London and the U.K.” But by Sunday he was off the rails: “At least 7 dead and 48 wounded in terror attack and Mayor of London says there is ‘no reason to be alarmed!’ ”\n\nWhat rational head of state attacks the mayor of a city that has just been hit by terrorists? Why would Trump do such a thing, in the process taking Mayor Sadiq Khan’s words out of context in a way that totally changed their meaning? Because last year Khan, perhaps the highest-profile Muslim public official in a non-Muslim country, criticized then-candidate Trump, saying that his “ignorant view of Islam could make both our countries less safe.”\n\nWhat Khan actually said Sunday was that the public had “no reason to be alarmed” about an increased police presence on the streets — not, as Trump suggests, that they should be nonchalant about terrorism. Khan’s stoic and defiant response is in the tradition of Churchill’s during the Blitz of 1940 and 1941, and Thatcher’s during the Irish Republican Army’s terrorism campaign. Londoners have rallied around him. Trump, by contrast, sounds like a ridiculous Chicken Little squawking about the coop.\n\nWords have consequences. Trump’s may hurt British Prime Minister Theresa May in Thursday’s election. Assuming she survives, she will have learned a lesson about getting too close to a volcanic president who might at any minute erupt.\n\nWe already knew that Trump had a narrow mind and a small heart. Now we must wonder about his emotional stability, his grasp of reality, or both.\n\nRead more from Eugene Robinson’s archive, follow him on Twitter or subscribe to his updates on Facebook. You can also join him Tuesdays at 1 p.m. for a live Q&A.", "authors": [], "publish_date": "2017-06-05", "source": "washingtonpost", "top_words": ["travel", "courts", "trump", "watered", "ban", "security", "trumps", "need", "statements", "president", "control"], "summary": "Trump signs an executive order for border security and immigration enforcement improvements at the Department of Homeland Security in Washington.\nJan. 25, 2017 Trump signs an executive order for border security and immigration enforcement improvements at the Department of Homeland Security in Washington.\nChip Somodevilla/Pool photo via Bloomberg NewsThe statements President Trump issued on Twitter in recent days lead to a chilling conclusion: The man is out of control.\nOn Monday, he started at 6:25 a.m. to comprehensively undermine his own legal team in its quest to win Supreme Court approval for a travel ban targeting Muslims.\n“People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN,” Trump wrote."}