{"url": "https://www.washingtonpost.com/business/capitalbusiness/after-trumps-travel-ban-tourism-outfits-say-that-brand-usa-has-taken-a-hit/2017/04/14/d0eebf4e-158e-11e7-833c-503e1f6394c9_story.html", "id": "35", "title": "Even Canadians are skipping trips to the U.S. after Trump travel ban", "text": "\n\nAirplanes sit on the tarmac at San Francisco International Airport. San Francisco is one city expected to lose tourism dollars this year after President Trump promoted a travel ban. (Justin Sullivan/Getty Images)\n\nThe cancellations came quickly and in rapid succession. Within days of President Trump’s first executive order restricting travelers from seven Muslim-majority countries, a number of European travel groups pulled their plans, amounting to a loss of 2,000 overnight stays for Hostelling International USA.\n\nThe ban would complicate travel for citizens of the countries cited — among them Iran, Syria and Libya. But Canadians and Europeans and others were dropping their plans, too. As group organizers put it, people suddenly had an unsettling sense that the United States wasn’t as welcoming a place as it once was.\n\nThe result was a wave of withdrawals. “Getting those cancellations all at once, that was startling,” said Russ Hedge, chief executive of HI USA, which oversees 52 hostels across the country. “We’ve never seen something like that.”\n\nFrom hostels to major hotel chains such as Marriott, tour group operators to outfits that cater to business travelers, the toll of Trump’s proposals on the nation’s tourism industry has been swift. Some say long-term damage has been done.\n\nAnd it could be compounded by recent reports of Trump administration plans to implement “extreme vetting” of foreign travelers. Visitors — including those from allies such as France and Germany — could be pressed to turn over mobile phone contacts, social media passwords and financial records, according to a Wall Street Journal report.\n\n“The travel ban is only a negative at this point,” said Michael Bellisario, an analyst for the investment bank Robert W. Baird & Co. “It hurts travel, regardless of whether we’re talking about one of the six banned countries or not,” he said, referring to the second, revised entry ban.\n\nDemand for flights to the United States has fallen in nearly every country since January, ­according to Hopper, a travel-booking app that analyzes more than 10 billion daily airfare price quotes to derive its data. Searches for U.S. flights from China and Iraq have dropped 40 percent since Trump’s inauguration, while demand in Ireland and New Zealand is down about 35 percent. (One exception: Russia, where searches for flights to the United States have surged 60 percent since January.)\n\nThe result could be an estimated 4.3 million fewer people coming to the United States this year, resulting in $7.4 billion in lost revenue, according to Tourism Economics, a Philadelphia-based analytics firm. Next year, the fallout is expected to be even larger, with 6.3 million fewer tourists and $10.8 billion in losses. Miami is expected to be hit hardest, followed by San Francisco and New York, the firm said.\n\nThe administration’s travel ban deals a blow to an industry that has only recently recovered from a $600 billion loss following the Sept. 11, 2001, attacks.\n\n“In the aftermath of 9/11, at first people didn’t feel safe coming here, and then they didn’t feel welcome,” said Jonathan Grella, an executive vice president at the U.S. Travel Association. “Our industry still refers to that as ‘the lost decade.’ There is a very real risk that that could happen again.”\n\n\n\nFlight attendants in Los Angeles watch a protest of the immigration ban imposed by President Trump. (Justin Sullivan/Getty Images)\n\nA demonstrator holds an American flag during a rally at San Francisco International Airport. (Stephen Lam/Getty Images)\n\nBroad-based apprehension\n\nAs anecdotal evidence mounts, industry experts say it’s increasingly clear that travelers from all over — Canada and Mexico, Europe and Asia — are rethinking their plans to visit the United States.\n\nMarriott International, the world’s largest hotel chain, has noted a 15 percent drop in bookings from Mexico to the United States. Meanwhile, bookings from the Middle East to the United States fell about 30 percent in February. The strong dollar, executives said, contributed to a decline in international travel to the United States.\n\nMike McCormick, executive director of the Global Business Travel Association, said that following Trump’s first travel order, there was a “pronounced drop in bookings,” resulting in estimated losses of $185 million.\n\n“It hurts the industry,” he said. “You have discretion in moving meetings and events to other places. They don’t have to be in New York or Chicago or here in the U.S.”\n\n[Worried about Trump’s travel ban, Canada’s largest school district calls off U.S. trips]\n\nFifteen miles from the White House, the Sheraton Tysons Hotel is now offering a free Apple Watch to anybody who books a meeting. “We’re doing everything we can to get through this storm,” said Chris Zindash, the hotel’s director of sales and marketing.\n\nConcerned guests have been calling for weeks, he said, and a group from Asia recently backed out of a long-planned visit.\n\n“There is a lot of apprehension,” Zindash said, “a lot of fear that people will arrive here and the gates will be closed.”\n\nAt Hostelling International, among the first to cancel was a British-based youth group that had planned a trip for 400 to the East Coast this summer. The three-week gathering, called Merit360, was to culminate in presentations to the United Nations.\n\nBut then Trump issued his first travel ban. Nearly 80 citizens of the affected countries had already paid their deposits for the annual trip. The year before, when Barack Obama was president and there were no such bans in place, nearly 200 of the organization’s 550 participants had failed to acquire proper visas for their trip. This year was bound to be much worse.\n\n“This has been a setback on so many levels,” said Marlou Herm­sen, chief operating officer of World Merit, which oversees the program. “When the first ban was announced, that’s when we thought: It’s real. We’re not welcome anymore.”\n\nTwo-thirds of participants voted to move the gathering to Britain, with plans to meet with Parliament in London instead of the United Nations in New York.\n\nGrella, of the U.S. Travel Association, says it’s not so much the executive orders that bother him, but the fact that the U.S. government hasn’t made an effort to reassure international travelers.\n\n“All it takes is a little rebranding: ‘Here’s who’s no longer welcome for the time being, but for everybody else, yes, we’re open for business,’ ” Grella said. “The ripple effects of this are very real. We’ve unnecessarily ruffled a lot of feathers.”\n\n[With Brand USA, a campaign to lure foreign tourists — and their money]\n\n\n\nPeople protest and welcome arriving passengers at Washington Dulles International Airport. (Astrid Riecken/For The Washington Post)\n\nThe American flag flies with other nations’ flags outside of the United Nations in New York City. (Spencer Platt/Getty Images)\n\nBorder businesses\n\nSince Trump announced the ban, Marie Aguado has canceled three trips: business travel to Los Angeles, a visit to see her brother in Austin and a family vacation to Disney World.\n\n“We’re afraid to leave,” said Aguado, an American who lives in Mexico City with her French-born husband and two daughters. She asked to be identified by her middle and last names for fear of government retribution.\n\n“I’m dead serious about not going home,” she said. “When the ban happened, I was thinking of my children.”\n\nAguado’s oldest daughter was born in Dubai. The other was born in Mexico City. Both are also French citizens.\n\n“I was just thinking they’re going to see my daughter was born in the Middle East,” she said. “And then what’s going to happen? I got totally freaked out and said to my brother, ‘I’m not coming to see you anymore. Come see me.’ ”\n\nJust one more wrinkle, she said: Her brother’s wife is a green-card holder from Ukraine.\n\n“They’re afraid to travel, too,” Aguado said.\n\nThat fear of leaving — and re-entering — the United States has led to a slowdown in traffic to Mexican border cities, which have long been popular destinations for shoppers and those seeking cheaper health care.\n\n[Worried about Trump’s travel ban, Canada’s largest school district calls off U.S. trips]\n\nFrancisco Vazquez Michel, a Mexican dentist in the border town of Nogales, said that 80 percent of his clients are Mexicans or Hispanics living in the United States, who cross the border for less-expensive care. Now about half as many as usual are coming, he said.\n\n“They are very afraid, and it’s fear that Donald Trump put into Mexicans,” he said. “One day, not long ago, all of our appointments [were] canceled in one day, because the rumor went around that if people crossed, they would lose their visas.”\n\nThe president of the Nogales chamber of commerce, Carlos Jimenez Robles, said that the number of shoppers crossing into Mexico had dropped by 40 percent.\n\n“We have seen a hardening by border agents, where they have more questions for people, more doubts about who people are,” Jimenez said. “Not only with tourists, also with American citizens.”\n\n\n\nDespite this sort of welcome at some U.S. airports, foreign travelers are changing their plans and rebooking their trips to steer away from U.S. cities. (Astrid Riecken/For The Washington Post)\n\n‘We’re not anti-American’\n\nNot everybody reported an immediate slowdown in business.\n\n“It hasn’t made a difference to us,” said Nayan Patel, owner of the Georgetown Inn in Washington. “America is still America — we’re still a democratic country full of opportunity — and that’s enough to get people to come here.”\n\nSmall World Vacations, a travel agency in New Jersey that specializes in Disney vacations, hasn’t noticed much of a drop-off, either. It has received just one cancellation this year, from an Iranian American with a German passport. He didn’t want to leave on a Disney cruise to the Bahamas out of fear he wouldn’t be allowed back into the country, said Sue Pisaturo, the agency’s founder.\n\n“We do get our share of international travelers from every country — even countries I’ve never heard of — but so far it’s business as usual,” she said.\n\nThat’s not the case, though, at Westmount High School in Montreal. Seniors there had been planning their graduation trip for months.\n\n“We usually go to New York but decided this year to go to Washington,” teacher Sabrina ­Jafralie said. “The kids were overjoyed.”\n\nThey were drawn to the capital, she said, by the new African American History museum and were interested in visiting the Holocaust Museum.\n\nOne hundred students signed up. Then the Trump travel ban hit. Jafralie, who is Canadian-born but whose father emigrated from India 40 years ago, realized that four of the students were from Iran. They held Canadian visas but weren’t Canadian citizens. Students from Pakistan and Sri Lanka also expressed concern.\n\nThey had read a number of media reports about people being stopped at the U.S. border for long interrogations. A Montreal-area woman wearing a hijab was blocked from going on a day-long shopping trip to Vermont, while a Canadian-born woman of Indian descent was told she would need a visa to enter the United States for a weekend spa visit.\n\nAfter long, sometimes agonizing discussions with her students — Jafralie teaches ethics — they agreed to go to Toronto instead.\n\n“We decided that we were not prepared to leave any students behind,” she said. “It’s not a political boycott on our part. We’re not anti-Trump. We’re not anti-American. We’re anti-not-being-together. We’re a family, and we travel together.”\n\nAlan Freeman in Ottawa and Joshua Partlow in Mexico City contributed to this report.\n\nRead more:\n\nAmericans are more split on the Trump travel ban than you might think\n\nHe bought Trump’s childhood home for $1.4 million — and flipped it weeks later for a yuge profit\n\nFrench manicures, Bud Light and fly fishing: How Trump staffers are changing Washington\n\nA Trump voter’s message to retailers: ‘Keep your mouths shut about our president’", "authors": [], "publish_date": "2017-04-14", "source": "washingtonpost", "top_words": ["travel", "international", "trump", "ban", "plans", "travelers", "united", "trips", "trumps", "states", "president", "canadians", "skipping"], "summary": "San Francisco is one city expected to lose tourism dollars this year after President Trump promoted a travel ban.\nThe administration’s travel ban deals a blow to an industry that has only recently recovered from a $600 billion loss following the Sept. 11, 2001, attacks.\nThe strong dollar, executives said, contributed to a decline in international travel to the United States.\nBut then Trump issued his first travel ban.\nThen the Trump travel ban hit."}