{"url": "https://www.washingtonpost.com/news/worldviews/wp/2017/01/31/why-not-frances-far-right-party-says-it-could-replicate-trumps-ban-if-le-pen-elected/", "id": "303", "title": "‘Why not?’ France’s far-right party says it could replicate Trump’s ban if Le Pen is elected", "text": "\n\nMarine Le Pen, leader of the French far-right National Front party, attends a private meeting with FN activists on Friday in Haulchin, near Lille, France. (Sylvain Lefevre/Getty Images)\n\nFrance could implement a travel ban similar to the one in the United States if far-right National Front candidate Marine Le Pen is elected president this spring, a party leader said Monday.\n\nPresident Trump on Friday signed orders to not only suspend admission of all refugees into the United States for 120 days but also to implement “new vetting measures” to screen out “radical Islamic terrorists.” Refugee entry from Syria, however, would be suspended indefinitely, and all travel from Syria and six other nations — Iran, Iraq, Libya, Somalia, Sudan and Yemen — is suspended for 90 days.\n\n[Who is affected by Trump’s travel ban]\n\nSteeve Briois, the National Front party's vice president and a member of Le Pen's campaign, told Agence France-Presse that they would certainly be open to copying Trump's ban in France.\n\n“And why not?” said Briois, who also is the mayor of Henin-Beaumont, a city about 125 miles north of Paris. “We are no longer in the world of the Care Bears. We are in a horrible world, so sometimes you have to take measures of authority, even if it shocks.”\n\nTrump also said he would give priority to Christian refugees over those of other religions, according to the Christian Broadcasting Network. The president and his supporters have continued to insist it is not a ban on Muslims.\n\n[Marine Le Pen could win the French election — but first she must win a family feud]\n\nThroughout the weekend, the order sowed confusion at numerous airports as travelers from the affected countries were denied entry. The ban also drew lawsuits, massive protests and sharp rebukes from domestic lawmakers and leaders around the world.\n\n“All is going well,” Trump said.\n\nDespite the chaos, Briois on Monday said it was Trump's prerogative to enact such a ban.\n\n“It is true that the United States are a target for jihadists so if [Trump] wishes to protect himself by barring entry on his territory for people from those countries, that is his right,” Briois told AFP. “It is unfortunate for those [caught up in the ban] who have nothing to do with it.”\n\nLe Pen has not spoken publicly about the travel ban, according to the Local. Since the beginning of her campaign, she has maintained that she wants to pull France out of the European Union, reinforce the country's borders and crack down on immigration.\n\nThis month, during Trump's transition period, Le Pen was spotted at Trump Tower in New York, although she did not say whether she met with the then-president-elect while there.\n\nOver the weekend, however, Le Pen posted a defense of Trump on Twitter.\n\n\"Ce qui gêne les médias et les politiques, c'est que #Trump respecte ses engagements et applique son programme.\" #MLPTF1 — Marine Le Pen (@MLP_officiel) January 28, 2017\n\n“What bothers the media and politicians is that Trump respects his commitments and implements his programs,” Le Pen tweeted Saturday.\n\nA recent poll shows Le Pen with a slight lead in the election's first round in April, with 25 percent of the votes, Reuters reported.\n\nMeanwhile, center-right candidate Francois Fillon, who won the national primaries in November, came in at 21 to 22 percent of the vote in that poll, ceding some votes as he is caught up in an employment scandal involving his wife. Fillon has said he may drop out of the presidential race if a judge decides to pursue a formal case against him.\n\nSeen as Le Pen's toughest competitor, Fillon has also taken a hard-line stance on immigration. He reiterated that stance in a tweet Sunday, saying he wanted “strict administrative control over the Muslim faith” in France.\n\nJe veux un strict contrôle administratif du culte musulman, tant que son ancrage dans la République ne sera pas pleinement achevé. — François Fillon (@FrancoisFillon) January 29, 2017\n\nThe poll showed that centrist candidate Emmanuel Macron would earn 20 to 21 percent of the vote.\n\nOn Sunday, Socialist Benoit Hamon won the country's leftist primary. Experts say the leftist party is very unlikely to win the presidential race, given the rise of populism and nationalism around the world.\n\nFrance's unpopular president, François Hollande of the Socialist party, announced last month that he would not seek reelection despite being eligible for another term.\n\nThe two rounds of the election will take place in late April and early May.\n\nRead more:\n\nFrench left chooses a presidential candidate, in an almost hopeless race\n\nMarine Le Pen at Trump Tower: Only for the food?\n\nFrench employees can legally ignore work emails outside of office hours", "authors": [], "publish_date": "2017-01-31", "source": "washingtonpost", "top_words": ["farright", "travel", "trump", "national", "ban", "replicate", "pen", "le", "frances", "trumps", "president", "party", "elected", "fillon"], "summary": "Marine Le Pen, leader of the French far-right National Front party, attends a private meeting with FN activists on Friday in Haulchin, near Lille, France.\n(Sylvain Lefevre/Getty Images)France could implement a travel ban similar to the one in the United States if far-right National Front candidate Marine Le Pen is elected president this spring, a party leader said Monday.\n#MLPTF1 — Marine Le Pen (@MLP_officiel) January 28, 2017“What bothers the media and politicians is that Trump respects his commitments and implements his programs,” Le Pen tweeted Saturday.\nA recent poll shows Le Pen with a slight lead in the election's first round in April, with 25 percent of the votes, Reuters reported.\nRead more:French left chooses a presidential candidate, in an almost hopeless raceMarine Le Pen at Trump Tower: Only for the food?"}