{"url": "https://www.washingtonpost.com/news/post-politics/wp/2017/02/01/ban-or-no-ban-trump-settles-the-debate-over-his-executive-order/", "id": "338", "title": "Ban or no ban? Trump settles the debate over his executive order.", "text": "\n\nWhite House press secretary Sean Spicer takes questions during the daily press briefing on Jan. 31. (Alex Wong/Getty Images)\n\nUntil the early afternoon Tuesday, the White House all seemed to be on the same page: President Trump's executive order restricting immigration from seven predominantly Muslim countries was a travel “ban.”\n\nThat was until White House press secretary Sean Spicer at that afternoon's press briefing declared with some irritation: “It's not a travel ban.”\n\n“What it is is to make sure that the people who are coming in are vetted properly from seven countries that were identified by the Obama administration,” Spicer said. “A ban would mean people can't get in.”\n\n[The number of people affected by Trump’s travel ban: About 90,000]\n\nThat was news to most people who had heard Spicer and other White House officials repeatedly call it a “ban” in recent days — including on Monday night, when Spicer appeared on a panel in Washington and said “the ban deals with seven countries.”\n\nBut more critically, the president himself had referred to it as a “ban” in a tweet on Monday.\n\nAsked about the discrepancy with the president's tweets, Spicer blamed it on the journalists sitting in front of him.\n\n“He's using the words that the media is using,” he said.\n\nBy Wednesday morning, Trump weighed in to settle the matter.\n\n“Everybody is arguing whether or not it is a BAN. Call it what you want, it is about keeping bad people (with bad intentions) out of country!” he tweeted.", "authors": [], "publish_date": "2017-02-01", "source": "washingtonpost", "top_words": ["executive", "seven", "travel", "trump", "spicer", "ban", "secretary", "trumps", "using", "debate", "press", "order", "house", "white", "settles"], "summary": "White House press secretary Sean Spicer takes questions during the daily press briefing on Jan. 31.\nAsked about the discrepancy with the president's tweets, Spicer blamed it on the journalists sitting in front of him.\n“He's using the words that the media is using,” he said.\n“Everybody is arguing whether or not it is a BAN.\nCall it what you want, it is about keeping bad people (with bad intentions) out of country!” he tweeted."}