{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/02/05/this-was-snls-most-politically-potent-sketch-this-week/", "id": "368", "title": "This was SNL’s most politically potent sketch this week", "text": "It's no surprise that \"Saturday Night Live\" poked plenty of fun at President Trump in its first new episode of his presidency. The Post's Elahe Izadi has your summaries of their Stephen K. Bannon-as-the-real-president and Melissa McCarthy-as-Sean Spicer bits.\n\nBut neither proved to be the show's most political and arguably most biting sketch this weekend. That one was a faux informational video for Customs and Border Protection that took a very dim view of Trump's travel ban -- using crude edits to reflect Trump's new (temporarily halted) policy and making the case, as opponents have, that it's a thinly veiled Muslim ban.\n\nAt one point, the video zeroes in on a young, brown-skinned boy waiting in line in customs, placing an \"X\" over him while giving a white man holding a thinly disguised, large gun a pass.", "authors": [], "publish_date": "2017-02-05", "source": "washingtonpost", "top_words": ["snls", "x", "politically", "weekend", "customs", "young", "zeroes", "week", "trumps", "sketch", "waiting", "white", "potent", "video", "thinly"], "summary": "It's no surprise that \"Saturday Night Live\" poked plenty of fun at President Trump in its first new episode of his presidency.\nThe Post's Elahe Izadi has your summaries of their Stephen K. Bannon-as-the-real-president and Melissa McCarthy-as-Sean Spicer bits.\nBut neither proved to be the show's most political and arguably most biting sketch this weekend.\nThat one was a faux informational video for Customs and Border Protection that took a very dim view of Trump's travel ban -- using crude edits to reflect Trump's new (temporarily halted) policy and making the case, as opponents have, that it's a thinly veiled Muslim ban.\nAt one point, the video zeroes in on a young, brown-skinned boy waiting in line in customs, placing an \"X\" over him while giving a white man holding a thinly disguised, large gun a pass."}