{"url": "https://www.washingtonpost.com/local/public-safety/va-demands-more-details-on-travel-ban-detentions-at-dulles-international-airport/2017/02/01/f10aef32-e8de-11e6-80c2-30e57e57e05d_story.html", "id": "317", "title": "Va. demands more details on travel ban detentions at Dulles International Airport", "text": "(Karen Attiah/The Washington Post)\n\nA day after joining a court fight challenging the legality of President Donald Trump’s ban on travelers from seven countries, the Commonwealth of Virginia asked federal officials to provide more details about precisely how many people were detained, and whether any Virginia residents were still being held.\n\n[Virginia enters federal court fight against Trump travel ban]\n\nIn a “show-cause” motion filed in federal court in Virginia, Attorney General Mark R. Herring (D) demanded that officials explain exactly what happened last weekend at Dulles International Airport after the president’s order went into effect.\n\nCiting news reports that travelers had been held and were not allowed to speak with lawyers – even after a judge placed a temporary restraining order on the president’s ban – Herring noted that he was “deeply concerned.”\n\n[Waiting for a refugee family, in the wake of Trump’s ban]\n\n“Although many aspects of these events are disturbing, I am particularly troubled that Virginia residents were detained, or returned to the country from which their travel originated, despite having been previously issued lawful permanent residence status or lawful student or work visas,” Herring wrote in a letter to the departments of Homeland Security, Justice and Customs that was released by his office.\n\nIn the motion, Herring called on federal officials to submit sworn statements to address four key questions: The time officials received the notice of the temporary restraining order on Jan. 28; the number of air passengers that arrived at Dulles International Airport from Jan. 27, 28 and 29 with “lawful permanent residence who were removed from the United States both before and after the receipt of the actual notice” of the restraining order; whether any such arrivals were denied prompt access to counsel; and the names and titles of all government officials, if any, who instructed Customs and Border Protection personnel not to comply with the temporary restraining order.\n\n[Acting attorney general declares Justice Department won’t defend Trump’s immigration order]\n\nHerring’s letter underscores the lingering confusion surrounding much of what happened during the weekend at the Virginia airport where, according to lawyers, between 50 and 60 legal residents were tricked into giving up their status.\n\nSeveral lawsuits have been filed across the country challenging the president’s travel ban.\n\n[ States are joining the legal battle over Trump’s immigration order ]\n\nThe Virginia lawsuit was filed by attorneys for two Yemeni brothers who arrived at Dulles International Airport over the weekend and were quickly put on a return flight to Ethiopia. The brothers were “coerced into signing documents that petitioners believe waived their visa rights,” according to court documents.\n\nThe motion also said several members of Congress went to Dulles to resolve the crisis and to ensure compliance of the temporary restraining order, but were turned away. Sen. Cory Booker (D-N.J.) said he went to the airport and Customs and Border Protection officials “told me nothing, and it was unacceptable,” according to the motion.\n\nBooker continued: “I believe it’s a Constitutional crisis, where the executive branch is not abiding by the law.”", "authors": [], "publish_date": "2017-02-01", "source": "washingtonpost", "top_words": ["travel", "international", "airport", "restraining", "ban", "va", "order", "officials", "herring", "trumps", "federal", "detentions", "temporary", "demands", "dulles", "virginia", "details"], "summary": "[Virginia enters federal court fight against Trump travel ban]In a “show-cause” motion filed in federal court in Virginia, Attorney General Mark R. Herring (D) demanded that officials explain exactly what happened last weekend at Dulles International Airport after the president’s order went into effect.\nSeveral lawsuits have been filed across the country challenging the president’s travel ban.\nThe motion also said several members of Congress went to Dulles to resolve the crisis and to ensure compliance of the temporary restraining order, but were turned away.\nSen. Cory Booker (D-N.J.) said he went to the airport and Customs and Border Protection officials “told me nothing, and it was unacceptable,” according to the motion.\nBooker continued: “I believe it’s a Constitutional crisis, where the executive branch is not abiding by the law.”"}