{"url": "https://www.washingtonpost.com/blogs/plum-line/wp/2017/02/07/trump-is-now-attacking-all-the-institutions-that-could-limit-his-power-later/", "id": "324", "title": "Trump is now attacking all the institutions that could limit his power later", "text": "A federal judge in Seattle on Feb. 3 temporarily blocked the enforcement of President Trump's travel ban. Here's what you need to know about the judge's ruling. (Natalie Jennings,Bastien Inzaurralde,Alice Li/The Washington Post)\n\nTHE MORNING PLUM:\n\nPresident Trump’s immigration ban faces a crucial legal test later Tuesday, when an appeals court is set to hold a hearing to decide whether to lift a lower court’s decision to place a hold on it. Judging by his multiple tweets attacking the judiciary for placing a temporary hold on his ban, Trump is trying to pressure the courts into restoring and upholding it, while simultaneously laying the groundwork for possible defeat by explicitly stating that any terrorist attacks that happen later should be blamed on the judges who rule against it.\n\n[Is President Trump’s executive order constitutional?]\n\nBut it’s important to step back and appreciate the bigger picture here. Trump — faced with an outpouring of popular opposition to his ban, and a level of institutional pushback to it, that surely caught him and his advisers off guard — is actively experimenting with how far he can go in delegitimizing the institutions that are already signaling they may place serious, meaningful limits on his power. Consider:\n\nTrump’s tweets attacking the judiciary go well beyond conventional criticism of judicial opinions on the substance or of “unelected judges” who are said to be overstepping their power. The description of the judge who first blocked his ban as a “so-called judge” directly targeted the judiciary’s institutional legitimacy. And it’s not hard to imagine where Trump’s explicit claim that any terrorist attack should be blamed on the judiciary will take him next, if such an attack does occur.\n\nTrump recently claimed that “any negative polls are fake news,” particularly those from major networks like CNN, NBC and ABC. He added: “Sorry, people want border security and extreme vetting.” In other words, any poll that finds that Trump or his policies are unpopular is suspect or invented by definition. Multiple polls have shown that majorities reject his travel ban and his border wall, and global protests have broken out against the ban in particular. In other words, the public backlash to the first two major efforts to translate Trumpism into policy reality has been severe. In response, Trump is explicitly telling his supporters that any empirical evidence of that backlash must be discounted as fake news — particularly if the polls in question come from major news organizations, who are thus being cast as deliberate deceivers of Real Americans.\n\nYou cannot divorce that last point from the larger context here: Trump and Sean Spicer spent days attacking the news media for accurately reporting on his shriveled inauguration crowds, and Stephen Bannon has claimed that Trump’s “populist nation-state policies are supported by the vast and overwhelming majority of Americans” — in other words, that a vast silent majority is rooting for Trumpism to succeed. But that’s just nonsense. The effort to falsely inflate impressions of popular support for Trump — and for policies that in reality are deeply controversial and divisive and are being rejected by majorities — is concerted and deliberate. And the unabashed use of obvious and demonstrable lies to carry out this deception campaign is remarkably brazen.\n\nTrump is now claiming that the media is covering up terrorist attacks, saying that “ISIS is on a campaign of genocide, committing atrocities across the world,” and that “in many cases, the very, very dishonest press doesn’t want to report it.” The larger context here is crucial, too: The media has in fact been invaluable in rooting out the dangerously incompetent process that led to the creation of this ban, as well as the ugly, discriminatory ideological underpinnings of the idea. In response, Trump, once again, is moving to obliterate the very possibility of shared agreement on the legitimate institutional role of the news media in informing the citizenry — right when it is playing that role to great effect by shedding light on the truth about his latest and most visible exercise of executive power, thus demonstrating that it can function as a check on him.\n\nThe travel ban has unleashed a surprisingly robust response from the public and our institutions, making this into a first test case as to whether popular mobilization and those institutions can effectively rein in Trump’s authoritarian and nakedly discriminatory impulses. The question is not just whether this ban can be stopped. It’s also whether Trump can be blocked from extending and expanding this policy and instituting others like it.\n\n[Trump must stop lying or Americans will think he is nuts]\n\nBut even as that response has arisen, Trump is also testing how far he can go in delegitimizing our institutions — and in telling lies designed to minimize impressions of popular opposition to the scope and nature of his exercise of power — apparently in order to undermine the degree to which those forces will continue to function as a check on that power later. So it’s important to appreciate that this test case flows in two directions.\n\n*****************************************************************\n\n* FATE OF TRAVEL BAN RESTS WITH APPEALS COURT: Trump’s travel ban will get a hearing in a federal appeals court later Tuesday, and The Post overview of the situation notes:\n\nThe future of the temporary ban now lies with three judges on the U.S. Court of Appeals for the 9th Circuit: William C. Canby Jr., who was appointed by President Carter; Judge Richard Clifton, who was appointed by President George W. Bush; and Judge Michelle Taryn Friedland, who was appointed by President Obama.\n\nWhatever decision is reached may be appealed to the Supreme Court, but the court only has eight members and might deadlock, in which case the appeals court ruling would stand.\n\n* A KEY CONCESSION ABOUT THE BAN? Adam Liptak observes this about the administration’s latest brief defending it:\n\n[The brief] asked the appeals court, at a minimum, to reinstate at least part of Mr. Trump’s order — appearing to acknowledge the possibility that the government’s case might not be successful. “At most,” the brief said, the court order blocking the ban should be limited to “previously admitted aliens who are temporarily abroad now or who wish to travel and return to the United States in the future.”\n\nThe administration hopes that at least some of the travel ban can remain in place — keeping out those who have not ever visited the United States — while the underlying legal dispute is resolved. Small victories!\n\n* HOMELAND SECURITY CHIEF TO BE GRILLED ON BAN: The Los Angeles Times notes that John Kelly, the secretary of homeland security, is set to face tough questioning from lawmakers Tuesday about Trump’s immigration ban:\n\nKelly will be in the awkward position of defending the execution of a directive he didn’t see until the week it was issued and wasn’t told was coming until the day before it was signed.\n\nHere’s a question for Kelly: Do you disagree with all of the national security professionals who believe this ban makes us less safe by sending a message that the United States is at war with Islam?\n\n* TRUMP IS PUTTING TRAVEL BAN IN LEGAL JEOPARDY: David George explains that the travel ban’s legal fate will turn on how expansively the courts interpret presidential power, but with a twist:\n\nTypically, legal experts say, the president would almost certainly win a legal fight involving national security and foreign citizens entering the country. But the rollout of this executive order has been far from the norm. Trump’s campaign promise to impose a Muslim ban, his recent tweets attacking the GOP-appointed judge who ruled against him and the White House’s clumsy handling of the order’s implementation may change the calculation.\n\nIt would be a fitting end to this saga if Trump’s anti-Muslim demagoguery and assaults on the judiciary, and Bannon’s incompetent rollout of the ban, ended up dooming it.\n\n* SETTING THE RECORD STRAIGHT ON TRUMP’S BAN: The White House likes to say that the seven countries targeted by Trump’s ban were merely selected from a list of countries that the Obama administration was worried about, as evidenced by Obama’s signing of a bill that restricted a visa program involving those countries. But Glenn Kessler has a detailed look at the actual history here, and it shows that the story is much more complicated than the White House claims.\n\nHere are the crucial points: The Obama administration’s measure did not ban people from visiting, and its emphasis was on people who traveled to those seven countries, while Trump is banning them, and his emphasis is on people who are nationals of those countries. Gosh, whatever would motivate Trump’s decision to make this all about nationality?\n\n* ANGRY CROWDS PROTEST OBAMACARE REPEAL: The New York Times reports that Republicans are increasingly anxious about their strategy for repealing Obamacare, and are now opting for a go-slow approach:\n\nMany are facing tough, angry questions at town hall meetings. … A crowd of protesters gathered outside a town meeting in California held over the weekend by Representative Tom McClintock, who was escorted by police officers as he left the event, according to news reports. Representative Gus Bilirakis of Florida faced 200 angry supporters of the health care law at a meeting on Saturday.\n\nTurns out tea partyers aren’t the only ones who have proved willing to show up at town meetings and make their feelings known about Obamacare.\n\n* MELANIA HOPES TO MAKE BIG BUCKS OFF FIRST LADY ROLE: Melania Trump has now filed a lawsuit over a newspaper story about her, alleging that it will compromise her ability to establish “multimillion dollar business relationships” during her years as first lady, in which she will be “one of the most photographed women in the world.”\n\nAs former George W. Bush ethics chief Richard Painter puts it: “There has never been a first lady of the United States who insinuated that she intended to make a lot of money because of the ‘once-in-a-lifetime’ opportunity of being first lady.” This White House is unconventional and disruptive!\n\n* AND THE TRUMP TWEET OF THE DAY, IT’S-STILL-ABOUT-OBAMA EDITION: Good morning, Mr. President:\n\nI don't know Putin, have no deals in Russia, and the haters are going crazy – yet Obama can make a deal with Iran, #1 in terror, no problem! — Donald J. Trump (@realDonaldTrump) February 7, 2017\n\nActually, the parties to the Iran deal also include Britain, France, Germany, China and (wait for it) Russia.", "authors": [], "publish_date": "2017-02-07", "source": "washingtonpost", "top_words": ["travel", "trump", "attacking", "ban", "appeals", "judge", "court", "institutions", "later", "trumps", "limit", "president", "power", "legal"], "summary": "A federal judge in Seattle on Feb. 3 temporarily blocked the enforcement of President Trump's travel ban.\n[Is President Trump’s executive order constitutional?]\nThe description of the judge who first blocked his ban as a “so-called judge” directly targeted the judiciary’s institutional legitimacy.\nMultiple polls have shown that majorities reject his travel ban and his border wall, and global protests have broken out against the ban in particular.\nWhatever decision is reached may be appealed to the Supreme Court, but the court only has eight members and might deadlock, in which case the appeals court ruling would stand."}