{"url": "https://www.washingtonpost.com/blogs/right-turn/wp/2017/06/04/with-his-london-tweets-trump-embarrasses-himself-and-america-once-again/", "id": "350", "title": "With his London tweets, Trump embarrasses himself — and America — once again", "text": "\n\nPeople leave the scene of a terrorist attack on London Bridge in central London on June 3. (Chris J Ratcliffe/Agence France-Presse via Getty Images)\n\nThe stoic determination and decency of the British people and their leaders were on full display in the hours after the latest horrific terrorist rampage. The Brits fought back, launching drinking glasses and chairs at the savages who attacked them. The police acted with lightning-fast precision, killing the three assailants within eight minutes of the emergency call. And, God Bless him, a man returned to the bar where he experienced Saturday’s horror — to pay his bill and tip. Civilization is not going to be driven out of Britain by three or three hundred killers.\n\nMeanwhile — and it pains me to write this — our president acted like a clod, a heartless and dull-witted thug in sending out a series of tweets. He — commander in chief and leader of the Free World — first retweeted an unverified, unofficial Drudge headline about the unfolding terrorist attack. Then he aimed to bolster his Muslim travel ban (which is not supposed to be a Muslim travel ban). “We need to be smart, vigilant and tough,” he tweeted. “We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!” (Aside from the inappropriateness of President Trump’s tweet, he fails to grasp that the courts in these cases are reaffirming our rights against an overreaching, discriminatory edict.)\n\nRepublicans and Democrats on June 4 commented on President Trump's tweets calling for a travel ban and criticizing the mayor of London after an attack in Britain's capital left seven people dead the day before. (Bastien Inzaurralde/The Washington Post)\n\nAfter receiving blowback for that obnoxious missive, he tweeted out, “Whatever the United States can do to help out in London and the U. K., we will be there – WE ARE WITH YOU. GOD BLESS!” But then he decided to slam the mayor of the city attacked, who had calmly warned his fellow Londoners: “Londoners will see an increased police presence today and over the course of the next few days. There’s no reason to be alarmed.” Trump took the second part out of context and responded viciously, “At least 7 dead and 48 wounded in terror attack and Mayor of London says there is ‘no reason to be alarmed!'” (The mayor, of course, was telling them not to be alarmed by the heightened police presence.) Trump was not done, however, inanely tweeting, “Do you notice we are not having a gun debate right now? That’s because they used knives and a truck!”\n\nSpeaking at a vigil at Potters Fields Park in London on June 5, London Mayor Sadiq Khan called the London Bridge attack \"cowardly,\" saying to the perpetrators, \"We will defeat you.\" (Reuters)\n\nOne is prompted to ask if he is off his rocker. But this is vintage Trump — impulsive and cruel, without an ounce of class or human decency. His behavior no longer surprises us, but it should offend and disturb us, first, that he remains the face and voice of America in the world and, second, that his fans hoot and holler, seeing this as inconsequential or acceptable conduct. We wound up with this president because millions of Republicans could not prioritize character, decency and overall fitness to serve over their mundane and frankly petty partisan wish list (28 percent top marginal tax rate!). Self-appointed religious leaders fail to see that this soullessness — not the dreaded liberal elite who insist on saying “Happy Holidays” or refuse to countenance discrimination against gay customers — is a threat to the moral fiber of a democracy that requires a modicum of common sense and human decency to function.\n\n1 of 39 Full Screen Autoplay Close Skip Ad × Britain probes attack in central London that left 7 dead and dozens injured View Photos London Bridge and nearby Borough Market were the site of chaos after a van plowed into pedestrians and attackers with knives went into the crowd. At least 12 suspects have been arrested. Caption London Bridge and nearby Borough Market were the site of chaos after a van plowed into pedestrians and attackers with knives went into the crowd. At least 12 suspects have been arrested. June 5, 2017 People attend a vigil at Potters Field Park in London to remember the victims of the attack on London Bridge and Borough Market. Hannah Mckay/Reuters Buy Photo Wait 1 second to continue.\n\nSure, Trump’s policies and rhetoric are incoherent and based on a tower of lies. Far worse, however, is his appalling character, which accelerates the erosion of democratic norms and social cohesion a diverse democracy requires. In instances like this, those who would lecture us on President Obama’s under-appreciation of America’s unique place in human history or proclaim that they simply had to vote for Trump because Hillary Clinton was some sort of monster are exposed as fools or hypocrites or both.\n\nThe London attacks bring out the best in Britain and in Western leaders on the European continent; it brings out the worst in Trump and his followers. The former protect the soul of Western civilization; the latter drive a stake through the animating ideas that make America special.", "authors": [], "publish_date": "2017-06-04", "source": "washingtonpost", "top_words": ["america", "travel", "trump", "tweets", "ban", "decency", "bridge", "trumps", "london", "mayor", "president", "embarrasses", "attack"], "summary": "People leave the scene of a terrorist attack on London Bridge in central London on June 3.\nThen he aimed to bolster his Muslim travel ban (which is not supposed to be a Muslim travel ban).\nThat’s because they used knives and a truck!”Speaking at a vigil at Potters Fields Park in London on June 5, London Mayor Sadiq Khan called the London Bridge attack \"cowardly,\" saying to the perpetrators, \"We will defeat you.\"\nCaption London Bridge and nearby Borough Market were the site of chaos after a van plowed into pedestrians and attackers with knives went into the crowd.\nJune 5, 2017 People attend a vigil at Potters Field Park in London to remember the victims of the attack on London Bridge and Borough Market."}