{"url": "https://www.washingtonpost.com/world/national-security/hawaii-plans-to-sue-to-block-new-trump-travel-ban/2017/03/07/ed589242-03a3-11e7-b9fa-ed727b644a0b_story.html", "id": "33", "title": "Hawaii plans to sue to block new Trump travel ban", "text": "The state of Hawaii will ask a federal judge to block President Trump’s revised executive order barring the issuance of new visas to citizens of six Muslim-majority countries, according to a court filing.\n\nThe action — which lawyers for the state hope to file Wednesday in Hawaii — would mark the first formal legal challenge to the order, which the president signed Monday. Hawaii also sued over Trump’s first travel ban, and lawyers for the state told a judge in a court filing that they want to resume that litigation to ask for a temporary restraining order on the new directive.\n\nDemocrats and civil liberties groups had asserted soon after Trump signed a revised executive order that more litigation was all but certain because — in their view — the measure was still a thinly veiled Muslim ban. But the new order was substantially different from the first, and there were no immediate new legal challenges.\n\n[Revised executive order bans travelers from six Muslim-majority countries from getting new visas]\n\nWashington Attorney General Bob Ferguson, who had successfully sued to freeze the first ban, said Monday that he needed more time to study the new one before deciding what to do next.\n\n“We’re reviewing it carefully, and still have concerns with the new order,” Ferguson said.\n\nThe new order reduces the list of affected countries from seven to six — removing Iraq while keeping Iran, Somalia, Sudan, Libya, Yemen and Syria. It explicitly exempts legal permanent residents and current visa holders, blocking only the issuance of new visas for citizens of the affected countries for 90 days. It also spells out a lengthy list of people who may be eligible for exceptions, including those previously admitted to the United States for “a continuous period of work, study, or other long-term activity”; those with “significant business or professional obligations”; and those seeking to visit or live with family.\n\nThe new order keeps intact a 120-day suspension of the refu­gee program, and it declares the United States will not accept more than 50,000 refugees in a year, down from the 110,000 cap set by the Obama administration.\n\nThe new order is scheduled to take effect March 16, which would be March 15 in Hawaii. Justice Department lawyers have indicated that the administration intends to enforce the measure on that date, as they consider the court-ordered freeze on the previous ban no longer applicable.\n\nHawaii, in a motion joined by Justice Department lawyers, asked to present arguments on its legal challenge to the new order on the morning of March 15 and to file briefs before that.\n\nThe Justice Department has asserted that there is “no imminent harm” from the imposition of the new ban, as visa applicants typically have to wait months. To win a temporary restraining order, Hawaii would have to prove there was an immediate need for it.\n\nIn the long run, the state probably would try to prove that the executive order violates the establishment clause of the First Amendment in that it intentionally discriminates against Muslims.\n\n(Jenny Starrs/The Washington Post)\n\nOn the campaign trail, Trump called for a “total and complete shutdown of Muslims entering the United States.” After the election, former New York mayor Rudolph Giuliani said: “So when [Trump] first announced it, he said, ‘Muslim ban.’ He called me up. He said, ‘Put a commission together. Show me the right way to do it legally.’ ” Those statements could be used as evidence against the administration.\n\nThe White House and U. S. officials have insisted that the executive order is necessary for national security reasons, and it is meant to target countries with terrorism problems — not a particular religious group.", "authors": [], "publish_date": "2017-03-07", "source": "washingtonpost", "top_words": ["executive", "travel", "hawaii", "trump", "lawyers", "plans", "ban", "state", "block", "united", "sue", "countries", "order", "legal"], "summary": "The state of Hawaii will ask a federal judge to block President Trump’s revised executive order barring the issuance of new visas to citizens of six Muslim-majority countries, according to a court filing.\nThe action — which lawyers for the state hope to file Wednesday in Hawaii — would mark the first formal legal challenge to the order, which the president signed Monday.\nDemocrats and civil liberties groups had asserted soon after Trump signed a revised executive order that more litigation was all but certain because — in their view — the measure was still a thinly veiled Muslim ban.\nThe new order is scheduled to take effect March 16, which would be March 15 in Hawaii.\nTo win a temporary restraining order, Hawaii would have to prove there was an immediate need for it."}