{"url": "https://www.washingtonpost.com/powerpost/new-opposition-emerges-as-trump-pushes-for-travel-ban/2017/06/04/5914e7fa-4973-11e7-a186-60c031eab644_story.html", "id": "39", "title": "In Twitter barrage, Trump ramps up push for ‘TRAVEL BAN!’ even as opposition hardens", "text": "President Trump unleashed a fresh barrage of criticism Monday against courts blocking the administration’s travel ban, calling for a fast-track Supreme Court hearing and urging the Justice Department to seek even tougher measures on who enters the United States.\n\nIn a series of tweets, Trump circled back on his push for the travel ban in the wake of Saturday’s terrorist attack in London — even as new opposition emerged from Republican and Democratic lawmakers.\n\nTrump also appeared again to disregard the potential legal problems linked to the term “travel ban.” Trump’s use of the phrase was cited by several U.S. district court judges in decisions to stop plans to virtually halt U.S. entry for citizens of six Muslim-majority nations.\n\n[Trump’s latest tweets could hurt effort to restore travel ban]\n\nThe Trump administration’s lawyers — as well as White House spokesman Sean Spicer and other top Trump aides — have argued that Trump’s previous appeals for a “Muslim ban” have no connection to the travel restrictions. The White House claims the rules are needed because of security gaps in the six countries cited.\n\nHow Trump’s travel ban broke from the normal executive order process\n\n\n\nBut Trump’s latest comments possibly undercut that stance by calling the revised order a “politically correct version” — leaving open suggestions that religion was an element of the original order.\n\n“The Justice Dept. should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C.,” Trump wrote, using initials to refer to the Supreme Court.\n\nMinutes earlier, he posted: “People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!”\n\nTrump also called on the Justice Department to seek an “expedited hearing of the watered down Travel Ban before the Supreme Court ,” and study options for a “much tougher version” in the meantime.\n\n“The Justice Dept. should ask for an expedited hearing of the watered down Travel Ban before the Supreme Court — & seek much tougher version!” Trump tweeted.\n\nBut it was Trump who put forward the revised travel ban provisions — dropping Iraq from the list and making other changes — after the original executive order was blocked by court challenges.\n\n[Trump’s London reaction: stoking fears and rekindling feuds]\n\n(Bastien Inzaurralde/The Washington Post)\n\nOn Sunday, several lawmakers suggested in TV interviews that Trump’s proposed ban is no longer necessary since the administration has had the time it claimed it needed to develop beefed-up vetting procedures to screen people coming to the United States.\n\n“It’s been four months since I said they needed four months to put that in place,” Sen. Roy Blunt (R-Mo.), a member of the Intelligence Committee, said on “Fox News Sunday.” “I think you can do that without a travel ban and hopefully we are.”\n\nSen. Mark R. Warner (Va.), the top Democrat on the panel, said Trump’s administration has had plenty of time at this point to examine how immigrants are let into the United States and make any improvements that are needed. “If the president wanted 90 days to re-examine how individuals from certain countries would enter the United States, he’s had more than 90 days,” Warner said on CBS’s “Face the Nation.”\n\nTrump argued repeatedly on the campaign trail and after his victory that a better system for screening immigrants is imperative to national security. He signed an executive order in mid-March to temporarily suspend the U.S. refugee program and block visas for citizens of Iran, Libya, Syria, Somalia, Sudan and Yemen. He promised to develop more-comprehensive screening that would render the temporary ban unnecessary once in place.\n\nTrump renewed his call for the ban Sunday in response to the Saturday attacks near London Bridge, which left seven dead and dozens injured. The president tweeted: “We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!”\n\nThe travel ban was to last only 90 days, purportedly to buy agencies time to explore new procedures. Federal judges in Maryland and Hawaii have since suspended the ban, and the U.S. Court of Appeals for the 4th Circuit agreed with the Maryland judge that the order was discriminatory.\n\nThe Justice Department interpreted the Hawaii court’s decision to mean federal agencies couldn’t work on new vetting procedures.\n\n“We have put our pens down,” acting U.S. Solicitor General Jeffrey B. Wall told the told the 4th Circuit last month, when questioned about work on new procedures during a separate hearing about the travel ban. Wall said the administration has “done nothing to review the vetting procedures for these countries.”\n\nTo get the travel ban reinstated, the Justice Department filed two emergency applications with the Supreme Court last week. If the court allows the development of new vetting procedures to go forward, that could start the clock on another 90 days for the administration to review vetting procedures. But that could also render a Supreme Court decision on the travel ban moot, since the court is not likely to hear that case before October.\n\nThat time frame has left some legal experts puzzled about the Trump administration’s intent.\n\n“The enhanced procedures would be in place by the beginning of October,” said Mark Tushnet, a law professor at Harvard University. “By that time, the travel ban would not be in effect.”\n\nAs more time goes by with no appearance of effort toward stronger vetting, it could undermine the administration’s legal justification for a temporary travel ban.\n\n“I think the travel ban is too broad, and that is why it’s been rejected by the courts,” Sen. Susan Collins (R-Maine) said Sunday on “Face the Nation.” “The president is right, however, that we need to do a better job of vetting individuals who are coming from war-torn countries into our nation … but I do believe that the very broad ban that he has proposed is not the right way to go.”\n\nRead more at PowerPost", "authors": [], "publish_date": "2017-06-04", "source": "washingtonpost", "top_words": ["travel", "hardens", "trump", "ban", "supreme", "justice", "vetting", "ramps", "court", "twitter", "trumps", "push", "procedures", "opposition", "order", "barrage"], "summary": "In a series of tweets, Trump circled back on his push for the travel ban in the wake of Saturday’s terrorist attack in London — even as new opposition emerged from Republican and Democratic lawmakers.\nshould ask for an expedited hearing of the watered down Travel Ban before the Supreme Court — & seek much tougher version!” Trump tweeted.\nWe need the Travel Ban as an extra level of safety!”The travel ban was to last only 90 days, purportedly to buy agencies time to explore new procedures.\nBut that could also render a Supreme Court decision on the travel ban moot, since the court is not likely to hear that case before October.\n“By that time, the travel ban would not be in effect.”As more time goes by with no appearance of effort toward stronger vetting, it could undermine the administration’s legal justification for a temporary travel ban."}