{"url": "https://www.washingtonpost.com/news/monkey-cage/wp/2017/02/07/trumps-immigration-order-requires-bureaucrats-to-figure-out-who-is-christian-thats-not-easy/", "id": "353", "title": "Trump’s immigration order means bureaucrats have to decide who’s a “real” Christian", "text": "\n\nPeople protest President Trump’s travel ban order at Washington Dulles International Airport on Jan. 28. (Yeganeh Torbati/Reuters)\n\nPresident Trump’s executive order on immigration has a clause that is supposed to protect religious minorities. Trump has made clear he has in mind primarily Christians from the Middle East. If implemented, individuals who can show evidence of being persecuted as Christian will qualify for a fast lane into the United States.\n\nIt would also mean that immigration officials would have to hone their theological skills — because they will be in charge of determining who belongs to what religion. Many commentators have noted the constitutional problems with administering a “religious test.” But the practical and theological problems are equally daunting.\n\nWould U.S. definitions for “real” membership in each religion violate the Establishment Clause?\n\nThe order says that the United States will “prioritize refugee claims made by individuals on the basis of religious-based persecution, provided that the religion of the individual is a minority religion in the individual’s country of nationality.”\n\n[Unlike all previous U.S. presidents, Trump almost never mentions democratic ideals]\n\nIn practice, this means that every immigration officer must know how to tell if the person before them is a Christian or a member of another minority religious community — or is merely claiming to escape persecution for other reasons. The Department of Homeland Security will have to issue guidelines to standardize decisions.\n\nTo effect this, the government will have to come up with definitive answers to long-standing religious questions. For instance, what is the religion of the child of a Muslim father and Jewish mother, since Islam is inherited through the father and Judaism through the mother? Does baptism make one a Christian, as some believe, or does it also require good works and faith in Jesus, as others maintain? Who decides whether a person truly belongs to a particular religion: the individual or the institution? Is Shiism in Saudi Arabia a minority religion — or is it, as the Saudi government maintains, a deviant sect of Sunni orthodoxy? What about those who claim a religion but do not pay the fees or adhere to the guidance of its central institutions? What about religions without centralized institutions?\n\n[How low can Donald Trump’s approval rating go?]\n\nHouse Speaker Paul D. Ryan (R-Wis.) has sought to reassure donors that the executive order does not impose a “religious test.” But there’s no avoiding it: The bureaucratization of religious categories cannot happen otherwise. As Ken Meier and George Krause note, bureaucracies need “a division of labor, career personnel with specialized training and expertise . . . and explicit rules and procedures.” Immigration authorities need to know the boundaries of each religion so they can decide who’s in and who’s out.\n\nThe government will also get involved in religious hierarchies and their disputes. Under most interpretations of the halacha, or Jewish law, the child of a Jewish mother and non-Jewish father is Jewish. If the same child is a practicing Yemeni Muslim, it doesn’t matter for Jewish law: She is Jewish. But what will the U.S. authorities do? Will they submit to the halacha or lean toward a Protestant-friendly, practice-based test, declaring that because the child practices Islam she’s a Muslim and thus not a minority? Will they ask the child about her practices? If so, which ones? Will the questions be limited to doctrine, with the limitations this entails, or include other aspects of religious experience that may be difficult for overworked bureaucrats to categorize — such as the encounters with the transcendent described by Robert Orsi as “the breaking-in of the gods?”\n\n[This is what we learned by counting the women’s marches]\n\nWhatever position the government takes will have significant implications for contending interpretations of these traditions. The government will inevitably endorse one or more interpretation among religious traditions. This would seem to violate the First Amendment’s establishment clause, which says, “Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof.”\n\nThe United Kingdom and United Nations are already wrestling with this issue\n\nThe U.K. already faces this conundrum. Religious persecution is one of its asylum categories. Putting that into practice has not been entirely smooth. Baroness Elizabeth Berridge explained that it requires some “incredibly nuanced and difficult decisions to make sure that genuine claims are accepted and non-genuine ones are rejected.”\n\nThe Guardian reported that refugee applicants were being quizzed on “Bible trivia” to test whether they had indeed converted to Christianity, as they claimed. To administer these tests and interpret the answers, immigration officials asked for greater religious literacy training, which the government is deciding whether to offer.\n\n[Will the protests continue? Here’s why they almost certainly will]\n\nThe United Nations is also struggling to define “religion.” Helge Arsheim observes that the High Commissioner for Human Rights is frequently asked to defend religious freedom and condemn religious defamation — but it has never devised a legally meaningful way to distinguish one religion from another or to separate religious issues in general from other social concerns. Instead, Arsheim writes, when it comes to religion, the United Nations has settled on “vague, general notions of harmony, peace, understanding, and dialogue.”\n\nHere’s what could come of a U.S.-backed religious test\n\nFor the government to decide who belongs to which religious group and which group gets special privileges can be dangerous — and in the United States, unconstitutional. Religion cannot be coherently defined for the purposes of U.S. law and governance because Americans have different definitions of religion. Official attempts to define religion can also heighten social tension. The government ends up dividing religions by law, empowering some and leaving others outside. This favors forms of religion authorized by those in positions of power and downgrades other ways of being and belonging.\n\nUnder the new order, government officials will have the authority to declare who counts as Christian, Muslim or atheist. Universities will be pressed to accept Homeland Security officers on fellowships to learn how to verify who is authentically Muslim or Christian. The Trump administration may centralize these tasks in a federal Office of Religious Authentication.\n\n[What 4 types of American nationalism can tell us about Trump voters]\n\nOf course, government will always be entangled with religion. As historian Faisal Devji notes, “the nation-state is inescapable when it comes to matters of establishing and governing matters within and between religious communities.” Scholars will continue to debate the proper terms of religion-state relations in the United States and elsewhere. These debates will not be resolved easily, nor should they be.\n\nBut when the United States was founded, one of the strongest arguments in favor of disestablishment was that the federal government should not have the authority to determine who is or is not authentically religious. If President Trump wants to move away from this tradition, he will find much of the weight of the Constitution, and U.S. history, pushing back against him.\n\nElizabeth Shakman Hurd is professor of political science at Northwestern University and the author of “Beyond Religious Freedom: The New Global Politics of Religion” (Princeton, 2015) and “The Politics of Secularism in International Relations.” (Princeton, 2008).", "authors": [], "publish_date": "2017-02-07", "source": "washingtonpost", "top_words": ["means", "trump", "real", "immigration", "united", "law", "trumps", "religious", "religion", "bureaucrats", "decide", "order", "muslim", "christian", "jewish", "whos"], "summary": "(Yeganeh Torbati/Reuters)President Trump’s executive order on immigration has a clause that is supposed to protect religious minorities.\nand explicit rules and procedures.” Immigration authorities need to know the boundaries of each religion so they can decide who’s in and who’s out.\nUnder most interpretations of the halacha, or Jewish law, the child of a Jewish mother and non-Jewish father is Jewish.\nIf the same child is a practicing Yemeni Muslim, it doesn’t matter for Jewish law: She is Jewish.\nUnder the new order, government officials will have the authority to declare who counts as Christian, Muslim or atheist."}