{"url": "https://www.washingtonpost.com/news/josh-rogin/wp/2017/01/30/state-department-dissent-memo-we-are-better-than-this-ban/", "id": "323", "title": "State Department dissent memo: ‘We are better than this ban’", "text": "\n\nThe State Department building. (Joshua Roberts/Reuters)\n\nDozens of State Department officials are expected to sign a memo opposing President Trump’s executive order suspending immigration from seven majority-Muslim countries, activating the famous “Dissent Channel,” which diplomats have used for decades, to oppose what they see as wrongheaded policies put forth by the Trump White House.\n\n“A policy which closes our doors to over 200 million legitimate travelers in the hopes of preventing a small number of travelers who intend to harm Americans from using the visa system to enter the United States will not achieve its aim of making our country safer,” reads a draft of the Dissent Channel memo, which I obtained. “Moreover, such a policy runs counter to core American values of nondiscrimination, fair play, and extending a warm welcome to foreign visitors and immigrants.”\n\n[Trump’s half-baked travel ban is a picture of American shame]\n\nThe memo focuses on Section 3 of the executive order Trump signed Jan. 27, which temporarily suspends the issuance of visas and other immigration benefits for citizens from Iraq, Iran, Libya, Somalia, Sudan, Syria and Yemen. As of Monday morning, edits and signatures were still being collected in advance of submitting the memo to State Department leadership.\n\nThe memo argues that the executive order is poorly conceived and poorly drafted and that its implementation will damage U.S. relationships with Muslim countries, U.S. standing in the Muslim world and the U.S. fight against terrorism and radicalization both at home and abroad. The diplomats point out that “a vanishingly small number” of terrorist attacks on U.S. soil have been committed by terrorists coming from abroad on a visa, and in those cases, they came from countries not covered by the executive order.\n\nWhile the order will have little or no benefit to American security, it will have negative effects, the diplomats argue. Soured relations with the Muslim world will harm cooperation with allied countries in the fight against terrorism. The ill will created by the moves will alienate citizens in these countries and fuel radicalization of their mostly younger populations.\n\nIn addition to the harmful effects to the fight against terrorism, the executive order also undermines America’s moral leadership in the world, the dissent memo states.\n\nHundreds of protesters gathered at the arrivals gate of Washington Dulles International Airport to push back against President Trump's executive order that targeted citizens from seven predominantly Muslim countries. A federal judge in New York blocked deportations nationwide late Saturday of those detained on entry to the United States. (McKenna Ewen/The Washington Post)\n\n“We are better than this ban,” the memo states. “Looking beyond its effectiveness, this ban stands in opposition to the core American and constitutional values that we, as federal employees, took an oath to uphold.”\n\nThe memo argues that as a nation of immigrants, the United States has a special obligation to ensure an immigration system that is as free as possible from religious tests, discrimination or stereotypes. The diplomats refer back to dark times in American history when nationality was a litmus test for immigration and certain citizens, such as Japanese Americans during World War II, were subjected to discrimination and mistreatment.\n\n“Decades from now, we will look back and realize we made the same mistakes our predecessors: shutting borders in a knee-jerk reaction instead of setting up systems of checks that protect our interests and our values,” the memo states.\n\n[Trump’s refugee ban could get much, much worse. That’s why it must be stopped — now.]\n\nThe memo suggests alternative methods for improving visa and immigration screening, including through expanded interagency cooperation and increased vetting procedures not based on nationality alone.\n\nThe Dissent Channel was created in 1971 during the controversies surrounding the Vietnam War. State Department regulations stipulate that all Dissent Channel messages must be conveyed to all the top leaders of the State Department, including the secretary of state, who must formally respond. Last year, more than 50 officials signed a Dissent Chanel memo opposing the U.S. policy in Syria.\n\nThe diplomats signing the Dissent Channel memo are taking a risk by putting their names to their opposition to a White House that has been openly hostile to the foreign policy establishment in Washington and suspicious of government employees in federal agencies.\n\n“Freedom from reprisal for Dissent Channel users is strictly enforced,” the regulations state. “Officers or employees found to have engaged in retaliation or reprisal against Dissent Channel users … will be subject to disciplinary action.”\n\nBut many in the State Department want to be on record expressing their disagreement with the Trump White House’s actions. Several told me they felt they had no choice but to stand on principle.\n\n“This dissent cable illustrates a widespread sense of outrage and alarm throughout the building,” one State Department official said. “Most State Department career staff signed up for these jobs with a sense of duty and pride in America on the world stage. One role is to uphold and represent American values and strategic interests on the world stage. This executive order is contrary to that mission.”\n\nThis is not the end of their activity either; I’m told more Dissent Channel memos are in the works and are expected to receive widespread support.", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["executive", "channel", "world", "ban", "state", "better", "memo", "american", "countries", "order", "department", "dissent"], "summary": "The State Department building.\nAs of Monday morning, edits and signatures were still being collected in advance of submitting the memo to State Department leadership.\nState Department regulations stipulate that all Dissent Channel messages must be conveyed to all the top leaders of the State Department, including the secretary of state, who must formally respond.\n“This dissent cable illustrates a widespread sense of outrage and alarm throughout the building,” one State Department official said.\n“Most State Department career staff signed up for these jobs with a sense of duty and pride in America on the world stage."}