{"url": "https://www.washingtonpost.com/news/global-opinions/wp/2017/03/27/were-not-a-part-of-somalia-mr-trump-and-we-dont-belong-in-your-ban/", "id": "360", "title": "We’re not a part of Somalia, Mr. Trump — and don’t belong in your ban", "text": "\n\nPort manager Ali Omer at Berbera port in Somaliland. (Paul Schemm for The Washington Post)\n\nSaad Ali Shire is the minister of foreign affairs and international cooperation for the Republic of Somaliland.\n\nAmid the discourse, debate and dissent over President Trump’s emerging foreign-policy agenda, there is one thing on which most would agree: The new administration will not be bound by conventional wisdom. Such a path has both peril and promise, but for the Republic of Somaliland, challenging diplomatic conventions has been a mainstay as we have pursued recognition as an independent, sovereign and rightful member of the international community. The executive order suspending travel from six countries, including Somalia, to the United States brings light to our enduring cause yet also poses threats to our progress.\n\nBy most measures, Somaliland is an independent nation — according to the Economist, it “ticks almost all the boxes of statehood” — albeit one with a complicated history. A former British protectorate, Somaliland achieved full independence from Britain in 1960 and subsequently united with Somalia, thereby creating the Somali Republic. In 1991, at the height of a chaotic and bloody civil war in Somalia, the Republic of Somaliland reclaimed its independence, and has since enjoyed self-governance and freedom.\n\nWith the collapse of Somalia’s governing institutions, civil unrest and terrorist attacks dominated global attention over the years, requiring vast resources from the United States and other nations. Somaliland focused on building strong state institutions, maintaining peace within our borders and creating a sustainable economy with comparatively minuscule foreign assistance.\n\nThrough these efforts, Somaliland has remained at peace and serves as a model for others. Our government mints its own currency and issues its own passports, our military and police are firmly in control of our territory, and our private sector produces modest but respectable economic growth. We have held numerous elections and will elect a new president later this year. We are a reliable partner to the United States and the paragon of a Muslim-majority country that celebrates democracy. Yet without acknowledgment that these conditions in no way resemble those plaguing Somalia, the Trump administration’s travel ban will prevent our citizens from entering the United States.\n\nThis dilemma typifies the precariousness of Somaliland’s unresolved legal status. Our citizens are subjected to restrictions imposed on Somalia, which regrettably remains a haven for terrorist organizations. In contrast, there have been no acts of terrorism in Somaliland since 2008. From our capital, Hargeisa, Mogadishu seems a million miles away, yet its circumstances and other nations’ policies affect our daily lives.\n\nRelieving Somaliland of these unjust impediments to our progress would benefit not just our nation, but also the United States. Greater international recognition of Somaliland, led by the United States, would incentivize better governance and economic self-reliance elsewhere in sub-Saharan Africa, as well as positively contribute to global security. Ironically, at the recent meeting in Washington of the Global Coalition to Counter ISIS, Somalia’s representative had a seat at the table but Somaliland’s voice was absent. This was a missed opportunity, as Somaliland’s stability and success in curbing the threat of violent extremism should be a strategic asset of the coalition.\n\nRegrettably, the travel ban’s most harmful and lasting consequence will be the disruption of ties between our citizens. If the ban survives, Somaliland residents will not be able to travel to the United States to visit family, pursue educational advancement or strengthen commercial ties between our two nations. In particular, dozens of our students are realizing their dreams of educational advancement in elite American universities today. As our young people come from a region that can benefit tremendously from skilled engineers, doctors and administrators, the opportunity to study in the United States provides them with the knowledge and training necessary to serve their communities upon their return. Presently, nearly 100 students from Somaliland are attending Harvard, Yale, Brown, Columbia, the Massachusetts Institute of Technology, Amherst, Swarthmore and other distinguished colleges, many having graduated from the Abaarso School, a remarkable institution founded by an American who urges these young people to serve as ambassadors between our two nations. Yet these students cannot go home if they wish to return to the United States and finish their studies. And Somalilanders who have defied overwhelming odds and have college acceptance letters in hand will not be able to matriculate without some relief from the travel ban. This month, Canada’s Globe and Mail reported on the case of Shukri Ali, a Somaliland student accepted to Wellesley College. “I feel lucky that I’ve been accepted,” Ali said. “But I am also sad that I might not be able to start my college education this year.”\n\nTo address these challenges, my government is seeking an exemption from the executive order and is encouraging the United States to take steps toward the recognition of Somaliland as an independent member of the international community. Upending the conventional wisdom in this way would allow Trump to turn an unintended consequence into an opportunity and acknowledge that in the eyes of the United States, sovereignty is conferred — and partnerships are forged — through sustained democratic governance, the promotion of economic opportunities, and an enduring commitment to peace and security.", "authors": [], "publish_date": "2017-03-27", "source": "washingtonpost", "top_words": ["travel", "international", "trump", "ban", "dont", "somalia", "belong", "united", "nations", "ali", "republic", "states", "students", "mr", "somaliland"], "summary": "The executive order suspending travel from six countries, including Somalia, to the United States brings light to our enduring cause yet also poses threats to our progress.\nWe are a reliable partner to the United States and the paragon of a Muslim-majority country that celebrates democracy.\nYet without acknowledgment that these conditions in no way resemble those plaguing Somalia, the Trump administration’s travel ban will prevent our citizens from entering the United States.\nRelieving Somaliland of these unjust impediments to our progress would benefit not just our nation, but also the United States.\nYet these students cannot go home if they wish to return to the United States and finish their studies."}