{"url": "https://www.washingtonpost.com/news/democracy-post/wp/2017/03/16/the-libyan-student-who-sued-trump-and-won/", "id": "313", "title": "The Libyan student who sued Trump — and won", "text": "\n\nLibyan student Zakaria Hagig, center, poses in front of the Colorado state capitol with attorneys Alan Kennedy-Shaffer, left, and Morgan Carroll. (Courtesy of Alan Kennedy-Shaffer)\n\nWhen Zakaria Hagig decided to leave his war-torn homeland for college in Colorado, he never dreamed that he’d one day be suing the president of the United States. But when President Trump issued his Jan. 27 executive order banning citizens of seven Muslim-majority countries from traveling to the United States, Hagig realized that he had to act. “I never thought that such a thing would happen,” he told me. “For a long time all I knew about the U.S. was that they have freedom of religion, freedom of belief. Was this really the U.S. that they’d told me about?”\n\nThe revised version of Trump’s executive order was supposed to take effect Thursday — stripped of some of its worst excesses, but still sufficiently problematic for it to be blocked yet again by the federal courts. The credit for that goes to the many Americans who pushed back against the original ban, from the demonstrators who flooded into airports in support of those affected to the federal judges who issued formal challenges to Trump’s order. But the 24-year-old Hagig has also played his part — a particularly remarkable one, considering that he hails from Libya, one of the countries targeted by the ban.\n\nFor a few years after the fall of dictator Moammar Gaddafi, Hagig kept plugging away with his studies in computer science at a local university. But by 2014, as the civil war that followed Gaddafi’s removal was entering its third year, Hagig began to lose heart. His father, an engineer, had studied overseas abroad earlier, and the family decided that it was time for Hagig to try his luck elsewhere. Having enrolled in an English-language-study program in Denver, he applied for a U.S. student visa at an American consulate in Europe during a visit there. (The United States hasn’t issued visas in Libya for several years now because of the ongoing war.)\n\nSo that was how, equipped with a student visa, Hagig arrived in Colorado in summer 2014. After finishing his English course, he enrolled in the business program at the Community College of Denver. His plan was to complete his degree there, then move on to further study at a four-year college.\n\nBut then his dreams ran afoul of the presidential travel ban. Hagig was bewildered. According to Trump’s executive order, Hagig — despite holding a perfectly valid student visa — wouldn’t be able to return home to visit his family during the period covered by the ban without the risk of being blocked from returning. He was lucky enough to be in Colorado when the ban took effect, but he was aware that many other visa holders from the seven targeted countries would be stranded in their homelands for the period it covered.\n\nThat was when one of his American friends and neighbors, an attorney and PhD candidate, Alan Kennedy-Shaffer, decided to lend a hand. “He and I hadn’t talked about immigration issues until the executive order came out,” said Kennedy-Shaffer. “The order frightened the entire community here in Colorado.”\n\nAs he and Hagig discussed the issue, they realized that many of the foreigners living in the area were understandably reluctant to mount a court challenge to the president. “I spoke with Alan, and he told me about my right,” said Hagig. “I decided to take the step not just for myself but for other people affected by the order” — above all, he said, the thousands of foreign students included in its scope. “I personally know people who tried to travel back to their home countries because they were afraid. And people who were already traveling got stuck in the airport. Some people lost weeks in school, some even lost their educations.”\n\nOn Jan. 31, Kennedy-Shaffer and a former Colorado state senator, Morgan Carroll, filed Civil Action No. 1:17-cv-289 on Hagig’s behalf against Trump and several federal agencies in U.S. District Court in Denver. Their argument: The travel ban violated fundamental constitutional principles (specifically, Hagig’s rights to due process and freedom from religious discrimination). And yes, they did the work pro bono, so Hagig didn’t have to pay a cent.\n\nHow did it feel to take on the world’s most powerful man in a high-profile case? “It was a hard feeling, I’m not going to lie,” Hagig recalled (in his impeccable American English). “But when I looked at the bigger picture, that made me feel more comfortable.” Support from his family and friends helped a lot, he said; so, too, did the images of American protesters fighting back. But above all he was driven by the conviction that big issues were at stake. “We were trying so hard to prove that no one’s above the law, and that human rights are truly universal,” he said.\n\nThen came a series of legal decisions by the federal courts blocking the travel ban on a variety of legal grounds. The White House was forced to go back to the drawing board, finally issuing a new version of the ban that exempted visa holders like Hagig (as well as green-card holders and dual citizens) from its strictures. The Justice Department filed an official response to the lawsuit informing Hagig that he would no longer be affected by the new executive order (which still imposes travel restrictions on visitors from six of the original countries, with the exception of Iraq).\n\nHandling the publicity from the case, which was been widely covered in Colorado (less so nationally), has involved a delicate balancing act for Hagig. Libya, where armed militias still range freely, is a volatile place, and Hagig has worked hard to keep his personal details private to prevent potential retaliation against his family. He recalls seeing comments by Libyan Facebook users who, he said, worried “about the repercussions of suing the president of the United States. ‘Why are you suing the president?’ they said. ‘You’ll get deported. You’ll get kicked out.’”\n\nNeedless to say, the fact that none of that has happened confirms Hagig’s faith in American principles. “It feels amazing. It feels like we do have a voice. When there’s something wrong we can fight to get our rights back. The law is the law. It’s an amazing feeling that our voice was heard.”\n\nNow he’s keen to continue his education, working his way toward a business degree that he can one day put to good use back in his native country. In the meantime, there might be a thing or two that some jaded Americans could learn from his example. In the eyes of this Libyan, our institutions, it turns out, are entirely worth fighting for.", "authors": [], "publish_date": "2017-03-16", "source": "washingtonpost", "top_words": ["executive", "won", "colorado", "travel", "trump", "sued", "libyan", "ban", "countries", "hagig", "student", "order", "president", "american", "visa"], "summary": "Libyan student Zakaria Hagig, center, poses in front of the Colorado state capitol with attorneys Alan Kennedy-Shaffer, left, and Morgan Carroll.\nSo that was how, equipped with a student visa, Hagig arrived in Colorado in summer 2014.\n“He and I hadn’t talked about immigration issues until the executive order came out,” said Kennedy-Shaffer.\nTheir argument: The travel ban violated fundamental constitutional principles (specifically, Hagig’s rights to due process and freedom from religious discrimination).\nThen came a series of legal decisions by the federal courts blocking the travel ban on a variety of legal grounds."}