{"url": "https://www.washingtonpost.com/news/worldviews/wp/2017/03/14/canadas-girl-guides-were-irked-by-trumps-travel-bans-so-they-decided-to-snub-america/", "id": "307", "title": "Canada’s Girl Guides were irked by Trump’s travel bans. So they decided to snub America.", "text": "\n\nCanadian and American flags from the U.S. side of the border in Pittsburg, N.H. (Don Emmert/AFP)\n\nCanada’s Girl Guides have added a nation to the places they fear to tread. And it’s right next door.\n\nThe organization has called off all trips to the United States until further notice, citing a “commitment to inclusivity” in what is widely interpreted as a stand against the Trump administration’s effort to restore a travel ban against six Muslim-majority countries.\n\nThe Guides — the Canadian counterparts of the Girl Scouts — did not specifically mention the U.S. travel restrictions, which are set to take effect Thursday unless blocked again by various court challenges. But there was little doubt that the White House moves were behind the decision by the 70,000-member Girl Guides.\n\nIn a statement late Monday, the group said the “ability of all our members to equally enter this country is currently uncertain” — suggesting that Muslim or foreign-born members might face difficulties at U.S. airports and border crossings.\n\n[The full statement from the Girl Guides]\n\nUnder the new ban, all nationals from Syria, Iran, Libya, Somalia, Sudan and Yemen would be blocked from obtaining visas to enter the United States for at least the next 90 days. Officials have said green-card holders or others with valid visas from the six nations can enter.\n\nThe Girl Guides is not the first group to reassess U.S. travel plans or business interactions because of the attempts by the White House to tighten travel rules and immigration controls. Many Mexican shoppers have heeded calls to boycott U.S. border towns, where the local economy often depends heavily on Mexican consumers.\n\nBut the decision by the Guides carries an extra sting because of the 107-year-old group’s size and wholesome image.\n\nThe girl guides have more integrity & leadership than the entire Republican Party, plus they have cookies. https://t.co/AmKDos6McS — Andrew Tumilty (@AndrewTumilty) March 14, 2017\n\nThe group had planned a summer camping trip to California. That is now off the table, and so are other trips — and even transit at U.S. airports.\n\n“We know our members value the safe, inclusive and accepting space that Guiding provides,” the group's statement added.\n\n“These values are reflected in all we do, including the Girl Guide travel experiences we offer girls and women. This was a very difficult decision to make,” it continued. “We hope that members will appreciate this reflects our commitment to inclusivity and equal opportunities for all girls and women.”\n\nGuides spokeswoman Sarah Kiriliuks told the Associated Press that she is unaware of any members being turned away by U.S. officials, but “we just want to make sure that no girl gets left behind.”\n\nMeanwhile, Canadian Prime Minister Justin Trudeau planned to visit New York on Wednesday for a Broadway performance celebrating his country's hospitality in a time of crisis. “Come From Away” tells the story of how Newfoundland hosted thousands of passengers — including many Americans — diverted from U.S. airports after the Sept. 11, 2001, attacks.", "authors": [], "publish_date": "2017-03-14", "source": "washingtonpost", "top_words": ["girl", "america", "travel", "canadas", "guides", "irked", "canadian", "statement", "members", "trumps", "group", "border", "decided", "bans", "white", "decision", "snub"], "summary": "Canadian and American flags from the U.S. side of the border in Pittsburg, N.H. (Don Emmert/AFP)Canada’s Girl Guides have added a nation to the places they fear to tread.\nBut there was little doubt that the White House moves were behind the decision by the 70,000-member Girl Guides.\nThe Girl Guides is not the first group to reassess U.S. travel plans or business interactions because of the attempts by the White House to tighten travel rules and immigration controls.\nThe girl guides have more integrity & leadership than the entire Republican Party, plus they have cookies.\n“These values are reflected in all we do, including the Girl Guide travel experiences we offer girls and women."}