{"url": "https://www.washingtonpost.com/blogs/erik-wemple/wp/2017/01/31/sean-spicer-now-blaming-media-for-president-trump-tweet/", "id": "344", "title": "Sean Spicer now blaming media for President Trump tweet", "text": "During the White House daily briefing on Jan. 31, NBC's Kristen Welker asked press secretary Sean Spicer why the administration is lashing out against calling President Trump's executive order on immigration a \"travel ban,\" when that's in fact what the president is calling it on Twitter. (Reuters)\n\nOver and over again, President Trump has blasted major media organizations as “disgusting,” “dishonest” and, quite commonly, “failing.” If so, they’re failing their way right into his head.\n\nThe influence of the mainstream media on Trump arose this afternoon at a White House press briefing under the leadership of press secretary Sean Spicer. In the course of the proceedings, Spicer fielded a question about the last week’s executive order temporarily barring entry into the United States of citizens from seven Muslim-majority countries. “He’s also made clear that it’s not a Muslim ban, it’s not a travel ban. It’s a vetting system to keep America safe,” said Spicer. To repeat: Not a a ban!\n\nMeanwhile: Trump loyalist Rudy Giuliani, in a television interview, elaborated on the provenance of this non-ban: “So when [Trump] first announced it, he said, ‘Muslim ban.’ He called me up. He said, ‘Put a commission together. Show me the right way to do it legally,'” Giuliani said on Fox News.\n\nIf the ban were announced with a one week notice, the \"bad\" would rush into our country during that week. A lot of bad \"dudes\" out there! — Donald J. Trump (@realDonaldTrump) January 30, 2017\n\nFollowing up on Spicer’s protestations about the word “ban,” NBC News White House Correspondent Kristen Welker noted the tweet above: “He says it’s a ban.”\n\nAlluding to the wonderful symbiosis and spirit of cooperation between the White House and its press corps, Spicer responded, “He’s using the words that the media’s using,” said Spicer in a tribute to the overwhelming power of the modern media. “But at the end of the day … it can’t be a ban if you’re letting a million people in.”\n\nWelker wasn’t going to accept that tripe. So she pointedly noted that the president had called it a ban. “Is he confused or are you confused?” she asked.\n\n“No, I’m not confused. I think that the words being used to describe it are derived from what the media is calling this. He has been very clear, it is ‘extreme vetting.'” Except for that tweet, which has been retweeted nearly 34,000 times and liked nearly 160,000 times.\n\nPerhaps Welker’s remarkable moment of accountability journalism can set to rest all that silly talk that the media shouldn’t pay much heed to Trump’s tweets. Or maybe media organizations should check with Spicer & Co. before characterizing Trump administration initiatives to avoid overly influencing the president of the United States. Because we don’t want to mess up their messaging.", "authors": [], "publish_date": "2017-01-31", "source": "washingtonpost", "top_words": ["spicer", "trump", "ban", "sean", "confused", "blaming", "house", "calling", "press", "media", "president", "white"], "summary": "During the White House daily briefing on Jan. 31, NBC's Kristen Welker asked press secretary Sean Spicer why the administration is lashing out against calling President Trump's executive order on immigration a \"travel ban,\" when that's in fact what the president is calling it on Twitter.\n(Reuters)Over and over again, President Trump has blasted major media organizations as “disgusting,” “dishonest” and, quite commonly, “failing.” If so, they’re failing their way right into his head.\nThe influence of the mainstream media on Trump arose this afternoon at a White House press briefing under the leadership of press secretary Sean Spicer.\nI think that the words being used to describe it are derived from what the media is calling this.\nOr maybe media organizations should check with Spicer & Co. before characterizing Trump administration initiatives to avoid overly influencing the president of the United States."}