{"url": "https://www.washingtonpost.com/powerpost/mcconnell-we-dont-have-religious-tests-in-this-country/2017/01/29/03215604-e630-11e6-b82f-687d6e6a3e7c_story.html", "id": "335", "title": "McConnell: We don’t have religious tests in this country", "text": "Several top Senate Republicans raised concerns Sunday that President Trump’s order to halt the admission of refugees and citizens of seven Muslim-majority countries had not been properly vetted and could harm the relationship between the United States and key allies.\n\n[Trump signs order temporarily halting admission of refugees, promises priority for Christians]\n\nThe senators generally said they support the decision to increase standards for vetting refugees and other people traveling to the United States, but their remarks added to the growing chorus of criticism of Trump’s order.\n\nSenate Majority Leader Mitch McConnell (R-Ky.) cautioned that the United States does not have a religious test for entry into the country, though he stopped short of rejecting the order in its entirety. McConnell said that Muslims, both in the United States and abroad, are key allies in the fight against terrorism and urged caution in regard to Trump’s plan to implement “extreme vetting” for refugees from countries where a majority of the citizens are Muslim.\n\n“I don’t want to criticize them for improving vetting,” McConnell said on ABC’s “This Week.” “I think we need to be careful. We don’t have religious tests in this country.”\n\n(Bastien Inzaurralde/The Washington Post)\n\nThe comments came after a day of silence from McConnell on the issue. He did not offer any reaction in the early hours when the order caused mass chaos and outrage as Muslims were turned away at airports across the country. Republican leaders are facing intense criticism for backing the measure, which has been interpreted by some Democrats, human rights leaders and activists as effectively a ban on Muslims.\n\nMcConnell is one of a growing number of Republicans who have urged caution in implementing the order to block citizens from Iran, Iraq, Syria, Yemen, Sudan, Somalia and Libya from entering the country for at least 90 days. On Sunday, he left it to the judiciary to decide its legality.\n\n“Ultimately it is going to be decided in the courts as to whether or not this has gone too far,” McConnell said.\n\nMcConnell is among those who strongly opposed the concept of a Muslim ban when Trump touted the idea during the campaign. His decision to back the order, at least in part, is generally in line with that of House Speaker Paul D. Ryan (R-Wis.) who announced his support Friday. However, Ryan did not share McConnell’s broader concerns in his statement.\n\nRyan said that while he supports the refu­gee resettlement program, he thinks it is time to “reevaluate and strengthen the visa vetting process.”\n\n“President Trump is right to make sure we are doing everything possible to know exactly who is entering our country,” the speaker said in a statement.\n\nA growing number of other prominent Republicans have raised serious concerns about the decision to ban people traveling from the seven countries listed in the order.\n\n[WHIP COUNT: Here’s where Republicans stand on Trump’s controversial travel ban]\n\nSen. Rob Portman (R-Ohio), a top Republican on the Senate Committee on Homeland Security, also stopped short of criticizing the order, but he suggested that the action wasn’t fully thought through by the Trump administration.\n\n“You have an extreme vetting proposal that didn’t get the vetting it should have,” Portman said Sunday on CNN’s “State of the Union.”\n\nPortman said that he supports the rulings by several federal judges staying the part of the order that affects legal permanent residents and visa holders and prevents them from entering the country.\n\n“I think that’s appropriate,” Portman said of the judicial orders. “And let’s allow those people who have come here legally in this country to get out of detention — allow them to go to the Cleveland Clinic, for instance, as this doctor was banned from doing so.”\n\nConcerns that the order was not properly reviewed were shared by Senate Armed Services Committee Chairman John McCain (R-Ariz.), who called the process “confused.”\n\n“The good news is that its only got to do with a pause,” McCain said on CBS’s “Face the Nation. “The bad news is obviously this process and these conclusions were not vetted.”\n\nMcCain said he worries that the order could bar Iraqi soldiers who are working with the United States from entering the country and that the chaos could become part of marketing efforts for ISIS and other terrorist organizations.\n\n“I think the effect will probably in some areas give ISIS some more propaganda,”McCain said, using an alternative acronym for the Islamic State. “I’m very concerned about our effect on the Iraqis right now.”\n\nMcConnell, McCain and Portman joined several other Senate Republicans who expressed concerns on Saturday.\n\n[Facing intense criticism, some Republicans are speaking out against Trump’s refugee ban. Paul Ryan and Mitch McConnell aren’t among them.]\n\nSen Jeff Flake (R-Ariz.) voiced some of the most vociferous objections to the order in a Saturday evening post on the blogging site Medium. Flake, a longtime opponent of the Muslim ban proposed by Trump, said the administration is right to be concerned about national security but said the measure too broadly blocks those who have already been vetted.\n\n“It’s unacceptable when even legal permanent residents are being detained or turned away at airports and ports of entry,” Flake said in his post. “Enhancing long-term national security requires that we have a clear-eyed view of radical Islamic terrorism without ascribing radical Islamic terrorist views to all Muslims.”\n\nSen. Ben Sasse (R-Neb.) also supported Trump’s focus on protecting the country’s borders and backed connecting “jihadi terrorism” with Islam and particular countries. However, he said, the order is “too broad.”\n\n“If we send a signal to the Middle East that the U.S. sees all Muslims as jihadis, the terrorist recruiters win by telling kids that America is banning Muslims and that this is America versus one religion,” Sasse said in a statement released Saturday. “Our generational fight against jihadism requires wisdom.”\n\nSen. Mike Lee (R-Utah) said he has “technical” questions about how the order will be implemented but supports its purpose.\n\nOthers, including Sen. James Lankford (R-Okla.), announced tepid support and concerns on Twitter.\n\n“We should value freedom & not surrender security. We can protect the homeland while upholding #religiousfreedom & refuge for the persecuted,” Lankford tweeted.\n\nRead more at PowerPost", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["ban", "dont", "vetting", "republicans", "united", "states", "trumps", "religious", "country", "mcconnell", "order", "tests", "concerns"], "summary": "Senate Majority Leader Mitch McConnell (R-Ky.) cautioned that the United States does not have a religious test for entry into the country, though he stopped short of rejecting the order in its entirety.\n“I don’t want to criticize them for improving vetting,” McConnell said on ABC’s “This Week.” “I think we need to be careful.\nWe don’t have religious tests in this country.”(Bastien Inzaurralde/The Washington Post)The comments came after a day of silence from McConnell on the issue.\n“Ultimately it is going to be decided in the courts as to whether or not this has gone too far,” McConnell said.\nMcConnell is among those who strongly opposed the concept of a Muslim ban when Trump touted the idea during the campaign."}