{"url": "https://www.washingtonpost.com/world/national-security/dhs-report-casts-doubt-on-need-for-trump-travel-ban/2017/02/24/2a9992e4-fadc-11e6-9845-576c69081518_story.html", "id": "36", "title": "DHS report casts doubt on need for Trump travel ban", "text": "A Department of Homeland Security report assessing the terrorist threat posed by people from the seven countries covered by President Trump’s travel ban casts doubt on the necessity of the executive order, concluding that citizenship is an “unreliable” threat indicator and that people from the seven countries have rarely been implicated in U.S.-based terrorism.\n\nThe document — first reported by the Associated Press and later confirmed to the Washington Post — relies on public materials, and a Department of Homeland Security spokeswoman said it was “clear on its face that it is an incomplete product.” Still, it could prove another hurdle in the administration’s effort to restore the travel ban, undermining the White House’s argument that the measure is necessary for national security reasons.\n\nThe report was prepared at the request of the acting secretary for the Office of Intelligence and Analysis and does not represent the official position of the Department of Homeland Security.\n\nGillian M. Christensen, a Homeland Security spokeswoman, said in a statement that it had “not been subject to the extensive interagency review process required of finished intelligence products” and did not “include data from other intelligence community sources.” She confirmed there was debate over the matter, as CNN reported, but disputed that debate was because of political concerns.\n\n“Allegations by opponents of the president’s policies that senior DHS intelligence officials would politicize intelligence is unfortunate and untrue,” she said. “The dispute with this product was over sources and quality, not politics.”\n\nShanez Tabarsi, right, is greeted by her daughter Negin at Logan Airport in Boston after traveling to the U.S. from Iran following a federal court's temporary stay of Trump's executive order travel ban. (Brian Snyder/Reuters)\n\n[The government now says 746 people were held due to the travel ban. Here’s why that number keeps changing.]\n\nThe report is three pages long and does not address head-on whether the temporary ban on people entering the United States from Iraq, Iran, Somalia, Sudan, Syria, Yemen and Libya is an effective measure. But it asserts that citizens from those countries are “rarely implicated in U.S.-based terrorism,” and citizenship itself is an “unreliable indicator of terrorist threat to the United States.”\n\nBased on an analysis of Justice Department press releases, it says of 82 people “who died in the pursuit of or were convicted of any terrorism-related federal offense,” more than half were U.S.-born citizens.\n\nThe report referenced eight people from Somalia, Iraq, Iran, Sudan and Yemen who it said were convicted of or died in pursuit of terrorism. It said none had done so from Syria and did not specifically mention Libya. It also excluded those merely traveling or attempting to travel to join a foreign terrorist organization.\n\nThe report also concludes that while terror groups in Iraq, Syria and Yemen pose a threat of attacks in the United States, the other four countries are “regionally focused.” That conclusion is based on another, non-classified report.\n\nTrump has said he plans to re-write his executive order — which courts have ordered frozen — and a White House official has said the new version is expected next week. Those suing over the matter said the original order represents an unconstitutional targeting of Muslims, disguised as a national security measure. In one court case, 10 former high-ranking diplomatic and national security officials attached their names to an affidavit declaring there was “no national security purpose” for a complete barring of people from the seven affected countries, which are all Muslim-majority.\n\nThe new report could prove a boon to those challenging Trump’s ban, as they seek to demonstrate it was motivated not by national security concerns, but by religious animosity. They also will likely be able to use as evidence comments by Trump himself and ally Rudy Giuliani suggesting the administration wanted to ban Muslims from entering the United States.\n\n(Victoria Walker/The Washington Post)\n\nThough not addressing that directly, Christensen offered a defense of the ban’s national security purpose.\n\n“The seven countries were identified by the previous administration as being countries of concern for foreign terrorist travel to the Unites States. Consequently, these countries were the focus of this administration’s initial efforts to enhance vetting for foreign travel to the United States,” she said. “It is the policy of the United States to protect its citizens from foreign nationals who intend to commit terrorist attacks in the United States; and to prevent the admission of foreign nationals who intend to exploit United States immigration laws for malevolent purposes.”", "authors": [], "publish_date": "2017-02-24", "source": "washingtonpost", "top_words": ["travel", "casts", "trump", "national", "ban", "intelligence", "security", "report", "terrorist", "united", "need", "dhs", "countries", "states", "doubt"], "summary": "(Brian Snyder/Reuters)[The government now says 746 people were held due to the travel ban.\nThose suing over the matter said the original order represents an unconstitutional targeting of Muslims, disguised as a national security measure.\n(Victoria Walker/The Washington Post)Though not addressing that directly, Christensen offered a defense of the ban’s national security purpose.\n“The seven countries were identified by the previous administration as being countries of concern for foreign terrorist travel to the Unites States.\nConsequently, these countries were the focus of this administration’s initial efforts to enhance vetting for foreign travel to the United States,” she said."}