{"url": "https://www.washingtonpost.com/news/grade-point/wp/2017/01/30/disruption-and-disorientation-universities-respond-to-trumps-immigration-order/", "id": "345", "title": "‘A stunning violation of our deepest American values’: Universities respond to Trump’s immigration order", "text": "\n\nDemonstrators gather in Copley Square in Boston to protest President Trump’s executive order travel ban in Boston on Jan. 29. (Brian Snyder/Reuters)\n\nIn letters both sweeping and personal, university presidents across the country expressed alarm about President Trump’s recent executive order on immigration. MIT’s president called it “a stunning violation of our deepest American values.” Princeton’s president wrote that his own parents would have died had they been denied visas to the United States.\n\nThe situation on campuses nationally is best characterized as full of uncertainty, confusion and fear, said Terry Hartle, senior vice president, division of government and public affairs for the American Council on Education, which represents the country’s colleges and universities.\n\nCollege officials were still scrambling to account for students and faculty affected by the order at some campuses Monday, advising those from the seven countries targeted not to leave the United States and urging the administration to reconsider a policy that threatens to shut out top scholars.\n\n[Universities grappling with impact of Trump’s executive order on immigration]\n\nThe executive order signed Friday includes a ban on entry into the United States by citizens of seven predominantly Muslim countries — Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen — for the next 90 days and temporary bans on refugees as well, including an indefinite block on those from Syria.\n\nThe Trump administration says green-card holders will no longer be affected, and courts in several cities have blocked the ban. But Department of Homeland Security officials said Sunday that the order would continue to be imposed despite the judicial rulings.\n\n[Trump says ‘All is going well’ on immigration order, amid questions and confusion]\n\nA spokeswoman for the White House did not immediately respond to a request for comment Monday, but the administration has said that the order was needed to protect national security.\n\nOur country needs strong borders and extreme vetting, NOW. Look what is happening all over Europe and, indeed, the world – a horrible mess! — Donald J. Trump (@realDonaldTrump) January 29, 2017\n\nTrump has often said that people from some countries and refugees wishing to come to the United States are not vetted thoroughly enough. He reiterated that after an Ohio State University student, Abdul Razak Ali Artan, attacked a crowd of people on campus with a car and a butcher knife. Trump said Artan should not have been ­allowed into the country.\n\nArtan, who was Muslim and had lived in Somalia and Pakistan, did not have actual ties to terrorists overseas but was apparently radicalized online, inspired by the Islamic State and radical cleric Anwar al-Awlaki, according to federal law enforcement officials.\n\nSen. Charles E. Grassley (R-Iowa), chairman of the Senate Judiciary Committee, wrote that the family’s application to be admitted as refugees should have been more thoroughly vetted.\n\nOn social media, Trump defended the executive order.\n\nIf the ban were announced with a one week notice, the \"bad\" would rush into our country during that week. A lot of bad \"dudes\" out there! — Donald J. Trump (@realDonaldTrump) January 30, 2017\n\nStudent visas have been in the political crosshairs before, Hartle said, especially since 9/11 terrorists initially entered the country that way. “What’s different this time is it’s the start of the administration, key agencies have not been involved in the effort, and they’re trying to figure out what it means themselves,” Hartle said. “It’s a very confusing situation. People coming in on visas have been denied opportunities to see lawyers. The federal agencies involved in this are making it up as they go.” He said their understanding is that Homeland Security is working feverishly to put together an initial response, which he hopes to see in the next couple of days.\n\nAs protests continued nationwide, many schools issued public statements to offer support and guidance for the campus community — and advised patience, as officials and lawyers worked to navigate shifting information. Officials were looking ahead, too, wondering about overseas recruitment at such an unsettled time.\n\nAbout 17,000 of America's international students come from the seven predominantly Muslim countries that President Trump banned from entering the country with his Jan. 27 executive order. Now some students and professors are unsure of their fate. The Post's Joe Heim tells you more. (Monica Akhtar/The Washington Post)\n\nAt MIT, President L. Rafael Reif wrote to the campus community that the events of the past few days had been deeply disturbing. “I was hoping to write to you today with some uplifting news.\n\n“Yet, as I write, we continue to push hard to bring back to MIT those members of our community, including two undergraduates, who were barred …”\n\nHe asked that if people knew of others affected to alert campus officials so that they could try to help. He wrote that MIT is profoundly American, a place founded to accelerate the industrial revolution, where “graduates have invented fundamental technologies, launched new industries and created millions of American jobs. Our history of national service stretches back to World War I … we are engaged every day in keeping America safe.\n\n… We are as American as the flag on the Moon. At the same time, and without the slightest sense of contradiction, MIT is profoundly global. Like the United States, and thanks to the United States, MIT gains tremendous strength by being a magnet for talent from around the world. More than 40% of our faculty, 40% of our graduate students and 10% of our undergraduates are international. Faculty, students, post-docs and staff from 134 other nations join us here because they love our mission, our values and our community. And — as I have — a great many stay in this country for life, repaying the American promise of freedom with their energy and their ideas. … The Executive Order on Friday appeared to me a stunning violation of our deepest American values, the values of a nation of immigrants: fairness, equality, openness, generosity, courage. The Statue of Liberty is the “Mother of Exiles”; how can we slam the door on desperate refugees? Religious liberty is a founding American value; how can our government discriminate against people of any religion? In a nation made rich by immigrants, why would we signal to the world that we no longer welcome new talent? In a nation of laws, how can we reject students and others who have established legal rights to be here?\n\nHe ended with a plea that people work together, despite the divisions.\n\nChristopher Eisgruber, the president of Princeton University, noted in a message to the campus community that the university had taken steps to help students and scholars affected by the order, including a small number who are traveling abroad and face difficulties returning to the United States.\n\nHe wrote:\n\nPrinceton’s position on immigration policy issues reflects our conviction that every single person on this campus has benefited from the ability of people to cross borders in search of learning or a better life. That is emphatically true for me. My mother and her family arrived in this country as refugees escaping from a war-torn continent. They would have perished had they been denied visas. My father first came to America as an exchange student from a country that had recently been at war with the United States, and he then studied at Purdue University as a foreign graduate student. Immigration has been a source of creativity and strength for this country throughout its history. It is indispensable to the mission and the excellence of America’s universities, which enhance this country’s economy, security, and well-being through the students they educate and the ideas they generate. Princeton will continue supporting students, faculty, and staff of all nationalities and faiths, and we will continue making the case for policies that simultaneously respect this nation’s legitimate security interests and allow for the free and vital movement of students and scholars across borders.\n\nHarvard President Drew Faust issued a statement which expressed, in part, her concern:\n\nAs I write, we are still working to understand the concrete implications of the new travel restrictions, and we are following related developments in the courts. But the disruption and disorientation flowing from these restrictions are palpable and distressing. … National security is, of course, an essential element of our nation’s immigration policy. But we are confident those considerations can be fairly addressed while avoiding the large-scale disruption and distress that the new restrictions portend — and while honoring the ideals of openness, nondiscrimination, and opportunity that our universities and our nation hold dear. We urge the administration, the Congress, and the courts to address these concerns without delay.\n\nAt Yale, President Peter Salovey wrote to the campus community, in part, “We are alarmed by this executive order” and joined with the Association of American Universities in urging that “the administration’s new order barring the entry or return of individuals from certain countries … should end as quickly as possible” and for the United States to continue “to welcome the most talented individuals from all countries to study, teach, and carry out research and scholarship at our universities.”\n\nAbout 1 in 20 of the more than 20 million students enrolled in U.S. colleges in 2015-2016 comes from abroad, according to the Institute of International Education, with an estimated 17,000 of them originally from the seven countries included in the ban.\n\nAt George Washington University, they know of at least 74 students, visiting scholars and alumni affected by the executive order because they are on the Optional Practical Training that can extend a student visa. So far, a spokeswoman said, they have heard from one student who was not allowed to board a plane in Iran. The university’s president, Steven Knapp, asked the campus community to offer support to colleagues and friends who may be worried about their own and their family’s futures.", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["executive", "values", "campus", "immigration", "american", "deepest", "universities", "united", "trumps", "country", "states", "stunning", "countries", "order", "president", "students", "violation", "respond"], "summary": "Demonstrators gather in Copley Square in Boston to protest President Trump’s executive order travel ban in Boston on Jan. 29.\n(Brian Snyder/Reuters)In letters both sweeping and personal, university presidents across the country expressed alarm about President Trump’s recent executive order on immigration.\nMIT’s president called it “a stunning violation of our deepest American values.” Princeton’s president wrote that his own parents would have died had they been denied visas to the United States.\nLike the United States, and thanks to the United States, MIT gains tremendous strength by being a magnet for talent from around the world.\n… The Executive Order on Friday appeared to me a stunning violation of our deepest American values, the values of a nation of immigrants: fairness, equality, openness, generosity, courage."}