{"url": "https://www.washingtonpost.com/blogs/erik-wemple/wp/2017/03/16/ij-review-scoop-hawaii-judge-ruling-against-trump-comes-days-after-surprise-visit-by-obama/", "id": "341", "title": "IJ Review scoop! Hawaii judge ruling against Trump comes days after ‘surprise’ visit by Obama", "text": "\n\nU.S. President Donald Trump and former president Barack Obama leave the U.S. Capitol prior to Obama’s departure from Washington on Inauguration Day, Jan. 20. REUTERS/Jack Gruber/Pool via USA TODAY NETWORK/File Photo\n\nKyle Becker works at the Independent Journal Review (IJR) with the title of lead editor and director of viral media. Today he posted a story with this headline: “Ex-President Obama Made ‘Surprise Visit’ to Hawaii, Just Days Before Judge Issued Travel Ban Ruling.” Though that headline seems tightly factual, it was filed under the banner of “OPINION.”\n\nBut:\n\n*What’s so opinionated about pointing out that “Former President Barack Obama made a ‘surprise visit’ to Oahu this week, just days ahead of a controversial ruling on President Trump’s new travel ban executive order issued by a Hawaiian judge.”?\n\n*What’s so opinionated about noting that this Hawaiian judge “is a former Harvard classmate of President Obama who was appointed under his administration in 2012.”?\n\n*What’s so opinionated about writing this simple fact: “Ahead of the ruling, the president made the aforementioned ‘surprise visit’ to Oahu, Hawaii.”?\n\n*And what’s so opinionated about noting, just like a wire-service reporter, that “On Monday night, President Obama dined at upscale restaurant Noi Thai in Honolulu, Hawaii. The location of the restaurant was particularly interesting to Reddit users, who point out with verifiable information that it was within five minutes of the courthouse where the ruling was issued.”?\n\nThere are all just boring, everyday facts. Why is the viral editor of the IJ Review doing such prosaic journalism?\n\nAnd what’s with this crazy editor’s note that is now appended to the story? Here it is: “Editor’s Note: This story has removed unnecessary speculation about the timing of the visit. We apologize for any undue conclusions that might have been drawn from the report.”\n\nNo undue conclusions here! The Erik Wemple Blog never supposed that IJ Review was attempting anything other than coincidental journalism.\n\nIn light of this demonstrated ability to string together facts in compelling and viral ways, please check in on the work of the IJ Review as it covers the Asia trip of Secretary of State Rex Tillerson. The State Department chose an IJ Review staffer as the sole reporter to travel on Tillerson’s plane, the better to “include a broader representation of U.S. media.” That aim appears to be fulfilled.\n\nUPDATE: IJ Review has now retracted this innocent collection of facts.", "authors": [], "publish_date": "2017-03-16", "source": "washingtonpost", "top_words": ["ruling", "travel", "hawaii", "trump", "viral", "ij", "opinionated", "judge", "visit", "obama", "review", "president", "scoop", "surprise"], "summary": "*What’s so opinionated about noting that this Hawaiian judge “is a former Harvard classmate of President Obama who was appointed under his administration in 2012.”?\n*What’s so opinionated about writing this simple fact: “Ahead of the ruling, the president made the aforementioned ‘surprise visit’ to Oahu, Hawaii.”?\nWhy is the viral editor of the IJ Review doing such prosaic journalism?\nThe Erik Wemple Blog never supposed that IJ Review was attempting anything other than coincidental journalism.\nUPDATE: IJ Review has now retracted this innocent collection of facts."}