{"url": "https://www.washingtonpost.com/news/monkey-cage/wp/2017/02/09/trumps-travel-ban-may-backfire-and-hinder-u-s-policy/", "id": "48", "title": "Trump’s travel ban may backfire — and hinder U.S. policy", "text": "\n\nRoodo Abdishakur, second from left, a Somali national who was delayed entry to the United States because of the recent travel ban, is greeted by her mother, Zahra Warsma, at Washington Dulles International Airport on Feb. 6. (Jonathan Ernst/Reuters)\n\nThe Trump administration’s ban of migrants from seven Muslim-majority countries has been carried out in an inconsistent, hasty and vague manner. Green-card holders, dual citizens, vetted asylum seekers and visa-holders have been overwhelmed with anxiety and uncertainty about whether they will be allowed to remain in the United States. Confusion about the ban has led many migrants (both those affected by the ban and those not) to doubt whether their legal status will be enough to protect them from the U.S. government.\n\nBy increasing migrants’ distrust of the government, Trump’s executive order actually hurts his ability to effectively pursue national security and migration policy.\n\nHere’s how I know\n\nOver the past four years, I have spoken with more than 100 Syrian refugees in Greece, Jordan and Iraq about their perceptions of host government officials and whether these perceptions affect their decision to comply with policies. While in Greece, I saw that the government changed asylum policies frequently, enforced them inconsistently and failed to provide information about these policies.\n\n[How low can Donald Trump’s approval rating go?]\n\nThe Greek government’s arbitrary and confusing approach left many refugees anxious and uncertain. Over time, refugees increasingly distrusted the government — many refused to engage with government officials, avoided accessing critical services, ignored or evaded official policies, and turned to smugglers for information. Refugees’ behavior made it harder for the government to manage the crisis.\n\nWhat are the similarities between the Greek migrant crisis and the U.S. travel ban?\n\nOf course, the Greek migrant crisis is quite different from the situation in the United States. However, there are several important similarities that make comparing the two useful.\n\nIn both countries, language barriers make it harder for government representatives to communicate directly with migrants. For instance, lawyers attempting to help detained individuals have been asking for Arabic and Farsi translators across U.S. airports.\n\nAlthough the U.S. bureaucracy generally communicates policies more clearly than in Greece, Trump’s executive order was carried out similarly to those in Greece: hastily, arbitrarily and without clear and consistent information. To wit, whether travelers are detained or deported has varied from one airport to another; government representatives have issued conflicting statements about the legality of the ban and how it will be implemented. Much like migrants in Greece, travelers to the United States have been relying on social media networks for information rather than the government.\n\n[Unlike all previous U.S. presidents, Trump almost never mentions democratic ideals]\n\nMuch like refugees in Greece, migrants in the United States have had difficulty discerning the motives behind Trump’s immigration ban — leading many to distrust his administration and view changes in the ban warily.\n\nFirst, while Trump argued that restricting immigration will reduce terrorism, no one from the specified countries has carried out such an attack on U.S. soil. These migrants were exhaustively vetted and granted legal residency; however, the executive order depicts them as national security threats. This sends a signal to migrants that, no matter whether they have legally traveled to and lived in the United States, they are innately suspect because of their nationality.\n\nSecond, the Trump administration frequently changed the scope of the ban, making it unclear whether green-card holders, dual citizens and other legal residents were included.\n\n[Trump’s immigration order requires bureaucrats to decide who’s a real Christian]\n\nThird, despite the fact that several federal judges halted enforcement of the order, some border control officers continued to arbitrarily detain visa and green-card holders.\n\nHow will this affect U.S. government attempts to enforce policy?\n\nBy arbitrarily and hastily implementing an aggressive policy without clear justification, the Trump administration is sowing confusion and anxiety in U.S. refugee and migrant communities.\n\nIn Greece, refugees feared that any interaction with government officials would get them deported — so they avoided using crucial public services. For instance, many refused primary health services unless it was an emergency; in these cases, they often refused to provide their names and contact information, making it difficult for doctors to provide sustained care.\n\nMigrants legally residing in the United States may similarly refuse to access public health care, file complaints with the police, or deal with officials in other capacities, for fear that they will be treated as illegal and deported.\n\nMaking migrants feel they cannot access public services may be what the Trump administration desires. However, the pervasive distrust that leads migrants to reduce their use of services may also lead them to believe that evading, ignoring or failing to comply with other laws is necessary to secure their safety.\n\nIn Greece, thousands of refugees lived for months, even years, in a dangerous, informal tent camp in Piraeus Port. When the government tried to move them to a formal facility, many returned to Piraeus, where they could move freely. Additionally, rather than use formal legal routes to travel to Northern Europe, refugees increasingly relied on extralegal ways, such as walking across the border using their phones’ GPS, or turning to smugglers, seeing these routes as more effective and secure.\n\nIn the United States and Europe, scholars have found that, when migrants cannot access their legal rights through government institutions, they will use informal, nontraditional means to exercise their rights.\n\nAs a result, migrants are likely to comply with U.S. law — but selectively\n\nThis, combined with my work in Greece, indicates that migrants — even legal residents and those not explicitly targeted by the ban — will act on their distrust of the Trump administration by using informal, extralegal pathways to get what they need. In particular, migrants may be less likely to obtain various registrations, such as drivers’ licenses and birth certificates. Similarly, migrants may be more likely to work outside their visa restrictions, expanding the informal labor sector.\n\nOnce migrants begin to selectively comply with laws, the Trump administration will find it harder to enforce domestic policy. An increase in individuals working “under the table” can make it more difficult for the Trump administration to enforce its migration policies, track remittances, reduce informal labor, and monitor movement in and out of the country.\n\nIf migrants reduce their interactions with government officials, the result can be clusters of self-isolated communities, where it is harder for the government to maintain law and order.\n\nRefugee communities overseas are likely to be suspicious of U.S. intentions\n\nThe Trump administration will likely find that migrants’ reaction to this ban will make it difficult to pursue foreign policy as well. In Greece, once refugees began to distrust the government, they interpreted all government actions, even clearly positive ones, through this skepticism. For instance, when the Greek government provided free WiFi access in formal camps, many refugees believed that they purposely provided a weak WiFi signal to prevent refugees from accessing information.\n\nRefugee communities abroad, skeptical about the Trump administration’s motives, may be less willing to access services provided by U.S.-funded aid programs, or interact with aid organizations that receive U.S. aid. Whether the United States provides aid altruistically or with strategic intent, reduced refugee engagement may make it less effective.\n\nWorse, refugees’ decreased access of aid may make U.S. allies less stable. In Greece, distrust in the government was so widespread that, when rumors started spreading through the Moria detention center on Lesbos that refugees would be deported en masse, tensions boiled over into riots, destroying much of the camp.\n\nIf refugees distrust U.S. motives, they may become skeptical of any government that accepts U.S. aid, creating an environment ripe for mass mobilization and violent protest. Further, distrust of “U.S.-affiliated” host governments may lead refugees to view anti-American groups as more credible and reliable, further harming Trump’s ability to pursue desired foreign policy goals.\n\nHow people perceive policy matters\n\nHow a policy is implemented, and how the government explains its reasoning, directly affects its ability to pursue related policies in the future. Given how the travel ban was implemented, it could undermine the Trump administration’s efforts to keep the U.S. stable and pursue its policy goals abroad.\n\nMelissa Carlson is a PhD student in the political science program at the University of California at Berkeley.", "authors": [], "publish_date": "2017-02-09", "source": "washingtonpost", "top_words": ["travel", "administration", "trump", "backfire", "ban", "distrust", "hinder", "united", "states", "trumps", "migrants", "greece", "refugees", "policy"], "summary": "By increasing migrants’ distrust of the government, Trump’s executive order actually hurts his ability to effectively pursue national security and migration policy.\nOf course, the Greek migrant crisis is quite different from the situation in the United States.\nIn Greece, refugees feared that any interaction with government officials would get them deported — so they avoided using crucial public services.\nOnce migrants begin to selectively comply with laws, the Trump administration will find it harder to enforce domestic policy.\nWhether the United States provides aid altruistically or with strategic intent, reduced refugee engagement may make it less effective."}