{"url": "https://www.washingtonpost.com/national/with-trump-travel-ban-stay-immigrants-scramble-to-get-back-to-us/2017/02/05/3806cea6-ebb4-11e6-b4ff-ac2cf509efe5_story.html", "id": "49", "title": "With stay of Trump travel ban, immigrants scramble to get back to U.S.", "text": "After a federal appeals court early Sunday denied an initial request by the Trump administration to reinstate its controversial travel ban, a crush of people stranded in legal limbo rushed to fly back to the United States during the temporary stay.\n\nSunday’s ruling by the U.S. Court of Appeals for the 9th Circuit capped several days of chaos as airlines and immigration authorities adjusted to a constantly changing landscape of court rulings and federal guidance on the executive order that barred refugees and people from seven Muslim-majority countries from entering the United States.\n\nA judge in a lower federal court had put a temporary stop to the travel ban. Because the appeals court declined to intervene immediately, affected travelers can enter until at least Monday. The appeals court asked challengers to the ban to file a response by roughly 3 a.m. Eastern on Monday and the Justice Department to reply to that by 6 p.m.\n\n[9th Circuit Court declines to quickly reinstate travel ban]\n\nThe court’s decision not to intervene meant Abdusebur Jemal could be reunited with his wife, Rudaynah, and their toddler daughter, Haifa.\n\nInternational travelers are welcomed by demonstrators at Dulles International Airport in Sterling, Va., on Feb. 5. (Astrid Riecken/European Pressphoto Agency)\n\nHis wife is a refugee from Yemen. She fled to Ethiopia two years ago and had refugee status there. “She can never go back to her country,” Jemel said Sunday at Chicago’s O’Hare International Airport.\n\nRudaynah, 25, was set to arrive in the United States on Jan. 28 but got caught in the ban, which Jemal said he learned about while surfing the Web. He contacted the office of Sen. Richard J. Durbin (D-Ill.), who arranged for an immigration attorney to help with the case pro bono.\n\nJemal, 33, is a two-year medical student at the University of Illinois’s Rockford campus. He is a U.S. citizen and has been here since 1999. He met his wife in Yemen through a family member, and the two married in 2011. Their daughter is a U.S. citizen.\n\n“All I wanted was to see my wife and daughter,” he said. “This is one of the greatest moments of my life. The ruling allowed me to see my wife. Finally, I have a chance to be a dad.\n\n“I always believed in the foundations that this country was built on,” he said. “This is a reaffirmation of that.”\n\nAt Dulles International Airport, an elated Roslyn Sinha arrived on a flight from Dubai, anxious to join her husband, Neil, in Texas.\n\nShe landed at Dulles around 8 a.m. Sunday, emerging from the terminal almost two hours later without problem.\n\n(Reuters)\n\n“Neil? Neil? Neil? They are not sending me to Dubai, Neil,” Sinha said, beaming as she spoke on the phone with her husband.\n\nSinha had been in Dubai visiting her ailing mother. She was in bed her first night in Dubai when she received a text from her husband just hours after Trump signed the executive order on Jan. 27. The 30-year-old former TV personality was born and raised in the United Arab Emirates, but the country’s rules require that she maintain a passport from Iraq, her parents’ native country. Iraq is one of the seven countries on the ban list, along with Iran, Libya, Somalia, Sudan, Syria and Yemen .\n\n[Despite her life in Texas, she fears deportation to Iraq — where she is a stranger]\n\nWith her green-card application pending and confusion mounting over who would be barred from the country, the newlywed scrambled to find a way back to her husband in the United States.\n\n“I thought it was going to be over, I’m going to lose him,” Sinha recalled Sunday.\n\nSo she cut short her visit with her mother, who is partially paralyzed after suffering strokes on Dec. 28.\n\n“I cried when I left because I didn’t see her, I didn’t get to see her at all. I was awake at night calling lawyers, calling [U.S. Citizenship and Immigration Services], calling airports trying to figure out how to get back to my husband,” Sinha said. “During the day, I was so exhausted.”\n\nAfter a few canceled flights, arguments at airports and concocting a backup plan to get a visa to travel to Mexico and drive to Texas, Sinha managed to get on a flight to Washington, where her attorney could intervene if she ran into problems.\n\n[‘We’re the good guys’: Lawyers continue airport campouts amid Trump travel ban]\n\nBut while things appeared to be going relatively smoothly for travelers landing at U.S. airports, many people were having problems boarding U.S.-bound flights overseas.\n\nWhen Sahar Fadul arrived at Dulles from Sudan on Jan. 28 to meet her fiance, a U.S. citizen who lives in Colorado, she was stopped at customs due to the ban. According to her lawyer, she was forced to sign a form relinquishing her visa and put on a flight back to Khartoum.\n\nFadul now is part of a Virginia lawsuit challenging the revocation of a variety of visas, including student and work visas.\n\nJustice and State department officials revealed Friday that about 60,000 — and possibly as many as 100,000 — visas have been provisionally revoked as a result of Trump’s order.\n\nThe State Department said Saturday it would restore those visas.\n\nOn Saturday, after a Seattle judge halted the travel ban, Fadul tried to board a plane in Khartoum. She was denied boarding at the gate, according to her lawyer, Timothy Heaphy. Heaphy said it was because Ethiopian Airlines had not received notice of the judge’s ruling.\n\nFadul, a microbiologist, was denied boarding again Sunday because the airline had no record of her reinstated visa. She will try again Monday night, and she is slated to arrive in Washington on Tuesday morning on her third flight of the journey.\n\n“She didn’t have an official document except her passport with the canceled visa stamp, and they wouldn’t honor that,” Heaphy said. “The problem seems to be communication between the United States and these foreign airlines.”\n\nBecause the visa was hand-canceled, he said, there was no record of it being reinstated in the computer system. Everything must be done by phone, and it is taking time.\n\nIsihaq Rabi, a 37-year-old Somali refugee who has been living in Austria, had a similar experience. He boarded a connecting flight to London on Friday and then a flight to Seattle, where he was planning to start a new life with his wife, an American citizen. His travel documents were confiscated and canceled by Customs and Border Protection upon his arrival, said his lawyer, Carol Edward. Rabi was put back on the same flight to London — in the same seat — with only a photocopy of those documents.\n\n“The original document he had with him was confiscated by CPB and it was marked canceled, but they have a new order to reinstate those,” Edward said. She said Customs and Border Protection has been very cooperative and has said that Rabi would be able to enter the United States.\n\nRabi was able to get back to Vienna. The problem now, because of his documents, Edward said, is getting him on a flight to London. U.S. authorities are working with her, she said, but it requires multiple layers and phone calls. “It’s really messy and complicated,” she said.\n\nImmigration attorneys, dozens of whom have been camped out at Dulles and airports throughout the country since the ban was implemented, expected another round of passengers to arrive late Sunday. Many could be heard arguing on the phone with airline representatives to let their passengers board, as some seemed confused over the court rulings and what they meant.\n\nAhmed Abdulle embraced his wife and two young children after they arrived at Dulles on a flight from Qatar on Sunday afternoon, ending an agonizing week of fear that his long-awaited reunion with his family wouldn’t happen.\n\nHe married his wife, a fellow native of Somalia, seven years ago, but he moved to the United States shortly after the wedding, and they never lived together long-term.\n\nAbdulle, 31, would occasionally return to Dubai to visit her for short periods, and they had two children. A week before the November election, his family secured immigrant visas to join him in Alexandria, Va.\n\nBut then came the travel ban.\n\n“When the injunction came down on Friday, I called and said, get a flight right now before they change their minds,” said his attorney, Lauren Eagan.\n\nA Saturday flight from Dubai was canceled, but the family managed to get on a flight from Doha, Qatar, on Sunday.\n\n“Last night I could not sleep because of excitement and happiness, and before that, I couldn’t sleep because of sadness and stress. I lost like five pounds in one week. It was very stressful,” Abdulle said. “It was the first time I Googled what depression mean.”\n\nWhen he spotted his wife, Bisharo, he ran to her with flowers and grabbed his 10-month-old son, Mostafa.\n\nThey are spending the night in a hotel because his apartment isn’t fully furnished. Their original plan was to reunite in March, but they didn’t want to take any chances on more immigration restrictions.\n\nHe ran his fingers through the hair of his toddler daughter, Zuhayrah.\n\n“These are children,” he said. “Generalization and stereotypes are always wrong.”\n\nThe Jalili family, separated in Tehran on Friday by an unexplained bureaucratic hurdle, was reunited in Boston on Sunday. Nineteen-year-old Helya had been blocked from boarding a flight with her parents and younger sister. The family made the agonizing decision to separate, with Helya arguing that it would be easier to get her to the United States if her parents had arrived.\n\nThe family had been trying for 13 years to emigrate from Iran, joining Hamid Jalili’s American brother and mother in New Hampshire.\n\nTeary-eyed and visibly shaken on Saturday, the Jalili family looked much happier Sunday as they awaited Helya’s arrival and then flung their arms around her as she arrived. Helya finished one year of university in Iran and hopes to continue her studies in the United States, dreaming of becoming a veterinarian.\n\n“My mind hasn’t changed about the American people,” she said.\n\nGuarino reported from Chicago and Nirappil and Zezima reported from Washington. Karen Weintraub in Boston, Vera Haller in New York, Rob Kuznia in Los Angeles, Camille Pendley in Atlanta, Lornet Turnbull in Seattle, Leah Sotille in Portland, Steve Friess in Detroit and Francisco Alvarado in Miami contributed to this report.", "authors": [], "publish_date": "2017-02-05", "source": "washingtonpost", "top_words": ["stay", "travel", "trump", "immigrants", "ban", "wife", "family", "scramble", "court", "united", "flight", "dubai", "states", "dulles"], "summary": "A judge in a lower federal court had put a temporary stop to the travel ban.\nOn Saturday, after a Seattle judge halted the travel ban, Fadul tried to board a plane in Khartoum.\nShe said Customs and Border Protection has been very cooperative and has said that Rabi would be able to enter the United States.\nBut then came the travel ban.\nHelya finished one year of university in Iran and hopes to continue her studies in the United States, dreaming of becoming a veterinarian."}