{"url": "https://www.washingtonpost.com/news/post-nation/wp/2017/03/16/whats-next-for-trump-travel-ban-2-0/", "id": "40", "title": "What’s next for Trump travel ban 2.0", "text": "\n\nPresident Trump said during a campaign rally in Nashville on March 15 that he “ought to” restore his first travel ban, after a federal judge blocked a revised version. (Jabin Botsford/The Washington Post)\n\nFederal judges in Hawaii and Maryland handed President Trump’s revised travel ban two significant defeats Wednesday and Thursday, blocking critical sections of the executive order just hours before officials were set to enforce them. Soon after the first ruling, Trump vowed at a campaign rally to take the case to the Supreme Court, if need be, while also declaring that he “ought to” restore his original travel ban and fight for it in court.\n\nTrump has been in a similar predicament before, after a federal judge in Washington state suspended his first travel ban. His options now, though, seem even more limited. He already has revoked and rewritten the order — and even the significant changes he made weren’t enough to convince the judiciary that his directive should be allowed to take effect, at least for now. He has two rulings against him in two federal circuits, meaning he’ll now have to persuade two appeals courts to overturn lower judges’ rulings to immediately lift the freeze on his ban, said Stephen W. Yale-Loehr, a professor of immigration law at Cornell Law School. A federal judge in Washington also is expected to weigh in soon.\n\n[Federal judge in Hawaii freezes President Trump’s new entry ban]\n\nAll roads, legal analysts say, are now likely lead to the Supreme Court, although the Justice Department has said only that it will “continue to defend this Executive Order in the courts.” Here are the government’s options, and the path that analysts say administration officials are most likely to take as they seek to restore Trump’s new travel ban.\n\n(1) Ask for appellate court intervention, and do it quickly\n\nThe last time around, Justice Department lawyers filed to the U.S. Court of Appeals for the 9th Circuit an emergency motion to stop a lower judge’s freeze on his ban. That bid was rejected, and ultimately, a three-judge panel ruled unanimously that the ban should remain on hold.\n\nHawaii, where U.S. District Judge Derrick K. Watson issued the most sweeping suspension of Trump’s new ban Wednesday, is in the 9th Circuit, so Trump’s appeal would again have to go through that court. The court has a reputation for being liberal, and Trump has referred to it as a circuit “in chaos.”\n\nThe 4th Circuit — of which Maryland is a part — had a reputation for being more conservative, although in recent years, it has seemed to become more liberal, said Leon Fresco, the deputy assistant attorney general in the Office of Immigration Litigation in President Barack Obama’s Justice Department.\n\n[Second federal judge blocks revised Trump travel ban]\n\nYale-Loehr said the government’s first step probably would be to appeal both places, as a favorable ruling in one case would not undo the restraining order in the other. U.S. District Judge Theodore D. Chuang, the federal judge in Maryland, issued a somewhat narrower restraining order than the one in Hawaii, but it was still significant. He blocked the key section of the executive order that stopped the issuance of new visas to residents of six Muslim-majority countries, while Watson, the judge in Hawaii, blocked that and the section that suspended the U.S. refugee program.\n\nIf the Justice Department were to again file an emergency motion to stop Watson’s ruling, it would get three judges to consider it. The motions panel for March is composed of Milan D. Smith Jr., an appointee of President George W. Bush; Morgan Christen, an Obama appointee; and John B. Owens, also an Obama appointee. The judges who rejected the last appeal were Michelle T. Friedland, who was appointed by Obama; Richard R. Clifton, who was appointed by Bush; and William C. Canby Jr., who was appointed by President Jimmy Carter.\n\nThe considerations this time are somewhat different. Trump’s first executive order barred entry to citizens of seven Muslim-majority countries, and it resulted in the provisional revocation of tens of thousands of visas. The new ban does not affect current visa holders. It affects only six countries and it spells out a robust list of people who might be able to apply for exceptions. Both bans suspended the refugee program.\n\nThe previous 9th Circuit ruling, though, is instructive in many ways. The three-judge panel wrote, for example, that even a ban that exempted green-card holders and others would not address their concerns about U.S. citizens with an interest in noncitizens’ right to travel. And the district court rulings on the new ban pointed extensively to comments by Trump and his top advisers indicating that they wanted to prevent Muslims from entering the United States.\n\nThe Justice Department would have to convince the appeals courts that that evidence — which judges in Hawaii and Maryland wrote is a strong indication that the ban might disfavor one religion and violate the Establishment Clause of the First Amendment — should not be considered, is not relevant or does not show what those suing claim it does.\n\nNotably, the 9th Circuit revealed Wednesday that a majority of its judges had not voted to reconsider en banc the opinion by its three-judge panel on the first travel ban. Five judges, though, signed on to a dissent, declaring that Trump was well within his authority even the first time, and that the controversy over the measure’s implementation might have led to an erroneous decision.\n\n“We are all acutely aware of the enormous controversy and chaos that attended the issuance of the Executive Order. People contested the extent of the national security interests at stake, and they debated the value that the Executive Order added to our security against the real suffering of potential emigres,” Judge Jay S. Bybee wrote for the dissenters. “As tempting as it is to use the judicial power to balance those competing interests as we see fit, we cannot let our personal inclinations get ahead of important, overarching principles about who gets to make decisions in our democracy.”\n\nFresco, who now works at the Holland & Knight law firm, said that although he was “not personally in favor of the travel ban,” the dissenters raised some important points, and that the Hawaii decision was far from a “slam dunk.” In particular, he said, it did not address the question of whether the president’s comments can “irrevocably stain the ability to ever issue an order like this.”\n\n“I actually think the Supreme Court will be the first legitimate grappling with these issues,” Fresco said.\n\n(2) Review the vetting procedures, with an eye on issuing something short of a ban\n\nThe next executive order, like the last one, is supposed to be a temporary measure — implemented so that the Homeland Security secretary and other agency heads could review U.S. vetting procedures and the information provided by other countries about their citizens wanting to come to the United States.\n\nThe order commanded the Homeland Security secretary to provide, within 20 days of when the order was to take effect, a determination of what information the United States would need to vet travelers and a list of countries not providing adequate data. Those countries would then be given 50 days to start providing the information, according to the order.\n\nThe administration was supposed to have been working on that review the first time around, but with a new order came new deadlines. Although it probably wants to win in court to avoid an authority-curtailing precedent, Fresco said the administration could simply finish its review and implement new vetting procedures that did not impose an outright ban. That might make the litigation moot, he said.\n\n(3) Restore the old order? Not if Trump wants to win, analysts say.\n\nAt a rally on Wednesday not long after the judge in Hawaii had ruled, Trump floated a wholly different solution.\n\n“I think we ought to go back to the first one and go all the way, which is what I wanted to do in the first place,” he told a cheering crowd.\n\nIt is technically possible that he could do that. Yale-Loehr said Trump “could reinstate his earlier executive order, but he would be foolish to do so,” particularly given the 9th Circuit’s rulings. Fresco said the president’s only option left would be the Supreme Court, where he would have to deal with all the legal problems that his revised order sought to eliminate.\n\n“I think that is going to be received with a very ugly reception in the Supreme Court, where I don’t think that would necessarily be the case with this new travel ban,” Fresco said.", "authors": [], "publish_date": "2017-03-16", "source": "washingtonpost", "top_words": ["executive", "travel", "judges", "trump", "hawaii", "ban", "judge", "court", "trumps", "whats", "order", "20"], "summary": "President Trump said during a campaign rally in Nashville on March 15 that he “ought to” restore his first travel ban, after a federal judge blocked a revised version.\nTrump has been in a similar predicament before, after a federal judge in Washington state suspended his first travel ban.\nNotably, the 9th Circuit revealed Wednesday that a majority of its judges had not voted to reconsider en banc the opinion by its three-judge panel on the first travel ban.\n“We are all acutely aware of the enormous controversy and chaos that attended the issuance of the Executive Order.\nYale-Loehr said Trump “could reinstate his earlier executive order, but he would be foolish to do so,” particularly given the 9th Circuit’s rulings."}