{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/06/05/trump-says-its-a-travel-ban-his-staff-insisted-it-wasnt/", "id": "50", "title": "Trump says it’s a travel ‘ban.’ His staff insisted it wasn’t.", "text": "President Trump tweeted loudly and clearly on Monday, insisting that his executive order banning travel from certain countries is, in fact, a “travel ban.”\n\nPeople, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN! — Donald J. Trump (@realDonaldTrump) June 5, 2017\n\nHe then repeated the term in a second tweet.\n\nThe Justice Dept. should ask for an expedited hearing of the watered down Travel Ban before the Supreme Court - & seek much tougher version! — Donald J. Trump (@realDonaldTrump) June 5, 2017\n\nDo those two words really matter in characterizing Trump's executive order? Or are we just being picky?\n\nIn this case, it isn't just picking apart words. Trump's language, and that of some of his aides, has been repeatedly cited by judges in U.S. district courts that have blocked the travel ban. In particular, the federal judges have cited Trump's campaign trail speeches, in which he promised a “total and complete shutdown of Muslims entering the United States.”\n\nReferring to his most recent executive order as a “watered down” version of the original could spell trouble for the Trump administration, too.\n\nAdding to that, Trump's latest tweets also undermine his own aides' attempts to defend the ban. Below, we've collected several instances of Trump officials directly denying that the travel ban is, well, a travel ban.\n\nHomeland Security Secretary John Kelly\n\nSecretary of Homeland Security John Kelly appeared before the media, seeking to clarify how President Trump's executive order is being implemented, on Jan. 31. (The Washington Post)\n\nSecretary of Homeland Security John Kelly held a news conference on Jan. 31, after the rollout of Trump's first travel ban, to insist several times that the president's executive order was not a “ban.”\n\n“This is not a travel ban; this is a temporary pause that allows us to better review the existing refugee vetting system,” Kelly said at the beginning of his statement. He went on to insist that the ban was not focused specifically on Muslims. “This is not — I repeat, not — a ban on Muslims … religious liberty is one of our most fundamental and treasured values.”\n\nWhite House press secretary Sean Spicer\n\nAfter the rollout of President Trump's first travel ban, White House press secretary Sean Spicer insisted \"it's not a travel ban,\" but rather is a vetting system, on Jan. 31. (The White House)\n\nLike Kelly, Spicer appeared in front of the media in the wake of the first executive order and went out of his way to parse words.\n\n“First of all, it's not a travel ban,” Spicer said during his daily briefing on Jan. 31 at the White House. “That's not a ban. What it is, is to make sure that the people who are coming in are vetted properly … a ban would mean people can't get in.”\n\n“It's not a travel ban. It's not a Muslim ban,” he went on to insist. When pushed on the fact that Trump himself had referred to it as a “ban,” Spicer said Trump was simply using the media's words.\n\nTrump's own Justice Department lawyers\n\nLawyers from the Department of Justice are tasked with arguing in favor of Trump's travel ban in courts. During arguments at a federal appeals court in Virginia, acting U.S. solicitor general Jeffrey B. Wall argued that Trump's campaign trail statements shouldn't be taken into consideration now that he's president.\n\n“Candidates talk about things on the campaign trail all the time,” Wall said, attempting to deflect the president's own words.\n\nJudges did not accept Wall's argument, becoming the second court to strike down portions of the ban.", "authors": [], "publish_date": "2017-06-05", "source": "washingtonpost", "top_words": ["executive", "travel", "wasnt", "trump", "spicer", "ban", "jan", "trumps", "staff", "kelly", "order", "31", "insisted"], "summary": "should ask for an expedited hearing of the watered down Travel Ban before the Supreme Court - & seek much tougher version!\nBelow, we've collected several instances of Trump officials directly denying that the travel ban is, well, a travel ban.\n“First of all, it's not a travel ban,” Spicer said during his daily briefing on Jan. 31 at the White House.\nWhen pushed on the fact that Trump himself had referred to it as a “ban,” Spicer said Trump was simply using the media's words.\nTrump's own Justice Department lawyersLawyers from the Department of Justice are tasked with arguing in favor of Trump's travel ban in courts."}