{"url": "https://www.washingtonpost.com/world/almost-no-north-koreans-travel-to-the-us-so-why-ban-them/2017/09/25/822ac340-a19c-11e7-8c37-e1d99ad6aa22_story.html", "id": "57", "title": "Almost no North Koreans travel to the U.S., so why ban them?", "text": "President Trump’s extension of his travel ban to North Korea is mostly symbolic and will have little to no effect on Kim Jong Un’s regime, experts said Monday.\n\nTrump on Sunday issued an executive order indefinitely banning travel to the United States by citizens of seven countries and the ruling class of an eighth. The list includes all but one of the countries covered by the original ban plus three more: Chad, Venezuela and North Korea. The restrictions on Venezuela apply to that country’s leaders and their families.\n\nWhile the entire order is sure to be controversial, the timing of the North Korea addition is particularly sensitive because it comes amid a protracted standoff over North Korea’s nuclear weapons program.\n\nSuccessive rounds of U.N. sanctions have done little to curb missile and nuclear tests, with the Kim regime pushing ahead and threatening, repeatedly, to target the United States.\n\nIn recent days, the situation has devolved into name-calling. Trump has tweeted vague threats to “Rocket Man” Kim, and the North Korean dictator has fired back at “dotard” Trump.\n\nEveryday, North Koreans are told that the Americans are \"imperialists\" and North Korean children are taught that \"cunning American wolves\" want to kill them. To understand why, we need to go back to the Korean War. (Anna Fifield,Jason Aldag/The Washington Post)\n\nIn the context of this escalating conflict, the North Korea travel ban may appear to be part of a U.S. push to isolate the regime. But experts said the provisions are unlikely to do so — or, in fact, accomplish anything concrete at all.\n\nTrump pitched the new order as a measure designed to keep Americans safe. “Making America Safe is my number one priority. We will not admit those into our country we cannot safely vet,” he tweeted.\n\nThe problem with punishing Pyongyang by stopping North Koreans from traveling to the United States is that very few — almost none — make the trip.\n\nThe new executive order suspends “immigrant and nonimmigrant” travel from North Korea to the United States. But people cannot emigrate from North Korea to the United States to begin with.\n\n“They should have checked if there is North Korean immigration before they banned it,” said John Delury, an associate professor at Seoul’s Yonsei University. “Why are you banning something that doesn’t exist?”\n\nNorth Korean defectors who end up in the United States usually arrive via South Korea and are typically traveling on South Korean, not North Korean, passports.\n\nAlthough North Korean diplomats do travel to the United States, mostly to United Nations headquarters in New York, the order notes that diplomatic visits are exempt from the ban.\n\nPassengers board an Air Koryo plane bound for Beijing at the Pyongyang International Airport in North Korea in June 2015. (Wong Maye-E/AP)\n\nThat leaves only the handful of officials or academics who attend conferences in the United States each year, a group that is already closely vetted by the State Department.\n\nGiven all this, Cheng Xiaohe, a North Korea expert at Renmin University of China in Beijing, predicted that the impact of the ban on North Korea would be “very limited.”\n\nLu Chao, a Korea specialist at the Liaoning Academy of Social Sciences in Shenyang, China, said there would be no practical impact at all. “It’s propaganda,” he said.\n\nYet, if this is a message, nobody seems certain what message Trump is trying send — or to whom.\n\nDelury said the move may be aimed at a domestic audience, not an international one. The original travel ban was widely criticized for targeting Muslims — adding North Korea and Venezuela changes the conversation.\n\n“There’s no logic in the North Korea context, so we can conclude this is not really about North Korea,” Delury said. “This is not part of real North Korea policy at all.”\n\nAmber Ziye Wang and Shirley Feng in Beijing contributed to this report.\n\nRead more:\n\nWhite House expands travel ban, restricting visitors from eight countries\n\nTrump calls North Korea’s leader ‘madman’ whose regime will face new tests\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "authors": [], "publish_date": "2017-09-25", "source": "washingtonpost", "top_words": ["travel", "ban", "korean", "korea", "venezuela", "regime", "order", "united", "north", "states", "koreans"], "summary": "President Trump’s extension of his travel ban to North Korea is mostly symbolic and will have little to no effect on Kim Jong Un’s regime, experts said Monday.\nEveryday, North Koreans are told that the Americans are \"imperialists\" and North Korean children are taught that \"cunning American wolves\" want to kill them.\n(Anna Fifield,Jason Aldag/The Washington Post)In the context of this escalating conflict, the North Korea travel ban may appear to be part of a U.S. push to isolate the regime.\nThe original travel ban was widely criticized for targeting Muslims — adding North Korea and Venezuela changes the conversation.\n“There’s no logic in the North Korea context, so we can conclude this is not really about North Korea,” Delury said."}