{"url": "https://www.washingtonpost.com/local/public-safety/judge-in-virginia-grants-preliminary-injunction-against-travel-ban/2017/02/13/a6164bfe-f255-11e6-a9b0-ecee7ce475fc_story.html", "id": "54", "title": "Federal judge in Virginia issues strong rebuke of Trump travel ban", "text": "A federal judge in Alexandria has issued a preliminary injunction against President Trump’s travel ban, dealing another blow to the White House attempt to bar residents of seven predominantly Muslim countries from entering the United States.\n\nThe executive order, Judge Leonie M. Brinkema concluded, probably violates the First Amendment’s protections for freedom of religion.\n\nBrinkema’s order applies only to Virginia residents and students, or employees of Virginia schools. A nationwide freeze has been in place for several days, having been issued in Washington state and upheld by a three-judge panel of the U.S. Court of Appeals for the 9th Circuit.\n\nIn her opinion, Brinkema wrote that the Commonwealth of Virginia “has produced unrebutted evidence” that the order “was not motivated by rational national security concerns” but “religious prejudice” toward Muslims. She cited Trump’s statements before taking office, as well as an interview in which former New York City mayor Rudolph W. Giuliani (R) said that the president wanted a “Muslim ban.”\n\n“The ‘Muslim Ban’ was a centerpiece of the president’s campaign for months, and the press release calling for it was still available on his website as of the day this Memorandum Opinion is being entered,” Brinkema wrote.\n\nThe case against the order in Virginia is being litigated by the state’s attorney general, Mark R. Herring (D). It was originally brought by lawyers for the Legal Aid Justice Center who were representing two Yemeni brothers turned away after landing at Dulles International Airport. The brothers have since been allowed into the country.\n\n“I saw this unlawful, unconstitutional and un-American ban for what it is, and I’m glad the court did too,” Herring said Monday night. He said the decision “lays out in stunning detail the extent to which the Court finds this order to likely violate the First Amendment of the U.S. Constitution.”\n\nSimon Sandoval-Moshenberg, an attorney for the brothers, Tareq and Ammar Aziz, said the judge was “calling out the ban for what it really is, a Muslim ban.”\n\nThe decision is significant, he noted, because a preliminary injunction requires a higher burden of proof than the temporary restraining order issued in Washington.\n\nAt a hearing Friday, Brinkema said judges throughout the country were “begging” for evidence from the government to defend the ban. At the hearing, a lawyer for the Justice Department produced only a copy of the order as evidence, while arguing that Virginia has no standing to challenge the ban and federal courts have no power to weigh in on its rationale.\n\nBrinkema rejected that argument. “Maximum power does not mean absolute power,” she wrote. “Every presidential action must still comply with the limits set by Congress’ delegation of power and the constraints of the Constitution, including the Bill of Rights.”\n\nShe also dismissed the idea that a halt on the ban would cause any harm. On the other hand, she said, the Commonwealth produced evidence that the ban is having a negative impact on students and faculty who can no longer leave the country for fear of losing their visas or who are no longer sure they can study in the state.\n\n(Peter Stevenson/The Washington Post)\n\n“Ironically, the only evidence in this record concerning national security indicates that the [order] may actually make the country less safe,” Brinkema wrote, a reference to a letter from a bipartisan group of national security professionals decrying the impact of the ban abroad.\n\nThe judge concluded it was irrelevant that the ban does not cover all or even most Muslims, as long as Muslims were the target.\n\n“It is a discriminatory purpose that matters, no matter how inefficient the execution,” she wrote.\n\nHowever, Brinkema declined Herring’s request that the order be national, saying she did not want her order to be so broad as to infringe on other courts. The order from Washington, she noted, offers nationwide relief.\n\nTrump has said he is considering rewriting his executive order on the travel ban.", "authors": [], "publish_date": "2017-02-13", "source": "washingtonpost", "top_words": ["travel", "wrote", "trump", "national", "ban", "issues", "evidence", "judge", "brinkema", "strong", "rebuke", "federal", "order", "power", "muslim", "virginia"], "summary": "The executive order, Judge Leonie M. Brinkema concluded, probably violates the First Amendment’s protections for freedom of religion.\nBrinkema’s order applies only to Virginia residents and students, or employees of Virginia schools.\nThe case against the order in Virginia is being litigated by the state’s attorney general, Mark R. Herring (D).\nAt a hearing Friday, Brinkema said judges throughout the country were “begging” for evidence from the government to defend the ban.\nTrump has said he is considering rewriting his executive order on the travel ban."}