{"url": "https://www.washingtonpost.com/world/national-security/trumps-latest-tweets-could-hurt-effort-to-restore-travel-ban/2017/06/05/c8eb5940-49e8-11e7-bc1b-fddbd8359dee_story.html", "id": "56", "title": "Trump’s latest tweets will probably hurt effort to restore travel ban", "text": "President Trump on Monday derided the revised travel ban as a “watered down” version of the first and criticized his own Justice Department’s handling of the case — potentially hurting the administration’s defense of the ban as the legal battle over it reaches a critical new stage.\n\nTrump in a tweet called the new ban “politically correct,” ignoring the fact that he himself signed the executive order replacing the first ban with a revised version that targeted six, rather than seven, Muslim-majority countries and that blocked the issuance of new visas rather than revoking current ones.\n\nTrump said the Justice Department should seek a “much tougher version” and made clear — despite his press secretary’s past remarks to the contrary — that the executive order is a “ban,” not a pause on some sources of immigration or an enhanced vetting system.\n\n“People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!” Trump wrote.\n\n[Federal appeals court maintains freeze of Trump’s travel ban. Attorney general vows Supreme Court appeal.]\n\nPresident Trump posted tweets defending his travel ban and saying that he thinks even harsher measures might be necessary for U.S. security. (Mike Theiler/Reuters)\n\nThe president’s tweets could significantly damage his administration’s effort to restore the ban, which has been put on hold by two federal courts.\n\nNext week, those suing are expected to file arguments on the matter with the Supreme Court, and Trump’s latest remarks will surely be part of their briefs. The administration appealed to the nation’s highest court after the U.S. Court of Appeals for the 4th Circuit upheld the freeze on the ban last month.\n\nNeal Katyal, the lawyer who argued for the challengers in the U.S. Court of Appeals for the 9th Circuit, wrote on Twitter, “Its kinda odd to have the defendant in HawaiivTrump acting as our co-counsel. We don’t need the help but will take it!” He also wrote that he was “waiting now for the inevitable cover-my-tweet posts from him that the Solicitor General will no doubt insist upon.”\n\n\n\nEven George Conway, a prominent lawyer who recently took himself out of the running to lead the Justice Department’s Civil Division and who is the husband of top Trump adviser Kellyanne Conway, posted on Twitter that the remarks might hurt the legal case.\n\n“These tweets may make some ppl feel better, but they certainly won’t help OSG get 5 votes in SCOTUS, which is what actually matters. Sad,” he wrote, using abbreviations for Office of Solicitor General and the Supreme Court.\n\n[Conway: President’s tweets ‘certainly won’t help’]\n\nA Justice Department spokesman declined to comment. White House spokeswoman Sarah Huckabee Sanders said the president was “not at all” concerned that his tweets might muddy the legal case, and his attention was instead on the substance of his executive order. She said she was not aware of any vetting of his tweets by lawyers or aides.\n\nView Graphic How Trump’s travel ban broke from the normal executive order process\n\n“The president is very focused on exactly what that order spells out, and that’s protecting Americans, protecting national security, and he has every constitutional authority to do that through that executive order and he maintains that, and that position hasn’t changed in the slightest,” Sanders said.\n\nTrump himself indicated late in the day that he had no intention of backing down from his early morning sentiments, tweeting, “That’s right, we need a TRAVEL BAN for certain DANGEROUS countries, not some politically correct term that won’t help us protect our people!”\n\nFederal judges across the country have focused acutely on Trump’s own comments in ordering that the ban be frozen, determining that the president’s words expose the measure as being a tool for discrimination disguised as a national security directive.\n\n[President Trump’s lawyers on revised travel ban repeatedly asked about campaign promises]\n\nThe majority opinion in the 4th Circuit maintaining the freeze on the ban quoted extensively from Trump’s tweets and media interviews, and from those of his advisers. On the campaign trail, Trump called for a “total and complete shutdown of Muslims entering the United States.”\n\nOmar C. Jadwat, the American Civil Liberties Union lawyer who argued the case in the 4th Circuit, wrote that Trump’s tweets amounted to “a promise: let me do this and I’ll take it as license to do even worse.” In an interview, Jadwat said the president’s tweets “seem to undermine the picture the government’s been trying to paint.”\n\n“I can’t say for sure what our brief is going to look like, but this stuff seems relevant,” Jadwat said.\n\nGovernment lawyers have sought to convince judges that they should not consider the president’s statements but instead limit their analysis to the text of the ban. They have also sought to portray the president’s words as campaign trail rhetoric, and noted that many of the remarks in question — though not all — came before Trump was elected.\n\n“We shouldn’t start down the road of psychoanalyzing what people meant on the campaign trail,” acting solicitor general Jeffrey B. Wall told judges at a recent court hearing in the 9th Circuit.\n\nTrump’s latest tweets — which were later set to dramatic music and posted in a video on his Facebook page — will provide those challenging the ban more examples of post-election remarks and a stronger case that Trump’s revised travel ban had the same purpose as the original version.\n\nThat version, which unilaterally revoked the visas of tens of thousands of people from seven Muslim-majority countries, was seen as much harder to defend because it was more onerous and had a provision in the text that seemed designed to exempt Christian travelers.\n\nTrump tweeted Monday that the Justice Department “should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted” to the Supreme Court. In addition to creating possible headaches in court, that misstates the process. Trump signed the executive order imposing the ban. The Justice Department defends his policies in court.\n\nTrump also wrote that the Justice Department “should ask for an expedited hearing of the watered down Travel Ban before the Supreme Court — & seek much tougher version!” The Supreme Court would not be the body to enact a ban; the justices will be weighing whether Trump’s order is constitutional.\n\nThe travel ban seems to have been on Trump’s mind since the terrorist attack in London on Saturday, when Trump wrote on Twitter, “We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!”\n\n[Trump ramps up push for travel ban even as opposition hardens]\n\nLegal analysts were quick to point out that the president was hurting his own case.\n\n“In case it’s not obvious, these will only undermine the government’s case before #SCOTUS for both a stay & on the merits of the #TravelBan,” University of Texas law professor Stephen Vladeck posted on Twitter. “These will also go a long way toward mooting debate over use of campaign statements; no need when, as President, he still says these things.”\n\nTrump also wrote on Twitter that the administration was already “EXTREME VETTING” travelers coming into the United States — which he said was necessary to keep the country safe because courts are “slow and political!” The Department of Homeland Security has previously suggested such vetting was taking place, but that, too, seems to undercut the Justice Department’s legal position.\n\nThe travel ban was supposed to be a temporary measure, designed to afford the administration time to conduct a review and decide what new vetting procedures were necessary. When a federal judge in Hawaii ordered the ban frozen, though, the government interpreted his order as stopping even that review — and the judge declined to clarify that it did not.\n\nWall told the 4th Circuit last month that the administration had “put our pens down” and had “done nothing to review the vetting procedures for these countries.”\n\nIf the administration already has implemented new vetting procedures, that would seem to call into question the necessity of a temporary ban. Legal analysts, though, have previously said that president’s remarks indicate he might not view the measure as temporary — despite what the text of the executive order says.\n\nRead more:\n\nGraphic: What Trump changed in the new travel ban\n\nTrump was terrorized by the London attack, while Britain stood firm", "authors": [], "publish_date": "2017-06-05", "source": "washingtonpost", "top_words": ["travel", "hurt", "wrote", "tweets", "trump", "ban", "vetting", "court", "order", "trumps", "restore", "justice", "latest", "probably", "effort"], "summary": "“People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!” Trump wrote.\n[Federal appeals court maintains freeze of Trump’s travel ban.\nPresident Trump posted tweets defending his travel ban and saying that he thinks even harsher measures might be necessary for U.S. security.\n[President Trump’s lawyers on revised travel ban repeatedly asked about campaign promises]The majority opinion in the 4th Circuit maintaining the freeze on the ban quoted extensively from Trump’s tweets and media interviews, and from those of his advisers.\nWe need the Travel Ban as an extra level of safety!”[Trump ramps up push for travel ban even as opposition hardens]Legal analysts were quick to point out that the president was hurting his own case."}