{"url": "https://www.washingtonpost.com/world/national-security/whats-next-for-trumps-travel-ban-and-vetting-procedures/2017/06/27/e97aa93e-5b65-11e7-9fc6-c7ef4bc58d13_story.html", "id": "51", "title": "What’s next for Trump’s travel ban and vetting procedures", "text": "Travelers walk near a sign for international arrivals at the Seattle-Tacoma International Airport. The Supreme Court said that President Trump’s ban on U.S. entry by citizens of Iran, Libya, Somalia, Sudan, Syria and Yemen can be enforced if those visitors lack a “credible claim of a bona fide relationship with a person or entity in the United States.” (Ted S. Warren/AP)\n\nThe Trump administration got some of what it wanted when the Supreme Court decided to allow a scaled-back version of the president’s travel ban to take effect.\n\nBut the court’s ruling also put pressure on officials to press ahead with their review of the information other countries are able to gather on potential U.S.-bound travelers — which might ultimately produce more rigorous vetting procedures or a completely new ban.\n\nThe U.S. already has stepped up vetting of foreigners, having consular officers around the world ask visa applicants for their social media handles and requiring applicants to list 15 years of travel history, including the source of funding for their trips. Trump’s travel ban, though, contemplates even more-restrictive measures, and the president himself has, counter to the representation of Justice Department lawyers, suggested that the measure is not a mere “pause” for assessment.\n\n“People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!” Trump wrote on Twitter this month.\n\n[What the Supreme Court’s travel-ban ruling means]\n\n(Bastien Inzaurralde/The Washington Post)\n\nThe Supreme Court’s decision Monday means that — at least for now — the administration can decline to issue visas to residents of six majority-Muslim countries, provided that those seeking the visas “lack any bona fide relationship with a person or entity in the United States.” That means those from the six countries who have family members in the United States, job offers or school acceptance letters should be able to get in, although others without such ties should not.\n\nThe court said the same standard should be applied to refugees who also would have been blocked under Trump’s ban.\n\nTrump indicated in a recent memo that he would begin enforcing his ban 72 hours after “all applicable injunctions are lifted or stayed.”\n\nIn a statement, Trump called the ruling “a clear victory for our national security” and said it “allows me to use an important tool for protecting our Nation’s homeland.” State, Justice Department and Homeland Security officials have said they are still reviewing and discussing the decision to see how it should be implemented, and a Justice Department official said lawyers were readying for more possible legal challenges on the question of who had a “bona fide” U.S. tie.\n\n[Trump said dangerous people might be pouring in without his travel ban. But he’s not rushing to restore it.]\n\nThe court’s decision did not offer finality. Although the justices partially lifted lower courts’ injunctions on Trump’s ban, they said they would take up the case fully in their October term. The ban on entry to the United States was supposed to have been temporary: 90 days for citizens of Iran, Sudan, Somalia, Libya, Yemen and Syria, and 120 days for refugees. By the time the court hears the case, the landscape almost certainly will have shifted.\n\nWithin 20 days of the ban’s taking effect, the secretary of homeland security is supposed to submit to Trump a report on the information needed from countries to adjudicate applications for entry to the United States, and a list of which countries do not provide such information. The countries on the list are then supposed to be given 50 days to begin providing the required information.\n\nIf they do not, they could be included in a proclamation that would block “appropriate categories” of their citizens from coming to the United States, according to the executive order.\n\nJonathan Meyer, who was a deputy general counsel in the Department of Homeland Security under President Barack Obama and now works in private practice at the Sheppard Mullin law firm, said the Trump administration could make the argument that “they still can’t do [the review] because all of the injunctions haven’t been lifted,” but he expected that the administration would press ahead.\n\nThe Supreme Court wrote: “We fully expect that the relief we grant today will permit the Executive to conclude its internal work and provide adequate notice to foreign governments” within 90 days.\n\nThe conclusion of that review could mean increased vetting: for example, not just asking travelers for their social media profiles, but also their passwords or other data, Meyer said. And the executive order, he said, contemplated “some sort of longer-lasting ban or partial ban” on nationals from countries that could not provide the requested information.\n\nSome of the countries on the list are experiencing military conflicts — which would probably make providing the requested data difficult.\n\nA Department of Homeland Security spokeswoman did not provide comment.\n\nThe American Civil Liberties Union has suggested — and the Supreme Court said it would consider — whether the case became moot on June 14. That is 90 days from when Trump signed his revised entry ban. The Justice Department had in the past argued that officials felt barred by a Hawaii judge’s injunction from doing the reviews.\n\n“We have put our pens down,” acting U.S. Solicitor General Jeffrey B. Wall told the U.S. Court of Appeals for the 4th Circuit in May, adding that the administration had “done nothing to review the vetting procedures for these countries.” A different federal appeals court would later clarify that the administration could go ahead with its review work.", "authors": [], "publish_date": "2017-06-27", "source": "washingtonpost", "top_words": ["travel", "courts", "trump", "ban", "supreme", "vetting", "court", "united", "trumps", "whats", "procedures", "countries", "states", "department", "administration"], "summary": "“People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!” Trump wrote on Twitter this month.\nThe court said the same standard should be applied to refugees who also would have been blocked under Trump’s ban.\nAlthough the justices partially lifted lower courts’ injunctions on Trump’s ban, they said they would take up the case fully in their October term.\nAnd the executive order, he said, contemplated “some sort of longer-lasting ban or partial ban” on nationals from countries that could not provide the requested information.\nThe American Civil Liberties Union has suggested — and the Supreme Court said it would consider — whether the case became moot on June 14."}