{"url": "https://www.washingtonpost.com/opinions/trumps-travel-ban-is-a-gift-to-irans-rulers/2017/01/29/a85b7d7c-e642-11e6-b82f-687d6e6a3e7c_story.html", "id": "63", "title": "Trump’s travel ban is a gift to Iran’s rulers", "text": "Marian Vayghan reacts after her uncle is released from a detention center for deportation back to Iran as people protest President Trump’s travel ban from Muslim-majority countries at Los Angeles International Airport on Jan. 28. (Patrick T. Fallon/Reuters)\n\nHadi Ghaemi is the founder and executive director of the Campaign for Human Rights in Iran.\n\nPresident Trump’s travel ban on Iranians is a gift to the Islamic republic and its hard-line rulers. It will not deter terrorism on U.S. soil. Not a single terrorist involved in the 9/11 attacks or other fatal terrorist attacks in the United States since then has been of Iranian origin.\n\nInstead, Trump’s policy is a collective punishment of a diverse and changing nationality, and will ironically serve the purposes of Iran’s hard-line rulers.\n\nWho are the Iranians who will be harmed by this policy?\n\nI have been helping Iranian refugees reach safety for more than a decade. A recent case is that of Reza, his wife and their 3-year-old daughter. Reza, whose full name I cannot use for security reasons, is a victim of torture at the hands of Iranian Revolutionary Guards at Tehran’s notorious Kahrizak prison.\n\nReza fled to Turkey in 2013, and after years waiting, he and his family were recently approved for resettlement in the United States. He hoped to arrive sometime this year, once security vetting by U.S. agencies was complete.\n\nHis hopes are shattered. He and his family are suddenly rendered effectively stateless and homeless, with nowhere to turn. Instead of welcoming a regime opponent to the United States, we are effectively throwing Reza and his family back into the treacherous hands of Iranian Revolutionary Guards.\n\n(Reuters)\n\nThe Iranian refugees who have settled in the United States over the past decade are chiefly victims of the regime’s harsh crackdowns, including students, journalists, women’s rights activists and lawyers. These are the Iranians who have vocally and ferociously opposed the Islamic republic.\n\nAnother Iranian who was on her way to the United States — but now will likely never reach here — is a young women’s rights activist. For years she has led a movement to change Iran’s discriminatory practices toward women, anonymously through social media.\n\nHer dream is to strengthen her activism and knowledge base by attending a U.S. human rights program, and she has just been accepted to an Ivy League university. Without the travel ban, she would be on her way to fulfilling her dream and upon return to Iran would bring back valuable experience and knowledge for her fight against gender discrimination.\n\nBut now the door has been slammed in her face. She and her generation of women’s rights activists in Iran will continue their work, make no mistake, but they will have to struggle harder to break out of their isolation and confront their oppressive rulers.\n\nIndeed, the people who are most likely to travel between Iran and the United States — the people most affected by any ban — are Iranians who hold Western values of moderation and tolerance and believe in open political and economic systems. It’s in the interest of the United States to strengthen these values in Iran however it can.\n\nIsolating Iran from engagement with the West is not the way to fortify the forces of moderation in Iran — and it is exactly the opposite of strategy adopted by previous presidents, such as Ronald Reagan, who conscientiously encouraged nongovernmental and cultural interaction between citizens of the Soviet Union and its satellite countries and the United States, even at the height of the Cold War.\n\nThe Iranian government thrives on isolating its population and choking off criticism. But Iran’s young population has been striving to break free of this isolation. In Iran, public opinion of the United States is much more favorable than in any other country in the Middle East and North Africa.\n\nBy excluding all Iranians, Trump is only making it harder for the most promising elements of Iranian society to stand up to their repressive system and change their country for the better.\n\nThis policy will extend the Islamic republic’s longevity, disrupt the lives of 1.5 million Iranian Americans and fan the flames of anti-Americanism in the region. None of these developments will help secure our country from terrorism.", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["gift", "travel", "iran", "ban", "rulers", "united", "iranian", "trumps", "iranians", "rights", "irans", "states", "way", "womens"], "summary": "Marian Vayghan reacts after her uncle is released from a detention center for deportation back to Iran as people protest President Trump’s travel ban from Muslim-majority countries at Los Angeles International Airport on Jan. 28.\nPresident Trump’s travel ban on Iranians is a gift to the Islamic republic and its hard-line rulers.\nNot a single terrorist involved in the 9/11 attacks or other fatal terrorist attacks in the United States since then has been of Iranian origin.\nInstead, Trump’s policy is a collective punishment of a diverse and changing nationality, and will ironically serve the purposes of Iran’s hard-line rulers.\nReza fled to Turkey in 2013, and after years waiting, he and his family were recently approved for resettlement in the United States."}