{"url": "https://www.washingtonpost.com/blogs/right-turn/wp/2017/01/30/trumps-travel-ban-shows-staggering-incompetence/", "id": "65", "title": "Trump’s travel ban shows staggering incompetence", "text": "\n\nPeople gather at O’Hare International Airport in Chicago on Saturday to protest against the travel ban imposed by President Trump’s executive order. (Kamil Krzaczynski/Reuters)\n\nWe don’t want to minimize how objectionable is the concept that underlies the executive order on refugees and immigration. However, the executive order’s lack of coherence and common sense leaves us dumbfounded.\n\nWe have already heard concerns from members of Congress, former intelligence and military officials and national security experts that the order sweeps up nationals from the listed countries who risked life and limb (literally) to help the American military as guides, translators, etc.\n\nWho else is swept up?\n\nPro Publica reports on a doctor at the Cleveland Clinic:\n\nHours after landing in New York on Saturday, a doctor at the prestigious Cleveland Clinic was forced to leave the country based on an executive order issued by President Donald Trump that bans visitors from seven predominantly Muslim countries for 90 days. Her flight to Saudi Arabia took off minutes before a federal judge in New York put a temporary stay on turning back people in such situations. Suha Abushamma, 26, is in the first year of an Internal Medicine residency program at the clinic and held an H-1B visa for workers in “specialty occupations.” Born and raised in Saudi Arabia, she holds a passport from Sudan, one of the seven countries from which Trump barred visitors. . . . “I’m only in this country to be a doctor, to work and to help people — that’s it,” she said. “There’s no other reason.”\n\nThe ban, signed on Holocaust Remembrance Day, may bar Israelis from coming to the United States, according to CNN:\n\nThe [Israeli Foreign] Ministry has reached out to the US State Department and the US Consulate in Jerusalem, but deputy spokesperson Michal Maayan said the Ministry has not yet received a response. Israel is home to approximately 145,000 Jews born in the seven countries listed in Trump’s executive order, according to Israel’s Central Bureau of Statistics. Of those, approximately 54,000 were born in Iraq and 45,000 were born in Iran. They carry Israeli passports, but their place of birth is listed as one of the countries mentioned in the order.\n\nThere are also journalists — who are no concern of the anti-First Amendment White House, but who are critical to coverage of the war against Islamist terrorism. Not only would the ban bar nationals from the designated countries, but also reports suggest that the administration is “discussing the possibility of asking foreign visitors to disclose all websites and social media sites they visit, and to share the contacts in their cell phones. If the foreign visitor declines to share such information he or she could be denied entry.”\n\nThat puts journalists in a no-win situation. Margaux Ewen, advocacy and communications director for the North America office of Reporters Without Borders (RSF), tells me, “RSF condemns the latest travel ban with regards to any journalists that may be affected by it, whether they are nationals of the listed countries or have traveled to those countries in the exercise of their profession.” She makes clear that the possibility journalists may be required to turn over contacts poses a danger to them and their sources. “Under the previous administration, we have seen the detention of many journalists at the US border which very often includes the search and seizure of their mobile devices, which is a serious threat to the integrity and confidentiality of their sources. This new travel ban threatens to subject even more journalists to border searches and detentions that could severely compromise their sources. Should they refuse to allow access to their devices they could face deportation.” In the end, however, the United States is the damaged party because the country would be deprived of “valuable news reporting on topics that are of interest to the American people.” Maybe that is the point, at least in part, of the contemplated policy.\n\nIn constitutional law, the lowest level of scrutiny is whether the law has a “reasonable basis.” There is none in this case. It is under- and over-inclusive, impairs national security, brings disrepute to the United States, creates a host of innocent victims and deprives the United States of news reporters and health-care professionals. It may be the worst executive action undertaken since the one in 1942 ordering the internment of Japanese Americans.", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["executive", "travel", "journalists", "born", "visitors", "shows", "ban", "united", "states", "trumps", "countries", "listed", "order", "incompetence", "staggering"], "summary": "People gather at O’Hare International Airport in Chicago on Saturday to protest against the travel ban imposed by President Trump’s executive order.\n(Kamil Krzaczynski/Reuters)We don’t want to minimize how objectionable is the concept that underlies the executive order on refugees and immigration.\nIsrael is home to approximately 145,000 Jews born in the seven countries listed in Trump’s executive order, according to Israel’s Central Bureau of Statistics.\nThis new travel ban threatens to subject even more journalists to border searches and detentions that could severely compromise their sources.\nIt is under- and over-inclusive, impairs national security, brings disrepute to the United States, creates a host of innocent victims and deprives the United States of news reporters and health-care professionals."}