{"url": "https://www.washingtonpost.com/news/on-leadership/wp/2017/01/30/deeply-concerned-corporate-america-responds-to-trumps-travel-ban/", "id": "66", "title": "‘Deeply concerned’: Corporate America responds to Trump’s travel ban", "text": "\n\nAjay Banga, CEO of MasterCard, wrote to employees that he is \"deeply concerned\" about Trump's travel ban. (Jacquelyn Martin/AP Photo)\n\nA chorus that began in Silicon Valley is gaining voices across Corporate America, as more business leaders from other industries speak out against President Trump's travel ban prohibiting entry of migrants from seven predominantly Muslim countries or touted their commitments to diversity.\n\nSome were relatively subdued, using the moment to reaffirm corporate values. (\"We want every one of you to know of our unwavering commitment to the dedicated people working here at JPMorgan Chase,\" the bank's operating committee, which includes CEO Jamie Dimon, wrote in a memo.) Others were specific, announcing plans to hire refugees, as Starbucks CEO Howard Schultz did Sunday (\"There are more than 65 million citizens of the world recognized as refugees by the United Nations, and we are developing plans to hire 10,000 of them over five years in the 75 countries around the world where Starbucks does business,\" Schultz said in a letter to employees.).\n\n[Taking aim at Trump policies, Starbucks CEO vows to hire 10,000 refugees over five years]\n\nOthers openly opposed the president's order. Nike CEO Mark Parker wrote that the company's values of diversity \"are being threatened by the recent executive order in the U.S. banning refugees, as well as visitors, from seven Muslim-majority countries. This is a policy we don't support.\" Goldman Sachs CEO Lloyd Blankfein echoed that sentiment, saying in a voicemail to employees that Goldman does not support the policy, \"and I would note that it has already been challenged in federal court, and some of the order has been enjoined at least temporarily.\"\n\nThe growing number of statements objecting to the ban may indicate Corporate America is sounding a more critical tune after months of either touting the jobs they will create following Trump's election or remaining quiet as the president, who has shown no restraint at using Twitter to lash out at critics, transitioned into his first term.\n\n\"Every single CEO of any company of magnitude is thinking and feeling pressure and trying to decide what to do\" to speak out about the ban, said Sydney Finkelstein, a professor at Dartmouth's Tuck School of Business. \"Some are speaking out naturally. Others are being more deliberate and strategic and recognize there could be a downside.\"\n\nTechnology industry executives, many of whom were critical of Trump during the campaign and whose workforces are especially dependent on high-skilled visas, were first out of the gate with criticism. CEOs including Google's Sundar Pichai, Apple's Tim Cook and Netflix's Reed Hastings expressed their concern about the ban. \"Trump’s actions are hurting Netflix employees around the world, and are so un-American it pains us all,\" Hastings wrote in a statement.\n\nYet while Silicon Valley executives may have given the rest of Corporate America air cover to join in the critique, the groundwork for speaking out on political issues was laid long before Trump's travel ban. In recent years, business leaders have increasingly engaged on social issues or political hot-buttons, whether the topic was gender pay, racial justice or LGBTQ rights.\n\nCorporations were at the forefront of state-level fights to push back on legislation seen as limiting gay and transgender rights; more than 200 corporations signed on to a letter by the Human Rights Campaign opposing North Carolina's law limiting some transgender rights. Some, including PayPal and Deutsche Bank, even chose not to expand their businesses in the state because of the controversial bill.\n\n\"Employees do hold their CEOs and leadership accountable for defending those values when the line has been crossed,\" said Leslie Gaines-Ross, Weber-Shandwick's chief reputation strategist. After years of communicating and focusing on diversity and inclusion as a corporate value, she says, CEOs \"do feel under a lot of pressure right now, and are trying to figure out what to say about Trump’s ban and how to speak to their employees. They’ve set a high bar and an expectation that diversity really matters. That is adding a lot of fire power to getting CEOs to speak up.\"\n\nSome of the statements from CEOs have included not only concerns but personal reflections. \"I am deeply concerned, as many of you are, with this fracture in our society,\" wrote MasterCard CEO Ajay Banga, who was born in India. \"I am an immigrant into this wonderful country. I came here midway through my career and have over the past years made this my home and pledged my allegiance to all that the Constitution stands for.\"\n\nChobani CEO Hamdi Ulukaya, who has come under fire from some on the extreme right for his hiring and advocacy of refugees, wrote to employees: \"While there’s still some confusion about the immediate impact of this action, I’ve directed our Legal and HR teams to explore whether any member of our company or their family members are affected and provide whatever assistance they need. We’ll have their backs every day and every step of the way.\"\n\n['Apple would not exist without immigration:' Companies at Trump's tech summit react to his travel ban]\n\nOther statements reflected an urgency to reassure employees who had spoken up with concerns. \"I want to thank all those who have reached out to me in the last 48 hours or so sharing your views,\" wrote Tim Ryan, U.S. chairman of PwC. \"I have heard heartbreaking stories of people who had to cancel plans to visit loved ones or have friends who were outside the country when the order was issued and are not able to re-enter. Some have also written simply to share their fear, concern and desire to help those who need help.\"\n\nHe also suggested specific actions. \"I’m asking all of us to be guided by our values, to support each other and to listen and support those who need it,\" Ryan wrote. \"One lesson I've learned over the past few months is that when there are difficult issues affecting our people, silence isn't an option. ... In the meantime, I ask you to treat each other with care.\"\n\nSchultz echoed similar themes. \"If there is any lesson to be learned over the last year, it’s that your voice and your vote matter more than ever,\" Schultz wrote. \"Starbucks is doing its part; we need you to use the collective power of your voices to do the same while respecting the diverse viewpoints of the 90 million customers who visit our stores in more than 25,000 locations around the world.\"\n\nRead also:\n\nCEOs are getting more political, but consumers aren't buying it\n\nLike On Leadership? Follow us on Facebook and Twitter, and subscribe to our podcast on iTunes.", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["america", "travel", "responds", "wrote", "values", "ban", "corporate", "deeply", "refugees", "trumps", "ceo", "concerned", "ceos", "employees"], "summary": "Ajay Banga, CEO of MasterCard, wrote to employees that he is \"deeply concerned\" about Trump's travel ban.\n(Jacquelyn Martin/AP Photo)A chorus that began in Silicon Valley is gaining voices across Corporate America, as more business leaders from other industries speak out against President Trump's travel ban prohibiting entry of migrants from seven predominantly Muslim countries or touted their commitments to diversity.\nSome were relatively subdued, using the moment to reaffirm corporate values.\nYet while Silicon Valley executives may have given the rest of Corporate America air cover to join in the critique, the groundwork for speaking out on political issues was laid long before Trump's travel ban.\n\"I am deeply concerned, as many of you are, with this fracture in our society,\" wrote MasterCard CEO Ajay Banga, who was born in India."}