{"url": "https://www.washingtonpost.com/news/post-nation/wp/2017/03/01/trump-argues-for-revised-travel-ban-by-citing-attacks-carried-out-by-u-s-citizens/", "id": "62", "title": "Trump argues for revised travel ban by citing attacks carried out by U.S. citizens", "text": "\n\nPresident Trump speaks to a joint session of Congress on Tuesday. (Pablo Martinez Monsivais/Associated Press)\n\nPresident Trump did not explicitly mention his now-frozen travel ban during his address to Congress on Tuesday night, nor did he bring up the revised immigration order he was expected to sign this week. But during the only portion of his speech dealing with terrorism, Trump left no doubt he was laying down an argument for a new ban.\n\n“My administration has been working on improved vetting procedures, and we will shortly take new steps to keep our nation safe — and to keep out those who would do us harm,” Trump said.\n\nTo bolster his case, Trump did something he and his aides have done before: He pointed to deadly attacks that the new ban almost certainly wouldn’t have been able to stop.\n\n“We are also taking strong measures to protect our nation from radical Islamic terrorism,” Trump said. “According to data provided by the Department of Justice, the vast majority of individuals convicted for terrorism-related offenses since 9/11 came here from outside of our country. We have seen the attacks at home — from Boston to San Bernardino to the Pentagon and, yes, even the World Trade Center.”\n\n[Trump and his aides keep justifying the entry ban by citing attacks it couldn’t have prevented]\n\nTrump’s comments implied that “improved vetting procedures” would keep terrorists out. Yet the attacks he cited — the Boston Marathon bombing, the shooting rampage in San Bernardino, Calif., and the 9/11 attacks — were all carried out by U.S. citizens or people born in countries not included in his original ban and not expected to be included in the revised order.\n\nThe male San Bernardino shooter was born in Illinois; his wife, with whom he carried out the attack, was born in Pakistan. (The FBI said the male gunman had been plotting attacks for years before he met her.)\n\nThe Boston Marathon bombers were brothers born in Russia and Kyrgyzstan. Neither country was mentioned in Trump’s original ban, nor are they expected to be on the revised version; the younger of the brothers, who was sentenced to death for the bombing, was a naturalized U.S. citizen. None of the 9/11 hijackers who attacked the World Trade Center and the Pentagon in 2001 was from countries on the original ban list. Most were from Saudi Arabia, while the rest were from Egypt, Lebanon and the United Arab Emirates.\n\n[Revised Trump immigration order, delayed after speech, will not ban citizens from Iraq]\n\nTrump’s original travel ban barred citizens of seven Muslim-majority countries — Iraq, Iran, Sudan, Somalia, Syria, Libya and Yemen — as well as all refugees from entering the United States. The revised version is expected to lower that to six countries, removing Iraq from the list.\n\nThere’s also another problem with Trump’s promise to “keep out those who would do us harm.” Since the 9/11 attacks, every deadly jihadist attack inside the United States was carried out by a U.S. citizen or legal resident, according to New America, a Washington-based nonprofit group.\n\n“Far from being foreign infiltrators, the large majority of jihadist terrorists in the United States have been American citizens or legal residents,” the group said in a report on its findings.\n\nAlthough Trump’s original order also froze refugee admissions, refugees from the seven countries in that ban have been responsible for no successful attacks in the United States between 1975 and 2015, according to a report published by the Cato Institute, a libertarian think tank.\n\nThat, though, was before Abdul Razak Ali Artan, a refugee from Somalia, plowed his car into a crowd on the Ohio State University campus late last year, injuring 11. The FBI has alleged Artan might have been inspired by radical cleric Anwar al-Awlaki and the Islamic State, which claimed responsibility for the attack. The chair of the Senate Judiciary Committee has alleged Artan should have received more thorough vetting when his family was seeking refu­gee status in the United States years earlier.\n\n[New travel ban will exempt current visa holders, sources say]\n\nStill, Trump’s comment that “the vast majority” of people convicted of terrorism-related offenses since 9/11 were not from the United States could be true, and the Justice Department backed him up in a statement Wednesday.\n\n“Since 9/11, convictions have been obtained against over 500 defendants for terrorism or terrorism-related charges in federal courts,” the department said. “A review of that information revealed that a substantial majority of those convicted were born in foreign countries.”\n\nA spokesperson said this list of people convicted includes everyone charged in a terrorism probe in that span, including those who plotted attacks and never carried them out as well as those who sought to travel overseas or fund terrorist groups abroad. The list also includes people facing charges that emerge from terrorism probes but were not specifically related to terrorism.\n\nTrump’s comment and the department’s statement do not specifically break out the countries implicated in the ban. The Department of Homeland Security, however, assessed that question specifically in a report analyzing the threat posed by those countries.\n\nHomeland Security Secretary John Kelly. (Luis Soto/AP)\n\nSince the beginning of the Syrian conflict in March 2011, the report said, more than half of the 82 people who died in the pursuit of or were convicted of any terrorism-related offense inspired by a foreign terrorist organization were native-born U.S. citizens.\n\nThat analysis was based on a review of Department of Justice press releases. Of the people who were convicted of or died in pursuit of terrorism, the review found eight were from the countries implicated in Trump’s now-frozen travel ban, specifically Somalia, Iraq, Iran, Sudan and Yemen. None were from Syria. The report did not specifically mention Libya.\n\n[The government now says 746 people were held due to the travel ban. Here’s why that number keeps changing.]\n\nJudges and others have expressed skepticism that the ban is necessary for national security reasons. U.S. District Judge Leonie M. Brinkema said at a court hearing there was “startling evidence” from national security professionals that the order “may be counterproductive to its stated goal” of keeping the nation safe. Ten former high-ranking diplomatic and national security officials affixed their names to an affidavit declaring there was “no national security purpose” for a complete barring of people from the seven affected countries.\n\nBut Trump and others have pressed the case. Trump claimed that the judge who froze the first ban “put our country in such peril” and warned that “if something happens blame him and court system,” strongly implying that the order was needed to avert a terrorist attack. Homeland Security Secretary John F. Kelly told a congressional committee it was “entirely possible” that dangerous people were entering the United States with the order on hold, and that officials might not know until it was too late.\n\n“Not until the boom,” he said when asked during a House Homeland Security committee hearing whether he could provide evidence of a dangerous person coming into the country since the ban was suspended.\n\nIt is unclear when Trump will sign the revised ban. He was originally expected to do so on Wednesday, but that was postponed after Trump’s speech last night, the third time his administration has delayed the matter.\n\nFurther reading:\n\nTrump defended original executive order: ‘This is not a Muslim ban’\n\nFederal appeals court rules 3 to 0 against Trump on travel ban\n\nDHS report casts doubt on need for Trump travel ban", "authors": [], "publish_date": "2017-03-01", "source": "washingtonpost", "top_words": ["travel", "attacks", "argues", "revised", "trump", "citizens", "ban", "carried", "security", "order", "united", "trumps", "countries", "states", "citing"], "summary": "[Revised Trump immigration order, delayed after speech, will not ban citizens from Iraq]Trump’s original travel ban barred citizens of seven Muslim-majority countries — Iraq, Iran, Sudan, Somalia, Syria, Libya and Yemen — as well as all refugees from entering the United States.\n“Far from being foreign infiltrators, the large majority of jihadist terrorists in the United States have been American citizens or legal residents,” the group said in a report on its findings.\nThe chair of the Senate Judiciary Committee has alleged Artan should have received more thorough vetting when his family was seeking refu­gee status in the United States years earlier.\n[The government now says 746 people were held due to the travel ban.\nFurther reading:Trump defended original executive order: ‘This is not a Muslim ban’Federal appeals court rules 3 to 0 against Trump on travel banDHS report casts doubt on need for Trump travel ban"}