{"url": "https://www.washingtonpost.com/news/post-nation/wp/2017/02/01/tale-of-an-iraqi-woman-dying-because-of-trump-travel-ban-unravels/", "id": "60", "title": "Tale of an Iraqi woman dying because of Trump travel ban unravels", "text": "Man who claimed mom died in Iraq after Trump's ban lied, Imam confirms https://t.co/wNQchf7lpc pic.twitter.com/wQsUUFJIqb — FOX 2 Detroit (@FOX2News) February 1, 2017\n\nThe gut-wrenching story of the Iraqi family spread quickly across the Internet on Tuesday, depicting what seemed to be among the most calamitous examples of a family torn apart by President Trump’s order temporarily barring people from seven countries from entering the United States. A Michigan man claimed his sick Iraqi mother died a day after being turned away from traveling to the U.S. as a result of the executive order.\n\n“They destroyed us,” the man, Mike Hager, told Detroit’s Fox 2, claiming that if his mother had made it to the United States as scheduled, she would have received the medical treatment necessary to survive. A number of national news outlets published the account, linking to the original interview.\n\nBut late Tuesday night, the story began to fall apart. The local Fox affiliate “received many questions about the validity of Hager’s claims that his mother died waiting to be approved to come home,” it wrote. On Wednesday afternoon, the Fox station published a story with the headline: “Man who claimed mom died in Iraq after Trump’s ban lied, Imam confirms.”\n\nSources close to the family also told The Washington Post that the man appears to have fabricated the tale.\n\n[Judge halts deportations as refugee ban causes worldwide furor]\n\nA leading imam in Dearborn, Mich., who oversees a congregation of primarily Iraqi refugees, including Hager’s family, said Hager’s mother actually died at least five days before Trump’s executive order was put into place.\n\nThe imam, Husham Al-Husainy, said Hager sent him a message last month informing him that he would be traveling to Iraq to see his sick mother, Naimma. On Jan. 22 — two days after Trump was inaugurated — community members and posts on Facebook informed Al-Husainy of the woman’s death. She had been living in Iraq for quite some time, and she died in Karbala, Iraq of kidney failure, he said.\n\nAl-Husainy, leader of the Karbalaa Islamic Educational Center in Dearborn, said he helped lead a number of community prayer services in her honor over the course of the next three days. Al-Hajar had lived in Dearborn on and off since 1995.\n\n“She is a very respected lady,” he said. “I know them all very well and they are a very respected family.”\n\nWhen reached by telephone on Wednesday, Hager told The Post that he could not talk because he was dealing with family matters, and he later did not answer his phone. He told Fox, in a text message: “I did not make anything up.”\n\nHager, a Dearborn resident who is also listed in public records with the name Mohammed Al-Hajar, reportedly fled Iraq with his family during the Gulf War. After spending four years in a refugee camp, they were resettled in the U.S., Fox 2 reported. A few years later, he decided to return to his home country as an American serviceman, working with the U.S. Special Forces as an interpreter and adviser.\n\nHis cousin, Tony Al-Shammeree, also an Iraqi refugee and American citizen living in the Detroit suburbs, stood by the family’s story in an interview with The Post.\n\nHe claimed that “Trump killed her,” and said the family was mourning the loss of his aunt. To his knowledge, his aunt died after Trump’s travel ban went into effect on Friday, Jan. 27, he said. He claimed there are “haters” trying to “smear” his cousin’s name by alleging he lied. He declined to provide records to corroborate the date of his aunt’s death.\n\nThe imam said there was a grain of truth to the family’s account: if she had been treated in a U.S. hospital, as opposed to an Iraqi hospital, Al-Husainy said, “she would have survived.”\n\n“But Trump killed her? No, I don’t agree with that,” he said, adding that he is certain the woman died days before the travel ban. “Anybody who lies, or gives fake information, is going to hurt the Muslims. Because Muslims should be truth tellers.”\n\nAl-Husainy said he voted for Trump, but he believes it is unfair for the travel ban to include Iraqis. “Don’t victimize the victims,” he said. “But he was fighting terrorism, so let’s give him a chance. Let’s support him.”\n\nHager claimed in his original interview with Fox that he was traveling with his niece, two nephews, and his mother, who were all green-card holders. As they were waiting in line at the airport in Iraq on Friday, he was told that he could pass through because he was a U.S. citizen. But his family members — including his mother — weren’t allowed, he said.\n\nHager was born in Iraq and fled during the Gulf War. He lived in a refugee camp with his family for four years before settling in the United States.\n\n“I was just shocked. I had to put my mom back on the wheelchair and take her back and call the ambulance and she was very very upset,” Hager said in the interview. “She knew right there if we send her back to the hospital she’s going to pass away — she’s not going to make it.”\n\nThe president’s order, signed Friday, suspends admission to the United States of all refugees for 120 days and bars for 90 days the entry of any citizen from Iraq, Iran, Syria, Yemen, Sudan, Libya and Somalia. That list excludes several majority-Muslim nations — notably Turkey, the United Arab Emirates and Indonesia.", "authors": [], "publish_date": "2017-02-01", "source": "washingtonpost", "top_words": ["travel", "iraqi", "mother", "tale", "trump", "ban", "family", "days", "fox", "iraq", "unravels", "united", "trumps", "woman", "died", "dying", "claimed"], "summary": "A Michigan man claimed his sick Iraqi mother died a day after being turned away from traveling to the U.S. as a result of the executive order.\nThe local Fox affiliate “received many questions about the validity of Hager’s claims that his mother died waiting to be approved to come home,” it wrote.\nTo his knowledge, his aunt died after Trump’s travel ban went into effect on Friday, Jan. 27, he said.\nNo, I don’t agree with that,” he said, adding that he is certain the woman died days before the travel ban.\nBecause Muslims should be truth tellers.”Al-Husainy said he voted for Trump, but he believes it is unfair for the travel ban to include Iraqis."}