{"url": "https://www.washingtonpost.com/news/morning-mix/wp/2017/02/10/travel-ban-ruling-in-court-as-on-twitter-trump-confronts-problem-of-no-evidence-for-claims/", "id": "67", "title": "Travel ban ruling: In court as on Twitter, Trump confronts evidence gap", "text": "\n\n9th Circuit Judges Richard R. Clifton, top, William Canby Jr. and Michelle Taryn Friedland. (AP)\n\nThe list of evidence-free claims from President Trump and his administration is long and growing. “Millions” of people voted illegally. Inauguration turnout was the “biggest ever.” All negative polls are “fake news.”\n\nNo matter how hard the administration is pressured to support its assertions, no matter how many “four-Pinocchio” and “pants on fire” ratings follow, Trump doesn’t relent. It’s hard to imagine he feels the need to, especially when polls such as one this week out of Emerson College show registered voters find his administration more truthful than its interlocutors in the news media.\n\n'Trump administration seen as more truthful than news media'https://t.co/6LmsR5JOSW — Donald J. Trump (@realDonaldTrump) February 8, 2017\n\nTrump’s defiance might work well as political theater, and there’s no denying that it made for an effective presidential campaign. But as a legal strategy, it’s already hitting roadblocks.\n\nThe first came last week, when a federal judge froze his controversial executive order shutting U.S. borders to refugees and migrants from seven mostly Muslim countries.\n\nBut the real blow came Thursday, when an appeals court upheld that freeze. In a unanimous opinion, a three-judge panel on the U.S. Court of Appeals for the 9th Circuit found that the government had failed to show why the travel ban needed to be immediately reinstated, as The Washington Post’s Matt Zapotosky reported.\n\nPresident Trump said on Feb. 9 that he looked forward to seeing the judges \"in court\" after a federal appeals court upheld the suspension of his controversial immigration order. (Editor's note: Audio only.) (The Washington Post)\n\nTo arrive at that decision, the appeals court did something close to what fact-checkers, journalists, scholars and others do every day when Trump and his surrogates make extraordinary claims: It demanded extraordinary evidence — or at least some evidence — for the administration’s arguments.\n\nAnd it got none, the judges said.\n\nThe court asked the government to explain the “urgent need” for the order to be restored, but Justice Department lawyers offered “no evidence,” the opinion read.\n\nIt asked for evidence in the form of legal precedents that noncitizens affected by the order “have no rights” under the Constitution. The court found the government’s examples unconvincing.\n\nIt also asked for evidence that immigrants from the countries named in Trump’s order had committed terrorist attacks in the United States. Instead, the government merely argued that the court “must not review its decision at all,” according to the opinion.\n\n[Read the 9th Circuit’s opinion on the travel ban]\n\nIn court papers, the government argued that the president’s authority to suspend immigration was “unreviewable,” meaning the court couldn’t check his power. That seemed to alarm the judges.\n\n“There is no precedent to support this claimed unreviewability,” the opinion read, “which runs contrary to the fundamental structure of our constitutional democracy.”\n\nA federal appeals court ruled 3 to 0 against President Trump's controversial immigration ban that barred refugees and citizens from seven Muslim-majority countries from entering the United States. (Victoria Walker/The Washington Post)\n\nThe only thing at issue in the case right now is the temporary order blocking Trump’s travel ban. A decision on whether the travel ban is legal or constitutional could be a long way away.\n\nThe Trump administration says the travel ban is necessary to protect national security and defend the country against terrorism. Trump has even gone so far as to assert on Twitter that if a terrorist attack did happen, the judiciary would be to blame.\n\nWhile language like that might play well with the base, it didn’t impress the court, suggested Mary Fan, an immigration and refugee law professor at the University of Washington School of Law.\n\n“The court can’t abdicate responsibility in the face of fear-filled words like ‘terrorism’ or terms of deference like ‘national security.’ These are, of course, important interests, but you have to have substance behind the words,” Fan told The Post.\n\n“You can’t just play upon these fears without giving the court a substantial reason to justify extreme exercises of power,” Fan said. “The Trump administration made the 9th Circuit’s job easier in the sense that they were so extreme in what they claimed about unreviewability that they made themselves into a straw man easy to knock down.”\n\nThe Justice Department said in a statement it was reviewing the 9th Circuit’s opinion.\n\nTrump reacted angrily on Thursday, accusing the judges of making a “political decision.” He had previously used the phrase “so-called judge” to refer to U.S. District Judge James L. Robart, who penned the lower court decision that paved the way for the appeals court’s ruling.\n\n[How Trump’s travel ban broke from the normal executive order process]\n\nTrump’s attacks on the judiciary will likely continue, but he’ll have a hard time bashing individual judges on the appeals court because the opinion was unanimous and unsigned, said Jonathan Hafetz, a constitutional law professor at Seton Hall University School of Law. Writing on the legal blog Balkinization, Hafetz described the 9th Circuit’s ruling as an “important moment in the defense of judicial independence.”\n\n“President Trump, from his reckless implementation of the Executive Order to his flagrant attacks on the integrity of federal judges hearing these challenges, has transformed the case into an early — and critical — showdown over the independence of the judiciary in the United States,” Hafetz wrote. The judges, he added, may have penned the opinion unanimously because they “recognize the real and grave threat Trump poses to the foundations of the constitutional order.”\n\nIn a case such as this one, the government faces a heavy burden. To lift the stay on Trump’s executive order, it had to show both that it was likely to succeed on the merits of the case, and that leaving the stay in place would cause “irreparable injury.” It failed on both fronts.\n\n“Although we agree that ‘the government’s interest in combating terrorism is an urgent objective of the highest order,'” the court said, citing a past Supreme Court opinion, “the government has done little more than reiterate that fact.”\n\nThe judges continued: “Despite the district court’s and our own repeated invitations to explain the urgent need for the Executive Order to be placed immediately into effect, the Government submitted no evidence to rebut the States’ argument that the district court’s order merely returned the nation temporarily to the position it has occupied for many previous years.”\n\nIn a damaging aside, the court raised questions about whether it could trust the administration’s credibility on the status of the order itself, saying that the administration, through the White House counsel, had shifted positions on whether the order would apply to lawful permanent residents.\n\n[Trump’s travel ban is the controversial policy almost nobody was begging for]\n\n“The White House counsel is not the President, and he is not known to be in the chain of command for any of the Executive Departments,” the court wrote. “We cannot say that the current interpretation by White House counsel, even if authoritative and binding, will persist past the immediate stage of these proceedings.”\n\nIn short, the court found the administration essentially unbelievable, as have many of Trump’s critics.\n\nThough the court’s ruling represents a significant setback for the administration, some legal observers cautioned about reading too much into it. The court has yet to rule on the merits of the case, including whether the order discriminates against Muslims specifically, as the plaintiffs — the states of Washington and Minnesota — argue.\n\n“Are there tea leaves to read in this opinion? There sure are, particularly with respect to the judges’ analysis of the government’s likelihood of prevailing on the merits and its blithe dismissal of the government’s claims of national security necessity,” wrote Benjamin Wittes, editor in chief of Lawfare.\n\n“But it’s worth emphasizing that the grounds on which this order was fought are not the grounds on which the merits fight will happen,” Wittes wrote. “Eventually, the court has to confront the clash between a broad delegation of power to the President — a delegation which gives him a lot of authority to do a lot of not-nice stuff to refugees and visa holders — in a context in which judges normally defer to the president, and the incompetent malevolence with which this order was promulgated.”\n\nRead more:\n\n7 key take-aways from the court’s ruling on Trump’s immigration order\n\nTrump’s loose talk about Muslims gets weaponized in court against travel ban\n\nHow all-caps came to signify shouting, as in Trump’s ‘SEE YOU IN COURT …’", "authors": [], "publish_date": "2017-02-10", "source": "washingtonpost", "top_words": ["ruling", "travel", "judges", "trump", "ban", "appeals", "evidence", "court", "twitter", "opinion", "trumps", "confronts", "order", "administration", "gap"], "summary": "But the real blow came Thursday, when an appeals court upheld that freeze.\nIt also asked for evidence that immigrants from the countries named in Trump’s order had committed terrorist attacks in the United States.\n(Victoria Walker/The Washington Post)The only thing at issue in the case right now is the temporary order blocking Trump’s travel ban.\nA decision on whether the travel ban is legal or constitutional could be a long way away.\nThe Trump administration says the travel ban is necessary to protect national security and defend the country against terrorism."}