{"url": "https://www.washingtonpost.com/opinions/the-evidence-for-trumps-travel-ban-simply-isnt-there/2017/02/27/90e228ac-fd36-11e6-8f41-ea6ed597e4ca_story.html", "id": "71", "title": "The evidence backing Trump’s travel ban simply isn’t there", "text": "TRY AS it might, the Trump administration has made scant progress in its effort to find intelligence that might justify its proposed temporary travel ban on citizens from seven predominantly Muslim countries. Even as it scours the federal government for data to validate its proposed policy — an inversion of a systematic, rational decision-making process — the administration keeps running into obstacles in the form of stubborn facts that provide no basis for a ban.\n\nThe latest such example arrived in the form of a report from the Intelligence and Analysis branch of the Department of Homeland Security. Tasked with compiling a report on the terrorist threat posed by citizens of the seven countries in President Trump’s crosshairs, the DHS study found, first, that citizenship itself is an “unlikely indicator” of danger to the United States and, second, that very few people from the seven nations in question have been linked to terrorism in the United States over the past six years.\n\nThat’s a damning conclusion, and one that eviscerates the rationale for Mr. Trump’s proposed ban, issuing as it does from an agency intimately involved with safeguarding the United States from terrorist attacks. A DHS spokeswoman hastened to belittle the analysis as mere “commentary,” based on unclassified sources and lacking the full weight of what she called “an official, robust document with thorough interagency sourcing.” Specifically, said the spokeswoman, Gillian Christensen, the report “does not include data from other intelligence community sources.”\n\nFair enough. Fortuitously, a former top CIA official, Michael Morell, who twice served as the agency’s acting director, and an intelligence scholar, Robert Pape, weighed in days later with a conclusion widely shared in the U.S. intelligence community: that the most serious terrorist peril to America is home-grown, from U.S. citizens who have been radicalized by Islamic State propaganda. (Similarly, most of the bloodiest terror attacks in Europe, including the 2015 carnage in Paris, were carried out by individuals born in Europe, not the Mideast.)\n\nCiting comprehensive research by the Chicago Project on Security and Threats, a program associated with the University of Chicago, Mr. Morell and Mr. Pape pointed out that of 125 terrorists in the past three years who had either been indicted for crimes tied to the Islamic State or died before they could be indicted, more than 80 percent were U.S. citizens; of them, more than three-quarters were born in the United States. Of the handful who remained, just over one-third were from the seven countries singled out by Mr. Trump’s executive order.\n\nThat report jibed with the DHS report, as well as with other intelligence analyses that agree that the administration’s proposed ban does virtually nothing to enhance national security — and in fact may have the opposite effect.\n\nUndeterred, the administration is preparing to release an updated travel-ban order this week . The idea is to convince federal courts that the proposed ban is more than a manifestation of a prejudice against Islam masquerading as the legitimate exercise of the executive branch’s responsibility to promote national security. It remains to be seen what evidence can be mustered to make that case.", "authors": [], "publish_date": "2017-02-27", "source": "washingtonpost", "top_words": ["seven", "travel", "intelligence", "citizens", "ban", "simply", "evidence", "report", "security", "united", "trumps", "proposed", "states", "mr", "isnt", "backing"], "summary": "TRY AS it might, the Trump administration has made scant progress in its effort to find intelligence that might justify its proposed temporary travel ban on citizens from seven predominantly Muslim countries.\nThe latest such example arrived in the form of a report from the Intelligence and Analysis branch of the Department of Homeland Security.\nThat’s a damning conclusion, and one that eviscerates the rationale for Mr. Trump’s proposed ban, issuing as it does from an agency intimately involved with safeguarding the United States from terrorist attacks.\nOf the handful who remained, just over one-third were from the seven countries singled out by Mr. Trump’s executive order.\nThe idea is to convince federal courts that the proposed ban is more than a manifestation of a prejudice against Islam masquerading as the legitimate exercise of the executive branch’s responsibility to promote national security."}