{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/01/31/trumps-team-is-mad-people-are-calling-the-travel-ban-a-ban-even-though-they-also-called-it-a-ban/", "id": "76", "title": "The Trump team bizarrely quibbles with calling its travel ban a ‘ban’ — and then backs down", "text": "During the White House daily briefing on Jan. 31, NBC's Kristen Welker asked press secretary Sean Spicer why the administration is lashing out against calling President Trump's executive order on immigration a \"travel ban,\" when that's in fact what the president is calling it on Twitter. (Reuters)\n\nUpdate: And sure enough, just a day after Spicer took issue with calling it a \"ban,\" Trump tweeted that the word doesn't really matter. It doesn't seem the White House has any kind of a cogent or coordinated messaging strategy here.\n\nEverybody is arguing whether or not it is a BAN. Call it what you want, it is about keeping bad people (with bad intentions) out of country! — Donald J. Trump (@realDonaldTrump) February 1, 2017\n\nWhite House press secretary Sean Spicer had a message for the news media at a briefing Tuesday: You guys caused the confusion about the Trump administration's new temporary travel ban ... by calling it a travel “ban.”\n\n“It's not a travel ban,” Spicer said, adding: \"Because when we use words like 'travel ban,' that misrepresents what it is.\"\n\nAt least, that's what he said Tuesday. On Monday, he used the term himself. At an appearance at George Washington University, he said that “the ban deals with seven countries that the Obama administration had previously identified as needing further travel restrictions.”\n\nHe wasn't the only member of the Trump team to embrace the word:\n\nIf the ban were announced with a one week notice, the \"bad\" would rush into our country during that week. A lot of bad \"dudes\" out there! — Donald J. Trump (@realDonaldTrump) January 30, 2017\n\nTrump also called it a “ban” on Saturday, saying “We're going to have a very, very strict ban, and we're going to have extreme vetting, which we should have had in this country for many years.” And Kellyanne Conway used the b-word Sunday, saying, \"This is a ban on travel, prospective travel from countries, trying to prevent terrorists in this country...\"\n\nSo four times in three days.\n\nWhen the tweet above was pointed out at Tuesday's briefing, Spicer insisted Trump was just “using the words that the media is using.\" (We assume the press secretary would say he was doing the same thing himself Monday.)\n\n“But it can't be ... a ban if you're letting a million people in, if 325,000 people from another country can't come in,” Spicer said. “That, by nature, is not a ban.”\n\nNBC's Kristen Welker asked if the message was getting confused.\n\n“I'm not confused,” Spicer said. “The words that are being used to describe it are derived from what the media is calling it. He has been very clear that it is extreme vetting.”\n\nspicer: it's not a ban\n\nreporter: but the president called it a ban\n\nspicer: it's not\n\nreporter: is he confused or u?\n\nspicer: i'm not confused pic.twitter.com/i4wWuuZ7JT — David Mack (@davidmackau) January 31, 2017\n\nExcept that the administration also kinda, sorta says it's not “extreme vetting,” either — or at least, it did when that characterization didn't suit its purposes.\n\nIn its memo announcing Acting Attorney General Sally Yates's firing late Monday, the White House seemed to take issue with that adjective.\n\n“Calling for tougher vetting for individuals traveling from seven dangerous places is not extreme,” the memo reads.\n\nOkay, on this latter one, maybe they get a pass. They seem to be saying that although the vetting will be “extreme,” the policy itself isn't (?). It's still very mixed messaging.\n\nBut the first one just doesn't make sense. If it's so wrong to call this a travel “ban,” the White House's three leading public messengers should know not to call it that. They both did ... on Monday. That's Political Messaging 101. And although it's perhaps understandable that Trump would goof and use the wrong word, Spicer knows better. If avoiding the word “ban” was the strategy, he wouldn't have used it Monday. And we would have seen pushback on its use earlier than five days after the ban was enacted.\n\nIn the end, it looks like more grasping at straws when it comes to explaining how poor the implementation was — almost as though they didn't have a plan to implement it or a plan to sell it publicly.", "authors": [], "publish_date": "2017-01-31", "source": "washingtonpost", "top_words": ["travel", "quibbles", "extreme", "trump", "spicer", "ban", "used", "bizarrely", "vetting", "calling", "backs", "house", "white", "team"], "summary": "(Reuters)Update: And sure enough, just a day after Spicer took issue with calling it a \"ban,\" Trump tweeted that the word doesn't really matter.\nIt doesn't seem the White House has any kind of a cogent or coordinated messaging strategy here.\n— Donald J. Trump (@realDonaldTrump) February 1, 2017White House press secretary Sean Spicer had a message for the news media at a briefing Tuesday: You guys caused the confusion about the Trump administration's new temporary travel ban ... by calling it a travel “ban.”“It's not a travel ban,” Spicer said, adding: \"Because when we use words like 'travel ban,' that misrepresents what it is.\"\nIn its memo announcing Acting Attorney General Sally Yates's firing late Monday, the White House seemed to take issue with that adjective.\nIf it's so wrong to call this a travel “ban,” the White House's three leading public messengers should know not to call it that."}