{"url": "https://www.washingtonpost.com/blogs/plum-line/wp/2017/03/06/trump-just-signed-his-new-travel-ban-heres-what-its-really-about/", "id": "74", "title": "Trump just signed his new travel ban. Here’s what it’s really about.", "text": "The Trump administration on March 6 unveiled an executive order establishing a new travel ban as President Trump's wiretapping claims continued to elicit reactions. (Bastien Inzaurralde,Jayne Orenstein,Alice Li/The Washington Post)\n\nToday the administration released the new version of its travel ban, and unlike the first, bumbling time they did it, this time it actually looks as though they put some thought into it, particularly with regard to getting it upheld in court. There is one critical feature it shares with the original version, however: It will do nothing to keep Americans any safer than we already are.\n\nHere are the basics of this order and how it differs from the previous one:\n\nIt bans nationals of Iran, Libya, Somalia, Sudan, Syria and Yemen from entering the United States. Iraq has been removed from the list.\n\nIt bars all refugees from entering the United States for the next 120 days, and no longer bans Syrian refugees indefinitely.\n\nIt says that the number of refugees who will be admitted once the ban is lifted will be cut by more than half, down below a cap of 50,000 a year.\n\nThe ban no longer applies to people with green cards or those who have already gotten valid visas to travel to the United States, as the first ban did.\n\nIt contains language making clear that the preference given to persecuted religious minorities does not only apply to Christians.\n\nIn short, unlike the first order, this one looks as though it was written by people who know what they’re doing, with an eye to overcoming the legal problems that got the first order blocked by the courts. So it may well survive the inevitable legal challenges. But that doesn’t mean it actually enhances our security.\n\nThat’s because the terrorism that would be stopped by this new ban is virtually nonexistent. That’s for two reasons. First, experts have noted that there have been no fatal terrorist attacks on U.S. soil perpetrated since 9/11 by anyone from those six countries. Second, as an assessment from Trump’s own DHS has concluded, most foreign-born, U.S.-based violent extremists probably were radicalized years after getting here, rendering screening procedures of limited value in preventing the entry of such potential terror plotters.\n\nThat doesn’t even mention the fact that terrorism in general is a tiny threat: Fewer than 100 Americans have been killed here since 9/11, or an average of around six per year. I’m pretty sure that if the Trump administration can maintain the record established by Presidents Bush and Obama, they’ll claim that their policies were spectacularly successful at keeping us safe.\n\nThat brings up something else to keep a close eye on. As this blog has warned before, don’t be surprised if at some point in the future, perhaps after a few months pass and attention fades, the administration starts adding to that list of countries whose nationals will be banned. Just as no one seriously thinks we face a dire threat from nationals of these six countries, no one could think that the administration is worried about those countries and no others.\n\nIn fact, the best way to understand the travel ban is to see it as part of a broader effort on the part of White House, particularly Trump’s key advisers Stephen K. Bannon and Stephen Miller and Attorney General Jeff Sessions, to wage an assault on the very idea of American diversity. Bannon has long believed that the white, Christian West is embroiled in a clash of civilizations with Islam. We learned this weekend that he often cites “The Camp of the Saints,” a viciously racist French novel from the 1970s about white Europe being overrun by nonwhite immigrants, to describe what he sees in the world today.\n\nAnd as The Post recently reported, “Sessions’s ideology is driven by a visceral aversion to what he calls ‘soulless globalism,’ a term used on the extreme right to convey a perceived threat to the United States from free trade, international alliances and the immigration of nonwhites.” Also, let’s not forget that their boss won the presidency by promising to temporarily ban all Muslims from coming to the United States and build a wall on our southern border.\n\nSo even if this newest version of the travel ban was written more carefully than the first one, make no mistake about its intent. Like the administration’s immigration crackdown, its stated justification is secondary. What it’s really about is creating a particular kind of America, one that shuts out the “wrong” kind of people and sends a clear message to the world that if you aren’t the right race or the right religion, we don’t want you. That’s what the Trump administration is after, and so far they’re doing a pretty good job of it.", "authors": [], "publish_date": "2017-03-06", "source": "washingtonpost", "top_words": ["heres", "travel", "trump", "ban", "order", "version", "united", "signed", "countries", "trumps", "states", "white", "really", "administration"], "summary": "The Trump administration on March 6 unveiled an executive order establishing a new travel ban as President Trump's wiretapping claims continued to elicit reactions.\nIt bars all refugees from entering the United States for the next 120 days, and no longer bans Syrian refugees indefinitely.\nThe ban no longer applies to people with green cards or those who have already gotten valid visas to travel to the United States, as the first ban did.\nSo even if this newest version of the travel ban was written more carefully than the first one, make no mistake about its intent.\nThat’s what the Trump administration is after, and so far they’re doing a pretty good job of it."}