{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/03/06/3-claims-trump-made-about-his-travel-ban-that-dont-hold-up-at-all/", "id": "73", "title": "4 claims the Trump White House made about its travel ban that now look silly", "text": "The nations affected by President Trump's executive action on immigration are not actually countries where terrorists who have carried out fatal attacks the United States came from. (Daron Taylor/The Washington Post)\n\nPresident Trump on Monday took his second crack at a travel ban executive order. He signed a scaled-back version of the previous executive order, which was halted by the courts, that does more to guard against the idea that it is a thinly veiled “Muslim ban” and excludes Iraq from the list of banned countries.\n\nWhether the new ban passes legal muster is one question — and it will undoubtedly be answered in pretty short order.\n\nBut as much as anything, the handling of the new executive order makes some of Trump's actions and claims surrounding the first ban appear particularly haphazard and disingenuous. Trump and his aides said many things about the need for the last executive order that simply don't hold up anymore.\n\nBelow, we review a few of them.\n\n1) CLAIM: The travel ban simply could not wait.\n\nREALITY: The revised ban was originally due almost two weeks ago -- and was reportedly delayed for political reasons.\n\nWhen Trump signed the first executive order one week into his presidency — and implementation over that first weekend went poorly, even according to many Republicans — the White House justified it by saying that it was an urgent need and couldn't wait.\n\nBut it has been almost a month since the last one was halted. And as The Fix's Callum Borchers wrote last week, both Politico and CNN reported that this new order was delayed for political purposes:\n\nAsked in a Jan. 30 interview on MSNBC why Trump had moved so quickly to sign the order, press secretary Sean Spicer said “there was a very short period of time in which we had something to execute that ensured that the people of the United States were safe.” Spicer clarified that U.S. intelligence agencies had not detected a specific threat but said: “Do you wait until you do? The answer is you act now to protect the future.” The new answer seems to be that the White House will act when the media moment is right. Trump had planned to unveil a revised order on Wednesday but held off amid a wave of largely positive coverage of his address to Congress Tuesday night. Politico, citing unnamed administration officials, reported that the president didn't want to divide the media's attention. … In a similar report, CNN quoted an unnamed official who said the White House wanted the new order “to have its own moment.”\n\n2) CLAIM: You can't give notice of the ban's implementation date.\n\nREALITY: The new ban gives a 10-day notice.\n\nHere's what Trump said after the first ban's rough implementation weekend, amid questions of why it couldn't have been delayed by a few days while agencies figured out how to deal with it:\n\nIf the ban were announced with a one week notice, the \"bad\" would rush into our country during that week. A lot of bad \"dudes\" out there! — Donald J. Trump (@realDonaldTrump) January 30, 2017\n\nApparently that prospect no longer applies. The new travel ban has a 10-day period before it will take effect on March 16. So those “bad” “dudes” have not only had a month to enter the country since the last ban was struck down, but they'll now have 10 more days to game the system knowing exactly what's coming.\n\n(Unless Trump's claim was all bluster.)\n\n3) CLAIM: The White House would appeal the initial ruling and wouldn't rescind the first travel ban.\n\nREALITY: The White House is rescinding the first travel ban.\n\nTrump said after the U.S. Court of Appeals for the 9th Circuit upheld the temporary restraining order on his first ban, “SEE YOU IN COURT.”\n\nSEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE! — Donald J. Trump (@realDonaldTrump) February 9, 2017\n\nWhite House press secretary Sean Spicer, meanwhile, told reporters Feb. 21 that the initial travel ban wouldn't be rescinded when the replacement was signed.\n\nQUESTION: One more clarification just before you go. So, when the new EO comes out, you won't rescind the original one, you'll leave it in place? SPICER: That's correct.\n\nBoth were wrong. That appeal still hadn't come as of Monday, and the new executive order rescinds the first travel ban effective on the date that the new one will be implemented: March 16.\n\nOn March 16, the initial EO will be revoked. https://t.co/ORAfcfXCxn pic.twitter.com/9wn1qrVHj4 — Chris Geidner (@chrisgeidner) March 6, 2017\n\n4) CLAIM: The first ban's implementation process was silky smooth.\n\nREALITY: The administration says the new implementation process won’t be so rocky this time.\n\nWhen the media reported on the chaos as airports the first weekend that the travel ban was in effect, the White House dismissed these reports completely (even as Republicans complained):\n\nTheir overarching message: Everything is going exactly according to plan, nothing has changed since the order was signed, and the news media need to calm down their “false, misleading, inaccurate, hyperventilating” coverage of the “fractional, marginal, minuscule percentage” of international travelers who have been simply “set aside for further questioning” for a couple hours on their way into the greatest country in the world. “It really is a massive success story in terms of implementation on every single level,” the administration official said at one point.\n\nIn describing the new executive order, though, a Department of Homeland Security official acknowledged the chaotic rollout and said it would be avoided. (The official did qualify this statement with \"alleged chaos.\")\n\n“You should not see any chaos, so to speak, or alleged chaos, at airports. There aren’t going to be folks stopped tonight from coming into the country because of this executive order. If they are, it’s pursuant to our ordinary screening procedures,” the anonymous DHS official said. “We’re going to have a very smooth implementation period.”", "authors": [], "publish_date": "2017-03-06", "source": "washingtonpost", "top_words": ["claims", "executive", "travel", "implementation", "official", "trump", "ban", "claim", "order", "house", "white", "silly", "look"], "summary": "(Daron Taylor/The Washington Post)President Trump on Monday took his second crack at a travel ban executive order.\n1) CLAIM: The travel ban simply could not wait.\nThe new travel ban has a 10-day period before it will take effect on March 16.\n3) CLAIM: The White House would appeal the initial ruling and wouldn't rescind the first travel ban.\nREALITY: The White House is rescinding the first travel ban."}