{"url": "https://www.washingtonpost.com/local/public-safety/federal-appeals-court-largely-maintains-freeze-of-trumps-travel-ban/2017/05/25/395aa394-365b-11e7-b4ee-434b6d506b37_story.html", "id": "83", "title": "Federal appeals court maintains freeze of Trump’s travel ban. Attorney general vows Supreme Court appeal.", "text": "A federal appeals court on Thursday left in place the freeze on President Trump’s revised entry ban, handing the administration another legal setback in its efforts to block the issuance of new visas to citizens of six Muslim-majority countries.\n\nThe broad, decisive ruling from the U.S. Court of Appeals for the 4th Circuit means the Trump administration still cannot enforce its travel order that the government says is urgently needed for national security.\n\nAttorney General Jeff Sessions vowed to appeal to the Supreme Court.\n\nIn a 10-to-3 decision, the Richmond-based court said the president’s power to deny entry into the United States is not absolute and sided with challengers, finding that the travel ban “in context drips with religious intolerance, animus and discrimination.”\n\nThe president’s authority, the court said, “cannot go unchecked when, as here, the president wields it through an executive edict that stands to cause irreparable harm to individuals across this nation,” according to the majority opinion written by Chief Judge Roger L. Gregory and joined in part by nine colleagues.\n\nProtesters hold signs and march outside the U.S. Court of Appeals for the 4th Circuit in Richmond, Va., in advance of the hearing earlier this month on the Trump administration’s travel ban. (Steve Helber/AP)\n\nThe 4th Circuit order leaves in place a nationwide injunction issued in March by U.S. District Judge Theodore D. Chuang in Maryland, who sided with opponents in finding that the ban violates the Constitution by intentionally discriminating against Muslims. Thursday’s ruling means citizens from Iran, Sudan, Somalia, Yemen, Syria and Libya can continue entering the United States.\n\n[Judges press Trump’s lawyers in travel ban case on campaign statements]\n\nEven if the appeals court had sided with the Trump administration, the president’s order would have remained on hold because of a separate opinion from a federal judge in Hawaii. To put the ban in motion, the Justice Department would also have had to win at the U.S. Court of Appeals for the 9th Circuit in San Francisco, which heard oral arguments on May 15 in the government’s appeal of the Hawaii decision.\n\nFederal immigration law gives the president broad authority, and acting solicitor general Jeffrey B. Wall had urged the court to defer to the president and not second-guess his judgment.\n\nBut the ruling from the 4th Circuit was the latest in a series of defeats for the administration. Trump rewrote the entry ban after the 9th Circuit in February refused to lift an earlier injunction.\n\nThe revised version would temporarily suspend the U.S. refugee program and halt for 90 days the issuance of new visas to travelers from the six countries while the administration reviews its screening process.\n\n[Read the full 4th Circuit opinion on President Trump's travel order]\n\nIf the administration asks the Supreme Court to stay the 4th Circuit’s decision, the request usually requires showing that the government would suffer irreparable harm if the lower court decision was allowed to stand. The passage of time since the executive order was first issued might make that difficult.\n\nSessions said the administration “strongly disagrees” with Thursday’s decision but did not detail its strategy except to say that the government “will seek review” of the ruling.\n\nThe president’s order, Sessions said in a statement, is “well within his lawful authority to keep the nation safe,” and the president is “not required to admit people from countries that sponsor or shelter terrorism, until he determines that they can be properly vetted and do not pose a security risk to the United States.”\n\nA challenge would go to Chief Justice John G. Roberts Jr., who receives emergency petitions from that court, and then be referred to the rest of the justices. It would take five votes to stay the decision.\n\n[9th Circuit rules 3 to 0 against Trump on first version of travel ban]\n\nThe challenge in Maryland was brought by organizations and individuals, including a Muslim in the United States whose relative would be affected by the ban. In its 79-page opinion, the court said challengers had demonstrated the harm that would come from delaying or disrupting pending visa applications, in addition to the “psychological harm that flows from confronting official action preferring or disfavoring a particular religion.”\n\nKaren Tumlin, the legal director at the National Immigration Law Center and one of the lawyers on the case, said the court concluded that the president’s order has to be blocked because it “steps over the constitutional line in a way that is out of step with our constitutional values of religious tolerance.”\n\nDuring oral arguments this month, many of the 4th Circuit judges questioned the government’s lawyer about the link between U.S. security and the barring of citizens from the six countries identified by the administration.\n\nIn its opinion Thursday, the court said, “plaintiffs point to ample evidence that national security is not the true reason” for the order, “including, among other things, then-candidate Trump’s numerous campaign statements expressing animus towards the Islamic faith” and his proposal as a candidate to ban Muslims from entering the United States.\n\nA key issue for the court was whether to consider the president’s political statements and whether the order violates the establishment clause of the First Amendment that specifically prohibits the government from denigrating a particular religion. The travel order itself makes no mention of religion or Muslims.\n\nThe majority opinion recounts in detail Trump’s statements, and it quotes extensively from his tweets, media interviews and comments made by his supporters and advisers, including White House press secretary Sean Spicer.\n\n“Laid bare, this executive order is no more than what the president promised before and after his election: naked invidious discrimination against Muslims,” Judge James A. Wynn Jr. wrote in a concurring opinion.\n\nJudge Stephanie D. Thacker also sided with the majority but said the court could reach the same conclusion without relying on Trump’s comments before he became president.\n\nAll of the judges in the majority were nominated to the court by Democratic presidents, and the three dissenting judges — Paul V. Niemeyer, Dennis W. Shedd and G. Steven Agee — were nominated to the bench by Republican presidents.\n\nNiemeyer called the decision unprecedented and unworkable.\n\n“The Supreme Court surely will shudder at the majority’s adoption of this new rule that has no limits or bounds,” Niemeyer wrote. “One that transforms the majority’s criticisms of a candidate’s various campaign statements into a constitutional violation.”\n\nMatt Zapotosky contributed to this report.", "authors": [], "publish_date": "2017-05-25", "source": "washingtonpost", "top_words": ["travel", "ban", "supreme", "maintains", "circuit", "court", "freeze", "4th", "trumps", "general", "federal", "order", "president", "vows", "administration", "presidents"], "summary": "The broad, decisive ruling from the U.S. Court of Appeals for the 4th Circuit means the Trump administration still cannot enforce its travel order that the government says is urgently needed for national security.\nAttorney General Jeff Sessions vowed to appeal to the Supreme Court.\nProtesters hold signs and march outside the U.S. Court of Appeals for the 4th Circuit in Richmond, Va., in advance of the hearing earlier this month on the Trump administration’s travel ban.\nBut the ruling from the 4th Circuit was the latest in a series of defeats for the administration.\nThe travel order itself makes no mention of religion or Muslims."}