{"url": "https://www.washingtonpost.com/world/national-security/internal-trump-administration-data-undercuts-travel-ban/2017/03/16/9a2dc6b4-098e-11e7-93dc-00f9bdd74ed1_story.html", "id": "80", "title": "Internal Trump administration data undercuts travel ban", "text": "At least two sets of internal data that have been available to the Trump administration — but that have never been publicized — appear to undercut the government’s argument for a travel ban that it had hoped would take effect Thursday, according to several officials familiar with the documents.\n\nOne internal report, titled “Most Foreign-Born US-Based Violent Extremists Radicalized After Entering Homeland,” analyzed roughly 90 cases involving suspected or confirmed foreign-born terrorists, finding that most of them probably embraced extremist ideology after they arrived in the United States, not before.\n\nAnother report, drawn on classified FBI data, has been used by the Trump administration to bolster its claims that refugees pose a risk of terrorism. But the figures that are the basis for that report undermine a key premise of the travel ban, with most of the suspects cited in the report coming from countries unaffected by President Trump’s executive order, according to officials familiar with the report.\n\nTaken together, the two reports show there is a significant amount of internal government data that suggests the travel ban Trump wants to implement is not likely to be effective in curbing the threat of terrorism in the United States, these people said. The officials spoke on the condition of anonymity because some of the data is classified and none of it has been approved for public dissemination.\n\n[Federal judge in Hawaii freezes President Trump’s new entry ban]\n\n(Daron Taylor/The Washington Post)\n\nWhite House spokesman Michael Short said the justification for the travel ban is “not in any way diminished by these selective and potentially criminal leaks being carried out by disgruntled government officials. The president is 100 percent committed to keeping this country safe from terrorism, and that’s exactly what this order will help achieve.’’\n\nA Department of Homeland Security spokesman defended the travel-ban executive order, saying it is a prudent response to security concerns about six countries “where state-sponsored terror and unstable governments make thorough investigation difficult.” The Justice Department, which has defended the travel ban in court, declined to comment.\n\nThe existence of the DHS document was previously reported by MSNBC.\n\nThe Trump administration had hoped to implement a new executive order this week that would have temporarily halted the resettlement of all refugees in the United States for the next four months and banned the issuance of new visas to citizens of six majority-Muslim countries. Administration officials have justified the ban as a necessary national security measure to exclude people from countries that pose “heightened concerns about terrorism.”\n\nThe new travel ban did not take effect Thursday morning as planned. A federal judge in Hawaii on Wednesday issued a freeze of the executive order hours before it would have temporarily suspended the admission of new refugees and barred the issuance of new visas to citizens of Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nIn the 43-page ruling, U.S. District Judge Derrick K. Watson said that past comments Trump and his advisers have made indicated the executive order “was issued with a purpose to disfavor a particular religion’’ and therefore probably violated the Constitution.\n\n[Federal court blocks deportation of Afghan special-visa recipient]\n\n(Bastien Inzaurralde/The Washington Post)\n\nIn nearly half of the radicalization cases studied for the government’s internal report, officials found that the individuals came to the United States when they were younger than 16 and in many instances the terrorism charges filed against them came more than 10 years after their arrival, according to officials who spoke on the condition of anonymity to discuss sensitive material.\n\nThe report was finalized this month after work on it began in the summer, when the issue of radicalization was a hot topic in the presidential campaign and Trump had spoken publicly about his desire for a “Muslim ban” and “extreme vetting.” The analysis focused on 88 cases between March 2011 and December 2016, citing examples including a Bangladeshi terrorism suspect who came to the United States as a baby and another suspect who was born in Cuba and did not show signs of embracing an extremist ideology until 26 years after moving to the United States.\n\nThe report on radicalization argues that “tailored’’ domestic de-radicalization programs would be the most effective way to fight the trend, according to people familiar with its contents. So far, the Trump administration has favored suspending refu­gee programs or visitors from specific countries.\n\nA federal appeals court suspended an earlier version of the ban order that targeted a broader range of people from seven countries — including Iraq — after ruling that it violated the due-process rights of affected travelers.\n\nCivil rights advocates and state governments, arguing that the order still constitutes a “Muslim ban” and would be harmful to U.S. interests and national security, filed legal challenges to the new ban, leading to the court ruling Wednesday. The new ban removes Iraq from the list of countries, allows for the entry of current holders of valid visas, and institutes waivers for new visa applicants from the banned countries.\n\nTo try to build support for the new travel ban, the Trump administration has said — and the Justice Department has argued in court — that there are more than 300 terrorism-related investigations into people who came to the United States as refugees. The administration has declined to provide the nationalities of the people in question or any other details about that claim, which officials cited in support of the temporary provision to ban all refu­gee arrivals.\n\n[As Indiana governor, Pence failed to exclude Syrian refugees]\n\nBut officials familiar with the list say that at least 70 percent of the people under review are from countries not targeted by the new travel ban. More than half are or were at one time Iraqi nationals. Officials familiar with the data said roughly two-thirds of the people on the administration’s tally also arrived seven or more years ago, before the government significantly tightened its vetting procedures for Iraqis entering the United States.\n\nRoughly 20 percent of the individuals came to the United States from Somalia, which is covered by the ban. Others hail from a range of countries, including several that the Trump administration has never indicated as a national security threat. For example, there are more nationals from Ethi­o­pia, Uzbekistan and Bosnia that are subjects in counterterrorism investigation than there are from some of the banned countries, such as Yemen, Iran and Libya.\n\nThe list refers to people who are under some form of investigation, but officials familiar with the data cautioned that the classification of those people varies widely from individuals who have aroused serious suspicion to those who might have a relative who is a convicted or suspected terrorist. None of the individuals on the list have been charged with a ­terrorism-related crime, and the number of people under investigation by the FBI at any given time fluctuates regularly as investigations are started and concluded.\n\nInside the Department of Homeland Security, some view the data and analysis as a refutation of the rationale behind the travel ban — the original version and the new reworked one. Another official who has read the documents said they do not present a convincing-enough argument to dismiss the administration’s concerns about refu­gee terrorism risks.\n\nThe DHS prepared the report on radicalization, with input from FBI personnel at the National Counterterrorism Center, people familiar with the report said. The FBI compiled the data on current or former refugees under investigation.\n\nSeamus Hughes, deputy director of the Program on Extremism at George Washington University, said the reports’ findings generally match his research.\n\n“There are still going to be individuals who want to come here and do us harm, but the data is the data, and you should adjust your policy based on the data,” Hughes said. “Even the individuals who were refugees generally came here at a very young age and were arrested 20 years later. That’s not a sleeper cell — that’s a coma cell.”\n\nHughes said most of the terrorism in the United States brews from within, fueled partly by online activity and partly through face-to-face contacts with like-minded people that lead to radicalization.\n\n“You’re mostly talking about U.S. citizens and permanent residents who are largely brought into it by connections they made online — which doesn’t have a border,” he said.\n\nHughes said it is not surprising that of the more than 300 refugees or former refugees who came under law enforcement scrutiny, Iraqis make up a large percentage, given the previously known cases.\n\nThe data “points to the central question about the travel ban, which is, are you addressing the issues you need to address when it comes to the threat?” he said. “In the U.S., you’re talking about much more of a homegrown terrorism problem, and because ISIS attracts such a wide swath of individuals, it’s very hard to do a nationality targeted approach.”\n\nCorrection: An earlier version of this article incorrectly referred to the National Counterterrorism Center as being part of the FBI; personnel with the FBI work at the center. The article has been updated.\n\nRead more:\n\nNew rationale for travel ban: National security officials asked for it\n\nReport: U.S. lacks system for spotting, defusing homegrown extremist threats\n\nWhat’s next for Trump Travel Ban 2.0", "authors": [], "publish_date": "2017-03-16", "source": "washingtonpost", "top_words": ["travel", "trump", "ban", "report", "internal", "undercuts", "officials", "united", "states", "countries", "data", "terrorism", "administration"], "summary": "Administration officials have justified the ban as a necessary national security measure to exclude people from countries that pose “heightened concerns about terrorism.”The new travel ban did not take effect Thursday morning as planned.\nRoughly 20 percent of the individuals came to the United States from Somalia, which is covered by the ban.\nInside the Department of Homeland Security, some view the data and analysis as a refutation of the rationale behind the travel ban — the original version and the new reworked one.\nThe data “points to the central question about the travel ban, which is, are you addressing the issues you need to address when it comes to the threat?” he said.\nRead more:New rationale for travel ban: National security officials asked for itReport: U.S. lacks system for spotting, defusing homegrown extremist threatsWhat’s next for Trump Travel Ban 2.0"}