{"url": "https://www.washingtonpost.com/news/powerpost/wp/2017/01/29/senate-democrats-vow-legislation-to-block-trumps-travel-ban/", "id": "97", "title": "Senate Democrats vow legislation to block Trump’s travel ban", "text": "Trump administration officials defended the president's executive order temporarily banning entry to the U.S. from seven mostly Muslim countries, but lawmakers from both parties expressed strong concern or objection. (Bastien Inzaurralde/The Washington Post)\n\nDemocrats vowed Sunday to introduce legislation to reverse President Trump’s orders implementing a travel ban from certain countries, with at least one senator saying the moves should lead to slower consideration of the president’s top Cabinet nominees.\n\n“These orders go against what America has always been about. The orders make us less humanitarian, less safe, less American,” Senate Minority Leader Charles E. Schumer (D-N.Y.) said during his regularly scheduled news Sunday morning conference in New York as he announced that his colleagues were working on new legislation.\n\n“We’re demanding the president reverse these executive orders that go against what we are, everything we have always stood for,” he said.\n\nSchumer choked up as he described the chaos the orders had caused. Trump’s order was “mean-spirited and un-American,” he said. “It was implemented in a way that created chaos and confusion across the country, and it will only serve to embolden and inspire those around the globe those that will do us harm. It must be reversed immediately.”\n\nSenate Minority Leader Charles E. Schumer (D-N.Y.) on Jan. 29 got emotional during a news conference in which he opposed President Trump's executive order barring U.S. entry from refugees, migrants and foreign nationals from seven mostly Muslim countries. (Reuters)\n\n“We will fight this,” he added. “Many of you may not know this — my middle name is Ellis. I was named after Uncle Ellis who was named after Ellis Island. This fight’s in my bones. It’s on my birth certificate.”\n\nSen. Christopher Murphy (D-Conn.). (Steve Helber/AP)\n\nSenior aides said several Democratic lawmakers were working on legislative remedies. Among them is Sen. Christopher Murphy (D-Conn.), a member of the Foreign Relations Committee, who said he plans to introduce a bill that would overturn Trump’s orders by forcing him to comply with the 1965 Immigration and Nationality Act, which banned discrimination against immigrants on the basis of national origin.\n\n“I think ultimately this ban will be struck down by the courts, but we need to put legislation on the table that Republicans could support, that overturns the ban,” he said in an interview on Sunday.\n\nTrump “clearly campaigned on this ban but the fact that he put no thought into how it was drafted or how it would be implemented is incredibly dangerous,” Murphy added.\n\nGiven that stance, Murphy said Democrats must now “force a debate” this week on Trump’s orders by slowing the consideration of all of his remaining Cabinet nominees, especially Rex Tillerson, set to serve as the next secretary of state.\n\n“We should take every ounce of time that we’re allowed on these nominees, to talk about the disaster that has been the first week of this administration especially when it comes to foreign policy,” he said.\n\nMurphy noted that the Senate quickly confirmed James Mattis, the widely respected former Marine general, to serve as defense secretary, “because he assured us that he was going to argue against the very ban he watched Trump sign. Many of us gave the president and his Cabinet a little benefit of the doubt last week. I don’t see that there’s any reason that that should continue.”\n\n“Almost every single one of these nominees try to prop up their nomination by contradicting Trump in their confirmation hearing. It’s pretty clear now that Donald Trump and Steve Bannon are running this administration and the nominees that have been confirmed thus far have been marginalized,” Murphy added.\n\nSchumer said he believed legislation could easily move through the Senate given the growing opposition from key Republicans, including Sens. John McCain (Ariz.), Ben Sasse (Neb.) and others.\n\n“If we get a few more Republicans I think we might be able to get legislation to overturn it. It’ll be up to getting more Republicans,” he said.\n\nOn Saturday, Murphy tweeted an image of Alan Kurdi, a 3-year old Syrian boy who drowned as he and his parents were trying to flee their home country.\n\n“To my colleagues: don’t ever again lecture me on American moral leadership if you chose to be silent today,” Murphy tweeted.", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["travel", "trump", "ban", "orders", "democrats", "block", "vow", "republicans", "week", "president", "trumps", "legislation", "senate", "nominees", "murphy"], "summary": "(Bastien Inzaurralde/The Washington Post)Democrats vowed Sunday to introduce legislation to reverse President Trump’s orders implementing a travel ban from certain countries, with at least one senator saying the moves should lead to slower consideration of the president’s top Cabinet nominees.\n“We’re demanding the president reverse these executive orders that go against what we are, everything we have always stood for,” he said.\nSchumer said he believed legislation could easily move through the Senate given the growing opposition from key Republicans, including Sens.\n“If we get a few more Republicans I think we might be able to get legislation to overturn it.\n“To my colleagues: don’t ever again lecture me on American moral leadership if you chose to be silent today,” Murphy tweeted."}