{"url": "https://www.washingtonpost.com/news/innovations/wp/2017/01/30/why-trumps-travel-ban-is-so-harmful-to-the-tech-economy/", "id": "90", "title": "Why Trump’s travel ban is so harmful to the tech economy", "text": "\n\nFrom left, Amazon chief executive Jeffrey Bezos, Larry Page of Alphabet and Facebook chief operating officer Sheryl Sandberg were among the tech leaders who met with Vice President Pence and President Trump at Trump Tower last month. (Timothy A. Clary/Agence France-Presse via Getty Images)\n\nSilicon Valley exports technology and imports the world’s best talent. That is how it has helped grow the nation’s economy and boosted its competitive advantage. President Trump’s executive order banning immigrants from some Muslim countries sent shock waves through the tech industry over the weekend because it was a loud and clear message to the world that the United States’ doors are now closed, and xenophobia and bigotry are the new rules of law.\n\nIt is no wonder that executives at almost every major technology company, including Alphabet, Facebook and Apple, have made statements defending immigrants and distancing their companies from the president. These companies are worried about their survival and the future of the country.\n\nLet there be no doubt that immigrants are essential to our economic present and future. These newcomers start a disproportionate number of U.S. businesses, particularly in advanced technologies. Immigrants and foreign-passport holders occupy a growing majority of places in graduate education programs in computer science, mathematics, physics and other hard sciences. They play an outsize role in U.S. research and innovation.\n\nA 2012 research paper I co-wrote, “America’s New Immigrant Entrepreneurs: Then and Now,” documented that 24.3 percent of U.S. engineering and technology start-up companies and 43.9 percent of those based in Silicon Valley were founded by immigrants. My research also determined that immigrants contributed to more than 60 percent of the patent filings at innovative companies such as Qualcomm, Merck, General Electric and Cisco Systems. And surprisingly, more than 40 percent of the international patent applications filed by the U.S. government had foreign-national authors.\n\nStudy after study has found that immigrants are more likely to start job-creating businesses, not only in tech but across the economy. In 2014, 20 percent of the Inc. 500 companies had immigrant founders. That’s despite immigrants accounting for less than 15 percent of the U.S. population. According to research by economist Robert Fairlie for the Small Business Administration, immigrants are more than twice as likely to found businesses as nonimmigrants, and 7.1 percent of immigrant-founded businesses export their products outside the United States as compared to only 4.4 percent of non-immigrant-founded businesses.\n\nClearly, blocking the path of immigrants into the United States cuts off the exact economic growth serum that has made America great. Creating an atmosphere in which immigrants are fearful and uncertain about their future will reduce their incentives to open businesses here and stay. This is becoming even more so as other countries increasingly court educated immigrants and entrepreneurs. Those who support the president’s executive order say that the intent is to block people from countries where terrorism is sourced. But it’s not so simple.\n\nBy blocking entrance based on passport or country of birth rather than objective criteria, the executive order paints all immigrants from those affected countries and possibly dual passport holders with the same scarlet letter. What if the next Mark Zuckerberg happens to be Iranian? Or if an Albert Einstein happened to be born in Libya? Let’s not forget that Steve Jobs’s father was Syrian — and he would have been banned from entering the United States under Trump’s dictate.\n\nYes, it is true that the affected countries are not the largest sources of immigrant entrepreneurs. But setting a precedent like this can mean that a politician can use this weapon against other countries that have become critical in supplying talent to fuel U.S. innovation. What if a frustrated president elected to block immigrants with Mexican, Chinese or Indian passports? The scenario, unthinkable a few months ago, is today entirely plausible.\n\nIn my 2012 book, “The Immigrant Exodus: Why America Is Losing the Global Race to Capture Entrepreneurial Talent,” I documented the stories of numerous immigrant entrepreneurs who were forced to leave the country because of shortages of skilled immigrant visas, called green cards. It wasn’t that we didn’t want these people here; American politics was caught in a political quagmire on skilled immigration. As a result, the country began suffering a brain drain, with highly-skilled foreign-born doctors, engineers and scientists returning home.\n\nWith this executive order, Trump has made it clear that immigrants will have to worry about being singled out even after they have become lawful permanent residents; that their religion and places of birth may be the deciding factor in whether they are allowed to re-enter the United States after traveling abroad. This will no doubt turn the trickle of skilled workers permanently leaving the country into a flood. Entrepreneurs who had wanted to come here will now have second thoughts.\n\nWhether or not the courts uphold the legality of the executive order, the damage has been done. Already, the number of billion-dollar technology start-ups, commonly called “unicorns,” that are located outside the United States has been increasing significantly. Fifteen years ago, almost all were in the United States, while today 86 of the 191 unicorns are in countries such as China and India. We can expect this trend to accelerate because the Trump administration has just added fuel to the fire of innovation abroad and handicapped our own technology industry.\n\nRead more from The Washington Post’s Innovations section.\n\nWhat the U.S. can learn from India’s move toward a cashless society\n\nWhy 2017 is the year of the bot", "authors": [], "publish_date": "2017-01-30", "source": "washingtonpost", "top_words": ["executive", "travel", "immigrant", "technology", "economy", "ban", "tech", "immigrants", "order", "united", "trumps", "harmful", "countries", "entrepreneurs", "states", "president"], "summary": "Clearly, blocking the path of immigrants into the United States cuts off the exact economic growth serum that has made America great.\nThose who support the president’s executive order say that the intent is to block people from countries where terrorism is sourced.\nLet’s not forget that Steve Jobs’s father was Syrian — and he would have been banned from entering the United States under Trump’s dictate.\nWhether or not the courts uphold the legality of the executive order, the damage has been done.\nAlready, the number of billion-dollar technology start-ups, commonly called “unicorns,” that are located outside the United States has been increasing significantly."}