{"url": "https://www.washingtonpost.com/local/public-safety/judge-in-maryland-will-weigh-trump-travel-ban-the-day-before-it-takes-effect/2017/03/10/dd175406-05cc-11e7-b1e9-a05d3c21f7cf_story.html", "id": "91", "title": "Judge in Maryland will weigh Trump travel ban the day before it takes effect", "text": "A federal judge in Maryland will hear arguments on President Trump’s new travel ban the day before the measure is set to take effect. (Shawn Thew/EPA)\n\nA federal judge in Maryland will hear arguments on President Trump’s new travel ban the day before the measure is slated to take effect — offering the ban’s opponents one of their last opportunities to block it.\n\nJudge Theodore D. Chuang scheduled a hearing on the new ban for March 15 at 9:30 a.m., less than 24 hours before administration officials say they will begin enforcing it.\n\nUnless another court takes action before that, the date could be a significant one. A federal judge in Hawaii also is slated to hear arguments at 3:30 p.m. Eastern time Wednesday on whether he should immediately block Trump’s order, which suspends the U.S. refu­gee program and temporarily bars the issuance of new visas to citizens of six Muslim-majority countries.\n\nThe state of Washington, supported by several other states, separately has asked a federal judge in Seattle to declare that his freeze on Trump’s original ban applies to the new one. If the judge does so, that could obviate the need for more hearings, said Lee Gelernt, the deputy director of the ACLU’s national Immigrants’ Rights Project and a lawyer in the Maryland case. Another group in Washington also has sued to immediately block the new ban, and a judge ordered the parties to participate in a telephone hearing Monday to lay out a schedule.\n\n“At this point, we are seeking an injunction because we have no idea whether the Seattle injunction will remain in place,” Gelernt said. “What we are hoping is that the Seattle judge will continue the injunction nationwide. If he does that before the 15th, then there may not be a need for urgent action on our part.”\n\nMaryland Attorney General Brian E. Frosh (D) said Friday that his state would join Washington state’s lawsuit.\n\nA Justice Department spokeswoman declined to comment.\n\nThe hearing scheduled for Wednesday in Greenbelt stems from a lawsuit brought by the International Refugee Assistance Project and HIAS Inc., a refu­gee resettlement group. Both sued over the president’s first travel ban, which temporarily barred citizens of seven Muslim-majority countries from entering the United States and suspended the refu­gee program.\n\nThe new ban is different from the old in significant ways. It reduces the number of affected countries from seven to six — removing Iraq, while keeping Iran, Somalia, Sudan, Libya, Yemen and Syria. It also applies only to the issuance of new visas, instead of revoking visas from those who already have them.\n\nSeveral states and civil liberties groups, though, have said the new order suffers from the same legal problems as the first one because it discriminates against Muslims under the guise of being a national security measure. In deciding whether to suspend the new ban, federal judges will have to weigh the extent to which it differs from the first and whether it imposes immediate harms.\n\nMore than 130 former U.S. officials, including former Secretary of State John F. Kerry, sent an open letter to the Trump administration Friday saying the revised executive order has the same defects as the previous version, and will weaken national security and undermine U.S. leadership.\n\nThe letter was signed by officials who worked in Democratic and Republican administrations going back to President Reagan, and included many of the same well-known names who signed a Jan. 30 letter objecting to the original ban on refugees and travelers from several Muslim-majority nations. But the latest letter was signed by even more people, many of whom served under President Obama and President George W. Bush. They included cabinet secretaries, ambassadors, members of Congress and generals.\n\n“Bans like those included in this order are harmful to U.S. national security and beneath the dignity of our great nation,” said the letter, addressed to five senior Trump administration officials.\n\n“We must remain vigilant to keep our nation safe from terrorists, whether foreign or homegrown,” the letter states at another point. “At the same time, we must remain true to our ideals.”", "authors": [], "publish_date": "2017-03-10", "source": "washingtonpost", "top_words": ["travel", "trump", "day", "ban", "national", "maryland", "judge", "refugee", "order", "trumps", "takes", "federal", "states", "president", "weigh", "effect", "letter"], "summary": "A federal judge in Maryland will hear arguments on President Trump’s new travel ban the day before the measure is set to take effect.\n(Shawn Thew/EPA)A federal judge in Maryland will hear arguments on President Trump’s new travel ban the day before the measure is slated to take effect — offering the ban’s opponents one of their last opportunities to block it.\nThe state of Washington, supported by several other states, separately has asked a federal judge in Seattle to declare that his freeze on Trump’s original ban applies to the new one.\nIn deciding whether to suspend the new ban, federal judges will have to weigh the extent to which it differs from the first and whether it imposes immediate harms.\n“We must remain vigilant to keep our nation safe from terrorists, whether foreign or homegrown,” the letter states at another point."}