{"url": "https://www.washingtonpost.com/news/the-fix/wp/2017/01/29/heres-where-republicans-stand-on-president-trumps-controversial-travel-ban/", "id": "98", "title": "Whip Count: Here’s where Republicans stand on Trump’s controversial travel ban", "text": "President Trump's executive order to ban entry to the United States to citizens of seven predominantly Muslim countries has been roundly criticized by the international community and Democrats, who allege it amounts to a religious test — even a thinly veiled “Muslim ban.” There have also been numerous implementation headaches, with two judges halting deportations of those denied entry.\n\nAnd some Republicans are speaking out against Trump, too — albeit to varying degrees. Below, we break down which Republicans have gone on the record for, against or somewhat in the middle on Trump's executive order.\n\nHere is the current breakdown in each chamber:\n\nSENATE: 8 opposed, 15 have reservations, 5 support\n\nHOUSE: 16 opposed, 23 have reservations, 79 support\n\nThis list is necessarily incomplete, but it will be constantly updated as more lawmakers weigh in. If you see one we've missed, email me here. And be sure to scroll to the bottom, where a tool from The Post's Philip Bump helps you look up your own members.\n\nOpposed (24)\n\nSen. John McCain (R-Ariz.): “It is clear from the confusion at our airports across the nation that President Trump’s executive order was not properly vetted. We are particularly concerned by reports that this order went into effect with little to no consultation with the Departments of State, Defense, Justice, and Homeland Security. Such a hasty process risks harmful results. We should not stop green-card holders from returning to the country they call home. We should not stop those who have served as interpreters for our military and diplomats from seeking refuge in the country they risked their lives to help. And we should not turn our backs on those refugees who have been shown through extensive vetting to pose no demonstrable threat to our nation, and who have suffered unspeakable horrors, most of them women and children.” (Joint statement with Sen. Lindsey Graham) Sen. Lindsey Graham (R-S.C.): See above. Sen. Jeff Flake (R-Ariz.): “It’s unacceptable when even legal permanent residents are being detained or turned away at airports and ports of entry.” Sen. Ben Sasse (R-Neb.): The order is “too broad.” “If we send a signal to the Middle East that the U.S. sees all Muslims as jihadis, the terrorist recruiters win by telling kids that America is banning Muslims and that this is America versus one religion. Our generational fight against jihadism requires wisdom.” Sen. Dean Heller (R-Nev.): \"I agree that better vetting and border protection measures are necessary to our current immigration system. That's why I support the thorough vetting of individuals entering our country. However, I am deeply troubled ‎by the appearance of a religious ban. ‎The use of an overly broad executive order is not the way to strengthen national security. ‎I encourage the Administration to partner with Congress to find a solution.\" Sen. Jerry Moran (R-Kan.): \"While I support thorough vetting, I do not support restricting the rights of U.S. citizens and lawful permanent residents. Furthermore, far-reaching national security policy should always be devised in consultation with Congress and relevant government agencies.\" Sen. Cory Gardner (R-Colo.): “While I am supportive of strengthening our screening processes and securing our borders, a blanket travel ban goes too far. I also believe that lawful residents of the United States should be permitted to enter the country. I urge the Administration to take the appropriate steps to fix this overly broad executive order.” Sen. Susan Collins (R-Maine): “The worldwide refugee ban set forth in the executive order is overly broad and implementing it will be immediately problematic.” Rep. Charlie Dent (R-Pa.): “This is ridiculous. I guess I understand what his intention is, but unfortunately the order appears to have been rushed through without full consideration. You know, there are many, many nuances of immigration policy that can be life or death for many innocent, vulnerable people around the world.” Rep. Justin Amash (R-Mich.): \"Like Pres. Obama's executive actions on immigration, Pres. Trump's executive order overreaches and undermines our constitutional system.” Rep. Barbara Comstock (R-Va.): “The president’s Executive Order [goes] beyond the increased vetting actions that Congress has supported on a bipartisan basis and inexplicably applied to Green Card holders. This should be addressed and corrected expeditiously.” Rep. Brian Fitzpatrick (R-Pa.): “The president's policy entirely misses the mark.” Rep. Ileana Ros-Lehtinen (R-Fla.): “I object to the suspension of visas from the seven named countries because we could have accomplished our objective of keeping our homeland safe by immediate implementation of more thorough screening procedures.” Rep. Elise Stefanik (R-N.Y.): “Our first role as the federal government is to protect our national security and I believe we need to work in Congress to reform and strengthen our visa vetting process. However, I oppose President Trump's rushed and overly broad Executive Order.” Rep. Will Hurd (R-Tex.): The ban is the “ultimate display of mistrust” and “will erode allies' willingness to fight with us.” Rep. Leonard Lance (R-N.J.): “ … While I do support increased vetting of individuals applying to travel from countries with extensive terrorist ties or activity, the President’s current travel ban executive order appears rushed and poorly implemented.” Rep. Steve Stivers (R-Ohio): “While I agree with the President that we must improve our visa vetting process in order to better protect Americans, I believe the executive order risks violating our nation’s values and fails to differentiate mainstream Islamic partners from radical Islamic terrorists — setting back our fight against radical Islam. I urge the Administration to quickly replace this temporary order with permanent improvements in the visa vetting process.” Rep. Mark Sanford (R-S.C.): \"I'm hearing a voice of concern that things are moving from weird to reckless in their view. And that even if you're going to enact this policy, the way in which it was done just seems bizarre.\" Rep. John Faso (R-N.Y.): “After careful review of the recent executive order regarding immigration policy, I believe that the order was neither well drafted nor well implemented. Given recent events both here and abroad, we need to take steps to strengthen our nation’s security; however, this is most effectively pursued through thoughtful and deliberative legislation. While I acknowledge that the president may act in the event of a national security threat or emergency situation, this process was rushed and led to confusion. Rep. Erik Paulsen (R-Minn.): \"I support thorough vetting of those entering our country from countries and regions posing a serious threat to Americans. But this vetting must be applied responsibly and thoughtfully, and appropriately target those who are a national security risk. Unfortunately, the President's executive order is too broad and has been poorly implemented and conceived.\" Rep. Rodney Frelinghuysen (R-N.J.): “As part of his strategy to make the safety and security of the American people his top priority, President Trump believes a pause in immigration from unstable regions is warranted. However, this weekend’s confusion is an indication that the details of this executive order were not properly scrutinized. Among others, reconsideration should be given to courageous individuals who served as interpreters for our military and properly vetted refugees. Congress has important oversight responsibilities over all executive orders, which we intend to exercise.” Rep. Fred Upton (R-Mich.): “I fully support strengthening our screening processes and securing our borders, but this Executive Order needs to be scaled back. It has created real confusion for travelers and those who enforce the laws. I have heard from a number of local folks with valid concerns for themselves or loved ones as well from global companies that have legitimate worries relating to the international travel of their employees. A wiser course would have been to work with Congress to ensure that all visitors to our nation are properly vetted with appropriate documentation.\" Rep. Randy Hultgren (R-Ill.): “Unfortunately, the President's executive order is overly broad and its interpretation has been inconsistent and confused. This has led to unintended consequences, like the barring of legal permanent residents and the rejection of Syrian Christians at the airport, a religious minority that was supposed to be protected by the executive order. Keeping America First means keeping our principles first—both compassion and security. To remain the world's shining city on a hill and beacon of hope to many, we should have our arms open to those who are fleeing oppression and seeking safety, not turning them away at the door.\" Rep. Virginia Foxx (R-N.C.): \"Given shortcomings in the current screening process, I joined a bipartisan House majority in supporting legislation to strengthen the vetting process for individuals seeking entry to the United States through the Visa Waiver Program or as refugees. The Executive Order signed by the president on Friday came with little clarity and caused much uncertainty for foreign travelers. Additional implementing guidance is needed to ensure that the order can be applied in a fair and equitable manner.”\n\nReservations/decline to fully support (38)\n\nSenate Majority Leader Mitch McConnell (R-Ky.): “It’s going to be decided in the courts as to whether or not this has gone too far.” Sen. Mike Lee (R-Utah): “I do have some technical questions about President Trump's Executive Order titled 'Protecting the Nation From Foreign Terrorist Entry Into the United States.' My staff and I will continue to reach out to the White House for clarification on these issues.” Sen. Marco Rubio (R-Fla.): “We generally support additional vetting for many of those entering our country from nations where the United States has identified there are serious concerns regarding terrorist activities and planning. But given the broad scope and nature of these policy changes, we have some unanswered questions and concerns. We are seeking clarity on the changes to the Visa Waiver program, which is critical to the economies of our respective states.\" (Joint statement with Sen. Tim Scott) Sen. Tim Scott (R-S.C.): See above. Sen. Rob Portman (R-Ohio): “It is not a ban. However, I think it was not properly vetted. So, you have an extreme vetting proposal that didn't get the vetting it should have had. And as the result, in the implementation, we've seen some problems.” Sen. John Barrasso (R-Wyo.): “America has long needed to tighten the vetting process for those seeking to come here. However, a religious test or ban is against everything our country stands for. We need to remember that some of our best sources of information that keeps our nation and our troops safe comes from our Muslim friends and allies.” Sen. Joni Ernst (R-Iowa): “With respect to the President’s Executive Order, there must be more clarity surrounding the order’s implementation. In our efforts to protect our nation from ISIS, we also must ensure we are not inadvertently penalizing our allies in the fight against radical Islamic terrorism — especially those who have supported U.S. military efforts in Iraq.” Sen. Pat Toomey (R-Pa.): “I support the administration's decision to increase vetting and temporarily suspend the admission of certain individuals from states that sponsor or provide safe havens to terrorists, or are too weak to prosecute terrorists within their borders. ... Unfortunately, the initial executive order was flawed – it was too broad and poorly explained. This apparently resulted in denied entry into the United States for lawful permanent residents and others who should have been allowed immediate entry.\" Sen. Thom Tillis (R-N.C.) Sen. Lamar Alexander (R-Tenn.): “This vetting proposal itself needed more vetting. More scrutiny of those traveling from war-torn countries to the United States is wise. But this broad and confusing order seems to ban legal, permanent residents with ‘green cards,’ and might turn away Iraqis, for example, who were translators and helped save lives of Americans troops and who could be killed if they stay in Iraq. And while not explicitly a religious test, it comes close to one which is inconsistent with our American character.” Sen. Bob Corker (R-Tenn.): “We all share a desire to protect the American people, but this executive order has been poorly implemented, especially with respect to green card holders. The administration should immediately make appropriate revisions, and it is my hope that following a thorough review and implementation of security enhancements that many of these programs will be improved and reinstated.” Sen. James Lankford (R-Okla.): “This executive action has some unintended consequences that were not well thought out. I encourage the president's staff to evaluate American policy with an eye on both security and compassion for the refugees fleeing the terrors of war and persecution.” Sen. Orrin G. Hatch (R-Utah): “President Trump has described his recent order as a means ‘[to] temporarily reduce investigative burdens on relevant agencies.’ In this spirit, I urge the new administration to move quickly to tailor its policy on visa issuance as narrowly as possible so that officials can protect our security needs while reducing unnecessary burdens on the vast majority of visa-seekers that present a promise—not a threat—to our nation.” Sen. Bill Cassidy (R-La.): “I am pleased to see that this order is being refined to address this, and I look forward to it being further refined.\" Sen. Johnny Isakson (R-Ga.): \"I do think in the case of the immigration issue that the mandate over the weekend was not very well vetted and the people designed to carry out the mandate didn’t know what the mandate was, and when asked some of the questions it didn’t sound like the White House knew what it was exactly. They’ve amended it a couple times already. You need to be very careful when you’re issuing executive orders or passing laws that you vet them all the way through the system so you can carry them out once they’re in place.” House Foreign Affairs Committee Chairman Rep. Edward R. Royce (R-Calif.): \"Pausing the intake of refugees from terror hot spots is the right call to keep America safe. I hope cases of individuals with visas traveling as this executive action went into effect — including some who served alongside U.S. troops — will be resolved quickly.” Rep. Carlos Curbelo (R-Fla.): “The United States is and has always been a generous nation when it comes to welcoming those who seek refuge and want to contribute. I expect that these executive orders are in fact temporary and that after the Administration strengthens the vetting process, we can continue our tradition of welcoming those who are persecuted in an orderly manner and without any kind of religious test.” Rep. Lee Zeldin (R-N.Y.): “I support the temporary entry restriction from certain nations until the administration, Congress and the American people know with confidence that any individual being granted admission does not pose a threat to our security. … With all that being said, I will be closely monitoring the execution of this EO to make sure that any misapplication is corrected immediately.” Rep. Adam Kinzinger (R-Ill.): “I support a comprehensive look at our vetting process, and I believe it’s something every new administration would be expected to do. However, reports of green card holders and those who assisted us in the war on terror being denied or delayed entry is deeply concerning. Such detention is unacceptable and must be remedied immediately.” Rep. Bruce Poliquin (R-Maine): “The congressman will not be voting on these Executive Orders. His policy in Congress has been to increase border security, end sanctuary cities and stop Syrian refugee admissions until national security agencies put in place effective processes to ensure that no suspected or potential terrorists are allowed to cross our borders.” Rep. Mark Walker (R-N.C.): “The language of the order should not apply to legal permanent residents of the United States, and if it is being enforced in any other way, the administration should step in swiftly to clarify.” Rep. Jason Chaffetz (R-Utah): “I think it’s surprising a lot of people that he is actually doing what he said he was going to do, but there are those of us that actually support that. … People that have a green card supposedly already have been vetted, so there needs to be some further clarification.” Rep. Jim Renacci (R-Ohio): “While I strongly encourage the Administration to examine more closely whether it is effectual and necessary to subject green card holders from these nations to this temporary order, I fully support our government's renewed commitment to keeping Americans of all faiths safe and free across our homeland.” Rep. Raul Labrador (R-Idaho): Trump has the authority but “inadequate review and poor implementation.” Rep. Susan Brooks (R-Ind.): “I do not believe in discrimination, I do not support a religious test for immigrants or refugees, and I do support our nation's refugee resettlement program. America is a nation of immigrants, and our diversity has always been one of our greatest strengths. I join my colleagues in Congress in calling on the Administration for more information and clarity around the impact of the temporary provisions in the executive order on people who already have visas or who have previously been granted legal status.” Rep. John Katko (R-N.Y.): “I believe the President's intent was to accomplish that goal. However, I have concerns with this executive order, including the fact that it could potentially deny entrance to our country to lawful, permanent residents and dual citizens.” Rep. Jim Sensenbrenner (R-Wis.): \"After a town hall meeting, I was pressed to answer questions about whether the President's immigration pause should apply to green card holders. I do not believe it is right to ban green card holders from entering the United States absent evidence of a threat, regardless of where they are from. I misspoke and I apologize for the confusion.\" Rep. Dan Newhouse (R-Wash.): \"It is reasonable to conduct a review of prospective and existing visa holders and refugees to make sure they do not pose a security risk. However, the manner in which this Order is being implemented at airports and other points of entry appears that some innocent people, including some who have performed brave and valuable service to our anti-terror efforts, are having their lives needlessly disrupted. I encourage the administration to review its order in consultation with its national security team to ensure our enforcement resources are being targeted where they can be most effective and to allow those law-abiding green card holders and visa holders who clearly aren't a threat to security to return to their jobs and communities here in America.\" Rep. Jaime Herrera Beutler (R-Wash.): \"Surely there is a way to enhance the security at our borders without unnecessarily detaining innocent individuals who have followed the rules, stood in line, and pose no threat to our country, and I hope this Administration takes quick action to ensure that we’re focused only on those who pose a threat to our safety.\" Rep. Pat Tiberi (R-Ohio): \"Regarding the administration's temporary order, there are questions that need to be answered on how it is being implemented. Together with Congress, we should reevaluate our visa vetting process so that we effectively strengthen national security, uphold our values and protect our freedoms, while ensuring we are welcoming individuals and families fleeing persecution.\" Rep. Dave Reichert (R-Wash.) Rep. Frank LoBiondo (R-N.J.): \"This is a temporary pause in the refugee resettlement program so that we may strengthen the screening process to prevent Islamic jihadists from coming to our country to attack us. The hasty execution of such efforts have created wide-spread confusion, frustration and misrepresentation of what America stands for. This was avoidable and I urge the Trump Administration, working with appropriate federal, state and local agencies, to quickly reassess.” Rep. Larry Bucshon (R-Ind.): \"I support temporarily restricting the admittance of refugees and other travelers from these select areas until a verifiable system is in place to fully and completely vet whether or not the individuals admitted pose a threat to the safety of the American people. The restrictions should not affect U.S. citizens or legal permanent residents. In addition, I believe people with previously approved refugee status applications or visas should be admitted to the U.S.\" Rep. Dave Joyce (R-Ohio) Rep. Jack Bergman (R-Mich.): \"At its heart, this executive order represents a temporary pause to make sure we have adequate vetting procedures in place to prevent terror attacks against Americans on U.S. soil. That said, I believe we should work to maintain our status as a welcoming, sovereign nation for the unjustly persecuted and for those in countries of conflict who have risked their lives to support our armed forces.\" Rep. Frank Lucas (R-Okla.): “While I support the goal of President Trump’s executive order to strengthen America’s national security, I believe the administration must further clarify their long term objectives and the manner in which they intend to implement these new travel restrictions.” Rep. Mike Bishop (R-Mich.): “The primary duty of Congress is to keep Americans safe. All of our nation's security agencies agree that admitting individuals without the ability to properly vet them places national security and American lives at risk. That said, we need greater clarity from the administration to ensure this order is not carried out in a way that infringes on civil liberties and the protections guaranteed by our Constitution. We must remain vigilant and focused on going after enemies like ISIS – without targeting our allies in the process.\" Rep. Greg Walden (R-Ore.)\n\nSupport (84)\n\nUnclear (18)\n\nSen. Charles Grassley (R-Iowa): “The goals of the Executive Order are commendable, and something President Trump promised during the campaign, but implementation will be key to ensuring the bad guys are kept out while remaining a welcoming nation to people of all backgrounds and religions.” Sen. Todd Young (R-Ind.): \"I look forward to carefully analyzing this temporary executive order and its effects, and working with this new administration and my colleagues in Congress to keep America safe while finally ending the unspeakable suffering of the Syrian people.” Sen. Pat Roberts (R-Kan.): \"We need to strike a balance that protects the rights of Americans and those permitted to enter the country legally. The president needs to work with Congress to ensure every aspect of a major policy change such as this is taken into consideration.\" Sen. John Boozman (R-Ark.): \"We need reasonable measures that allow us to evaluate safety checks for people coming into our country. I have great confidence in Secretary Kelly and look forward to working with him to secure our borders. This is best achieved by working with Congress and the appropriate agencies to alleviate unintended consequences.\" Sen. Lisa Murkowski (R-Alaska) Sen. Mike Crapo (R-Idaho): \"During town meetings I held across my state, Idahoans affirmed that we must take steps to secure our borders, and I agree. We will need to constantly refine and improve our vetting process.\" Sen. John Cornyn (R-Tex.): \"I support the vetting of refugees and immigrants coming into our country, but I oppose blanket exclusion of anybody according to their religion. That’s not what America is all about.\" Rep. Kay Granger (R-Tex.): \"I am convinced that President Trump made this decision because he believes it will make us safer.” Rep. Robert Pittenger (R-N.C.): \"While we should be responsive to those who are persecuted for their faith or impacted by war, we need a thorough vetting of all refugees, consistent with the American Security Against Foreign Enemies Act (H.R. 4038), which I co-sponsored and helped pass with strong bipartisan support in 2015. This bipartisan legislation required the FBI, CIA, and Homeland Security to be engaged in the refugee vetting process to prevent access by infiltrated terrorists.” Rep. Francis Rooney (R-Fla): “The purpose of this ban is to have time to put procedures and processes in place to gain control over our borders and assure the American people that we know who is coming in, why and what they will do here. We should demand no less than these basic safeguards from our government. Rep. Ryan Costello (R-Pa.): \"I interpret these executive orders as temporary. We should all want a robust yet humane process for entry screening, and I am confident we can and will continue the American ethos of welcoming the persecuted and oppressed in a safe and orderly manner, with very strong security protections for our citizens.” Rep. Kevin Yoder (R-Kan.) Rep. Mike Coffman (R-Colo.): “While I’ve supported heightened vetting procedures for those wanting to travel to our country, I have never, nor will I ever support a blanket travel ban for people solely based on ethnic or religious grounds.” Rep. Steve Chabot (R-Ohio): \"A key piece to ensuring our safety is taking appropriate steps to properly vet those entering our nation, and making sure that those who would do us harm are not admitted. At the same time, our policies should be crafted and executed to minimize the impact on innocent people, particularly those who have abided by our laws and have already been vetted.\" Rep. Jason Lewis (R-Minn.): \"While this includes border security and immigration controls on those who enter our nation from dangerous parts of the world, I have never supported a religious test for immigration and nor does the Constitution. Nor do I believe in banning entry for green card holders, who are lawful residents of our country no matter where they are flying from, or those who have aided us on the field of battle. Yet the American people do expect us to properly vet those who wish to do us harm.\" Rep. Rob Wittman (R-Va.): \"Since its disorderly rollout, we have learned from Homeland Security Secretary John Kelly that this executive order will not prevent lawful green card holders from returning to the United States. This is a temporary pause on refugee resettlement from a select group of war-torn, volatile countries, as first identified by the Obama Administration, that are known to harbor and export terrorists.\" Rep. Drew Ferguson (R-Ga.): “The first job of the federal government is to keep its citizens safe. Georgians and Americans everywhere deserve to be safe in their communities. Given the growing number of threats around the world, increased awareness and effective policy to address these threats is warranted.” Rep. Jody Hice (R-Ga.): \"While we welcome refugees, I believe that the fundamental responsibility of the federal government is to provide for the common defense, including ensuring those who reach our shores are first fully vetted through a reliable screening process.\"\n\nNo comment so far (organized by chamber and state)\n\nSENATE\n\nAlabama\n\nJeff Sessions\n\nRichard Shelby\n\nAlaska\n\nDan Sullivan\n\nIdaho\n\nJim Risch\n\nKentucky\n\nRand Paul\n\nLouisiana\n\nJohn Neely Kennedy\n\nMississippi\n\nRoger Wicker\n\nThad Cochran\n\nNebraska\n\nDeb Fischer\n\nNorth Carolina\n\nRichard Burr\n\nNorth Dakota\n\nJohn Hoeven\n\nOklahoma\n\nJim Inhofe\n\nSouth Dakota\n\nMike Rounds\n\nJohn Thune\n\nWest Virginia\n\nShelley Moore Capito\n\nWisconsin\n\nRon Johnson\n\nWyoming\n\nMike Enzi\n\nHOUSE\n\nAlabama\n\nMartha Roby\n\nMike Rogers\n\nMo Brooks\n\nGary Palmer\n\nAlaska\n\nDon Young\n\nArizona\n\nMartha McSally\n\nDavid Schweikert\n\nTrent Franks\n\nArkansas\n\nFrench Hill\n\nSteve Womack\n\nBruce Westerman\n\nCalifornia\n\nPaul Cook\n\nJeff Denham\n\nDavid Valadao\n\nKevin McCarthy\n\nSteve Knight\n\nMimi Walters\n\nDana Rohrabacher\n\nDuncan Hunter\n\nColorado\n\nScott Tipton\n\nFlorida\n\nMatt Gaetz\n\nTed Yoho\n\nJohn Rutherford\n\nRon DeSantis\n\nBill Posey\n\nGus Bilirakis\n\nTom Rooney\n\nBrian Mast\n\nGeorgia\n\nTom Price\n\nRob Woodall\n\nAustin Scott\n\nBarry Loudermilk\n\nRick Allen\n\nTom Graves\n\nIdaho\n\nMike Simpson\n\nIllinois\n\nPeter Roskam\n\nMike Bost\n\nDarin LaHood\n\nIndiana\n\nJim Banks\n\nTrey Hollingsworth\n\nIowa\n\nDavid Young\n\nSteve King\n\nKansas\n\nLynn Jenkins\n\nKentucky\n\nJames Comer\n\nBrett Guthrie\n\nThomas Massie\n\nHal Rogers\n\nAndy Barr\n\nLouisiana\n\nGarret Graves\n\nMaryland\n\nAndy Harris\n\nMichigan\n\nBill Huizenga\n\nJohn Moolenaar\n\nTim Walberg\n\nPaul Mitchell\n\nMississippi\n\nTrent Kelly\n\nGregg Harper\n\nSteven Palazzo\n\nMissouri\n\nAnn Wagner\n\nBlaine Luetkemeyer\n\nVicky Hartzler\n\nSam Graves\n\nJason Smith\n\nMontana\n\nRyan Zinke\n\nNebraska\n\nJeff Fortenberry\n\nDon Bacon\n\nAdrian Smith\n\nNevada\n\nMark Amodei\n\nNew Jersey\n\nTom MacArthur\n\nChris Smith\n\nNew Mexico\n\nSteve Pearce\n\nNorth Carolina\n\nGeorge Holding\n\nWalter Jones\n\nDavid Rouzer\n\nRobert Pittenger\n\nPatrick McHenry\n\nMark Meadows\n\nTed Budd\n\nOhio\n\nBob Latta\n\nMike Turner\n\nOklahoma\n\nSteve Russell\n\nPennsylvania\n\nScott Perry\n\nGlenn Thompson\n\nPat Meehan\n\nBill Shuster\n\nTom Marino\n\nLloyd Smucker\n\nSouth Carolina\n\nTrey Gowdy\n\nMick Mulvaney\n\nTom Rice\n\nTennessee\n\nPhil Roe\n\nJimmy Duncan\n\nChuck Fleischmann\n\nScott DesJarlais\n\nTexas\n\nLouie Gohmert\n\nTed Poe\n\nSam Johnson\n\nJeb Hensarling\n\nKevin Brady\n\nMike Conaway\n\nMac Thornberry\n\nRandy Weber\n\nPete Olson\n\nWill Hurd\n\nKenny Marchant\n\nJohn Carter\n\nUtah\n\nRob Bishop\n\nChris Stewart\n\nMia Love\n\nVirginia\n\nMorgan Griffith\n\nWest Virginia\n\nDavid McKinley\n\nAlex Mooney\n\nEvan Jenkins\n\nWyoming\n\nLiz Cheney\n\nMike DeBonis, Sean Sullivan, Karoun Demirjian, Kelsey Snell, Amber Phillips, Elise Viebeck and Ed O'Keefe contributed to this post.", "authors": [], "publish_date": "2017-01-29", "source": "washingtonpost", "top_words": ["heres", "count", "travel", "controversial", "executive", "ban", "rep", "security", "vetting", "republicans", "support", "stand", "trumps", "sen", "country", "whip", "order", "administration", "process"], "summary": "Below, we break down which Republicans have gone on the record for, against or somewhat in the middle on Trump's executive order.\nOpposed (24)Sen. John McCain (R-Ariz.): “It is clear from the confusion at our airports across the nation that President Trump’s executive order was not properly vetted.\nHowever, I oppose President Trump's rushed and overly broad Executive Order.” Rep. Will Hurd (R-Tex.\nHowever, this weekend’s confusion is an indication that the details of this executive order were not properly scrutinized.\nThe Executive Order signed by the president on Friday came with little clarity and caused much uncertainty for foreign travelers."}