{"url": "https://www.bostonglobe.com/news/politics/2017/03/06/trump-travel-order-apply-those-seeking-new-visas/sgXDU1gJzwHXkLZqsgiRdN/story.html", "id": "18", "title": "Trump’s travel order to apply to those seeking new visas", "text": "From left: Secretary of State Rex Tillerson, Attorney General Jeff Sessions, and Homeland Security Secretary John Kelly spoke about the new travel order.\n\nWASHINGTON — President Trump scaled back his executive order barring migrants from several predominantly Muslim countries Monday, in an attempt to insulate the controversial rules from a flurry of legal challenges and critics.\n\nThe new executive order, which will be phased in starting March 16, removes Iraq from the list of original list of seven banned countries. The switch came after the Iraqi government, a key ally in the fight against the Islamic State, decried the initial order and worked with the State Department on mutually agreeable vetting procedures.\n\nThe revised ban halts the US refugee program for at least 120 days, removes language that prioritized religious minorities, clarifies that preapproved visa holders would still be allowed entry, and cuts the country’s refugee resettlement program this year by more than half, to 50,000 people a year.\n\nAdvertisement\n\n“This order is part of our ongoing efforts to eliminate vulnerabilities that radical Islamic terrorists can and will exploit for destructive ends,” said Secretary of State Rex Tillerson.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe rewrite was a rare retreat by the famously defiant Trump, which showed that the president and his team appear to have learned some lessons from the hastily drafted original order and its botched rollout.\n\nTrump’s initial travel ban sparked chaos in January. Without warning, Trump banned citizens from seven countries — Iraq, Iran, Syria, Somalia, Sudan, Yemen, and Libya — from traveling to the United States for 90 days. The order was later stayed by federal courts.\n\nIn contrast to the unveiling of the first travel ban, Trump did not perform a public bill signing Monday, choosing instead to ratify the order privately and later dispatch members of his Cabinet to explain its effects. The president was so upset after previous court defeats of his order that he called one deciding jurist a “so-called judge.”\n\nTrump officials discuss revised travel ban\n\nIn Democrat-heavy Massachusetts, officials pushed back on the revised travel ban.\n\nAdvertisement\n\n“This watered-down redraft is a clear attempt to resurrect a discredited order and fulfill a discriminatory and unconstitutional campaign promise,” said Attorney General Maura Healey. She said she would consider legal options for blocking the measure.\n\nMayor Martin J. Walsh of Boston said in a statement: “It was wrong the first time and it’s wrong the second. In Boston, we will always stand by our immigrant community.” Members of the congressional delegation added their opposition.\n\nThe new order was announced at a brief press conference, where Tillerson, Attorney General Jeff Sessions, and Secretary of Homeland Security John Kelly did not take media questions.\n\nIn a later statement, Kelly argued that the scope of the revised order was, in general, more limited than its predecessor.\n\n“The executive order signed today is prospective in nature — applying only to foreign nationals outside of the United States who do not have a valid visa,” Kelly said. “It is important to note that nothing in this executive order affects current lawful permanent residents or person with current authorization to enter our country. If you have a current valid visa to travel, we welcome you.”\n\nAdvertisement\n\nHowever, Deborah Anker, an immigration law scholar at Harvard and director of Harvard’s Immigration and Refugee Clinical program, said she still expects the order to run into substantial legal challenges.\n\nAnker cited three areas of law where she anticipates legal problems for the White House: the establishment clause of the Constitution, the Refugee Act of 1980, and nondiscrimination provisions baked into laws governing immigrant visas.\n\nLast week, a memo from the Department of Homeland Security disclosed by the Associated Press concluded that citizenship was an “unlikely indicator” of a threat.\n\nIn his statement to the press, Sessions said about 300 refugees are currently being investigated by the FBI for terrorism. However, officials have refused to say just how many come from the six banned countries. Even if the number is accurate, 300 refugees represent a small fraction of the total refugee population currently living in the United States, since nearly 85,000 refugees resettled stateside in 2016 alone.\n\n“The fundamental policy of the new executive order is the same. It’s banning entry and issuance of visas for people from specified Muslim countries. It’s still a ban,” Anker said.\n\nAll in all, she added, Trump has turned “his back on fundamental policies that have governed us” since World War II.\n\nThe president originally planned to announce the revised order weeks ago, but reportedly held off after a topsy-turvy week threw his administration into a defensive posture. Reports indicated Sessions may have misled Congress about his meetings with Russian officials, and Trump spent the weekend tweeting unsupported conspiracy claims about Barack Obama allegedly having wiretapped Trump Tower.\n\nOn Monday, the administration and congressional Republicans tried to use new order to get back to policy basics.\n\nHouse Speaker Paul Ryan, who criticized the haphazard rollout of the first travel ban, said the new version “advances our shared goals of protecting the homeland.”\n\nBut activists, immigration lawyers, and Democrats continue to push back against the basic premise of the travel ban, citing statistics that show no fatal terrorist events inside the United States have been committed by refugees since 1980.\n\nCatherine Tactaquin, executive editor of the National Institute for Immigrant and Refugee Rights, said no amount of revision can change her organization's opposition.\n\n“Together with the suspension of refugee program for 120 days, [the order] puts into jeopardy the lives of so many people seeking safe haven in the United States,” Tactaquin said.\n\nThe American Civil Liberties Union, which sued the Trump administration regarding the original order before it was ultimately put on hold last month by a federal judge in Washington state, said it plans to fight the revised version in court.\n\nOn Twitter, the ACLU dubbed the new executive order #MuslimBanNo2.\n\n“The Trump administration has conceded that its original Muslim ban was indefensible,” said Omar Jadwat, director of the ACLU’s Immigrants’ Rights Project. “Unfortunately, it has replaced it with a scaled-back version that shares the same fatal flaws. The only way to actually fix the Muslim ban is not to have a Muslim ban.”\n\nAstead W. Herndon can be reached at astead.herndon@globe.com . Follow him on Twitter @AsteadWH", "authors": ["Astead W. Herndon", "Globe Staff"], "publish_date": "2017-03-06", "source": "bostonglobe", "top_words": ["apply", "executive", "travel", "trump", "revised", "ban", "visas", "state", "refugee", "united", "states", "trumps", "order", "seeking"], "summary": "From left: Secretary of State Rex Tillerson, Attorney General Jeff Sessions, and Homeland Security Secretary John Kelly spoke about the new travel order.\nThe new executive order, which will be phased in starting March 16, removes Iraq from the list of original list of seven banned countries.\nTrump’s initial travel ban sparked chaos in January.\nThe president was so upset after previous court defeats of his order that he called one deciding jurist a “so-called judge.”Trump officials discuss revised travel banIn Democrat-heavy Massachusetts, officials pushed back on the revised travel ban.\nIn a later statement, Kelly argued that the scope of the revised order was, in general, more limited than its predecessor."}