{"url": "https://www.bostonglobe.com/metro/2017/07/10/healey-files-brief-supporting-hawaii-travel-ban-injunction/Rv4QZnOriC4HBa9WChc4KK/story.html", "id": "104", "title": "AG Healey files brief supporting Hawaii travel ban injunction", "text": "State Attorney General Maura Healey asserted that people who are deciding whether to work or study in the US will “take into account whether their close family members will be able to visit them.”\n\nMassachusetts has joined 14 other states, and the District of Columbia, in signaling support for Hawaii’s renewed challenge to President Donald Trump’s travel ban.\n\nOn Monday, Massachusetts Attorney General Maura Healey filed an amicus brief urging the courts to narrow the scope of the travel restrictions, which affect six countries with Muslim majorities.\n\nLast month, the US Supreme Court allowed portions of the ban to go into effect. Exempt from the ban were those able to prove a “bona fide relationship with a person or entity in the United States,” such as family, employers, or educational institutions. Grandparents were among the family members who were not granted exemptions.\n\nAdvertisement\n\nIn the brief, Healey asserted that people who are deciding whether to work or study in the US will “take into account whether their close family members will be able to visit them.”\n\nGet Fast Forward in your inbox: Forget yesterday's news. Get what you need today in this early-morning email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nAs a result, “the artificially narrow line drawn by the federal government will thus also likely impair the ability of institutions” to recruit and retain those “who do not wish to endure the hardship of disruption and separation from family members.”\n\nHealey also contended that the government’s definition of a close family relationship is not supported by the language Supreme Court laid out when allowing the ban to take effect.\n\n“The Court viewed the injunction as encompassing a broad category of relationships beyond those found within a traditional nuclear family,” the brief stated. “An ailing grandmother could not receive end-of-life care from her foreign granddaughter. A niece whose foreign aunt was like a mother to her could not bring that aunt to witness and celebrate her wedding. And an orphaned child would not be permitted to receive a visit from the uncle who took care of her financial and emotional needs after her father’s untimely death.”\n\nAlso supporting the brief were New York, California, Connecticut, Delaware, Illinois, Iowa, Maine, Maryland, New Mexico, Oregon, Rhode Island, Vermont, Virginia, and Washington.\n\nAdvertisement\n\nLast week, a Honolulu judge rejected Hawaii’s bid to curtail the travel ban, saying that the state could directly ask the Supreme Court to clarify its ruling. Hawaii responded late Friday by asking the courts to issue an injunction.\n\nAimee Ortiz can be reached at aimee.ortiz@globe.com . Follow her on twitter @aimee_ortiz", "authors": ["Globe Staff"], "publish_date": "2017-07-10", "source": "bostonglobe", "top_words": ["travel", "hawaii", "ban", "brief", "family", "supreme", "court", "ag", "files", "visit", "members", "close", "supporting", "healey", "injunction"], "summary": "On Monday, Massachusetts Attorney General Maura Healey filed an amicus brief urging the courts to narrow the scope of the travel restrictions, which affect six countries with Muslim majorities.\nLast month, the US Supreme Court allowed portions of the ban to go into effect.\nGrandparents were among the family members who were not granted exemptions.\n“The Court viewed the injunction as encompassing a broad category of relationships beyond those found within a traditional nuclear family,” the brief stated.\nAdvertisementLast week, a Honolulu judge rejected Hawaii’s bid to curtail the travel ban, saying that the state could directly ask the Supreme Court to clarify its ruling."}