{"url": "https://www.bostonglobe.com/opinion/2017/09/05/count-donald-trump-for-one-thing-abusing-immigrants/emvhhLxKDunsmnIl7bQjZJ/story.html", "id": "178", "title": "Count on Donald Trump for one thing: Abusing immigrants", "text": "Consistency is not a word that many people would apply to the Trump White House. But there is one notable exception – highlighted this week by the president’s decision to rescind the DACA program, which allows the children of undocumented immigrants to avoid deportation. It’s the Trump administration’s cruel and punitive behavior toward people of color.\n\nIt’s actually harder to come up with the campaign promises and pledges that Trump has followed through on than it is to chronicle his many flip-flops. Mexico is not paying for the wall, and Trump isn’t even trying to get them to do it. He didn’t lock up Hillary Clinton, pull the United States out of NAFTA, or declare China a currency manipulator. He went back on his pledge to protect Medicare and Medicaid. He’s done almost nothing to combat the opioid crisis or create new jobs. And as for draining the swamp . . . not so much.\n\nBut when it comes to the issues that energize his most intolerant and bigoted supporters, Trump is a paragon of dependability.\n\nAdvertisement\n\nOne of his first acts as president was to try to impose, via executive order, the so-called Muslim travel ban, which he had announced to great fanfare on the campaign trail in late 2015. Thankfully, the White House’s astounding incompetence (one other area of Trump administration consistency) has, so far, stopped that restrictions from coming into place.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nUnfortunately, the same cannot be said about its action toward undocumented immigrants. As of May, immigration arrests were up nearly 40 percent over the same period last year, even as deportations declined due to the huge backlog in cases. While the Obama administration actively worked to deport undocumented immigrants who have committed crimes, Trump has expanded the mandate of immigration officials to allow for noncriminals to be deported and families to be torn asunder by a slavish adherence to immigration law. The stories of undocumented immigrants who have made a life for themselves in America being taken away from their spouses and children have been both heartbreaking and all too common in Trump’s America. The Trump administration has even put in place policies to punish and deport undocumented immigrants who try to bring their children into the country.\n\nAll of this is consistent with an administration that has seemingly prioritized policies and actions that target people of color in America and give comfort to racists and white nationalists. From pushing for greater voting restrictions and toughening punishments for low-level drug offenses to pardoning the odious Joe Arpaio and refusing to single out neo-Nazi protesters for criticism, Trump has repeatedly fed the racial animus of his strongest supporters.\n\nNow we have the decision to end the DACA program. By all measures, the DACA program has been a huge success. It’s helped 800,000 undocumented immigrants who arrived in America as children to go to school, work, and pay taxes. Aside from the policy aspects, these are individuals who have spent their entire lives in America. They are as American as those who are native born. Punishing them for the actions of their parents is beyond cruel.\n\nEven if one buys the Trump administration’s argument that President Obama’s executive action creating the program was unconstitutional, Trump has an easy fix: Push Congress to pass legislation codifying DACA. But by putting in place a policy to wind down DACA over the next several months and daring Congress to save DACA, Trump has unnecessarily injected fear and uncertainty into the lives of 800,000 dreamers. And if Congress does nothing, their lives will be permanently upended.\n\nAdvertisement\n\nSo why do it? The answer, in part, is that this is what Trump and his aides believe his base of voters want. And they’re not wrong. Trump ran on a platform of racism and xenophobia. He portrayed undocumented immigrants as bloodthirsty killers — and his supporters lustily cheered these attacks at campaign event after campaign event. Now Trump is paying them back, just as he has over the past seven months — giving them morsels of racism while ignoring nearly all his other campaign promises.\n\nIt’s an unfortunate but essential reminder that for Trump’s most strident supporters, it wasn’t his economic populism or pledge to fix bad trade deals that united them behind his candidacy. It was his unabashed endorsement of bigotry, xenophobia, and racism. Trump’s DACA decision is not only unimaginably cruel, but also completely unnecessary. From a political perspective, though, it’s hardly a surprise. After all, when you elect an unabashed bigot, xenophobe, and racist to become president, no one should be surprised that these are the policies he implements.\n\nMichael A. Cohen’s column appears regularly in the Globe. Follow him on Twitter @speechboy71", "authors": [], "publish_date": "2017-09-05", "source": "bostonglobe", "top_words": ["count", "thing", "america", "trump", "immigrants", "abusing", "donald", "white", "children", "undocumented", "daca", "administration", "campaign", "program"], "summary": "Consistency is not a word that many people would apply to the Trump White House.\nSign up for more newsletters hereUnfortunately, the same cannot be said about its action toward undocumented immigrants.\nThe Trump administration has even put in place policies to punish and deport undocumented immigrants who try to bring their children into the country.\nIt’s helped 800,000 undocumented immigrants who arrived in America as children to go to school, work, and pay taxes.\nHe portrayed undocumented immigrants as bloodthirsty killers — and his supporters lustily cheered these attacks at campaign event after campaign event."}