{"url": "https://www.bostonglobe.com/news/nation/2017/09/18/refugees/OAYupccn4Wm1DaR8iG4fuM/story.html", "id": "197", "title": "Trump administration rejects study citing benefits of refugees", "text": "WASHINGTON — Trump administration officials, under pressure from the White House to provide a rationale for reducing the number of refugees allowed into the United States next year, rejected a study by the Department of Health and Human Services that found that refugees brought in $63 billion more in government revenues during the past decade than they cost.\n\nThe draft report, a portion of which was obtained by The New York Times, contradicts a central argument made by advocates of deep cuts in refugee totals as President Trump faces an Oct. 1 deadline to decide on an allowable number. The issue has sparked intense debate within his administration as opponents of the program, led by Trump’s chief policy adviser, Stephen Miller, assert that continuing to welcome refugees is too costly and raises concerns about terrorism.\n\nAdvocates of the program inside and outside the administration say refugees are a major benefit to the United States, paying more in taxes than they consume in public benefits, and filling jobs in service industries that others will not. But research documenting their fiscal upside — prepared for a report mandated by Trump in a March presidential memorandum implementing his travel ban — never made its way to the White House. Some of those proponents believe the report was suppressed.\n\nAdvertisement\n\nThe internal study, completed in late July but never publicly released, found that refugees “contributed an estimated $269.1 billion in revenues to all levels of government” between 2005 and 2014 through the payment of federal, state, and local taxes. “Overall, this report estimated that the net fiscal impact of refugees was positive over the 10-year period, at $63 billion.”\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nBut White House officials said those conclusions were illegitimate and politically motivated, and were disproved by the final report issued by the agency, which says the per-capita cost of a refugee is higher than that of the cost of an American.\n\n“This leak was delivered by someone with an ideological agenda, not someone looking at hard data,” said Raj Shah, a White House spokesman. “The actual report pursuant to the presidential memorandum shows that refugees with few skills coming from war-torn countries take more government benefits from the Department of Health and Human Services than the average population, and are not a net benefit to the US economy.”\n\nJohn Graham, acting assistant secretary for planning and evaluation at the health department, said: “We do not comment on allegedly leaked documents” and that no report had been finalized. He noted that Trump’s memorandum “seeks an analysis related to the cost of refugee programs. Therefore, the only analysis in the scope of HHS’s response to the memo would be on refugee-related expenditures from data within HHS programs.”\n\nThe three-page report the agency ultimately submitted, dated Sept. 5, does just that, comparing the costs of refugees to Americans and making no mention of revenues contributed by refugees.\n\nAdvertisement\n\n“In an average year over the 10-year period, per-capita refugee costs for major HHS programs totaled $3,300,” it says. “Per-person costs for the U.S. population were lower, at $2,500, reflecting a greater participation of refugees in HHS programs, especially during their first four years” in the United States.\n\nIt was not clear who in the administration decided to keep the information out of the final report. Miller personally intervened in the discussions on the refugee cap to ensure that only the costs — not any fiscal benefit — of the program were considered, according to two people familiar with the talks. And he has played a crucial role in the internal discussions over refugee admissions, which are capped by an annual presidential determination that is usually coordinated by the National Security Council and led in large part by the State Department.\n\nThis year, officials at the State Department as well as the Department of Defense have argued vociferously that the United States should admit no fewer than the 50,000-refugee cap that Trump imposed in January as part of the travel ban, but Miller has advocated for a much lower number — half or less, according to people familiar with the internal talks who described them on condition of anonymity because they were not authorized to detail them. The Department of Homeland Security last week proposed a cap of 40,000. The limits being debated would be the lowest in more than three decades.\n\n“We see an administration that’s running a program that it’s intent on destroying,” said Mark Hetfield, the president of HIAS, one of nine refugee resettlement agencies opposing the cut in admissions. “We do have champions in the White House and in the administration, but they’re not being given a voice in this.”\n\nThe issue is coming to a head as Trump attends the UN General Assembly this week for the first time as president. The United Nations has repeatedly appealed to nations to resettle 1.2 million refugees fleeing war and persecution from all over the world, and former President Barack Obama used the gathering last year to tout his goal of admitting 110,000 refugees in the fiscal year that ends this month, and to pressure other countries to follow the lead of the United States in embracing more displaced people.\n\nAdvertisement\n\nTrump, by contrast, has highlighted his goal of radically cutting refugee admissions. The president moved swiftly after taking office to crack down on refugees, issuing his original ban against travelers from seven predominantly Muslim countries only a week after taking office.\n\nFacing legal challenges to that order, his administration released a second travel ban two months later against six countries, along with a presidential memorandum in which Trump called on the secretary of state to consult with the secretaries of Health and Human Services and Homeland Security and his White House budget director and submit within 180 days “a report detailing the estimated long-term costs of the United States Refugee Admissions Program at the federal, state, and local levels, along with recommendations about how to curtail those costs.”", "authors": ["Julie Hirschfeld Davis", "Somini Sengupta", "New York Times"], "publish_date": "2017-09-18", "source": "bostonglobe", "top_words": ["trump", "benefits", "report", "refugee", "refugees", "united", "house", "costs", "department", "rejects", "study", "white", "citing", "administration"], "summary": "Advocates of the program inside and outside the administration say refugees are a major benefit to the United States, paying more in taxes than they consume in public benefits, and filling jobs in service industries that others will not.\nBut research documenting their fiscal upside — prepared for a report mandated by Trump in a March presidential memorandum implementing his travel ban — never made its way to the White House.\n“This leak was delivered by someone with an ideological agenda, not someone looking at hard data,” said Raj Shah, a White House spokesman.\nAdvertisement“In an average year over the 10-year period, per-capita refugee costs for major HHS programs totaled $3,300,” it says.\nIt was not clear who in the administration decided to keep the information out of the final report."}