{"url": "https://www.bostonglobe.com/opinion/2017/02/10/standing-for-called-law/VLbDYmrwpdjCn8qs5FPJaK/story.html", "id": "177", "title": "Standing up for ‘so-called’ law", "text": "Last Saturday, President Trump tweeted, “The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!” In mocking Judge James L. Robart, the federal district court judge who stayed the president’s executive order banning travel for individuals from seven predominantly Muslim countries, Trump risks making an enemy of the law and the Constitution. He then expressed contempt for the deliberations of the three-member appellate court convened to review Robart’s order, calling the legal argument “disgraceful,” and remarking that a “bad high school student would understand this” — before the appellate panel unanimously left Robart’s order in place.\n\nNow Trump is attacking anyone who calls him to account — senators, scientists, the civil service, the media, and the Democratic Party, to name a few. His approach divides the world between friends and enemies, vividly reminding us of the political philosophy of notorious theorist Carl Schmitt. Politics, Schmitt said, was an existential struggle for survival that requires us to destroy those who oppose us. It is no surprise, therefore, that Trump tells us that he is in a “running war” with the media, and that Trump’s trusted adviser, Stephen Bannon, instructs the press to “keep its mouth shut and just listen for while.”\n\nMuslims are the latest enemy on Trump’s hit list. His recent executive order was plainly drafted to appeal to his supporters during the campaign. Because such a shocking proposal would violate sacred American traditions protecting religious freedom and nondiscrimination, he crafted the executive order in the close confines of the White House and refused to permit the relevant federal agencies with legal expertise — Homeland Security, Defense, State, Justice — to vet the order. The evident goal was to maximize the political impact of the order while minimizing the reasonable restraints that a respect for law might impose.\n\nAdvertisement\n\nThe executive order produced pointless confusion and massive heartbreak. It caused untold and needless suffering among the more than 100,000 affected by the administration’s secret revocation of already-granted visas. Although the White House initially announced that only 109 persons had been affected by the order, the administration’s staggeringly inaccurate account of the facts can most charitably be explained by a cruel indifference to the order’s human consequences. The sufferings of Muslims apparently don’t count once they are included on Trump’s growing enemy list.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nTrump’s executive order feeds the “clash of civilizations” narrative used by Islamic radicals to recruit those, including disaffected American citizens, who would attack this country. It turns the United States from a shining beacon into a scene of religious and ethnic discrimination. It is no accident that anti-Semitism and reports of hate crimes are on the rise.\n\nWe are deans of respected law schools. We have dedicated our professional lives to the proposition that law overrides violence with reason. Law stands for what we have in common, not merely what divides us. Law respects disagreement; it patiently considers evidence and advocacy; it engages with the views of all. Each person — not just each citizen — is equal before the law. Created in ancient times to terminate endless cycles of vengeance and retribution, law substitutes official, publicly justified sanctions for animosity and enmity.\n\nThis is what is so radically disturbing about Trump’s attack on Judge James L. Robart, the George W. Bush appointee who temporarily suspended the enforcement of the executive order. If Trump believes he can make an enemy of the law and of the Constitution, then he has truly become a foe of the Republic, despite the oath he swore at his inauguration. The craft and professional culture of law is what makes politics possible; it is what keeps politics from spiraling into endless violence. By questioning the legitimacy and authority of judges, Trump seems perilously close to characterizing the law as simply one more enemy to be smashed into submission. At risk are the legal practices and protections that guard our freedom and our safety from the mob violence that destroyed democracies in the 1930s.\n\nIt is time for all who care about this nation to worry when the nation’s most powerful office is used to intimidate the institutions of law that have maintained American stability and prosperity since the founding of the Republic. Trump’s attack on the “so-called” Judge Robart and his “ridiculous” order exposes just how fragile our democracy is. The President’s own nominee for the Supreme Court, Judge Neil Gorsuch, has called Trump’s attacks on courts “disheartening” and “demoralizing.” We must be vigilant to preserve what makes America precious: the thirst for freedom and fairness, the demands of responsibility and cooperation, the solidarity that somehow makes e pluribus unum. Law is an essential medium of these virtues. If we are to keep the rule of law, it must not be a partisan question; it must not be the concern simply of lawyers. We must all defend it, passionately and whole-heartedly. Without the rule of law, we may have a “so-called” president who has in fact become a tyrant. Fundamentally, this moment is not about Trump. It is about all of us.\n\nEditor’s Note: At the authors’ request, this piece has been updated since its original print publication.\n\nMartha Minow is the dean and professor of law at Harvard Law School. Robert Post is the dean and professor of law at Yale Law School.", "authors": ["Martha Minow", "Robert Post"], "publish_date": "2017-02-10", "source": "bostonglobe", "top_words": ["executive", "socalled", "trump", "standing", "judge", "trumps", "enemy", "school", "order", "law", "violence"], "summary": "His recent executive order was plainly drafted to appeal to his supporters during the campaign.\nTrump’s attack on the “so-called” Judge Robart and his “ridiculous” order exposes just how fragile our democracy is.\nWithout the rule of law, we may have a “so-called” president who has in fact become a tyrant.\nMartha Minow is the dean and professor of law at Harvard Law School.\nRobert Post is the dean and professor of law at Yale Law School."}