{"url": "https://www.bostonglobe.com/news/politics/2017/01/29/here-where-republicans-stand-trump-controversial-travel-ban/X8pbi1BptV9mIE1SiHR40K/story.html", "id": "13", "title": "Here’s where Republicans stand on Trump’s controversial travel ban", "text": "House Speaker Paul Ryan said President Trump “is right to make sure we are doing everything possible to know exactly who is entering our country.’’\n\nWASHINGTON — President Trump’s executive order to ban entry to the United States to citizens of seven predominantly Muslim countries has been roundly criticized by the international community and Democrats, who allege it amounts to a religious test - even a thinly veiled ‘‘Muslim ban.’’ There have also been numerous implementation headaches, with two judges halting deportations of those denied entry.\n\nAnd some Republicans are speaking out against Trump, too - albeit to varying degrees. Below, we break down who has gone on the record for, against or somewhat in the middle on Trump’s executive order.\n\nThis list is necessarily incomplete, but it will be constantly updated as more lawmakers weigh in. If you see one we’ve missed, email me here.\n\nOpposed (21)\n\nAdvertisement\n\nSen. John McCain (R-Ariz.): ‘‘It is clear from the confusion at our airports across the nation that President Trump’s executive order was not properly vetted. We are particularly concerned by reports that this order went into effect with little to no consultation with the Departments of State, Defense, Justice, and Homeland Security. Such a hasty process risks harmful results. We should not stop green-card holders from returning to the country they call home. We should not stop those who have served as interpreters for our military and diplomats from seeking refuge in the country they risked their lives to help. And we should not turn our backs on those refugees who have been shown through extensive vetting to pose no demonstrable threat to our nation, and who have suffered unspeakable horrors, most of them women and children.’’ (Joint statement with Sen. Lindsey Graham)\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nSen. Lindsey Graham (R-S.C.): See above.\n\nSen. Jeff Flake (R-Ariz.): ‘‘It’s unacceptable when even legal permanent residents are being detained or turned away at airports and ports of entry.’’\n\nSen. Ben Sasse (R-Neb.): The order is ‘‘too broad.’’ ‘‘If we send a signal to the Middle East that the U.S. sees all Muslims as jihadis, the terrorist recruiters win by telling kids that America is banning Muslims and that this is America versus one religion. Our generational fight against jihadism requires wisdom.’’\n\nSen. Dean Heller (R-Nev.): ‘‘I agree that better vetting and border protection measures are necessary to our current immigration system. That’s why I support the thorough vetting of individuals entering our country. However, I am deeply troubled ?by the appearance of a religious ban. ?The use of an overly broad executive order is not the way to strengthen national security. ?I encourage the Administration to partner with Congress to find a solution.’’\n\nAdvertisement\n\nSen. Jerry Moran (R-Kan.): ‘‘While I support thorough vetting, I do not support restricting the rights of U.S. citizens and lawful permanent residents. Furthermore, far-reaching national security policy should always be devised in consultation with Congress and relevant government agencies.’’\n\nSen. Cory Gardner (R-Colo.): ‘‘While I am supportive of strengthening our screening processes and securing our borders, a blanket travel ban goes too far. I also believe that lawful residents of the United States should be permitted to enter the country. I urge the Administration to take the appropriate steps to fix this overly broad executive order.’’\n\nSen. Susan Collins (R-Maine): ‘‘The worldwide refugee ban set forth in the executive order is overly broad and implementing it will be immediately problematic.’’\n\nRep. Charlie Dent (R-Pa.): ‘‘This is ridiculous. I guess I understand what his intention is, but unfortunately the order appears to have been rushed through without full consideration. You know, there are many, many nuances of immigration policy that can be life or death for many innocent, vulnerable people around the world.’’\n\nRep. Justin Amash (R-Mich.): ‘‘Like Pres. Obama’s executive actions on immigration, Pres. Trump’s executive order overreaches and undermines our constitutional system.’’\n\nAdvertisement\n\nRep. Barbara Comstock (R-Va.): ‘‘The president’s Executive Order [goes] beyond the increased vetting actions that Congress has supported on a bipartisan basis and inexplicably applied to Green Card holders. This should be addressed and corrected expeditiously.’’\n\nRep. Brian Fitzpatrick (R-Pa.): ‘‘The president’s policy entirely misses the mark.’’\n\nRep. Ileana Ros-Lehtinen (R-Fla.): ‘‘I object to the suspension of visas from the seven named countries because we could have accomplished our objective of keeping our homeland safe by immediate implementation of more thorough screening procedures.’’\n\nRep. Elise Stefanik (R-N.Y.): ‘‘Our first role as the federal government is to protect our national security and I believe we need to work in Congress to reform and strengthen our visa vetting process. However, I oppose President Trump’s rushed and overly broad Executive Order.’’\n\nRep. Will Hurd (R-Tex.): The ban is the ‘‘ultimate display of mistrust’’ and ‘‘will erode allies’ willingness to fight with us.’’\n\nRep. Leonard Lance (R-N.J.): ‘‘ . . . While I do support increased vetting of individuals applying to travel from countries with extensive terrorist ties or activity, the President’s current travel ban executive order appears rushed and poorly implemented.’’\n\nRep. Steve Stivers (R-Ohio): ‘‘While I agree with the President that we must improve our visa vetting process in order to better protect Americans, I believe the executive order risks violating our nation’s values and fails to differentiate mainstream Islamic partners from radical Islamic terrorists - setting back our fight against radical Islam. I urge the Administration to quickly replace this temporary order with permanent improvements in the visa vetting process.’’\n\nRep. Mark Sanford (R-S.C.): ‘‘I’m hearing a voice of concern that things are moving from weird to reckless in their view. And that even if you’re going to enact this policy, the way in which it was done just seems bizarre.’’\n\nRep. John Faso (D-N.Y.): ‘‘After careful review of the recent executive order regarding immigration policy, I believe that the order was neither well drafted nor well implemented. Given recent events both here and abroad, we need to take steps to strengthen our nation’s security; however, this is most effectively pursued through thoughtful and deliberative legislation. While I acknowledge that the president may act in the event of a national security threat or emergency situation, this process was rushed and led to confusion.\n\nRep. Erik Paulsen (R-Minn.): ‘‘I support thorough vetting of those entering our country from countries and regions posing a serious threat to Americans. But this vetting must be applied responsibly and thoughtfully, and appropriately target those who are a national security risk. Unfortunately, the President’s executive order is too broad and has been poorly implemented and conceived.’’\n\nRep. Rodney Frelinghuysen (R-N.J.): ‘‘As part of his strategy to make the safety and security of the American people his top priority, President Trump believes a pause in immigration from unstable regions is warranted. However, this weekend’s confusion is an indication that the details of this executive order were not properly scrutinized. Among others, reconsideration should be given to courageous individuals who served as interpreters for our military and properly vetted refugees. Congress has important oversight responsibilities over all executive orders, which we intend to exercise.’’\n\nReservations/decline to fully support (32)\n\nSenate Majority Leader Mitch McConnell (R-Ky.): ‘‘It’s going to be decided in the courts as to whether or not this has gone too far.’’\n\nSen. Mike Lee (R-Utah): ‘‘I do have some technical questions about President Trump’s Executive Order titled ‘Protecting the Nation From Foreign Terrorist Entry Into the United States.’ My staff and I will continue to reach out to the White House for clarification on these issues.’’\n\nSen. Marco Rubio (R-Fla.): ‘‘We generally support additional vetting for many of those entering our country from nations where the United States has identified there are serious concerns regarding terrorist activities and planning. But given the broad scope and nature of these policy changes, we have some unanswered questions and concerns. We are seeking clarity on the changes to the Visa Waiver program, which is critical to the economies of our respective states.’’ (Joint statement with Sen. Tim Scott)\n\nSen. Tim Scott (R-S.C.): See above.\n\nSen. Rob Portman (R-Ohio): ‘‘It is not a ban. However, I think it was not properly vetted. So, you have an extreme vetting proposal that didn’t get the vetting it should have had. And as the result, in the implementation, we’ve seen some problems.’’\n\nSen. John Barrasso (R-Wyo.): ‘‘America has long needed to tighten the vetting process for those seeking to come here. However, a religious test or ban is against everything our country stands for. We need to remember that some of our best sources of information that keeps our nation and our troops safe comes from our Muslim friends and allies.’’\n\nSen. Joni Ernst (R-Iowa): ‘‘With respect to the President’s Executive Order, there must be more clarity surrounding the order’s implementation. In our efforts to protect our nation from ISIS, we also must ensure we are not inadvertently penalizing our allies in the fight against radical Islamic terrorism - especially those who have supported U.S. military efforts in Iraq.’’\n\nSen. Pat Toomey (R-Pa.): ‘‘I support the administration’s decision to increase vetting and temporarily suspend the admission of certain individuals from states that sponsor or provide safe havens to terrorists, or are too weak to prosecute terrorists within their borders. ... Unfortunately, the initial executive order was flawed - it was too broad and poorly explained. This apparently resulted in denied entry into the United States for lawful permanent residents and others who should have been allowed immediate entry.’’\n\nSen. Thom Tillis (R-N.C.)\n\nSen. Lamar Alexander (R-Tenn.): ‘‘This vetting proposal itself needed more vetting. More scrutiny of those traveling from war-torn countries to the United States is wise. But this broad and confusing order seems to ban legal, permanent residents with ‘green cards,’ and might turn away Iraqis, for example, who were translators and helped save lives of Americans troops and who could be killed if they stay in Iraq. And while not explicitly a religious test, it comes close to one which is inconsistent with our American character.’’\n\nSen. Bob Corker (R-Tenn.): ‘‘We all share a desire to protect the American people, but this executive order has been poorly implemented, especially with respect to green card holders. The administration should immediately make appropriate revisions, and it is my hope that following a thorough review and implementation of security enhancements that many of these programs will be improved and reinstated.’’\n\nSen. James Lankford (R-Okla.): ‘‘This executive action has some unintended consequences that were not well thought out. I encourage the president’s staff to evaluate American policy with an eye on both security and compassion for the refugees fleeing the terrors of war and persecution.’’\n\nSen. Orrin G. Hatch (R-Utah): ‘‘President Trump has described his recent order as a means ‘[to] temporarily reduce investigative burdens on relevant agencies.’ In this spirit, I urge the new administration to move quickly to tailor its policy on visa issuance as narrowly as possible so that officials can protect our security needs while reducing unnecessary burdens on the vast majority of visa-seekers that present a promise-not a threat-to our nation.’’\n\nSen. Bill Cassidy (R-La.): ‘‘I am pleased to see that this order is being refined to address this, and I look forward to it being further refined.’’\n\nHouse Foreign Affairs Committee Chairman Rep. Edward R. Royce (R-Calif.): ‘‘Pausing the intake of refugees from terror hot spots is the right call to keep America safe. I hope cases of individuals with visas traveling as this executive action went into effect - including some who served alongside U.S. troops - will be resolved quickly.’’\n\nRep. Carlos Curbelo (R-Fla.): ‘‘The United States is and has always been a generous nation when it comes to welcoming those who seek refuge and want to contribute. I expect that these executive orders are in fact temporary and that after the Administration strengthens the vetting process, we can continue our tradition of welcoming those who are persecuted in an orderly manner and without any kind of religious test.’’\n\nRep. Lee Zeldin (R-N.Y.): ‘‘I support the temporary entry restriction from certain nations until the administration, Congress and the American people know with confidence that any individual being granted admission does not pose a threat to our security. . . . With all that being said, I will be closely monitoring the execution of this EO to make sure that any misapplication is corrected immediately.’’\n\nRep. Adam Kinzinger (R-Ill.): ‘‘I support a comprehensive look at our vetting process, and I believe it’s something every new administration would be expected to do. However, reports of green card holders and those who assisted us in the war on terror being denied or delayed entry is deeply concerning. Such detention is unacceptable and must be remedied immediately.’’\n\nRep. Bruce Poliquin (R-Maine): ‘‘The congressman will not be voting on these Executive Orders. His policy in Congress has been to increase border security, end sanctuary cities and stop Syrian refugee admissions until national security agencies put in place effective processes to ensure that no suspected or potential terrorists are allowed to cross our borders.’’\n\nRep. Mark Walker (R-N.C.): ‘‘The language of the order should not apply to legal permanent residents of the United States, and if it is being enforced in any other way, the administration should step in swiftly to clarify.’’\n\nRep. Jason Chaffetz (R-Utah): ‘‘I think it’s surprising a lot of people that he is actually doing what he said he was going to do, but there are those of us that actually support that. . . . People that have a green card supposedly already have been vetted, so there needs to be some further clarification.’’\n\nRep. Jim Renacci (R-Ohio): ‘‘While I strongly encourage the Administration to examine more closely whether it is effectual and necessary to subject green card holders from these nations to this temporary order, I fully support our government’s renewed commitment to keeping Americans of all faiths safe and free across our homeland.’’\n\nRep. Raul Labrador (R-Idaho): Trump has the authority but ‘‘inadequate review and poor implementation.’’\n\nRep. Susan Brooks (R-Ind.): ‘‘I do not believe in discrimination, I do not support a religious test for immigrants or refugees, and I do support our nation’s refugee resettlement program. America is a nation of immigrants, and our diversity has always been one of our greatest strengths. I join my colleagues in Congress in calling on the Administration for more information and clarity around the impact of the temporary provisions in the executive order on people who already have visas or who have previously been granted legal status.’’\n\nRep. John Katko (R-N.Y.): ‘‘I believe the President’s intent was to accomplish that goal. However, I have concerns with this executive order, including the fact that it could potentially deny entrance to our country to lawful, permanent residents and dual citizens.’’\n\nRep. Jim Sensenbrenner (R-Wis.): ‘‘After a town hall meeting, I was pressed to answer questions about whether the President’s immigration pause should apply to green card holders. I do not believe it is right to ban green card holders from entering the United States absent evidence of a threat, regardless of where they are from. I misspoke and I apologize for the confusion.’’\n\nRep. Dan Newhouse (R-Wash.): ‘‘It is reasonable to conduct a review of prospective and existing visa holders and refugees to make sure they do not pose a security risk. However, the manner in which this Order is being implemented at airports and other points of entry appears that some innocent people, including some who have performed brave and valuable service to our anti-terror efforts, are having their lives needlessly disrupted. I encourage the administration to review its order in consultation with its national security team to ensure our enforcement resources are being targeted where they can be most effective and to allow those law-abiding green card holders and visa holders who clearly aren’t a threat to security to return to their jobs and communities here in America.’’\n\nRep. Jaime Herrera Beutler (R-Wash.): ‘‘Surely there is a way to enhance the security at our borders without unnecessarily detaining innocent individuals who have followed the rules, stood in line, and pose no threat to our country, and I hope this Administration takes quick action to ensure that we’re focused only on those who pose a threat to our safety.’’\n\nRep. Pat Tiberi (R-Ohio): ‘‘Regarding the administration’s temporary order, there are questions that need to be answered on how it is being implemented. Together with Congress, we should reevaluate our visa vetting process so that we effectively strengthen national security, uphold our values and protect our freedoms, while ensuring we are welcoming individuals and families fleeing persecution.’’\n\nRep. Frank LoBiondo (R-N.J.): ‘‘This is a temporary pause in the refugee resettlement program so that we may strengthen the screening process to prevent Islamic jihadists from coming to our country to attack us. The hasty execution of such efforts have created wide-spread confusion, frustration and misrepresentation of what America stands for. This was avoidable and I urge the Trump Administration, working with appropriate federal, state and local agencies, to quickly reassess.’’\n\nRep. Larry Bucshon (R-Ind.): ‘‘I support temporarily restricting the admittance of refugees and other travelers from these select areas until a verifiable system is in place to fully and completely vet whether or not the individuals admitted pose a threat to the safety of the American people. The restrictions should not affect U.S. citizens or legal permanent residents. In addition, I believe people with previously approved refugee status applications or visas should be admitted to the U.S.’’\n\nRep. Dave Joyce (R-Ohio)\n\nSupport (75)\n\nHouse Speaker Paul D. Ryan (R-Wis.): ‘‘President Trump is right to make sure we are doing everything possible to know exactly who is entering our country.’’\n\nSen. Tom Cotton (R-Ark.): ‘‘It’s simply wrong to call the president’s executive order concerning immigration and refugees ‘a religious test’ of any kind. I doubt many Arkansans or Americans more broadly object to taking a harder look at foreigners coming into our country from war-torn nations with known terror networks; I think they’re wondering why we don’t do that already.’’\n\nSen. Roy Blunt (R-Mo.): ‘‘He is doing what he told the American people he would do. I would not support a travel ban on Muslims; I do support increased vetting on people applying to travel from countries with extensive terrorist ties or activity. These seven countries meet that standard. Our top priority should be to keep Americans safe.’’\n\nSen. Steve Daines (R-Mont.): ‘‘We are at war with Islamic extremists and anything less than 100 percent verification of these refugees’ backgrounds puts our national security at risk. We need to take the time to examine our existing programs to ensure terrorists aren’t entering our country. The safety of U.S. citizens must be our number one priority.’’\n\nHouse Homeland Security Committee Chairman Michael McCaul (R-Tex.): ‘‘With the stroke of a pen, he is doing more to shut down terrorist pathways into this country than the last Administration did in eight years.’’\n\nRep. Lou Barletta (R-Pa.): ‘‘I commend President Trump for suspending the refugee program, and in particular for Syria and the six other countries, because they are unquestionably terrorist havens and hotspots.’’\n\nRep. Jeff Duncan (R-S.C.): ‘‘I’m grateful that @realDonaldTrump is making the safety security of the American people his top priority. His actions are very appropriate.’’\n\nRep. Steve Scalise (R-La.): ‘‘It’s very prudent to say, ‘Let’s be careful about who comes into our country to make sure that they’re not terrorists.’’’\n\nRep. Dan Donovan (R-N.Y.): ‘‘President Trump’s decision is in America’s best interest, and I support exploring safe zones in the region to protect innocent life.’’\n\nRep. Bob Goodlatte (R-Va.): ‘‘The primary duty of the federal government is to keep Americans safe. Today, President Trump has begun to fulfill this responsibility by taking a number of critical steps within his authority to strengthen national security and the integrity of our nation’s immigration system.’’\n\nRep. Dave Trott (R-Mich.): ‘‘Until we can adequately vet these refugees and ensure the safety of all Americans, I support President Trump’s executive order to stay refugees from these terror-prone countries.’’\n\nRep. Dave Reichert (R-Wash.): ‘‘My first and most important job is protecting families in our region and the American people . . . We must be absolutely certain we have systems in place capable of thoroughly vetting anyone applying for refugee status on American soil.’’\n\nRep. Bradley Byrne (R-Ala.): ‘‘I appreciate President Trump’s efforts to address these issues as he works to keep the American people safe. While there have been some issues with the order’s implementation, I look forward to working with the Trump Administration to make sure their efforts to protect the American people succeed in a timely and effective manner.’’\n\nRep. Scott Taylor (R-Va.): ‘‘While I do not agree with some of the rhetoric, taking a pause, figuring out if we are properly vetting people, and making changes if necessary to continue our American principles is prudent and needed. The safety and protection of our citizens must remain our number one priority.’’\n\nRep. Vern Buchanan (R-Fla.): ‘‘LONG OVERDUE: A freeze on Syrian refugees and a crackdown on sanctuary cities! Time to protect Americans.’’\n\nRep. Dennis Ross (R-Fla.): ‘‘This is long overdue. We must ensure our country is safe from radical Islamic jihadists who want to kill Americans.’’\n\nRep. John Ratcliffe (R-Tex.): ‘‘I applaud President Trump’s actions to vamp up the vetting of refugees attempting to enter our country.\n\nRep. Brian Babin (R-Tex.): ‘‘Great news - now let’s get it into law!’’\n\nRep. Bill Johnson (R-Ohio): ‘‘I support President Trump’s temporary, three month, precautionary action directed towards a handful of countries with a history of producing and exporting terrorists. These countries are either torn apart by violence, or under the control of hostile, jihadist governments.’’\n\nRep. Cathy McMorris Rodgers (R-Wash.): ‘‘’It is the federal government’s responsibility to protect the American people, and the Trump administration is following through on that responsibility.’’\n\nRep. Jackie Walorski (R-Ind.): ‘‘The temporary suspension of the refugee program and admission of individuals from countries where terrorism poses an elevated threat will allow our national security officials to examine the vetting process and strengthen safeguards to prevent terrorists from entering our homeland. I hope the administration provides greater clarity in the coming days on its implementation of the order and its review of vetting procedures.’’\n\nRep. Roger Marshall (R-Kan.): ‘‘President Trump is ensuring that he is doing all he can to protect us from radical Islamic terror, and to secure channels of migration in the future. Though we would like to see a more specific definition worked through Congress, we understand the need for quick action, and we stand by him in this effort.’’\n\nRep. Luke Messer (R-Ind.): ‘‘This is a pause, not a ban, while we work to ensure the U.S. has effective vetting processes in place to protect Americans from terrorist threats. The details will of course matter, but it’s way past time for us to develop this capability, and President Trump is right to prioritize American safety until we get this done.’’\n\nRep. Richard Hudson (R-N.C.): ‘‘At a time of grave security threats, President Trump is right to pause the flow of refugees from countries where terrorism is rampant until we can properly vet them and implement additional screening for individuals traveling to and from these countries.’’\n\nRep. Pete Sessions (R-Tex.): ‘‘Just as President Obama suspended the refugee program in 2011 for six months, the Trump Administration is working to protect national security by making adjustments in the refugee vetting process. It is critical that we address the threat of individuals who come to our country to create chaos and threaten our freedom.’’\n\nRep. Todd Rokita (R-Ind.): ‘‘This is not a ban on Muslim refugees, as the order specifically targets a select few nations with known terrorist networks and is similar to an executive order signed by President Obama without controversy in 2011. The President and his administration must now focus on the execution of this order, ensuring that it is implemented effectively and fairly.’’\n\nRep. Jodey Arrington (R-Tex.): ‘‘It is important that our commander in chief puts the safety of Americans first. Given concerns about the inadequate vetting of refugees and problems with our immigration system, this temporary pause is intended to ensure the safety of our citizens.’’\n\nRep. Devin Nunes (R-Calif.): ‘‘In light of attempts by jihadist groups to infiltrate fighters into refugee flows to the West, along with Europe’s tragic experience coping with this problem, the Trump Administration’s executive order on refugees is a common-sense security measure to prevent terror attacks on the homeland. While accommodations should be made for green card holders and those who’ve assisted the U.S. armed forces, this is a useful temporary measure on seven nations of concern until we can verify who is entering the United States.’’\n\nRep. Rod Blum (R-Iowa): ‘‘ . . . The bottom line is they can’t properly vet people coming from war-torn areas like Syria and Iraq. If we can’t vet people properly, then we shouldn’t be allowing them into our country. I’m supportive of that.’’\n\nRep. Joe Barton (R-Tex.): ‘‘We have heard of brief delays among constituents and are empathetic to any inconveniences while traveling.’’\n\nRep. Roger Williams (R-Tex.): ‘‘President Trump is responsible for defending this country, and I think what we’ve seen in the last couple days with executive orders that he’s passed, that’s what he’s doing.’’\n\nRep. Robert Aderholt (R-Ala.): ‘‘Quite frankly, I think it is commonsense for additional vetting to occur for the countries that are home to ISIS and AL Qaeda. The fact that some in DC are lost in the political correctness of this, is not that surprising.\n\nRep. Kevin Cramer (R-N.D.): ‘‘I think what Donald Trump is doing is he’s pulling America’s head out of the sand and facing the reality that we have not been kept very safe by current immigration and refugee policies.’’\n\nRep. Michael Burgess (R-Tex.): ‘‘As he has made clear, President Trump is taking the steps well within his authority, and based off intelligence gathered in the Obama Administration, to keep our country safe. Congress should remain involved in the process and provide legislation to strengthen not only border security but vetting those who wish to enter the country through any means.’’\n\nRep. John Shimkus (R-Ill.): ‘‘This temporary halt will give Congress and the new Administration time to evaluate and improve the vetting process, and in the meantime gives Secretary Kelly authority to grant exceptions to the restrictions as needed. One of those exceptions must be to green card holders, who have already undergone extensive screening.’’\n\nRep. Sean Duffy (R-Wis.): ‘‘President Trump is fulfilling a campaign promise to re-evaluate our visa vetting process so that the American people are safe from terrorism.’’\n\nRep. David Kustoff (R-Tenn.): ‘‘I believe President Trump is putting American safety first, and I will encourage a long-term plan that is consistent with the values and compassion on which our great nation was founded.’’\n\nRep. Peter King (R-N.Y.): ‘‘I don’t think the Constitution applies to people coming in from outside the country, especially if there is a logical basis for it.’’\n\nRep. Chris Collins (R-N.Y.): ‘‘I get a little frustrated with the folks who don’t like Trump trying to make something into something it’s not. So I’m just disappointed that we can’t have a true and honest debate without someone inflaming the situation and claiming there’s religious overtones.’’\n\nRep. Marsha Blackburn (R-Tenn.): ‘‘President Trump issued an executive order on Friday to do exactly what he promised - protect the American people.’’\n\nRep. Buddy Carter (R-Ga.): ‘‘While I believe there needs to be thoughtful clarifications on the executive actions similar to Secretary Kelly’s announcement about lawful permanent residents, the number one priority of the federal government is to provide for the common defense.’’\n\nRep. Clay Higgins (R-La.): ‘‘The president’s executive order for a short-term restriction on visa entries from seven countries, that are known to foster terrorists, combined with a systematic review of our immigration and vetting procedure, is reasonable.’’\n\nRep. Tom Emmer (R-Minn.): ‘‘Everybody needs to take a deep breath. There is no litmus test based on religion. The administration and I understand it has, takes the seven countries identified by the Obama administration, not this administration as the most dangerous countries when it comes to potential terrorists.’’\n\nRep. Kristi Noem (R-S.D.): ‘‘I support putting a temporary pause on accepting refugees from terrorist-held areas - at least until the administration can certify that asylum seekers do not present a safety threat to the U.S.’’\n\nRep. Bill Flores (R-Tex.): ‘‘Taking 120-day breath to evaluate the effectiveness of our vetting program is a smart thing to do.’’\n\nRep. Lamar Smith (R-Tex.): ‘‘I appreciate President Trump’s effort to protect innocent Americans from those who might commit terrorist acts. We ought to take every reasonable step possible to protect the American people. Those from terrorist sponsoring countries should not be admitted until they can be properly vetted by our national security agencies.’’\n\nRep. Diane Black (R-Tenn.): ‘‘We should insist upon the\\\n\nmost careful and cautious vetting possible for refugees from failed states and hostile nations and I commend the President for taking this duty seriously after the failures of the Obama administration.’’\n\nRep. Blake Farenthold (R-Tex.): ‘‘Just as we lock our doors at night, we must be cautious who we allow into our country. The countries on President Trump’s list are the same countries President Obama identified during his presidency.’’\n\nRep. John Culberson (R-Tex.): ‘‘This is a necessary pause in the refugee program until our intelligence agencies can develop adequate background checks to ensure that the people coming into the country are coming in for the right reasons.’’\n\nRep. Dave Brat (R-Va.): ‘‘Let’s be clear: the temporary halt on migration from seven countries will last only a few months until we have solid vetting procedures in place. And, these seven countries with a temporary travel ban have been identified by both the Obama administration and our intelligence agencies as being the greatest threat to our national security because they have a history of training, harboring, and exporting terrorism.’’\n\nRep. Tom Reed (R-N.Y.): ‘‘We are confident these orders will be carefully and fairly implemented, with strong oversight by Congress.’’\n\nRep. Rick Crawford (R-Ark.): ‘‘Green card holders and aides of the U.S. military should be allowed entry, but refugees from countries with very active threat networks deserve additional scrutiny, period. Trump’s executive order on refugees from 7 unstable nations is a temporary security measure designed to keep our nation safer, which is the role of our federal government above everything else.’’\n\nRep. Ralph Abraham (R-La.): Spokesman: ‘‘Dr. Abraham generally supports President Trump’s temporary suspension of the refugee and immigration admittance program. Dr. Abraham agrees with President Trump that we must take all necessary steps to protect American citizens from potential terrorism threats, and this temporary measure from the President will allow for a thorough review of our policies and procedures for vetting applicants from war-torn areas.’’\n\nRep. Keith Rothfus (R-Pa.)\n\nRep. Doug Collins (R-Ga.): ‘‘The executive order allows re-entry to lawful permanent residents and does not represent a comprehensive ban on entry to people from certain countries. In this temporary measure, President Trump has given us the opportunity to get refugee policy right going forward.’’\n\nRep. Tom Cole (R-Okla.): ‘‘It is fair and appropriate to debate the merits of President Trump’s executive order and its initial implementation. But it is inappropriate to engage in demagogic, inflammatory, inaccurate and reckless rhetoric that is designed to create and exploit a political issue rather than address a real threat to our security. I fear that is exactly what we are seeing from many of the President’s critics.’’\n\nRep. Mike Johnson (R-La.): ‘‘This is not an effort to ban any religion, but rather an effort to adequately protect our homeland. We live in a dangerous world, and this important measure will help us balance freedom and security.’’\n\nRep. Doug Lamborn (R-Colo.): ‘‘By taking steps to temporarily stop refugee admittance from nations that are hotbeds of terrorist activity, the President is taking prudent action to ensure that his national security and law enforcement teams have the strategies and systems in place that they will need to protect and defend America.’’\n\nRep. Darrell Issa (R-Calif.)\n\nRep. Billy Long (R-Mo.): ‘‘President Trump’s recent executive order on national security shows how keeping Americans safe remains one of his top priorities. Allowing agencies to reevaluate the refugee resettlement program is a commonsense approach to making sure that happens.’’\n\nRep. Mario Diaz-Balart (R-Fla.): ‘‘The ban is only temporary until the Administration can review and enact the necessary procedures to vet immigrants from these countries. The ban is based on countries the Obama administration identified as ‘countries of concern’ and not based on a religious test.’’\n\nRep. Joe Wilson (R-S.C.): ‘‘I support the President’s efforts to secure our borders and keep American families safe from terrorist attacks by pausing the refugee program to provide necessary improvements to the vetting process.’’\n\nRep. Markwayne Mullin (R-Okla.): ‘‘First and foremost, we have a duty to protect our U.S. citizens and this great country. Until we can do that with certainty, a lawful pause, much like President Obama’s pause of Iraqis in 2011, allows for a thoughtful review of our vetting process to ensure those determined to bring harm to our country are identified. This executive order isn’t intended to keep people out, it’s intended to keep people safe.’’\n\nRep. Andy Biggs (R-Ariz.): ‘‘This order is exactly what President Trump said he would do during the campaign, and he should be applauded for following through with his promises.’’\n\nRep. Jim Jordan (R-Ohio): ‘‘President Trump’s actions today are the first step toward securing our country from illegal immigration.’’\n\nRep. Warren Davidson (R-Ohio): ‘‘The Administration’s pause on allowing refugees from terrorist strongholds is a commonsense solution in the effort to protect American citizens.’’\n\nRep. Bob Gibbs (R-Ohio): ‘‘Re-examining the vetting process to ensure no Jihadist terrorists are slipping through the cracks is long overdue.’’\n\nRep. Brad Wenstrup (R-Ohio): ‘‘While thoughtful clarifications are needed to address any unintended consequences of the administration’s order, temporarily pausing and taking a comprehensive look at our vetting process is a commonsense security measure.’’\n\nRep. Doug LaMalfa (R-Calif.): ‘‘I believe that the policy of placing a temporary hold on persons from countries that are known exporters of terrorism while we reevaluate and strengthen our vetting procedures makes sense.’’\n\nRep. Tim Murphy (R-Pa.): ‘‘We know that many people that flooded into Europe didn’t have documents had false documents, we know that ISIS was intentionally working on forging documents for people. Our first and main goal is the safety and security of the American people, that means some many experience inconvenience for a while.’’\n\nRep. Paul Gosar (R-Ariz.): ‘‘I fully support President Trump’s Executive Order to strengthen our immigration and refugee screening process.’’\n\nRep. Jim Bridenstine (R-Okla.): ‘‘President Trump’s Executive Order on immigration is simply a pause, similar to ones issued by previous presidents including Mr. Obama. The temporary pause affects only seven terror prone countries so we can better vet people coming into the United States. The goal is to balance security with access. There is no ban on any religion.’’\n\nRep. Daniel Webster (R-Fla.): ‘‘I am thankful to see President Trump is taking his responsibility to protect our country seriously and putting Americans’ safety first.’’\n\nRep. Ken Calvert (R-Calif.): ‘‘For many of the same reasons President Obama slowed down the Iraqi refugee program in 2011 to implement new security screening requirements, I believe it makes sense to ensure we know who exactly we are allowing into our country.’’\n\nUnclear (13)\n\nSen. Charles Grassley (R-Iowa): ‘‘The goals of the Executive Order are commendable, and something President Trump promised during the campaign, but implementation will be key to ensuring the bad guys are kept out while remaining a welcoming nation to people of all backgrounds and religions.’’\n\nSen. Todd Young (R-Ind.): ‘‘I look forward to carefully analyzing this temporary executive order and its effects, and working with this new administration and my colleagues in Congress to keep America safe while finally ending the unspeakable suffering of the Syrian people.’’\n\nSen. Pat Roberts (R-Kan.): ‘‘We need to strike a balance that protects the rights of Americans and those permitted to enter the country legally. The president needs to work with Congress to ensure every aspect of a major policy change such as this is taken into consideration.’’\n\nSen. John Boozman (R-Ark.): ‘‘We need reasonable measures that allow us to evaluate safety checks for people coming into our country. I have great confidence in Secretary Kelly and look forward to working with him to secure our borders. This is best achieved by working with Congress and the appropriate agencies to alleviate unintended consequences.’’\n\nSen. Lisa Murkowski (R-Alaska)\n\nSen. Mike Crapo (R-Idaho): ‘‘During town meetings I held across my state, Idahoans affirmed that we must take steps to secure our borders, and I agree. We will need to constantly refine and improve our vetting process.’’\n\nRep. Kay Granger (R-Tex.): ‘‘I am convinced that President Trump made this decision because he believes it will make us safer.’’\n\nRep. Robert Pittenger (R-N.C.): ‘‘While we should be responsive to those who are persecuted for their faith or impacted by war, we need a thorough vetting of all refugees, consistent with the American Security Against Foreign Enemies Act (H.R. 4038), which I co-sponsored and helped pass with strong bipartisan support in 2015. This bipartisan legislation required the FBI, CIA, and Homeland Security to be engaged in the refugee vetting process to prevent access by infiltrated terrorists.’’\n\nRep. Francis Rooney (R-Fla): ‘‘The purpose of this ban is to have time to put procedures and processes in place to gain control over our borders and assure the American people that we know who is coming in, why and what they will do here. We should demand no less than these basic safeguards from our government.\n\nRep. Ryan Costello (R-Pa.): ‘‘I interpret these executive orders as temporary. We should all want a robust yet humane process for entry screening, and I am confident we can and will continue the American ethos of welcoming the persecuted and oppressed in a safe and orderly manner, with very strong security protections for our citizens.’’\n\nRep. Kevin Yoder (R-Kan.)\n\nRep. Mike Coffman (R-Colo.): ‘‘While I’ve supported heightened vetting procedures for those wanting to travel to our country, I have never, nor will I ever support a blanket travel ban for people solely based on ethnic or religious grounds.’’\n\nRep. Steve Chabot (R-Ohio): ‘‘A key piece to ensuring our safety is taking appropriate steps to properly vet those entering our nation, and making sure that those who would do us harm are not admitted. At the same time, our policies should be crafted and executed to minimize the impact on innocent people, particularly those who have abided by our laws and have already been vetted.’’\n\nNo comment so far (organized by chamber and state)\n\nSENATE\n\nAlabama\n\nJeff Sessions\n\nRichard Shelby\n\nAlaska\n\nDan Sullivan\n\nGeorgia\n\nDavid Perdue\n\nJohnny Isakson\n\nIdaho\n\nJim Risch\n\nKentucky\n\nRand Paul\n\nLouisiana\n\nJohn Neely Kennedy\n\nMississippi\n\nRoger Wicker\n\nThad Cochran\n\nNebraska\n\nDeb Fischer\n\nNorth Carolina\n\nRichard Burr\n\nNorth Dakota\n\nJohn Hoeven\n\nOklahoma\n\nJim Inhofe\n\nSouth Dakota\n\nMike Rounds\n\nJohn Thune\n\nTexas\n\nTed Cruz\n\nJohn Cornyn\n\nWest Virginia\n\nShelley Moore Capito\n\nWisconsin\n\nRon Johnson\n\nWyoming\n\nMike Enzi\n\nHOUSE\n\nAlabama\n\nMartha Roby\n\nMike Rogers\n\nMo Brooks\n\nGary Palmer\n\nAlaska\n\nDon Young\n\nArizona\n\nMartha McSally\n\nDavid Schweikert\n\nTrent Franks\n\nArkansas\n\nFrench Hill\n\nSteve Womack\n\nBruce Westerman\n\nCalifornia\n\nPaul Cook\n\nJeff Denham\n\nDavid Valadao\n\nKevin McCarthy\n\nSteve Knight\n\nMimi Walters\n\nDana Rohrabacher\n\nDuncan Hunter\n\nColorado\n\nScott Tipton\n\nKen Buck\n\nFlorida\n\nMatt Gaetz\n\nNeal Dunn\n\nTed Yoho\n\nJohn Rutherford\n\nRon DeSantis\n\nBill Posey\n\nGus Bilirakis\n\nTom Rooney\n\nBrian Mast\n\nGeorgia\n\nDrew Ferguson\n\nTom Price\n\nRob Woodall\n\nAustin Scott\n\nJody Hice\n\nBarry Loudermilk\n\nRick Allen\n\nTom Graves\n\nIdaho\n\nMike Simpson\n\nIllinois\n\nPeter Roskam\n\nMike Bost\n\nRodney Davis\n\nRandy Hultgren\n\nDarin LaHood\n\nIndiana\n\nJim Banks\n\nTrey Hollingsworth\n\nIowa\n\nDavid Young\n\nSteve King\n\nKansas\n\nLynn Jenkins\n\nKentucky\n\nJames Comer\n\nBrett Guthrie\n\nThomas Massie\n\nHal Rogers\n\nAndy Barr\n\nLouisiana\n\nGarret Graves\n\nMaryland\n\nAndy Harris\n\nMichigan\n\nJack Bergman\n\nBill Huizenga\n\nJohn Moolenaar\n\nFred Upton\n\nTim Walberg\n\nMike Bishop\n\nPaul Mitchell\n\nMinnesota\n\nJason Lewis\n\nMississippi\n\nTrent Kelly\n\nGregg Harper\n\nSteven Palazzo\n\nMissouri\n\nAnn Wagner\n\nBlaine Luetkemeyer\n\nVicky Hartzler\n\nSam Graves\n\nJason Smith\n\nMontana\n\nRyan Zinke\n\nNebraska\n\nJeff Fortenberry\n\nDon Bacon\n\nAdrian Smith\n\nNevada\n\nMark Amodei\n\nNew Jersey\n\nTom MacArthur\n\nChris Smith\n\nNew Mexico\n\nSteve Pearce\n\nNew York\n\nClaudia Tenney\n\nNorth Carolina\n\nGeorge Holding\n\nWalter Jones J\n\nVirginia Foxx\n\nDavid Rouzer\n\nRobert Pittenger\n\nPatrick McHenry\n\nMark Meadows\n\nTed Budd\n\nOhio\n\nBob Latta\n\nMike Turner\n\nOklahoma\n\nFrank Lucas\n\nSteve Russell\n\nOregon\n\nGreg Walden\n\nPennsylvania\n\nMike Kelly\n\nScott Perry\n\nGlenn Thompson\n\nPat Meehan\n\nBill Shuster\n\nTom Marino\n\nLloyd Smucker\n\nSouth Carolina\n\nTrey Gowdy\n\nMick Mulvaney\n\nTom Rice\n\nTennessee\n\nPhil Roe\n\nJimmy Duncan\n\nChuck Fleischmann\n\nScott DesJarlais\n\nTexas\n\nLouie Gohmert\n\nTed Poe\n\nSam Johnson\n\nJeb Hensarling\n\nKevin Brady\n\nMike Conaway\n\nMac Thornberry\n\nRandy Weber\n\nPete Olson\n\nWill Hurd\n\nKenny Marchant\n\nJohn Carter\n\nUtah\n\nRob Bishop\n\nChris Stewart\n\nMia Love\n\nVirginia\n\nRob Wittman\n\nThomas Garrett\n\nMorgan Griffith\n\nWest Virginia\n\nDavid McKinley\n\nAlex Mooney\n\nEvan Jenkins\n\nWisconsin\n\nGlenn Grothman\n\nMike Gallagher\n\nWyoming\n\nLiz Cheney", "authors": ["Aaron Blake", "Washington Post"], "publish_date": "2017-01-29", "source": "bostonglobe", "top_words": ["heres", "controversial", "travel", "executive", "trump", "ban", "security", "vetting", "republicans", "american", "stand", "trumps", "country", "countries", "order", "president", "administration"], "summary": "Below, we break down who has gone on the record for, against or somewhat in the middle on Trump’s executive order.\nOpposed (21)AdvertisementSen. John McCain (R-Ariz.): ‘‘It is clear from the confusion at our airports across the nation that President Trump’s executive order was not properly vetted.\nHowever, this weekend’s confusion is an indication that the details of this executive order were not properly scrutinized.\n): ‘‘It’s simply wrong to call the president’s executive order concerning immigration and refugees ‘a religious test’ of any kind.\nThe countries on President Trump’s list are the same countries President Obama identified during his presidency.’’Rep. John Culberson (R-Tex."}