{"url": "https://www.bostonglobe.com/news/politics/2017/06/26/what-supreme-court-ruling-trump-travel-ban-means/EuDq67BM1EGLXLRgq6D1rI/story.html", "id": "1", "title": "What the Supreme Court’s ruling on Trump’s travel ban means", "text": "US Supreme Court ruled Monday that a limited version of President Trump’s ban on travel from six mostly Muslim countries can take effect.\n\nAfter months of legal limbo, the US Supreme Court ruled Monday that a limited version of President Trump’s ban on travel from six mostly Muslim countries can take effect.\n\nHere’s a breakdown of what the ruling means for Trump, the ban, and the country.\n\nRefresh my memory — what happened with the travel ban before Monday’s ruling?\n\nThe president signed the executive order about a week after taking office in January, saying the 90-day ban was needed on national security grounds to allow for an internal review of screening procedures for visa applicants from seven countries. The order on travel applied to travelers from Iraq and well as Iran, Libya, Somalia, Sudan, Syria, and Yemen, and took effect immediately, causing chaos and panic at airports over the last weekend in January as Homeland Security scrambled to figure out how it was to be implemented.\n\nAdvertisement\n\nA federal judge blocked it eight days later, an order that was upheld by the US Court of Appeals for the Ninth Circuit.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nRather than pursue an appeal, the administration said it would revise the policy. In March, Trump issued a narrower order, reducing the list of countries affected to six — removing Iraq, while keeping Iran, Somalia, Sudan, Libya, Yemen and Syria. It also applied only to those seeking new visas, and spelled out a robust list of those who might be exempted.\n\nHowever, a federal judge in Hawaii blocked the revised ban hours before it was to go into effect. Shortly after, the administration appealed the court ruling to the same court that refused to reinstate the original version. That court left the freeze in place, prompting Attorney General Jeff Sessions to vow an appeal to the Supreme Court.\n\nThe president contends the ban is necessary to protect the nation while the administration decides whether tougher vetting procedures and other measures are needed.\n\nWhat’s included in the limited version? What’s left out?\n\nThe ban on visitors from Iran, Libya, Somalia, Sudan, Syria, and Yemen can be enforced. However, the court did leave one category of foreigners protected: those ‘‘with a credible claim of a bona fide relationship with a person or entity in the United States.’’\n\nAdvertisement\n\nThe court’s opinion further explained the kinds of relationships people from the six countries must demonstrate to obtain a US visa.\n\n‘‘For individuals, a close familial relationship is required,’’ the court said. For people who want to come to the US to work or study, ‘‘the relationship must be formal, documented, and formed in the ordinary course, not for the purpose of evading’’ the travel ban.\n\nBasically, the court said that a foreign national who wants to visit or live with a family member would have a “bona fide relationship,” and so would students from the designated countries who were admitted to a US university.\n\nA 120-day ban on refugees is also being allowed to take effect on a limited basis.\n\nWhen does the limited version go into effect?\n\nTrump said last week that the ban would take effect 72 hours after being cleared by courts. If that holds true, the limited ban would go into effect on Thursday.\n\nWhen will the Supreme Court decide on the full order?\n\nAdvertisement\n\nThe justices will hear full arguments in October. The administration’s internal review should be complete before Oct. 2, the first day the justices could hear arguments in their new term.\n\nHowever, the court also indicated in the ruling that things may change dramatically by then. It asked the parties to address whether the case would be moot by the time it hears it given that the ban is deisgned to be temporary to allow time for the internal review.\n\nThe justices said they ‘‘fully expect’’ the government to be able to conduct its review within the 90-day span the executive order proposes. That affects the ban on travel from the six countries and a 120-day ban on all refugees entering the United States, with the exceptions noted by the court.\n\nThe Supreme Court opinion on Monday faulted the two federal appeals courts that had blocked the travel policy for going too far to limit Trump’s authority over immigration.\n\nThree of the court’s conservative justices said they would have let the complete bans take effect.\n\nJustice Clarence Thomas, joined by Justices Samuel Alito and Neil Gorsuch, dissented from part of the court’s opinion. They said they would have revived the travel ban in its entirety while the court considered the case.\n\nThe remaining justices were silent on the ruling, which was unsigned.\n\nWhat does Trump think about all this?\n\nIn a statement, Trump called the Supreme Court decision a “clear victory.”\n\n“As president, I cannot allow people into our country who want to do us harm. I want people who can love the United States and all of its citizens, and who will be hardworking and productive,” he said.\n\nHowever, some immigration lawyers said the limited nature of the ban and the silence of the court’s liberals on the issue Monday suggested that the court had not handed Trump much of a victory.\n\nWire material from the Associated Press and The Washington post were used in this report.", "authors": ["Globe Staff"], "publish_date": "2017-06-26", "source": "bostonglobe", "top_words": ["ruling", "travel", "means", "courts", "trump", "ban", "supreme", "court", "version", "trumps", "countries", "limited", "justices"], "summary": "US Supreme Court ruled Monday that a limited version of President Trump’s ban on travel from six mostly Muslim countries can take effect.\nAfter months of legal limbo, the US Supreme Court ruled Monday that a limited version of President Trump’s ban on travel from six mostly Muslim countries can take effect.\nRefresh my memory — what happened with the travel ban before Monday’s ruling?\nThat court left the freeze in place, prompting Attorney General Jeff Sessions to vow an appeal to the Supreme Court.\nThey said they would have revived the travel ban in its entirety while the court considered the case."}