{"url": "https://www.bostonglobe.com/opinion/editorials/2017/03/07/muslim-ban-ban-ban-ban/eBp24mVkX1R6Pm97V7DzEK/story.html", "id": "162", "title": "A Muslim ban is a ban is a ban is a ban", "text": "THE NEW, watered-down executive order on travel from six predominantly Muslim nations that President Donald Trump signed Monday probably won’t bring the insane chaos at the airport or the last-minute court filings that his first stab at the order triggered in January. But one can certainly count on lawsuits challenging the new order’s constitutionality. While now more limited in scope, the order still reeks of discriminatory intent, and deserves the same fate as its predecessors: a quick rejection by federal courts.\n\nThe new order bars travelers from six, not the original seven, Muslim-majority countries — Sudan, Syria, Iran, Libya, Somalia, and Yemen — from getting new visas for 90 days. (Iraq was left out because its government undertook what the administration vaguely termed as “steps to provide additional information about its citizens for purposes of our immigration decision,” according to a document provided by the Trump administration.) The new policy doesn’t take effect until March 16 and also temporarily shuts down the country’s refugee program.\n\nThe order offers a feeble justification for the ban, attempting to make a case that the policy is based on national security concerns. But the stubborn fact is that not a single American has been killed on US soil as a result of a terror attack by a foreign national from any of the six countries, making it difficult to argue that the ban has a basis in reality. As for its halt to the refugee program, Trump says “terrorist groups have sought to infiltrate several nations through refugee programs,” hence the need to suspend ours. Never mind that the State Department, not foreign countries, vets refugees. A recent Cato Institute report showed that the probability of an American being murdered in a terrorist attack caused by a refugee is 1 in 3.64 billion. The administration has also argued, apparently with a straight face, that because some predominantly Muslim countries were not included in the list, the policy’s intent could not possibly be discriminatory. (Fun fact: not every single bathroom was segregated under Jim Crow.)\n\nAdvertisement\n\nThe administration’s arguments sound like half-baked rationalizations cooked up to justify the Muslim ban Trump promised in the campaign and to obscure its intent. Common sense suggests that’s just what they are, and so does the evidence: Indeed, the most difficult obstacles administration lawyers will face in defending the order are Trump’s own words, which make his illegal intent perfectly clear.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nIn the days after the San Bernardino, Calif., attack, Trump called “for a total and complete shutdown of Muslims entering the United States until our country’s representatives can figure out what the hell is going on.” His campaign later promised that he would call the policy something else to get around constitutional problems. “Call it whatever you want. We’ll call it territories, okay?” he said at one point.\n\nTrump can change the executive order, but he can’t unsay his own words. And, as one of the court rulings striking down the first ban made clear, the courts must consider the overall context, including the words of public officials involved, when assessing whether a government action had discriminatory intent. Trump all but announced he would seek to ban Muslims and then call the policy something else. Judges have a responsibility to see through this bigoted charade. Striking down the ban was an easy call for the federal courts the first time around. It should be another easy call now.", "authors": [], "publish_date": "2017-03-07", "source": "bostonglobe", "top_words": ["administration", "trump", "ban", "refugee", "intent", "countries", "words", "order", "muslim", "policy"], "summary": "(Iraq was left out because its government undertook what the administration vaguely termed as “steps to provide additional information about its citizens for purposes of our immigration decision,” according to a document provided by the Trump administration.)\nThe order offers a feeble justification for the ban, attempting to make a case that the policy is based on national security concerns.\nThe administration has also argued, apparently with a straight face, that because some predominantly Muslim countries were not included in the list, the policy’s intent could not possibly be discriminatory.\nAdvertisementThe administration’s arguments sound like half-baked rationalizations cooked up to justify the Muslim ban Trump promised in the campaign and to obscure its intent.\nTrump all but announced he would seek to ban Muslims and then call the policy something else."}