{"url": "http://www.bostonglobe.com/opinion/editorials/2017/06/06/donald-trump-twitter-snit/mdukbHzJbRebe8NHBvTALM/story.html", "id": "176", "title": "Donald Trump’s Twitter snit", "text": "MONDAY WOULD HAVE been a jaw-dropping day in any normal presidency. Which is to say, almost any presidency other than that of Donald J. Trump.\n\nIn the aftermath of the weekend terror attack in London, Trump repeatedly attacked that city’s mayor on Twitter, while criticizing his own Department of Justice and undercutting DOJ’s legal rationale for his troubled travel ban on residents of six Muslim-majority countries.\n\nIn his Twitter-targeting of London’s mayor, Sadiq Khan, who is Muslim, Trump misrepresented Khan’s comment that Londoners shouldn’t be alarmed by the increased police presence on the streets as a result of the attack, making it sound as though Khan meant Londoners shouldn’t be alarmed by the attack itself. Then, after a mayoral spokesman accurately noted that Trump’s tweet “deliberately takes out of context” Khan’s comment, Trump re-tworted that that response was a “pathetic excuse by London mayor Sadiq Khan, who had to think fast on his ‘no reason to be alarmed’ statement.”\n\nAdvertisement\n\nIf that conduct was unbecoming in an American president, Trump’s tweets about his court-stayed travel policy were astonishing. He confirmed what critics have said all along: It’s meant to be a ban on Muslims. He at first tweeted: “People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN.” He then followed up this way: “The Justice Dept. should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C.”\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nIf construed as a Muslim ban, Trump’s executive order would likely have a much harder time passing Supreme Court scrutiny. As it is, lower courts have blocked two versions of the policy. Last week, an appeals court upheld the stay of Trump’s revised executive order, saying that order “drips with religious intolerance, animus, and discrimination.” Among other things, the courts have cited Trump’s campaign call for a ban on Muslims, saying that lends weight to the claim that effectuating such a ban is the administration’s true goal. DOJ, however, argues that campaign-trail talk doesn’t deserve that much legal weight.\n\nSo it’s significant that President Trump has now conceded his order is a ban. The fact that his acknowledgment came via Twitter shouldn’t matter. It is, after all, a statement from the president, one that speaks directly to the issue at hand. Further, even if the Supreme Court were to accept DOJ’s argument — that is, that a 90-day pause on travelers from those six countries is needed while the administration evaluates the current entry rules and makes changes — it has now been more than three months.\n\nOne interesting question is why Trump dropped the pretense about the ban. Is this merely a case of a president who can’t keep his story straight? Did Trump decide he wanted to strike a resonant chord with his base, legal consequences be damned? Or has he made a more complex calculation that tweeting now will let him say “I told you so” if the Supreme Court doesn’t reinstate his order and a terrorist attack somehow involving one of those Muslim nations then occurs in the United States? The profound cynicism shown by this administration about governing makes nearly anything possible.\n\nWe may never know. All we do know is that Trump has seldom looked less like a serious, competent, high-minded president than he did on Monday. And that’s sad.", "authors": [], "publish_date": "2017-06-06", "source": "bostonglobe", "top_words": ["travel", "trump", "ban", "supreme", "shouldnt", "court", "twitter", "donald", "trumps", "snit", "order", "president", "attack"], "summary": "Which is to say, almost any presidency other than that of Donald J. Trump.\nHe at first tweeted: “People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN.” He then followed up this way: “The Justice Dept.\nSign up for more newsletters hereIf construed as a Muslim ban, Trump’s executive order would likely have a much harder time passing Supreme Court scrutiny.\nSo it’s significant that President Trump has now conceded his order is a ban.\nAll we do know is that Trump has seldom looked less like a serious, competent, high-minded president than he did on Monday."}