{"url": "https://www.bostonglobe.com/news/politics/2017/01/30/obama-fundamentally-disagrees-with-discrimination/r08x42hrMFVNPCWlTuXYLP/story.html", "id": "137", "title": "Obama rejects that Trump based immigration plan on his policy", "text": "A spokesman for Barack Obama says the former president ‘‘fundamentally disagrees’’ with discrimination that targets people based on their religion.\n\nFormer president Barack Obama rejected the idea Monday that President Donald Trump had based his immigration executive order on a policy adopted by his own administration, and endorsed the protests that have been taking place across the country in response to the new restrictions.\n\nTrump has said that his move to ban the entry of migrants from seven Muslim-majority countries into the U.S., and to suspend temporarily the admission of refugees, was based in part by a decision in 2011 by then-President Obama to ban the admission of Iraqis to the U.S. after evidence surfaced that two Iraqis seeking resettlement had been linked to terrorist activity in their home country. Former Obama administration officials have denied that there was ever a halt to the awarding of visas to Iraqis, though the processing of these applications slowed after they were subject to more intense scrutiny.\n\nObama, who has remained publicly silent about his successor since leaving office a week-and-a-half ago, pledged before leaving office to only speak about Trump’s policy moves ‘‘where I think our core values may be at stake.’’ On Monday his spokesman Kevin Lewis said in a statement, ‘‘With regard to comparisons to President Obama’s foreign policy decisions, as we've heard before, the President fundamentally disagrees with the notion of discriminating against individuals because of their faith or religion.’’\n\nAdvertisement\n\nAlluding to the widespread protests taking place in major airports and cities in response to the new immigration policy, Lewis said that Obama ‘‘is heartened by the level of engagement taking place in communities around the country.’’\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n‘‘In his final official speech as president, he spoke about the important role of citizen and how all Americans have a responsibility to be the guardians of our democracy - not just during an election but every day,’’ Lewis said. ‘‘Citizens exercising their Constitutional right to assemble, organize and have their voices heard by their elected officials is exactly what we expect to see when American values are at stake.’’\n\nThe statement alluded to but did not specifically mention President Donald Trump’s temporary ban on refugees from several Muslim-majority countries. The White House says the ban isn’t a Muslim ban because dozens of Muslim-majority countries aren’t affected.\n\nObama spokesman Kevin Lewis says Obama is ‘‘heartened’’ by the amount of engagement being seen across the country. He’s referring to protests against Trump’s order on immigration and refugees.\n\nLewis says ‘‘American values are at stake.’’ He’s praising citizens who are exercising constitutional rights to assemble and ‘‘have their voices heard.’’\n\nAdvertisement\n\nObama has not weighed in on a political issue since leaving office on Jan. 20. He has said he plans to give Trump room to govern but would speak out if Trump violates basic U.S. values.\n\nTrump signs new vetting measures for immigrants", "authors": ["Juliet Eilperin", "Washington Post"], "publish_date": "2017-01-30", "source": "bostonglobe", "top_words": ["values", "spokesman", "trump", "ban", "taking", "immigration", "plan", "obama", "trumps", "rejects", "lewis", "president", "based", "policy"], "summary": "A spokesman for Barack Obama says the former president ‘‘fundamentally disagrees’’ with discrimination that targets people based on their religion.\nFormer president Barack Obama rejected the idea Monday that President Donald Trump had based his immigration executive order on a policy adopted by his own administration, and endorsed the protests that have been taking place across the country in response to the new restrictions.\nThe White House says the ban isn’t a Muslim ban because dozens of Muslim-majority countries aren’t affected.\nObama spokesman Kevin Lewis says Obama is ‘‘heartened’’ by the amount of engagement being seen across the country.\nHe has said he plans to give Trump room to govern but would speak out if Trump violates basic U.S. values."}