{"url": "https://www.bostonglobe.com/opinion/2017/03/01/the-moral-failure-trump-immigration-policy/BkZT1p3kra0U90GtxxKXrN/story.html", "id": "180", "title": "The moral failure of Trump’s immigration policy", "text": "The Trump administration is barely one month old. In that short time period, President Trump has embarked on a misguided overhaul of our already broken immigration system that will make Americans less safe and secure.\n\nIn January, Trump signed an executive order barring Syrian refugees and blocking entry into the United States for citizens from several Muslim nations. Ultimately, the federal courts stepped in to stay the illegal order and end the chaos at American airports. Despite what should have been a humbling experience, Trump has doubled down on the executive order and is poised to reissue the ban under a new guise. This ban would compromise American values and alienate the nations and people we need to help combat terrorism.\n\nIndeed, this administration’s pursuit of disastrous immigration policy has not slowed. Recently, the Trump administration expanded its deportation priorities to those immigrants with even the most minor criminal backgrounds. More ominously, reports have recently emerged that Immigration and Customs Enforcement agents have felt the shackles come off, and now understand that they can be extremely aggressive in arresting and deporting immigrants — even those who have never committed a crime.\n\nAdvertisement\n\nWhen I served in the Obama administration as special assistant to the director of ICE, I knew we were enforcing a broken immigration system. As a result, we made sure to focus on the worst of the worst — the gang members, murderers, rapists, and other serious criminals who pose a real threat to our communities. Although the immigration system remains broken due to Congress’s failure to act on reform, President Trump’s new policies will minimize the focus on these serious criminals and endanger communities nationwide.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nIn a world of limited resources, spending time on immigrants who have committed minor crimes — or no crime at all — means that ICE cannot spend as much of its time or energy on removing murderers and rapists from the United States. As a result, fewer of these serious criminals will be deported. But that’s not all. Changing the enforcement priorities means that immigrants will be less likely to report crimes, for fear that the report will lead to the breakup of their families and their removal from the country they’ve known for years. Consequently, fewer crimes will be reported and fewer criminal arrests will be made. The bottom line is simple: The Trump administration policy is a recipe for increased crime and greater gang influence in our communities. This is not just bad policy. It is a moral failing.\n\nFor many years, the United States has needed comprehensive immigration reform. There is no doubt that America needs secure borders — but we also need to deal with the millions of immigrants who are already here and who contribute to society. The broad outlines of a workable immigration reform have been known for years: Increase border security and create a process for those who are already here to get right with the law and go to the back of the line for legal status and, potentially, citizenship. This plan takes into account concerns from both sides, increasing America’s security while ensuring a humanitarian outcome. Sadly, Republican opposition to “amnesty” has blocked this common-sense reform for many years.\n\nEarlier this week, Trump offhandedly suggested he was open to a path to legal status. So far, these are empty words. His base is vehemently against real immigration reform, and Republicans have steadfastly opposed legal status dating back to the Bush administration. And while he sometimes talks a nice game, President Trump’s actions threaten to turn an already broken immigration system into a humanitarian disaster. He seems dead-set on pursuing policies that will increase crime while breaking up families. Until Trump truly shows a desire for real reform, all of us, as Americans, have an obligation to oppose these draconian policies so that America remains safe and free — not marred by crime-ridden streets and government sweeps.\n\nTimothy H. Kistner served as special assistant to the director of US Immigration and Customs Enforcement under the Obama administration. He is a partner at the Truman National Security Project.", "authors": ["Timothy H. Kistner"], "publish_date": "2017-03-01", "source": "bostonglobe", "top_words": ["failure", "administration", "trump", "immigrants", "immigration", "broken", "reform", "united", "trumps", "system", "status", "states", "moral", "policy"], "summary": "AdvertisementWhen I served in the Obama administration as special assistant to the director of ICE, I knew we were enforcing a broken immigration system.\nAlthough the immigration system remains broken due to Congress’s failure to act on reform, President Trump’s new policies will minimize the focus on these serious criminals and endanger communities nationwide.\nThe bottom line is simple: The Trump administration policy is a recipe for increased crime and greater gang influence in our communities.\nFor many years, the United States has needed comprehensive immigration reform.\nAnd while he sometimes talks a nice game, President Trump’s actions threaten to turn an already broken immigration system into a humanitarian disaster."}