{"url": "https://www.bostonglobe.com/news/politics/2017/01/27/trump-signs-order-limiting-some-refugees/GDBSjvtbcKidlFr69JLj8L/story.html", "id": "123", "title": "Trump bars refugees and citizens of 7 Muslim countries", "text": "WASHINGTON — President Donald Trump on Friday closed the nation’s borders to refugees from around the world, ordering that families fleeing Syrian carnage be indefinitely blocked from entering the United States, and temporarily suspending immigration from several predominantly Muslim countries.\n\nDeclaring the measure part of an extreme vetting plan to “keep radical Islamic terrorists” out of the country, Trump also ordered that Christians around the globe who are seeking entry into the United States should be granted priority over Muslims, for the first time establishing a religious test for refugees.\n\n“We don’t want them here,” Trump said of Islamic terrorists during a signing ceremony at the Pentagon. “We want to ensure that we are not admitting into our country the very threats our soldiers are fighting overseas. We only want to admit those into our country who will support our country, and love deeply our people.”\n\nAdvertisement\n\nEarlier in the day, Trump explained to an interviewer for the Christian Broadcasting Network that Christians in Syria were “horribly treated” and alleged that under previous administrations, “if you were a Muslim you could come in, but if you were a Christian, it was almost impossible.”\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n“I thought it was very, very unfair. So we are going to help them,” the president said.\n\nThe executive order suspends the entry of refugees into the United States for 120 days and directs officials to determine additional screening “to ensure that those approved for refugee admission do not pose a threat to the security and welfare of the United States.”\n\nThe order also stops the admission of refugees from Syria indefinitely, and bars entry into the United States for 90 days from seven predominantly Muslim countries linked to concerns about terrorism. Those countries are: Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nAdditionally, Trump signed a memorandum Friday directing what he called “a great rebuilding of the armed services,” saying it would call for budget negotiations to acquire new planes, new ships and new resources for the nation’s military.\n\nAdvertisement\n\n“Our military strength will be questioned by no one, but neither will our dedication to peace,” Trump said.\n\nAnnouncing his “extreme vetting” plan, the president invoked the specter of the Sept. 11, 2001, attacks. Most of the 19 hijackers on the planes that crashed into the World Trade Center, the Pentagon and a field in Shanksville, Pennsylvania, were from Saudi Arabia. The rest were from the United Arab Emirates, Egypt and Lebanon. None of those countries is on Trump’s visa ban list.\n\nHuman rights activists roundly condemned Trump’s actions, describing them as officially sanctioned religious persecution dressed up to look like an effort to make the United States safer.\n\nThe International Rescue Committee called it “harmful and hasty.” The American Civil Liberties Union described it as a “euphemism for discriminating against Muslims.” Raymond Offensheiser, president of Oxfam America, said the order will harm families around the world who are threatened by authoritarian governments.\n\n“The refugees impacted by today’s decision are among the world’s most vulnerable people — women, children, and men — who are simply trying to find a safe place to live after fleeing unfathomable violence and loss,” Offensheiser said.\n\nAdvertisement\n\nThe president signed the executive order shortly after issuing a statement noting that Friday was International Holocaust Remembrance Day, an irony that many of his critics highlighted on Twitter.\n\nTrump’s actions came during a swearing-in ceremony for Secretary of Defense Jim Mattis, a former Marine general. Standing in the Hall of Heroes at the Pentagon, Trump hailed the members of the United States’ military as “the backbone of this country” and described Mattis as a “man of action.” The president mistakenly referred to Mattis as a “soldier,” a term abhorred by Marines.\n\nTrump has been deferential to Mattis, who has quickly established himself as a top aide whose advice the president is willing to take. Trump said Friday he would let Mattis “override” him by banning torture during terror interrogations even though Trump believes the tactics work in getting information from suspects.\n\nIn a remarkable show of deference to his own subordinate, Trump said during an earlier news conference Friday morning with Theresa May, the British prime minister, that he would let Mattis decide about whether to use torture in interrogations. Mattis has said he does not believe torture is effective.\n\n“I don’t necessarily agree, but I will tell you that he will override because I’m giving him that power,” Trump said. “I’m going to rely on him. I happen to feel that it does work.”\n\nTrump appeared to be struggling with the issue even as he spoke, returning several times to his belief in the effectiveness of torture even as he stated that he would let Mattis decide.\n\n“But I’m going with our leaders,” he said. “We are going to win, with or without.”\n\nThen he added, “But I do disagree.”\n\nMattis spent his first week as defense secretary trying to reassure not only U.S. allies, but also military rank and file, that the United States will not abandon a national security structure that has stood in place since the end of World War II. He has told officials in the Pentagon building that at an uncertain time, he intends, as defense secretary, to provide an even-keeled, measured approach to national security issues.\n\nBefore the signing ceremony, Trump met with Mattis and his military chiefs for about an hour. The meeting — which took place in a Pentagon secure room known as “the tank” — included introductions for Trump to his military chiefs of staff. The meeting was attended by Michael Flynn, the national security adviser; Gen. Joseph Dunford, chairman of the Joint Chiefs of Staff; and the chiefs of the four services and the National Guard.\n\nThe men discussed how to accelerate the fight against the Islamic State and North Korea and how to deal with global challenges, said a defense official who was not authorized to talk publicly about the internal talks. The leaders also discussed how to improve military readiness.\n\nThe newly sworn-in secretary of defense also gave Trump a little of what the president has been asking — or tweeting — for. On Thursday, Mattis ordered a review of the controversial F-35 Joint Strike Fighter program, which has been criticized by Trump for its cost overruns.\n\nMattis also ordered that plans for a new Air Force One — another project that has come under fire from Trump — should be reviewed, “with the specific objective of identifying means to substantially reduce the program’s costs while delivering needed capabilities.”\n\nThe F-35 review, Mattis said in a memo, will also look at how to reduce costs while still meeting requirements set out for the fighter jet program.\n\nDuring his confirmation hearings this month, Mattis defended tweets from Trump criticizing the F-35 program. Mattis said at the time that Trump had “in no way shown a lack of support for the program,” adding, “He just wants more bang for the buck.”\n\nThe cost of building the F-35 next-generation fighter jet has been an issue at the Pentagon for several years. At an estimated $400 billion over 15 years for 2,443 planes, the fighter jet is the military’s largest weapons project.", "authors": ["Michael D. Shear", "Helene Cooper", "New York Times"], "publish_date": "2017-01-27", "source": "bostonglobe", "top_words": ["bars", "world", "trump", "citizens", "united", "president", "states", "countries", "mattis", "pentagon", "military", "defense", "country", "refugees", "muslim"], "summary": "WASHINGTON — President Donald Trump on Friday closed the nation’s borders to refugees from around the world, ordering that families fleeing Syrian carnage be indefinitely blocked from entering the United States, and temporarily suspending immigration from several predominantly Muslim countries.\nThe executive order suspends the entry of refugees into the United States for 120 days and directs officials to determine additional screening “to ensure that those approved for refugee admission do not pose a threat to the security and welfare of the United States.”The order also stops the admission of refugees from Syria indefinitely, and bars entry into the United States for 90 days from seven predominantly Muslim countries linked to concerns about terrorism.\nAdvertisement“Our military strength will be questioned by no one, but neither will our dedication to peace,” Trump said.\nHuman rights activists roundly condemned Trump’s actions, describing them as officially sanctioned religious persecution dressed up to look like an effort to make the United States safer.\nThe newly sworn-in secretary of defense also gave Trump a little of what the president has been asking — or tweeting — for."}