{"url": "https://www.bostonglobe.com/arts/music/2017/03/15/snoop-dogg-shoots-ronald-klump-new-video-about-police-brutality-and-travel-ban/v7HAnWbNgUxysm5hNbf2KM/story.html", "id": "169", "title": "Snoop Dogg ‘shoots’ ‘Ronald Klump’ in new video about police brutality and the travel ban", "text": "In rapper and marijuana enthusiast Snoop Dogg’s latest music video, a character named ‘‘Ronald Klump’’ gets ‘‘shot’’ with a prank gun. And with his long, bright red tie and orange makeup, there’s no mistaking who Klump is a stand-in for.\n\nReleased Sunday, the video for ‘‘Lavender,’’ a song about police brutality among other issues, is rife with political commentary. Every character in the multi-plot narrative is a ‘‘clown,’’ sporting the exaggerated white face and red lips of a circus performer. It opens with actor Michael Rapaport playing a put-upon, weed-smoking suburban dad who gets pulled over by the clown police. There’s a misunderstanding, an officer pulls a gun, there’s a bystander with a smartphone and, eventually, a spray of glitter ‘‘blood.’’\n\nAs the cartoonish sugarcoating of a familiar gory scene plays out, Snoop raps, ‘‘Trying to keep from dying in these muthaf--ing streets. F-- the police from a black man’s point of view.’’\n\nAdvertisement\n\nLater there’s a ‘‘Clown House report’’ on the news. President Klump ‘‘wants to deport all doggs’’ (a clear reference to the Trump administration’s travel ban). Soon after, Snoop catches up with Klump and shoots him with a toy gun that replaces bullets with the word ‘‘bang.’’\n\nGet The Weekender in your inbox: The Globe's top picks for what to see and do each weekend, in Boston and beyond. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe 45-year-old rapper told Billboard that he wanted to make ‘‘a song that was not controversial but real - real to the voice of the people who don’t have a voice.’’\n\n‘‘It’s a lot of clown s-- going on that we could just sit and talk on the phone all day about,’’ continued Snoop, who in the summer led a Los Angeles march urging for better relations between the police and minority communities, ‘‘but it’s a few issues that we really wanted to lock into like police, the president and just life in general.’’", "authors": ["Helena Andrews-Dyer", "The Washington Post News Service"], "publish_date": "2017-03-15", "source": "bostonglobe", "top_words": ["theres", "wanted", "travel", "dogg", "gun", "ban", "snoop", "brutality", "red", "song", "ronald", "sign", "klump", "shoots", "clown", "video"], "summary": "In rapper and marijuana enthusiast Snoop Dogg’s latest music video, a character named ‘‘Ronald Klump’’ gets ‘‘shot’’ with a prank gun.\nAnd with his long, bright red tie and orange makeup, there’s no mistaking who Klump is a stand-in for.\nReleased Sunday, the video for ‘‘Lavender,’’ a song about police brutality among other issues, is rife with political commentary.\nF-- the police from a black man’s point of view.’’AdvertisementLater there’s a ‘‘Clown House report’’ on the news.\nPresident Klump ‘‘wants to deport all doggs’’ (a clear reference to the Trump administration’s travel ban)."}