{"url": "https://www.bostonglobe.com/opinion/2017/02/13/trump-needs-pick-fights-can-win/xjCOXXJp76BDTy5LpcGOiJ/story.html", "id": "183", "title": "Trump needs to pick fights he can win", "text": "“Breaking rocks in the hot sun / I fought the law and the law won.”\n\nAs a teenage punk rocker, I first heard those lines from the hoarse larynx of The Clash’s Joe Strummer. I found out only later that the song was written by the guy who replaced Buddy Holly as front-man of The Crickets. No, I don’t remember his name either.\n\nIt’s a great number, but not one that should be sung by presidents of the United States, unless they want their names to be engraved in our memories like the name of that guy who replaced Buddy Holly. Unfortunately for Donald Trump, “I Fought the Law” was last week’s theme tune. On Thursday, the federal Court of Appeals of the Ninth Circuit ruled against his administration’s executive order banning refugees, immigrants, and visitors from seven mostly Muslim countries. As a result, the executive order is a dead letter, pending further litigation or a complete rewrite by Team Trump.\n\nAdvertisement\n\nTo everyone who spent the past three months wildly predicting the death of the republic at the hands of the tyrant Trump, this must come as something of a let-down. The time-honored response of a dictator to a judicial rebuff is to have his party pass emergency legislation that suspends the constitution and gives his edicts the force of law. There is also the option of arresting and/or shooting the offending judges. Tweeting “SEE YOU IN COURT” does not get you to Duce status, much less full Führer.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nTrump’s biggest mistake so far has been to pick a fight with the law. Even Neil Gorsuch, whom Trump has just nominated for elevation to the Supreme Court, couldn’t bite his lip, injudiciously telling Connecticut Senator Richard Blumenthal that Trump’s judge-bashing tweets were “disheartening” and “demoralizing.” The lesson is that a would-be transformative leader — who is bound to face shrill opposition — needs to pick fights he can win.\n\nThink back the first year of Margaret Thatcher’s government. She, too, did not start off as a popular prime minister and her anti-inflationary policies for a time made matters worse. Many thought she would not survive to fight another election. But she was vindicated on inflation, which proved to be a beatable foe; she broke the siege of the Iranian embassy, sending the SAS in against the Iranian Arab group that had occupied the building; she resisted the blackmail of the IRA hunger strikers, refusing their demand to have the status of political prisoners; and, of course, she kicked the Argentinians out of the Falklands. Four wins. Four beatable adversaries.\n\nTrump’s presidency could go into freefall if he does not secure some comparable victories in the coming year. Populist voters are fickle. Conversely, however, if he does get some points on the scoreboard, his popularity could soar as Thatcher’s did in time to win the 1983 election.\n\nThat’s why Trump would be much smarter to start fighting a different kind of law: sharia law. There are Islamist enemies within (the Muslim Brotherhood) and without (Iran) who look eminently beatable. I see a much more credible strategy of resisting Islamic extremism than the inept “Muslim ban,” which has actually driven liberals into the camp of the Islamists. Better to clamp down on the activities of the numerous Islamist organizations inside the United States, who are busily targeting the Muslims already in America while Trump expends energy on fruitless litigation.\n\nAdvertisement\n\nI also see a strategic opportunity to isolate Iran over its missile tests and military interventions in Syria and Yemen. I am hoping Defense Secretary James Mattis has been settling nerves in the Far East partly in order to get serious about the Middle East.\n\nOf course, wins such as these won’t suffice if Trump fails to deliver on his economic promises. The overwhelming majority of economists currently see growth coming in below 2.5 percent this year. But economists are not esteemed the way judges are, and if Trump fights economics he might just be the one who wins. His promise on Thursday of a “phenomenal” tax reform plan sent a thrill through both Wall Street and Main Street. According to the latest available survey, 80 percent of business owners and executives expect US business conditions to improve this year, nearly twice as many as this time last year. If that translates into a surge in investment, Trump could start looking like Tom Brady.\n\n“I Fought the Law” is a song of resignation, an admission of defeat. “I left my baby and it feels so bad, / Guess my race is run.” By contrast, Tom Brady’s favorite pre-game tune is called “What’s Up,” which goes like this: “I try, oh my god do I try / I try all the time, in this institution / And I pray, oh my god do I pray / I pray every single day, for a revolution.” Could that be the theme tune of the Trump comeback? Don’t rule it out.\n\nNiall Ferguson is a senior fellow of the Hoover Institution at Stanford University.", "authors": ["Niall Ferguson"], "publish_date": "2017-02-13", "source": "bostonglobe", "top_words": ["tune", "trump", "fights", "win", "pick", "order", "wins", "fought", "try", "needs", "muslim", "start", "law", "pray"], "summary": "Unfortunately for Donald Trump, “I Fought the Law” was last week’s theme tune.\nAs a result, the executive order is a dead letter, pending further litigation or a complete rewrite by Team Trump.\nThat’s why Trump would be much smarter to start fighting a different kind of law: sharia law.\nBut economists are not esteemed the way judges are, and if Trump fights economics he might just be the one who wins.\nIf that translates into a surge in investment, Trump could start looking like Tom Brady."}