{"url": "https://www.bostonglobe.com/metro/2017/07/06/activists-labor-groups-oppose-trump-immigration-policies/FyRIlS6Z0mwAgSjLvDNFaK/story.html", "id": "187", "title": "In Boston, activists, labor groups oppose Trump’s immigration policies", "text": "Diego Castillo, 4, of East Boston rested on his mother Elsa’s shoulder during the “Here to Stay” rally.\n\nBOSTON — Nearly 100 activists and labor union members have rallied in Boston in opposition to President Trump’s crackdown on illegal immigration.\n\nMembers of the Service Employees International Union and the Massachusetts Immigrant and Refugee Advocacy Coalition gathered at the Irish Famine Memorial downtown. They held signs and chanted: ‘‘We are here to stay.’’\n\nUS Senator Ed Markey, a Massachusetts Democrat, was among Thursday’s speakers. Markey voiced opposition to Trump’s temporary travel ban on visitors from six Muslim-majority countries and other restrictive immigration policies.\n\nAdvertisement\n\nChelsea resident Francisco Rodriguez told of his family’s anxiety as he faces possible deportation to El Salvador later this month.\n\nRodriguez has been in the country since 2006. He was denied asylum in 2009 but was granted temporary reprieve by federal immigration officials until last month.\n\nJessica Rinaldi/Globe Staff A woman wore an American flag in her hair as she attended the “Here to Stay” rally.\n\nJessica Rinaldi/Globe Staff Trump supporter Andrew Mannett of Boston (top left), a combat veteran who served in Operation Enduring Freedom, held a sign reading “Trump is My President” as the “Here to Stay” rally wrapped up.", "authors": ["Associated Press"], "publish_date": "2017-07-06", "source": "bostonglobe", "top_words": ["stay", "trump", "policies", "activists", "immigration", "union", "opposition", "president", "trumps", "labor", "staff", "boston", "groups", "temporary", "oppose", "rinaldiglobe"], "summary": "Diego Castillo, 4, of East Boston rested on his mother Elsa’s shoulder during the “Here to Stay” rally.\nBOSTON — Nearly 100 activists and labor union members have rallied in Boston in opposition to President Trump’s crackdown on illegal immigration.\nMarkey voiced opposition to Trump’s temporary travel ban on visitors from six Muslim-majority countries and other restrictive immigration policies.\nHe was denied asylum in 2009 but was granted temporary reprieve by federal immigration officials until last month.\nJessica Rinaldi/Globe Staff A woman wore an American flag in her hair as she attended the “Here to Stay” rally."}