{"url": "https://www.bostonglobe.com/news/politics/2017/01/30/senators-including-warren-rail-against-trump-senate-floor/Rl33aLTBId9EZinnuzfe2N/story.html", "id": "100", "title": "US senators, including Warren, rail against Trump on Senate floor", "text": "Democratic members of the US Senate held the floor on Monday night to voice their opposition to the executive order on immigration that President Donald Trump signed on Friday.\n\nSenator Elizabeth Warren of Massachusetts took the floor shortly after 8 p.m., telling the stories of those who had been affected by the order, which temporarily suspends all immigration for citizens of seven majority-Muslim countries.\n\n“None of these people are criminals. None of these people are threats,” Warren said. “They’re doctors and scientists at some of the country’s best hospitals. One is a father who wants to see his cancer-stricken daughter.”\n\nAdvertisement\n\nWarren said she rejected recent rhetoric by White House officials, who say the order only affects a handful of countries.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n“While it may not affect every Muslim in the world. . . [this] was a Muslim ban, and it’s unconstitutional,” Warren said.\n\nShe also hit against Republican lawmakers, some of whom have criticized Trump for the policy, for failing to join the Democrats’ efforts to overturn the order.\n\n“Where are you?” Warren asked. “Where are Senate Republicans when their Republican president signs an order targeting one religious group?”\n\nEarlier Monday, Senate Republicans blocked a Democratic effort to overturn Trump’s executive order.\n\nAdvertisement\n\nMinority Leader Chuck Schumer of New York sought a vote Monday on legislation reversing the order. Republican Senator Tom Cotton of Arkansas objected.\n\nRepublicans have expressed support for the vetting, but have questioned the rollout of the order.\n\nMaterial from the Associated Press was used in this report.", "authors": ["Globe Staff"], "publish_date": "2017-01-30", "source": "bostonglobe", "top_words": ["republican", "muslim", "trump", "including", "floor", "republicans", "overturn", "president", "senators", "sign", "order", "warren", "senate", "rail"], "summary": "Democratic members of the US Senate held the floor on Monday night to voice their opposition to the executive order on immigration that President Donald Trump signed on Friday.\n[this] was a Muslim ban, and it’s unconstitutional,” Warren said.\nShe also hit against Republican lawmakers, some of whom have criticized Trump for the policy, for failing to join the Democrats’ efforts to overturn the order.\n“Where are Senate Republicans when their Republican president signs an order targeting one religious group?”Earlier Monday, Senate Republicans blocked a Democratic effort to overturn Trump’s executive order.\nRepublicans have expressed support for the vetting, but have questioned the rollout of the order."}