{"url": "https://www.bostonglobe.com/opinion/2017/01/29/trump-immigration-order-shame-you-president/3WuTOdNBAOutfbzC1wIxOL/story.html", "id": "132", "title": "Trump’s immigration order — Shame on you, Mr. President", "text": "Let’s get a few basic facts out of the way about Donald Trump’s executive order on immigration.\n\nFirst, it will do absolutely nothing to keep America safe from terrorism. Refugees from Syria and Iraq are being banned from entering this country even though refugees from there have never committed a single terrorist attack in the United States. You are far more likely to be crushed by falling furniture, struck by lightning, or shot by a toddler than you are a refugee.\n\nSecondly, Trump’s executive order would ban immigration from seven countries. It doesn’t include Saudi Arabia, the United Arab Emirates, Egypt, or Turkey. This is strange for two reasons: Individuals from those countries have killed more than 3,000 Americans in terrorist attacks and President Trump has business relationship in all four countries. He doesn’t have any business connections in the seven nations from which immigration is suspended.\n\nAdvertisement\n\nMoreover, contrary to Trump’s claims, the current impediments to refugee resettlement in the United States are extraordinarily high. It’s a multi-year process that involves invasive background checks and multiple federal agencies. Trump likes to claim that under the current refugee resettlement rules we don’t know who is coming into the country. That is a lie.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nTrump’s immigration restrictions go beyond merely “extreme vetting” of refugees. They also extend to dual citizens of the seven countries (i.e. someone who has Iranian and British citizenship would be blocked) and even green card holders. These are individuals who’ve already gone through “extreme vetting” to have green cards in the first place. There’s no logical reason to block these people from returning to America.\n\nBut here’s the real nub of the issue: Trump’s immigration order is fundamentally un-American. It turns its back on the most basic of American values, and is a slap in the face to millions of Americans who are intimately familiar with the immigrant experience.\n\nPoliticians often throw around the term “nation of immigrants” or speak rhetorically about America being a “shining city on a hill.” But for many Americans those words have tangible, emotional meaning.\n\nI’m the son of an immigrant. My mother was born in Great Britain and came to this country as a child. Her parents were not British. They were German Jews who escaped from Nazi Germany in 1939. They were not refugees, but rather their lives were saved because my grandfather got a teaching job in the UK and thus a visa to enter the country. The rest of his family would not be so lucky. Although he and his seven siblings lived in Germany, they were originally from Poland. In October 1938 German Jews of Polish background were systematically expelled from the country. Two of his siblings stayed in Germany (one eventually would make it to the UK in August 1939, the other would travel to Israel aboard the ill-fated ship, the Patria). His parents and four brothers left on a train for Poland. They were initially denied entry and were forced into a squalid refugee camp in the town of Zbaszyn along the German-Polish border. My great-grandfather died there. His wife (my great-grandmother) and four of his children would get out of the camp for Krakow. They either died in the Krakow Ghetto or were murdered by the Nazis, probably at Treblinka. My grandmother’s parents were German. They could not leave and what happened to them is unknown. My grandparents’ last contact with them was a Red Cross postcard telling them that a letter they’d sent had been returned with the notification “no longer at this address.”\n\nAdvertisement\n\nOn my father’s side: his grandparents and great-grandparents came to this country at the turn of the century, to escape the anti-Semitism of Eastern Europe.\n\nI tell this story because I can think of no better way to explain the gratitude that my family feels about the opportunities we received in becoming American citizens, but also the visceral pain caused by Trump’s immigration order. An America that turns its back on refugees fleeing persecution and that imposes restrictions based on religion or national origin is not an America that I recognize — or want any part of. Knowing the historical costs of closing the door to refugees, it is particularly searing to see a country that has long welcomed the “huddled masses” do the same.\n\nOn one level there is the basic indecency of immigration restrictions that penalize those who have suffered the most from intolerance, hatred and war. All Americans — no matter their personal story — should be outraged by that.\n\nThen there is the impact that such actions have on the very idea that so many Americans hold dear about what being an American means to them.\n\nTrump’s immigration order is pointless, counter-productive, and wrong. Period. But that it would also undermine the national attribute that make so many Americans proud to be citizens of this country is unforgivable.\n\nAdvertisement\n\nShame on you, President Trump. And shame on any American who refuses to condemn this.\n\nMichael A. Cohen’s column appears regularly in the Globe. Follow him on Twitter @speechboy71", "authors": [], "publish_date": "2017-01-29", "source": "bostonglobe", "top_words": ["america", "seven", "immigration", "shame", "refugees", "american", "trumps", "country", "countries", "order", "president", "americans", "mr"], "summary": "Let’s get a few basic facts out of the way about Donald Trump’s executive order on immigration.\nSecondly, Trump’s executive order would ban immigration from seven countries.\nThey also extend to dual citizens of the seven countries (i.e.\nBut here’s the real nub of the issue: Trump’s immigration order is fundamentally un-American.\nTrump’s immigration order is pointless, counter-productive, and wrong."}