{"url": "https://www.bostonglobe.com/news/politics/2017/02/19/trump-revised-travel-ban-targets-same-seven-countries/VVjoQSYNuZFaSjYWf3jzmL/story.html", "id": "19", "title": "Trump’s revised travel ban targets same seven countries", "text": "WASHINGTON — A draft of President Trump’s revised immigration ban targets the same seven countries listed in his original executive order and exempts travelers who already have a visa to travel to the US, even if they haven’t used it yet.\n\nA senior administration official said the order, which Trump revised after federal courts held up his original immigration and refugee ban, will target only those same seven Muslim-majority countries — Iran, Iraq, Syria, Yemen, Somalia, Sudan, and Libya.\n\nThe official said that green-card holders and dual citizens of the US and any of those countries are exempt. The draft also no longer directs authorities to single out — and reject — Syrian refugees when processing visa applications.\n\nAdvertisement\n\nThe official spoke on condition of anonymity to discuss the order before it’s made public. The official noted that the draft is subject to change ahead of its signing, which Trump said could come sometime this week.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nAsked about the revised order, White House spokeswoman Sarah Huckabee Sanders said the document circulating was a draft and that a final version should be released soon. The Department of Homeland Security did not immediately respond to a request for comment.\n\nThe Wall Street Journal also reported that the current draft of the revised order focused on the seven countries but excluded those with green cards.\n\nTrump’s original executive order triggered chaos at airports around the world, as travelers were detained when the order rapidly went into effect, US permanent residents known as green-card holders among them. Attorneys provided legal assistance to those held and protesters descended on the airports as news of the order’s implementation spread. In its original form, the order temporarily suspended all travel to the US for citizens of those seven Muslim-majority countries for 90 days.\n\nThe original order also called for Homeland Security and State officials, along with the director of national intelligence, to review what information the government needs to fully vet would-be visitors and come up with a list of countries that can’t or won’t make the information available. It said the government will give countries 60 days to start providing the information or citizens from those countries will be barred from traveling to the United States.\n\nAdvertisement\n\nEven if Syrian refugees are no longer automatically rejected under the new order, the pace of refugees entering the US from all countries is likely to slow significantly. That’s because even when the courts put Trump’s original ban on hold, they left untouched Trump’s 50,000-per-year refugee cap, a cut of more than half from the cap under the Obama administration.\n\nThe US has already taken in more than 35,000 refugees this year, leaving less than 15,000 spots before hitting Trump’s cap, according to a US official. That means that for the rest of this fiscal year, the number of refugees being let in per week will likely fall to a fraction of what it had been under the Obama administration’s cap of 110,000.\n\nEarlier this month, the 9th Circuit Court of Appeals in San Francisco refused to reinstate Trump’s ban, unanimously rejecting the administration’s claim of presidential authority, questioning its motives and concluding that the order was unlikely to survive legal challenges. The pushback prompted Trump to tweet ‘‘SEE YOU IN COURT!’’ and he has since lashed out at the judicial branch, accusing it of issuing a politically motivated decision.\n\nHomeland Security Secretary John Kelly said Saturday that Trump is working on a ‘‘streamlined’’ version of his executive order banning travel from the seven nations to iron out the difficulties that landed his first order in the courts.\n\nSpeaking at the Munich Security Conference about combating terrorism, Kelly said Trump’s original order was designed as a ‘‘temporary pause’’ to allow him to ‘‘see where our immigration and vetting system has gaps — and gaps it has — that could be exploited.’’\n\nAdvertisement\n\nHe said the Trump administration was surprised when US courts blocked the executive order and now ‘‘the president is contemplating releasing a tighter, more streamlined version’’ of the travel ban.\n\nKelly said this next time he will be able to ‘‘make sure that there’s no one caught in the system of moving from overseas to our airports.’’\n\nKelly mentioned ‘‘seven nations’’ again on Saturday, leading to speculation they will all be included in Trump’s next executive order.\n\nTrump’s order sparked an immediate backlash and sowed chaos and outrage, with travelers detained at airports, panicked families searching for relatives and protesters marching against the sweeping measure — parts of which were blocked by several federal courts.\n\nProtests were held across the country, including in sight of the Statue of Liberty and Ellis Island in New York City, and at international airports where travelers were temporarily detained.", "authors": ["Vivian Salama", "Associated Press"], "publish_date": "2017-02-19", "source": "bostonglobe", "top_words": ["executive", "seven", "travel", "original", "official", "revised", "trump", "ban", "refugees", "trumps", "countries", "order", "draft", "targets"], "summary": "WASHINGTON — A draft of President Trump’s revised immigration ban targets the same seven countries listed in his original executive order and exempts travelers who already have a visa to travel to the US, even if they haven’t used it yet.\nThe Wall Street Journal also reported that the current draft of the revised order focused on the seven countries but excluded those with green cards.\nTrump’s original executive order triggered chaos at airports around the world, as travelers were detained when the order rapidly went into effect, US permanent residents known as green-card holders among them.\nIn its original form, the order temporarily suspended all travel to the US for citizens of those seven Muslim-majority countries for 90 days.\nThat’s because even when the courts put Trump’s original ban on hold, they left untouched Trump’s 50,000-per-year refugee cap, a cut of more than half from the cap under the Obama administration."}