{"url": "https://www.bostonglobe.com/opinion/columns/2017/01/30/trump-travel-ban-diminishes-our-nation/JnMKDjGIO3Y8DUuGk62MWN/story.html", "id": "16", "title": "Trump’s travel ban diminishes our nation", "text": "The new administration’s executive order to temporarily ban people from seven Muslim nations from entering the United States is fundamentally inconsistent with the values that are the bedrock of higher education, and indeed, of our pluralistic, welcoming society. The executive order diminishes our nation as a beacon for freedom and opportunity. As an academic community, we must stand together to support each other at this time of uncertainty and use a clear voice to affirm our principles and voice our deep concern.\n\nThe moral argument against the action is amply clear. It has been described in many editorials and think pieces in the last several days. The order, now partially stayed by federal judges, may be more symbolic than effective in the long run, but the symbolism is extremely troubling, because it plays to base fears and bias against foreigners and sets us on a path to see every immigrant as a threat. In universities, we see things very differently. We believe that open immigration is good for the long-term health of higher education, our country, our economy, and our society.\n\nThere are countless examples of immigrants who have come to America, attended our universities, and shared their knowledge for the benefit of all. Elon Musk came from South Africa to study at the University of Pennsylvania before he built the world’s leading electric car producer, Tesla Motors, and founded Space X, the company that aims to colonize Mars. Beirut-born Noubar Afeyan made his way to MIT, where he earned his PhD, and went on to launch Moderna Therapeutics to pioneer new medicines for cancer and infectious and cardiovascular diseases. Pakistan-born Muhammad Zaman, the Howard Hughes Medical Institute professor of biomedical engineering and international health at Boston University, has developed a low-cost portable device that can detect counterfeit drugs, such as the poor-quality antimalarials that killed more than 122,000 children in sub-Saharan Africa in 2013. And Jhumpa Lahiri, born in London to Bengali parents, earned four degrees at Boston University on her way to becoming one of the world’s most acclaimed novelists.\n\nAdvertisement\n\nThese are not isolated examples. Consider the facts. More than one-third of American innovators — founders of start-ups and spin-offs — were born outside the United States, according to a recent study by the Information Technology & Innovation Foundation. Two-thirds of these immigrant innovators hold doctorates in the fields of science, technology, engineering, and math from American universities. There is more. A recent study by the National Foundation for American Policy found that more than half of the US start-ups worth $1 billion were founded by immigrants, and nearly a quarter of these were started by men and women who came to the United States as international students. And since 2000, 40 percent of the Nobel prizes awarded to Americans in the fields of chemistry, physics, and medicine have been won by immigrants. It is clear that immigrants are a critical driving force at the frontiers of our economy.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nAmerican colleges and universities play their part. More international students pursue higher education in the United States than in any other country in the world; the United States hosted over a million of these students last year, according to the International Institute of Education. Nearly 30 percent of the doctoral degrees awarded by American universities in 2015 went to men and women holding student visas from other countries. In engineering, mathematics, and computer sciences, the share of doctorates earned by those here on student visas rises to half. America’s higher education system is the beacon that draws these talented young people.\n\nNowhere is this meritocratic exchange more robust than in Boston and Cambridge, the center of the world’s greatest concentration of top-tier research universities. Classrooms and research labs on both sides of the Charles River attract the world’s best and brightest students. These capable, hard-working young people make our universities better and more vibrant places. As undergraduates, they enliven campus life and challenge their fellow students’ sometimes-provincial perspectives. They help build an understanding of the interconnected, global world all our students will share. As graduate researchers, they can be found in our classrooms and labs at all hours, working with their mentors to develop original ideas and insights, running experiments and calculations, on the way to being independent scientists and engineers.\n\nMany of our international students stay on after graduation to work in our universities and in industry. They launch start-ups that generate investment returns, bring inventions to market, and create jobs. Others go back to their home countries and become leaders there. They leave us with enduring friendships and an understanding of America that will pave the way for smoother international relations. It is heartbreaking to read reports of young scholars from Muslim countries who in recent days have been prevented from returning to their studies at our universities.\n\nOther universities around the world are moving to emulate our success, and international students have increasing choices, as other nations — from Britain to China to Singapore — aggressively expand their higher education system and establish their own innovation hubs.\n\nAdvertisement\n\nI believe the United States must offer international students a heartfelt, unequivocal welcome — backed up by consistent and thoughtful immigration policies based on American values of fairness and objectivity. We also should not delude ourselves into believing convenient justifications for limited restrictions. The world is watching what we do. Segregating international students and immigrants on the basis of religion or nationality sends the message to the world that the United States is not the land of freedom and opportunity that we value, but a place of bias and suspicion. The long-term consequences of these restrictions will diminish our universities, our economy, and what America stands for in the world.\n\nHistorically, our nation’s embrace of these smart, talented, and hard-working young people has stemmed from our commitment to important American values: cultural tolerance, intellectual curiosity, and academic freedom. I hope the new administration appreciates how much of our greatness throughout our history and in the future will be created by people from foreign lands. I hope those in Washington will rethink their position on visas and immigrants and move to uphold one of our core values that has led America and our research universities to being the greatest places in the world to study, live, and work. We must step up our commitment to educating foreign students, not turn them away. We should be making it easier for them to stay. We need them as much as they need us.\n\nRobert A. Brown is the president of Boston University.", "authors": ["Robert A. Brown"], "publish_date": "2017-01-30", "source": "bostonglobe", "top_words": ["travel", "international", "world", "ban", "immigrants", "diminishes", "nation", "universities", "united", "trumps", "states", "higher", "students", "education", "american"], "summary": "We believe that open immigration is good for the long-term health of higher education, our country, our economy, and our society.\nTwo-thirds of these immigrant innovators hold doctorates in the fields of science, technology, engineering, and math from American universities.\nNearly 30 percent of the doctoral degrees awarded by American universities in 2015 went to men and women holding student visas from other countries.\nAmerica’s higher education system is the beacon that draws these talented young people.\nMany of our international students stay on after graduation to work in our universities and in industry."}