{"url": "https://www.bostonglobe.com/news/politics/2017/01/29/elizabeth-warren-trump-order-should-dust-bin-history-where-belongs/13rREAbqRqVMvaZyCGUhAN/story.html", "id": "130", "title": "Elizabeth Warren: Trump’s order should go ‘in the dust bin of history where it belongs’", "text": "Senator Elizabeth Warren rallied a crowd of thousands in Boston on Sunday, telling them that she would fight against President Donald Trump’s controversial order for a travel ban.\n\n“We will not stop fighting until this executive order is tossed in the dust bin of history where it belongs,” Warren said to raucous cheers.\n\nThe liberal senator from Massachusetts spoke at a rally that attracted thousands to Copley Square, as demonstrators protested against Trump’s order blocking Syrian refugees and immigrants from seven predominantly-Muslim countries.\n\nAdvertisement\n\nThe demonstration was organized by the Massachusetts branch of the Council on American-Islamic Relations, also known as CAIR.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nDuring the rally, Warren railed against Trump’s plan.\n\n“Little girls who flee murderers are not a threat to the United States,” Warren said. “Elderly grandparents in airports are not a threat to the United States. Students, teachers, and people who work right here in Massachusetts, are not a threat to the United States.”\n\nShe also had some choice words about the president himself.\n\n“We will not let Donald Trump chip away at the very heart of our democracy,” she said. “We will not be divided by Donald Trump’s hateful divisions. We will not.”\n\nAdvertisement\n\nWarren vowed to fight the order, saying she didn’t want to “give ISIS more material for recruiting based on religious hate.”\n\n“Today, we will stand together with our Muslim brothers and sisters and we will say an attack on one of us, is an attack on all of us,” she said. “We will fight back. We will fight back in the courts, we will fight back in Congress, and we will fight back across America.”\n\n***\n\nRead Warren’s full speech, as transcribed by the Globe:\n\nLittle girls who flee murderers are not a threat to the United States.\n\nElderly grandparents in airports are not a threat to the United States.\n\nAdvertisement\n\nStudents, teachers, and people who work right here in Massachusetts, are not a threat to the United States.\n\nIraqi translators who laid down their lives to help us are not a threat to the United States.\n\nThis order is not about terrorist threats. This order is about religious tests, and the United States does not impose religious tests, period.\n\nIt is illegal. It is against the Constitution. And it is against the very foundations of our democracy.\n\nLawyers across this country have dropped everything and are doing God’s work fighting for justice.\n\nAnd right here in Boston, we have already got a stay on the president’s order. Can we hear it for the Massachusetts ACLU?\n\nBut we will not stop fighting until this executive order is tossed in the dust bin of history where it belongs.\n\nWe will not stop fighting for our Constitution, and for our constitutional principles.\n\nWe will not let Donald Trump chip away at the very heart of our democracy.\n\nSo from right here in Boston, let’s say it to people all across Massachusetts, all across this country, and all around this world: we will not turn our backs on refugees and immigrants.\n\nWe will not give ISIS more material for recruiting based on religious hate.\n\nWe will stand for Massachusetts values, we will stand for American values, we will stand for human values.\n\nWe will not be divided by Donald Trump’s hateful divisions. We will not.\n\nToday, we will stand together with our Muslim brothers and sisters and we will say an attack on one of us, is an attack on all of us.\n\nWe will fight back. We will fight back in the courts, we will fight back in Congress, and we will fight back across America.\n\nIt is an honor to be here with you. It is an honor to speak out with you. It is an honor to fight shoulder to shoulder alongside you.\n\nAmerica is a good country. America is a great country. America believes in the dignity of all human beings.\n\nWatch the full speech here:", "authors": ["Globe Staff"], "publish_date": "2017-01-29", "source": "bostonglobe", "top_words": ["belongs", "dust", "right", "fight", "massachusetts", "elizabeth", "united", "bin", "trumps", "stand", "history", "donald", "order", "warren", "threat"], "summary": "Senator Elizabeth Warren rallied a crowd of thousands in Boston on Sunday, telling them that she would fight against President Donald Trump’s controversial order for a travel ban.\n“We will not stop fighting until this executive order is tossed in the dust bin of history where it belongs,” Warren said to raucous cheers.\n“We will not be divided by Donald Trump’s hateful divisions.\nBut we will not stop fighting until this executive order is tossed in the dust bin of history where it belongs.\nWe will not be divided by Donald Trump’s hateful divisions."}