{"url": "https://www.bostonglobe.com/opinion/2017/01/30/trump-executive-order-will-make-less-safe/BPSK9KWyU3NwHtZg6l2jiK/story.html", "id": "120", "title": "Trump’s executive order will make us less safe", "text": "Will the executive order, “Protecting the Nation from Foreign Terrorist Entry Into the United States” make us safer?\n\nOn the contrary, it’s likely to make us less safe. On social media sites, jihadis are already celebrating Trump’s executive order as a “blessed ban,” comparable to President Bush’s invasion of Iraq. That war, launched in response to the 9/11 strikes, increased terrorism in the region dramatically, and jihadis still celebrate it.\n\nWhy would President Trump play into jihadis’ hands in this way? He is exploiting Americans’ fear. No nonstate enemy — ISIS or any other — poses an existential threat to the continued viability of our country. And yet, according to the sixth, and latest, annual American Values Survey, Americans are increasingly concerned about the country’s future, anxious about terrorism, and nostalgic for an imagined, more secure past.\n\nAdvertisement\n\nMore than 200 people died in terrorist attacks in North America and Western Europe in 2015, a marked rise from the previous year, leading to this heightened level of anxiety. But compared with much of the rest of the world, and compared with the 9/11 attacks, these numbers are relatively small. According to the Global Terrorism Database, attacks in the West account for less than 5 percent of terrorism around the globe. The vast majority of terrorist fatalities over the last five years occurred in just a handful of countries — Iraq, Nigeria, Afghanistan, Pakistan, and Syria — where governments are fragile or there is a civil war. Overall, global terrorism decreased in the last year. And while the recent high-profile attacks in the West have received a great deal of attention, previous terrorist campaigns in the West were significantly more lethal. During the eight-year-long war in Algeria, approximately 5,000 people were killed by terrorist campaigns in France. During the United Kingdom’s fight against the Irish Republican Army, more than 3,600 died in terrorist strikes.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe United States is generally far less prone to terrorism than is Europe, and even less prone to terrorism than the rest of the world. On average, terrorism kills about as many Americans per year as lightning strikes do. And yet, Americans are deeply afraid. According to the latest PEW polling, 40 percent of Americans believe that the ability of terrorists to launch a major strike on the United States is even greater than it was on 9/11. PEW concludes that Americans are more nervous about terrorism than they have been for the past 14 years.\n\nA CNN/ORC poll found that 71 percent of Americans think that further acts of terrorism are very or somewhat likely in the very near future; a level of concern that is higher than at any point since March 2003, when the United States invaded Iraq. Another recent survey found that 41 percent of Americans believe that the terrorists are winning, an increase of 10 percentage points from 2010, six years earlier. Jihadi terrorism is a major focus for Americans, despite the fact that the risk it poses to American lives is dwarfed by lives lost to gun violence. According to a CNN tally based on data from the Centers for Disease Control and Prevention, for every one American killed by an act of terror in the United States or abroad in 2014, more than 1,049 died because of guns. Moreover, in most years, far right-wing groups kill more Americans than jihadi groups do. Unlike jihadi groups, however, these threats do not impact America’s foreign policy options, but the two groups benefit from each other’s actions. For example, jihadi groups benefit from attacks on mosques.\n\nWhat makes Americans feel so alarmed by terrorism, given these numbers? I have been working on the topic of terrorism since the mid-1980s. When terrorism is “available” in the way risk analysts use that term — meaning that it is in the news and in our minds — we tend to focus excessively on the topic, exaggerating its importance. When it is “unavailable,” as it was before 9/11, people tended to ignore what experts viewed as an obviously growing threat.\n\nTerrorism is once again in the news, due to a spike in ISIS-inspired attacks in the West, among them the most recent attacks in Nice, Orlando, and San Bernadino. Compared with the 9/11 strikes, the sophistication of these strikes was low, and the death count also relatively low. But the lack of sophistication in many ways made the attacks even more frightening, making us feel that terrorists could strike at any of us, anytime, even with motor vehicles.\n\nAdvertisement\n\nAl Qaeda was loath to carry out the kind of relatively low-level attacks we’ve been seeing in the last year, such as mass shootings or stabbings at churches, workplaces, and nightclubs. Such attacks, many of which have been carried out by lone individuals or dyads with a mix of personal and ideological motives, are especially difficult for law enforcement authorities to stop, because there are fewer communications to intercept. There is a limit, though, to the damage that such self-trained individuals, lone actors, and dyads can cause. An individual or small group can terrorize a city, as recent events are making clear. But such groups are unlikely to be able to carry out a Sept. 11–type attack, which required coordination among a large number of operatives.\n\nTerrorism is unlikely to go away. We need to remember, at all times, that terrorism is a form of violent theater, played out to an audience of both sympathizers and victims. Its purpose is to bolster the morale of its supporters and demoralize and frighten the victims and their communities. Terrorists aim to make their victims overreact in fear and dread. But to make good decisions, we need to keep the risk in perspective. If we are to prevail in the war on terrorism, we need to remember that the freedoms we aspire to come with great obligations. And these obligations involve not just fighting terrorism, but also managing our own terror.\n\nThousands at Copley Square protest immigration order\n\nJessica Stern, a research professor at the Pardee School of Global Studies, is a member of the Aspen Homeland Security Advisory Group, was on President Clinton’s National Security Council staff, and has written extensively about terrorism. She can be reached at sternjes@bu.edu", "authors": ["Jessica Stern"], "publish_date": "2017-01-30", "source": "bostonglobe", "top_words": ["executive", "attacks", "order", "terrorist", "terrorism", "united", "trumps", "states", "west", "911", "groups", "safe", "war", "americans"], "summary": "Will the executive order, “Protecting the Nation from Foreign Terrorist Entry Into the United States” make us safer?\nOn social media sites, jihadis are already celebrating Trump’s executive order as a “blessed ban,” comparable to President Bush’s invasion of Iraq.\nAdvertisementMore than 200 people died in terrorist attacks in North America and Western Europe in 2015, a marked rise from the previous year, leading to this heightened level of anxiety.\nBut compared with much of the rest of the world, and compared with the 9/11 attacks, these numbers are relatively small.\nAccording to the Global Terrorism Database, attacks in the West account for less than 5 percent of terrorism around the globe."}