{"url": "https://www.bostonglobe.com/opinion/2017/02/22/checks-and-balances-can-slow-trump/vCRVdVpYUSc9qZqlp8nlUM/story.html", "id": "140", "title": "Checks and balances can slow Trump", "text": "When President Trump was in high school, he, like the rest of us, learned about our system of checks and balances. He learned that we have three coequal branches of government: the executive, which is the presidency; the legislative, which consists of the Senate and House of Representatives: and the judiciary, headed by the Supreme Court, with the numerous federal appellate and trial judges. Under our theory of separation of powers, each branch, which is coequal in status, is supposed to check the other.\n\nWhen Alexis de Tocqueville came to America early in our history, he was looking for where sovereignty lay in the new Republic. He was used to the European system under which the king or parliament was sovereign. Here in America, he could not find a single sovereign; instead he discovered the process of sovereignty, entailing our complex system of checks and balances, with the ultimate sovereignty residing in the voters (of which there were very few back then). That is what we learned in high school civics. But after only a month in office, Trump has learned an important lesson that does not get taught in school — or even in many colleges and universities: Our system of checks and balances extends well beyond the three formal branches of government. It is far more complex and nuanced than we were taught.\n\nLet me catalogue some of the many institutions that now serve as checks and balances, especially on the president. Without a doubt our president is the single most important and powerful player in our government. There is no leader in the free world — no prime minister, no president, no chancellor, no king — who has anywhere close to the power that our president can wield through executive orders, vetoes, military actions, and more. But here are some of the institutions — both formal and informal — that serve as realistic checks on even this enormous power.\n\nAdvertisement\n\nWe saw in the lawsuits filed by the states of Washington and Minnesota against the president’s executive order on immigration that the states can serve as a check on the power of the president. This would have made Thomas Jefferson happy and Alexander Hamilton sad, but it is a new reality.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nWe have also seen that, in our enormous bureaucracy, holdovers from the prior administration can serve as a check on the new administration, as evidenced by the decision of Acting Attorney General Sally Yates to refuse to defend the president’s immigration order. Holdovers are almost certainly responsible for some of the damaging leaks that have plagued the new administration. They can slow down presidential actions, at least for a while.\n\nAnd speaking of leaks, both the FBI and the CIA, although formally part of the executive branch, can serve as important checks on the White House by selectively leaking damaging intelligence information. Whistle-blowers also serve to check by exposing secrets. Before he became president, Trump praised WikiLeaks for disclosing information that was damaging to Hillary Clinton. Now, as president, he damns these “illegal” leakers.\n\nIntelligence agencies of foreign countries can also serve as checks on our president by threatening and/or disclosing damaging material. One of the reasons given for the firing of General Michael Flynn was the fear of blackmail by Russia.\n\nThen there are the conflicts within the White House itself — internecine palace warfare — that result in some members of the administration checking other members of the administration, both within the White House and by selective leaks to the media.\n\nAdvertisement\n\nThe media — both traditional and social — serve as important checks. Those who live by tweets can be checked by tweets.\n\nChurches and religious leaders, in our most religious of Western nations, can check the excesses of presidential power by invoking eternal values. The values can promote both liberal and conservative ideologies.\n\nThe academy, through research, teaching, and advocacy, can serve primarily as a left-wing check on the right-wing tendencies of an administration.\n\nThere are other institutions as well — ranging from family, to friends, to businesses — that can check and balance a president.\n\nTrump is learning the hard lesson that in the world we now inhabit there are no perfect secrets. Everyone is listening to and recording everyone else, as General Flynn painfully learned. And he or she who has the recording holds the power to extort or coerce and check.\n\nAdvertisement\n\nThe question is, is this a good or bad thing? It is both. It is good because it sends a powerful message to the most powerful person in the world that even he is subject to multiple checks and balances, that he cannot act with impunity, and that he will be held accountable for his actions, either in the court of public opinion or perhaps in the court of law. It is bad because some of these checking institutions are undemocratic and need to be checked themselves.\n\nSo welcome to the new world of multiple checks and balances. Like democracy itself, it is imperfect but better than its alternatives.\n\nAlan M. Dershowitz is professor emeritus of law at Harvard University and author of “Taking the Stand: My Life in the Law’’ and “Electile Dysfunction: A Guide for Unaroused Voters.’’", "authors": ["Alan M. Dershowitz"], "publish_date": "2017-02-22", "source": "bostonglobe", "top_words": ["world", "trump", "power", "balances", "learned", "serve", "checks", "check", "system", "president", "administration", "slow"], "summary": "When President Trump was in high school, he, like the rest of us, learned about our system of checks and balances.\nLet me catalogue some of the many institutions that now serve as checks and balances, especially on the president.\nBut here are some of the institutions — both formal and informal — that serve as realistic checks on even this enormous power.\nIntelligence agencies of foreign countries can also serve as checks on our president by threatening and/or disclosing damaging material.\nSo welcome to the new world of multiple checks and balances."}