{"url": "https://www.bostonglobe.com/news/politics/2017/06/06/london-mayor-says-doesn-care-about-trump-tweets/kKD3t7uOGJSzRTPHvlIJYK/story.html", "id": "191", "title": "London’s mayor asks Britain to reconsider Trump’s invitation to the UK", "text": "LONDON — The mayor of London says he doesn’t care about the repeated insults he has received from the president of the United States, asserting Tuesday that he ‘‘really couldn’t be bothered about what Donald Trump tweets.’’\n\nMayor Sadiq Khan, who made history as the British capital’s first Muslim leader, has repeatedly been targeted by Trump on Twitter. After Saturday’s attacks in the London Bridge area that claimed seven lives, for example, Trump panned the mayor for telling the public there was ‘‘no reason to be alarmed’’ by the atrocity.\n\nIn fact, Khan was referring in his televised remarks to the presence of armed officers on the capital’s streets. When the British press ridiculed Trump’s out-of-context quote, the president returned to Twitter to accuse the media of buying the mayor’s ‘‘pathetic excuse.’’\n\nPathetic excuse by London Mayor Sadiq Khan who had to think fast on his \"no reason to be alarmed\" statement. MSM is working hard to sell it! — Donald J. Trump (@realDonaldTrump) June 5, 2017\n\nAdvertisement\n\nReporters repeatedly asked Khan for his thoughts on Trump outside the headquarters of London’s Ambulance Service, where he observed a minute of silence Tuesday to honor of the victims of the attacks.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe 46-year-old mayor, who assumed office in May 2016 after serving in Parliament, generally praised the ‘‘special relationship’’ between the United States and Britain. He calmly explained his opposition to Trump’s proposed travel ban on visitors from several Muslim countries. But he dropped a hint of annoyance when asked about Trump’s social media jibes.\n\n‘‘I don’t know how to tell you this, but I really don’t care,’’ he said.\n\nTrump’s extraordinary attacks on the popular mayor of a grieving city have disgusted many Londoners, reigniting opposition to a state visit by the American president to the United Kingdom planned for later this year. Prime Minister Theresa May invited Trump a week after his Jan. 20 inauguration.\n\nKhan is among those who have asked the government to reconsider the invitation, describing the state visit as ‘‘inappropriate’’ given the president’s months-long push for a travel ban for passengers from several Muslim majority nations.\n\nAdvertisement\n\nTrump’s comments also discomfited many in the United States. They drew an implicit rebuke by the acting U.S. ambassador to the U.K., who praised Khan’s ‘‘strong leadership’’ on Twitter.\n\nAlthough the spat is embarrassing, Trump’s state visit — which according to traditional practice would include staying at Buckingham Palace as a guest of the queen — does not appear to be in any jeopardy.\n\nBritish Foreign Minister Boris Johnson — Khan’s predecessor as mayor of London — told BBC radio Tuesday that ‘‘the invitation has been issued and accepted and I see no reason to change that.’’\n\nAddressing Trump’s proposed plan to bar millions of people from Muslim majority countries from entering the United States, which the president said had been vindicated by the attacks, Khan said he found the idea antithetical to American values.\n\n‘‘There are literally millions and millions of Muslims around the world who love America. They love Britain, they want to come here to study, to be a tourist, to start up a business, to work, to learn. Why would you want to stop them coming?’’ Khan said.\n\nAdvertisement\n\n‘‘We saw on Saturday night some of the people in the health service, some of the consultants, surgeons, were Muslims surgeons, some of them people who’d come to this country from Muslim majority countries,’’ the mayor continued. ‘‘They helped save lives, they reduced the death toll, some of the police officers, some of the armed response teams, who help keep our cities safe, are Muslims.\n\n‘‘What have you got against them?’’", "authors": ["Raphael Satter", "Associated Press"], "publish_date": "2017-06-06", "source": "bostonglobe", "top_words": ["reconsider", "trump", "asks", "visit", "londons", "united", "invitation", "uk", "trumps", "london", "president", "mayor", "khan", "states", "muslim", "britain"], "summary": "In fact, Khan was referring in his televised remarks to the presence of armed officers on the capital’s streets.\nSign up for more newsletters hereThe 46-year-old mayor, who assumed office in May 2016 after serving in Parliament, generally praised the ‘‘special relationship’’ between the United States and Britain.\nHe calmly explained his opposition to Trump’s proposed travel ban on visitors from several Muslim countries.\nAdvertisementTrump’s comments also discomfited many in the United States.\nThey drew an implicit rebuke by the acting U.S. ambassador to the U.K., who praised Khan’s ‘‘strong leadership’’ on Twitter."}