{"url": "https://www.bostonglobe.com/metro/connecticut/2017/02/04/anti-trump-protesters-shut-down-connecticut-highway-delay-ambulance/BzAw5QbbF1qVedvJE17yEO/story.html", "id": "158", "title": "Anti-Trump protesters shut down Connecticut highway, delay ambulance", "text": "NEW HAVEN, Conn. — Protesters temporarily shut down a New Haven highway Saturday afternoon, delaying an ambulance that was on the road and forcing workers to perform an emergency medical procedure on a patient.\n\nMore than 100 people protesting President Trump’s travel ban blocked Route 34 in New Haven, according to the New Haven Register.\n\nAs protesters were being cleared from the road, state police say ambulance workers had to perform a procedure on a critically ill patient in the vehicle instead of at the hospital.\n\nAdvertisement\n\nState police say they found the leader of the protest, who immediately ran away, knocking over several of his supporters, before being caught.\n\nAuthorities say they used pepper spray on Norman Clement, 66, after he resisted arrest. Clement faces numerous charges including inciting a riot. It’s unclear if he has an attorney.", "authors": ["The Associated Press"], "publish_date": "2017-02-04", "source": "bostonglobe", "top_words": ["vehicle", "antitrump", "clement", "road", "procedure", "shut", "connecticut", "workers", "ambulance", "perform", "highway", "haven", "delay", "protesters", "say"], "summary": "NEW HAVEN, Conn. — Protesters temporarily shut down a New Haven highway Saturday afternoon, delaying an ambulance that was on the road and forcing workers to perform an emergency medical procedure on a patient.\nMore than 100 people protesting President Trump’s travel ban blocked Route 34 in New Haven, according to the New Haven Register.\nAs protesters were being cleared from the road, state police say ambulance workers had to perform a procedure on a critically ill patient in the vehicle instead of at the hospital.\nAdvertisementState police say they found the leader of the protest, who immediately ran away, knocking over several of his supporters, before being caught.\nAuthorities say they used pepper spray on Norman Clement, 66, after he resisted arrest."}