{"url": "https://www.bostonglobe.com/business/2017/04/02/immigration-fears-lead-sped-weddings-and-prenups/UyksYzEKwrYTYZoeGYHYKM/story.html", "id": "163", "title": "Immigration fears lead to sped-up weddings — and prenups", "text": "She is an American medical student. He is from South America, studying for his PhD in economics. The 25-year-olds were in no hurry to get married — and then Donald Trump got elected.\n\nSuddenly, the couple are scrambling to make their relationship official at Boston City Hall, a year earlier than planned, and their lawyer is rushing to complete a prenuptial agreement.\n\nDriven by uncertainty surrounding President Trump’s crackdown on immigrants, some foreign nationals and their American fiancés are accelerating their wedding plans. Even those who are here legally and don’t come from countries included in Trump’s travel ban are looking to tie the knot quickly, just in case.\n\nAdvertisement\n\nThe sooner she and her fiancé get married, the medical student said, the sooner he can get a green card, which gives him permanent residency status, provided the union is deemed legitimate. Then he can work toward becoming a US citizen and stop worrying about being questioned or detained under the new administration.\n\nGet Talking Points in your inbox: An afternoon recap of the day’s most important business news, delivered weekdays. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n“I started to get very nervous around November,” said the medical student, who asked not to be identified out of fear that it could interfere with the process. “The unpredictable nature of what’s going on has put a lot of people on edge, and certainly put me on edge.”\n\nTrump has stripped away protections on who can be deported and issued a travel ban on refugees and people from seven countries, since scaled back to six and blocked last month by a federal judge in Hawaii.\n\nTrump also reinstated a program requiring local law enforcement to assist federal immigration authorities. Immigrants with valid visas have been detained when trying to reenter the country, and people who have lived here without incident for years are being deported, news reports say.\n\nThe number of people who obtained green cards by marrying a US citizen rose 7 percent between 2013 and 2015, according to the Department of Homeland Security. More recent data are not available.\n\nAdvertisement\n\nClerks in cities around the country, however, cited an increase in marriage license applications immediately following Trump’s election, news reports say, and while there are no data on why this is happening, some have speculated that the new administration could be a factor.\n\nBetween November and mid-March, more than 1,800 marriage licenses were filed in the city of Boston, a 20 percent increase over the same time period the year before. The city doesn’t track the citizenship of people applying for marriage licenses, but observers note that the number of weddings at City Hall involving immigrants has increased since Trump was elected, with a marked increase after he took office.\n\nSeveral local lawyers have also seen an uptick in the number of people speeding up their weddings because of political fears, and some are rushing to get prenuptial agreements at the same time. While only 14 percent of married people in the United States have signed prenuptial agreements, according to estimates, the practice is becoming more common, especially among millennials.\n\nNearly two-thirds of attorneys reported an increase in the number of clients seeking prenups over the past three years, according to a recent survey by the American Academy of Matrimonial Lawyers.\n\nVicki Shemin, a partner at a Wellesley family law firm, coined the term “Trumped-up prenup” after two clients approached her in the same week about quickly drafting prenups to accommodate wedding dates that had been moved up because of immigration concerns.\n\nAdvertisement\n\nNegotiating a prenup in just a few weeks instead of over several months, as is usually the case, can be tricky, Shemin said, and if it’s proven to be done under duress, the agreement won’t hold up in court.\n\nEven those who are here legally and don’t come from countries included in President Trump’s proposed travel ban are looking to tie the knot quickly, just in case.\n\nHaving a prenuptial agreement could also potentially complicate the process of getting a green card, said Boston immigration lawyer Joshua Goldstein, who said he talks to people “all the time” who are considering moving up their wedding plans because of Trump’s policies.\n\nCouples have to prove that their marriages are legitimate in order for a non-US citizen to become a permanent legal resident, and a prenuptial agreement that shows assets being kept separate could make it more difficult to prove that the marriage is real.\n\nFederal immigration laws, in turn, could affect prenups. Americans marrying foreign nationals have to sign an affidavit agreeing to financially support their spouse, if necessary, until he or she becomes a US citizen or has worked for the equivalent of 10 years, even if they get divorced in the meantime. The intent is to keep people off public assistance, but it could interfere with alimony agreements.\n\nA Bunker Hill Community College student from the Middle East is speeding up his wedding because of worries over Trump’s immigration orders. He sees a prenup as a way to prevent potential problems down the road.\n\n“It’s like vaccination. It’s smart,” said the student, who asked not to be identified because of the tense political climate.\n\nHe and his fiancée, a Massachusetts native who works as a project manager at a cultural heritage organization, are getting married at Boston City Hall next month and then will celebrate, as previously planned, next February with their families in Connecticut.\n\nUntil he gets his green card, which takes about eight months, the student has been advised by an immigration lawyer not to leave the country in case he can’t get back in. That means not visiting his family; he already missed a trip to Turkey and Lebanon with the cultural nonprofit he works for.\n\nBecoming a US citizen was not initially part of the plan, but with the current political climate, the student has decided not to take any chances.\n\nAnd his fiancée is all for it: “We need to work on having the same nationality.”\n\nKatie Johnston can be reached at katie.johnston@globe.com . Follow her on Twitter @ktkjohnston", "authors": ["Globe Staff"], "publish_date": "2017-04-02", "source": "bostonglobe", "top_words": ["lead", "prenups", "immigration", "married", "citizen", "spedup", "trumps", "city", "prenuptial", "wedding", "number", "weddings", "marriage", "fears", "student"], "summary": "Driven by uncertainty surrounding President Trump’s crackdown on immigrants, some foreign nationals and their American fiancés are accelerating their wedding plans.\nThen he can work toward becoming a US citizen and stop worrying about being questioned or detained under the new administration.\nTrump also reinstated a program requiring local law enforcement to assist federal immigration authorities.\nFederal immigration laws, in turn, could affect prenups.\nA Bunker Hill Community College student from the Middle East is speeding up his wedding because of worries over Trump’s immigration orders."}