{"url": "https://www.bostonglobe.com/metro/2017/02/06/fast-forward-travel-ban-tussle-devos-vote-and-roger-has-hand-mvp-trophy-brady-today-sweet/hfQQzCP9uREJSODJVDTJZL/story.html", "id": "141", "title": "Fast Forward: Travel ban tussle, DeVos vote, and Roger has to hand the MVP trophy to Brady today -- sweet!", "text": "The Fast Forward e-mail newsletter has the news that you need to launch your day. Sign up here.\n\nHere’s a rundown of what’s coming up on this Magical Monday.\n\nWhat’s it like outside? Nothing but blue skies!\n\nCommuter alert: Take the day off!\n\nAdvertisement\n\nWhile you were sleeping: Everybody else was partying!\n\nHey, sport: The Celtics are off. They beat the Clippers yesterday, 107-102, and the Garden crowd bid a loving farewell to Paul Pierce, who’s retiring and played his last game in Boston.\n\nThe Bruins are off until Thursday. They lost a tough one to Toronto Saturday (6-5) when the Maple Leafs scored the go-ahead goal with just 1:36 left -- and just 1:18 after the Bruins had tied the score.\n\nOh, and THE PATRIOTS WON! Roger the Dodger Goodell has to hand the Super Bowl MVP trophy to Tom Brady today; you couldn’t hear the commish speak last night on the Super Bowl podium amid the shower of boos. The victory duck boat parade is Tuesday at 11 a.m., probably following the usual route from the Pru to City Hall. More details tomorrow. Another chance to thank these two GOATs:\n\nMatthew J. Lee/globe staff/file Tom Brady and Bill Belichick shared a laugh -- and the title of Greatest of All Time.\n\nGet Fast Forward in your inbox: Forget yesterday's news. Get what you need today in this early-morning email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nTurmoil in Trumpville: Lawyers for Washington state and Minnesota had until 3:59 ET this morning to submit more arguments as to why President Trump’s executive order barring immigrants and nonimmigrants from seven countries -- as well as all refugees from anywhere in the world -- should be stopped. (The lawyers met the deadline.)\n\nAdvertisement\n\nThose two states got a temporary restraining order Friday that lifted the bans, so legal residents and visa-holding visitors who had been refused entry scrambled to come home or arrive for the first time. The Justice Department asked for the TRO to be paused immediately, but the Ninth Circuit Court of Appeals, which covers nine western states and two Pacific Island jurisdictions, declined; instead, it told both sides to submit more arguments.\n\nJustice Department lawyers have until 6 p.m. ET to file a reply to Washington and Minnesota, then a three-judge panel will decide whether to issue a ruling or hold a hearing.\n\nMeanwhile, Education secretary nominee Betsy DeVos has been calling, e-mailing, writing, mailing million-dollar checks (just kidding) and otherwise lobbying senators to vote for her ahead of what could be a historically close confirmation vote today. After she demonstrated what Democrats felt was a breathtaking ignorance of federal education law during her hearing, and amid persistent ethics questions, two GOP senators said they won’t vote for her. That means the vote could be 50-50, making it necessary for VP Mike Pence to cast the deciding vote -- the first time in history it would be done for a Cabinet nominee.\n\nA vote on Jeff Sessions for attorney general is due today as well.\n\nThe Kremlin is demanding an apology today from Fox News host Bill O’Reilly (yeah, that’ll happen) for describing Vladimir Putin as a killer during his interview with Trump that aired before the Super Bowl. And look for more fallout from the part of the interview where Trump equated Putin’s vindictive, murderous regime (oops, sorry Vlad!) with the US government. Several Republicans condemned Trump’s remarks; Marco Rubio, for example, tweeted:\n\nWhen has a Democratic political activist been poisoned by the GOP, or vice versa? We are not the same as #Putin.\n\nAdvertisement\n\nThat defamation suit against former governor Deval Patrick is before the Supreme Judicial Court today. Here’s the sordid background: Patrick’s brother-in-law pleaded guilty to raping his wife -- Patrick’s sister -- in California in 1993. The couple reconciled two years later and eventually moved to Massachusetts. The brother-in-law, Bernard Sigh, claimed he didn’t have to register as a sex offender here. A lawyer for the Sex Offender Registry Board said that he did, but a hearing officer contradicted him, deciding that the crime equated with indecent assault and battery according to state statute, which doesn’t require registration. The hearing officer was demoted for insubordination, filed a whistleblower suit claiming his superiors pressured him to change his decision, and won a settlement. Patrick then fired the hearing officer’s boss, Saundra Edwards, saying that her pressuring the hearing officer was inappropriate and “maybe unlawful.” She’s now suing Patrick for defamation, and her case has cleared every legal hurdle so far, putting it in the lap of the state’s high court.\n\nFinally, let’s leave our monarch wannabe aside for a moment and turn our attention to a real one across the pond: Elizabeth became queen 65 years ago today when her father, King George VI, died in his sleep at Sandringham. That’s where she’ll have a quiet celebration today, no doubt with her signature Dubonnet and gin. Raise one to the Patriots, Lilibet.\n\n@craftginclub Queen Elizabeth enjoys a Dubonnet and gin (on the railing) on the grounds of Balmoral Castle in Scotland.\n\nThanks for reading. Life is good in Patriotland. Send questions, comments, or news tips to teresa.hanafin@globe.com, or follow me on Twitter @BostonTeresa. See you tomorrow.\n\nFast Forward this to your friends or tell them to stop sponging off you and sign up for their own copy", "authors": ["Globe Staff"], "publish_date": "2017-02-06", "source": "bostonglobe", "top_words": ["roger", "travel", "forward", "lawyers", "hearing", "patrick", "vote", "mvp", "trophy", "hand", "officer", "states", "sign", "today", "tussle", "sweet", "super"], "summary": "The Fast Forward e-mail newsletter has the news that you need to launch your day.\nRoger the Dodger Goodell has to hand the Super Bowl MVP trophy to Tom Brady today; you couldn’t hear the commish speak last night on the Super Bowl podium amid the shower of boos.\nMeanwhile, Education secretary nominee Betsy DeVos has been calling, e-mailing, writing, mailing million-dollar checks (just kidding) and otherwise lobbying senators to vote for her ahead of what could be a historically close confirmation vote today.\nThe hearing officer was demoted for insubordination, filed a whistleblower suit claiming his superiors pressured him to change his decision, and won a settlement.\nFast Forward this to your friends or tell them to stop sponging off you and sign up for their own copy"}