{"url": "https://www.bostonglobe.com/opinion/editorials/2017/03/23/enlisting-local-police-trump-deportation-force-thank-you/2l8WWKJdVdTSx5vgCW6GzH/story.html", "id": "161", "title": "Enlisting local police in Trump’s deportation force? No, thank you.", "text": "One by one, the unrealistic promises on immigration and security that President Trump made during the presidential campaign are starting to catch up with him. A border wall paid for by Mexico? Not happening. Muslim travel ban? The courts shot down that unconstitutional idea, twice. His vow to field a gigantic deportation force might be the next promise to face its moment of truth: Were it translated into reality, it would pose radical and unacceptable burdens on municipalities.\n\nThe federal government alone doesn’t have the time or resources to round up, jail, and deport everyone who is in this country illegally. Such an effort would require cooperation from localities, and enlisting local officers and jails for detaining immigrants. For some municipalities, that’s a nonstarter on principle: so-called sanctuary cities have limited cooperation with immigration authorities. Most of them won’t keep immigrants in jail unless there is a criminal warrant out for them. The Trump administration has railed against sanctuary cities, most recently by releasing a list of noncooperating municipalities, and has threatened to take away their federal funding. Boston, Somerville, and Cambridge all made the list.\n\nBut the flipside of Trump’s financial threat is that the cost of cooperating with enforcement is already high, and could become enormous. Asking municipalities to hold immigrants is effectively an unfunded mandate — most localities don’t get reimbursed for the costs of detaining someone for federal immigration authorities. A 2012 study found that Los Angeles County taxpayers spent more than $26 million per year on immigration detainers. The more immigrants Trump wants to deport, the more money local taxpayers will have to spend.\n\nAdvertisement\n\nBrowbeating cities to act as immigration jailers also exposes them to potentially costly lawsuits. For example, the Trump administration’s list of noncooperating jurisdictions includes the Orleans Parish Sheriff’s Office in Louisiana. But its policy of rejecting detention requests is part of a settlement that office entered after a lawsuit. Some courts have found federal detainers to be unconstitutional, meaning cities affected by those rulings could not legally comply with the administration’s demands even if they wanted to.\n\nThe best reasons to resist holding immigrants are the ones that sanctuary city proponents often list: Using local police as immigration agents weakens communities, erodes trust in police, and disrupts lives. Dollars and cents may not have been a top concern before, but it will become one if the Trump administration is serious about foisting more immigration responsibilities on unwilling cities. True, communities might lose federal funds if they defy the president. But they are certain to pay if they give in.", "authors": [], "publish_date": "2017-03-23", "source": "bostonglobe", "top_words": ["municipalities", "list", "trump", "immigrants", "immigration", "local", "thank", "sanctuary", "trumps", "enlisting", "cities", "deportation", "federal", "unconstitutional", "force"], "summary": "Such an effort would require cooperation from localities, and enlisting local officers and jails for detaining immigrants.\nFor some municipalities, that’s a nonstarter on principle: so-called sanctuary cities have limited cooperation with immigration authorities.\nAsking municipalities to hold immigrants is effectively an unfunded mandate — most localities don’t get reimbursed for the costs of detaining someone for federal immigration authorities.\nThe more immigrants Trump wants to deport, the more money local taxpayers will have to spend.\nFor example, the Trump administration’s list of noncooperating jurisdictions includes the Orleans Parish Sheriff’s Office in Louisiana."}