{"url": "https://www.bostonglobe.com/business/2017/02/09/trump-low-road-immigration-will-hurt-mass-higher/NxInahXBbLyB3mRgXd7DyK/story.html", "id": "125", "title": "Trump’s low road on immigration will hurt Mass. higher ed", "text": "America has unceremoniously thrown away its welcome mat to the world, and our universities and colleges will be among those hardest hit.\n\nI’m not about to embark on some kind of academic exercise here. The impact will be real, and we’re starting to see how it might play out.\n\nInterest among students from abroad who want to study in Massachusetts is down 17 percent since President Donald Trump issued his Jan. 27 executive order restricting immigration, according to StudyPortals. The Dutch company, which has North American headquarters in Boston, operates websites for students looking at global options for college.\n\nAdvertisement\n\nStudyPortals has been tracking searches on its platform, which attracts 19 million students annually. The company compared searches one week after the Trump travel ban with searches done the previous week. Massachusetts, home to some 140 colleges and universities, has a lot at stake.\n\nGet Talking Points in your inbox: An afternoon recap of the day’s most important business news, delivered weekdays. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe executive order, which Trump said was needed to protect the country against terrorism, bans travel from seven predominantly Muslim countries in the Middle East, including Iran, Syria, and Somalia. While that represents a tiny fraction of the overall number of foreign students, the president’s stance on immigration appears to have a chilling effect on a broad swath of international students who want to be educated in the United States.\n\nLast week, a federal judge temporarily suspended the ban, and a US appeals court Thursday night upheld that decision. But in a tweet, Trump indicated he would continue his legal effort to overturn the suspension.\n\nThink about it. If you’re a prospective student from Mexico or China, would you want to come here after Trump’s remarks about those countries? No doubt parents around the world are also thinking twice about sending their kids here.\n\nEven before the executive order, international students were wary about Trump’s America. StudyPortals conducted a survey of 1,300 prospective students in November after the election and found that global interest in studying in America is on the decline, with 57 percent saying they are less likely to attend school here because of the Trump victory.\n\nAdvertisement\n\nAmong the main reasons is the perception that the United States is becoming less welcoming to international students and minorities, and students think the country will become weaker under Trump. But students still think the American education system is top notch.\n\nSo if they’re not coming to America, where are they going?\n\nStudyPortals found that the most popular alternatives were Canada (61 percent), the United Kingdom (52 percent), and Australia (34 percent).\n\nThat’s not lost on the Canadians. Aggressive might be the last word anyone would associate with our neighbors to the north, but they’re angling to capitalize on the Trump ban.\n\nThe Canadian media have begun dubbing this the Brain Gain.\n\nAdvertisement\n\nAcademic institutions across Canada have been waiving application and other fees for students who have been affected by Trump’s travel ban and may want to apply or transfer to a Canadian school.\n\nSome have taken further steps, such as the University of Ottawa, which will help affected students with an accelerated admissions process so they can continue their education with little disruption.\n\nThen there’s the University of British Columbia, which has set aside close to $200,000 to help students, scholars, and professors at the university and around the world who might find themselves in limbo because of the executive order.\n\nCanadians have been actively recruiting foreign college students over the past decade, a number that has doubled to about 100,000, according to Paul Davidson, president of Universities Canada, which represents 97 public and not-for-profit schools in Canada.\n\nLast November the government tweaked the immigration system to make it easier for foreign students who completed their studies in Canada to become permanent residents if they stayed after graduation. The changes also made it easier for researchers and academics to become residents. “We talk about universities as being [our] Ellis Island,” said Davidson.\n\nWhy does this all matter?\n\nThere’s a global war for talent to sustain the modern economies we have built. Attracting the best and brightest foreign students is a way to help fill the pipeline of skilled labor this country needs. Think doctors at the teaching hospitals, scientists in the biotech labs, and software engineers at tech companies.\n\nSure, foreign students are a growing source of revenue for academic institutions, but the free flow of ideas is as much a bedrock principle of higher education as it is of US democracy.\n\nThat’s a big reason why you saw eight Massachusetts colleges and universities — including Harvard, MIT, and Northeastern — in the trenches fighting the Trump executive order in court last week.\n\nNortheastern, in particular, has a lot on the line after pursuing a globalization strategy over the past decade under President Joseph Aoun. It’s a push that has brought about 11,000 international students, including about 250 from the seven countries on the travel ban, to the Boston campus. But it has also created opportunities for students to study and work abroad in 140 countries.\n\nAoun has a team of 16 from the legal department to admissions to government relations working on the implications of the ban. There have been meetings with students and faculty affected by the ban, and conversations with concerned parents.\n\nEven with a favorable ruling from the appeals court, Northeastern general counsel Ralph Martin II thinks the case will end up back in the federal district courts and proceed for months, or longer. “I don’t think it will bring finality to it,” said Martin, a former Suffolk County District Attorney. The issue will likely go to the US Supreme Court. “As of today, I don’t see how it doesn’t,” he said.\n\nAoun himself is an immigrant from Lebanon who arrived on a student visa to get his doctorate at MIT and then stayed in the United States. He’s not worried about finding enough students to fill the classrooms at Northeastern; rather, he worries the ban will close minds as parts of the world shun the United States.\n\n“Societies that understand each other avoid problems, avoid war,” Aoun said. “We cannot afford to isolate ourselves. We will move backwards, and others will move forward.”\n\nShirley Leung is a Globe columnist. She can be reached at shirley.leung@globe.com", "authors": ["Globe Columnist"], "publish_date": "2017-02-09", "source": "bostonglobe", "top_words": ["executive", "hurt", "foreign", "mass", "trump", "world", "low", "road", "immigration", "ban", "travel", "think", "universities", "united", "trumps", "ed", "higher", "students"], "summary": "The company compared searches one week after the Trump travel ban with searches done the previous week.\nAggressive might be the last word anyone would associate with our neighbors to the north, but they’re angling to capitalize on the Trump ban.\nLast November the government tweaked the immigration system to make it easier for foreign students who completed their studies in Canada to become permanent residents if they stayed after graduation.\nAttracting the best and brightest foreign students is a way to help fill the pipeline of skilled labor this country needs.\nSure, foreign students are a growing source of revenue for academic institutions, but the free flow of ideas is as much a bedrock principle of higher education as it is of US democracy."}