{"url": "https://www.bostonglobe.com/news/politics/2017/02/04/trump-tweets-about-death-destruction-from-immigrants/9zNCRHTCRN5G1U2N733jZJ/story.html", "id": "131", "title": "Trump tweets about ‘death & destruction’ from immigrants", "text": "President Trump arrived at Palm Beach International Airport in West Palm Beach, Fla. on Friday.\n\nReacting to a Seattle judge’s decision that blocked his immigration order, President Trump pointed Saturday in a tweet to a separate decision by a Boston judge to leave the travel ban in place.\n\nTrump asked, “Why aren’t the lawyers looking at and using the Federal Court decision in Boston, which is at conflict with ridiculous lift ban decision?”\n\nThe tweet did not say what lawyers Trump was talking about. Trump’s Justice Department is defending the ban.\n\nWhy aren't the lawyers looking at and using the Federal Court decision in Boston, which is at conflict with ridiculous lift ban decision? — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nAdvertisement\n\nTrump tweeted after a Friday ruling by a federal judge in Seattle, who issued a temporary nationwide block of the president’s ban on travelers from seven Muslim countries.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nJudge James Robart said two states, Minnesota and Washington, had standing to challenge Trump’s order and that the order had brought harm to residents and colleges.\n\nThe White House on Friday night said it would appeal the ruling.\n\nTrump took to Twitter Saturday morning with responses.\n\nWhen a country is no longer able to say who can, and who cannot , come in & out, especially for reasons of safety &.security - big trouble! — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nInteresting that certain Middle-Eastern countries agree with the ban. They know if certain people are allowed in it's death & destruction! — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nThe opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned! — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nAbout a half-hour after that series of tweets, Trump took aim at one of his favorite targets.\n\nAfter being forced to apologize for its bad and inaccurate coverage of me after winning the election, the FAKE NEWS @nytimes is still lost! — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nAdvertisement\n\nOn Saturday afternoon, Trump tweeted:\n\nWhat is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.? — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nMartin Finucane of Globe Staff contributed to this report.", "authors": ["Globe Staff"], "publish_date": "2017-02-04", "source": "bostonglobe", "top_words": ["death", "lawyers", "trump", "tweets", "immigrants", "ban", "ridiculous", "judge", "donald", "realdonaldtrump", "order", "destruction", "decision", "j"], "summary": "— Donald J. Trump (@realDonaldTrump) February 4, 2017Interesting that certain Middle-Eastern countries agree with the ban.\n— Donald J. Trump (@realDonaldTrump) February 4, 2017The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!\n— Donald J. Trump (@realDonaldTrump) February 4, 2017About a half-hour after that series of tweets, Trump took aim at one of his favorite targets.\n— Donald J. Trump (@realDonaldTrump) February 4, 2017AdvertisementOn Saturday afternoon, Trump tweeted:What is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.?\n— Donald J. Trump (@realDonaldTrump) February 4, 2017Martin Finucane of Globe Staff contributed to this report."}