{"url": "https://www.bostonglobe.com/business/2017/02/07/leaders-biotech-companies-fire-off-letter-trump-opposing-travel-ban/xFTSPUIsXhYZZH43sClXSI/story.html", "id": "101", "title": "Leaders of biotech companies fire off letter to Trump opposing travel ban", "text": "WASHINGTON — More than 160 leaders of biotechnology companies signed a strong letter of opposition to President Trump’s travel ban, arguing the ‘‘poorly conceived and implemented’’ action strikes at the heart of an industry that originated in America, has been dominated by American companies, and is at the cutting edge of medicine.\n\nThe letter, published Tuesday by the journal Nature Biotechnology, reveals that scientists abroad are afraid to come to the United States and are canceling trips. Foreign-born scientists within the United States fear similar orders could be issued without warning, and some have expressed anxiety about deportation or losing family ties. Ultimately, the letter argues, the policy will harm patients and the US economy.\n\n‘‘Though the ban from the Trump administration is aimed at seven countries, our global employees interpret the underlying message as, ‘America is no longer welcoming of any immigrants, whatsoever,’ ’’ wrote chief executives, venture capitalists, academic leaders, and at least one Nobel Prize winner. ‘‘If this misguided policy is not reversed, America is at risk of losing its leadership position in one of its most important sectors, one that will shape the world in the twenty-first century.’’\n\nAdvertisement\n\nThe letter, a grass-roots effort organized late last week by a half dozen chief executives, starkly contrasts the tone that the leaders of major pharmaceutical companies set in a meeting last week with Trump. The executives came away from that meeting emphasizing the common ground they had with Trump on many issues. It was unclear whether the travel ban was discussed in the private portion of the meeting. However, in the run-up, the industry’s major trade group did not take a position and the companies that did respond were often supportive of employees, but neutral.\n\nGet Talking Points in your inbox: An afternoon recap of the day’s most important business news, delivered weekdays. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n‘‘What this letter represents is the voice of the innovative, entrepreneurial biotechnology industry, which places basic human values ahead of economic gain,’’ said Steven Holtzman, chief executive of Decibel Therapeutics, an early-stage company developing drugs for hearing loss based in Cambridge.\n\nBiotech is a relatively young industry born from the emerging understanding of genetic science in the 1970s, best known for complex, expensive drugs created through living organisms. As science has advanced, biotech has become an increasingly broad term for the research-driven, startup-heavy wing of the drug industry trying to turn cutting-edge science into medicines. As the research and development pipelines of traditional drug companies have dried up, biotech has become increasingly important — economically and to the development of medicines.\n\nAt the same time, the biotech industry has been heavily reliant on immigrants; 52 percent of the 69,000 biomedical researchers in the United States were born abroad, according to one study.\n\n‘‘Without those immigrants, cancer treatment today would never be in the kind of position that it is today,’’ Jeremy Levin, chief executive of Ovid Therapeutics, said. ‘‘For me, the core of innovation — the heart of innovation — resides in America. It resides here because of the borders that we’ve opened to these scientists that have come from abroad; it resides here because of the tremendous capital and infrastructure we’ve built.’’\n\nAdvertisement\n\nThe letter-writing effort began informally, when late last week half a dozen colleagues, including Holtzman and Levin, decided they needed to say something about Trump’s executive order. They drafted the letter collectively and sent it out to colleagues over the weekend to see if any would sign on. It quickly went viral; they accumulated more than 160 signatures over 96 hours.\n\nHoltzman said his mother came to the United States from Cuba as a child and his father’s family came to escape religious persecution. Neither of his parents graduated from high school, and yet Holtzman has been involved in creating medicines at six biotechnology companies. His current company, a year-old startup, has about 40 employees — a quarter of whom are either first-generation or foreign born.\n\n‘‘Could such a story be told in Trump’s America?’’ Holtzman asked.\n\nLevin is both an immigrant and a refugee. His family was expelled from South Africa during apartheid when he was a child. He also believes that he knows the threat terrorism poses more personally than some. As the former chief executive of generic drug company Teva Pharmaceuticals, he recalls touring a factory in Israel on the border while rockets were being fired by Hamas.\n\n‘‘I believe you hunt down and destroy terrorism,’’ Levin said. ‘‘I know it more than most people who are in my industry, because I experienced it.’’\n\nAdvertisement\n\nWhat the executives agree upon is that the executive order could have far-reaching effects on American business and on the health of sick people.\n\n‘Without those immi-grants, cancer treatment today would never be in the kind of position that it is.’\n\n‘‘It will harm an industry dominated by smaller companies and startups, the very kind of industry the administration has said it wants to support,’’ the letter states. ‘‘It will slow the fight against the many diseases that afflict us, as well as carry negative economic consequences for the United States.’’", "authors": ["Carolyn Y. Johnson", "Washington Post"], "publish_date": "2017-02-07", "source": "bostonglobe", "top_words": ["executive", "america", "opposing", "travel", "companies", "trump", "industry", "ban", "position", "immigrants", "united", "states", "chief", "biotech", "leaders", "letter"], "summary": "The letter, published Tuesday by the journal Nature Biotechnology, reveals that scientists abroad are afraid to come to the United States and are canceling trips.\nForeign-born scientists within the United States fear similar orders could be issued without warning, and some have expressed anxiety about deportation or losing family ties.\nHoltzman said his mother came to the United States from Cuba as a child and his father’s family came to escape religious persecution.\nAs the former chief executive of generic drug company Teva Pharmaceuticals, he recalls touring a factory in Israel on the border while rockets were being fired by Hamas.\n‘‘It will slow the fight against the many diseases that afflict us, as well as carry negative economic consequences for the United States.’’"}