{"url": "https://www.bostonglobe.com/opinion/2017/01/30/trump-war-national-security-ideology-stupid/vYzsIMdefMf5PlRIG87kJM/story.html", "id": "188", "title": "Trump’s war on national security: it’s the ideology, stupid", "text": "Donald Trump the candidate declared war on Islamic terrorism. Donald Trump the president is now at war with his own national security apparatus and norms of how best to protect our country.\n\nIn a chaotic first eight days, Trump has sidelined and alienated patriotic Americans, Republicans and Democrats alike, whose job it is to advise the president and carry out his counterterrorism policies legally and effectively. From boasting about himself at the CIA memorial to reshuffling the National Security Council to include an ideologue with ties to white supremacists and demote top military and intelligence officials; from his ban on arrivals from certain Muslim-majority countries to his disinterest in seeking input from national security policymakers, Trump has flown in the face of national security expertise and procedures that have kept our homeland safe from a repeat of the Sept. 11 attacks.\n\nTrump’s haphazard executive order to block arrivals from seven countries was drafted by a small circle of White House strategists, short-circuiting even a cabinet-level meeting with Trump’s own secretaries of Homeland Security, State and Defense, whose agencies monitor threats and carry out policy. Issued without adequate vetting by government lawyers, the order is riddled with ambiguities and contradictions with US law and international conventions, and is being challenged in lawsuits. The order reads like the slapdash document it is: it even cites the wrong statute of immigration law. Michael Hayden, CIA director under George W. Bush, was biting in his critique, saying the order puts us at greater risk from terrorism.\n\nAdvertisement\n\nThis is not just about Trump running roughshod over national security experts who know more about protecting America (notwithstanding Trump’s boast that he knows “more about ISIS than the generals”). There’s a reason there’s a process, used by past presidents from both parties, for the White House to seek input and vet wording: to make sure policies are rooted in evidence and legally defensible. National security law analyst Benjamin Wittes of the Brookings Institution obtained a stinging critique of the entry ban drafted through the dissent channel at the State Department that he said hundreds of employees are expected to sign. In a shocking retort, spokesman Sean Spicer suggested career diplomats should quit if they disagree with policy.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nTrump’s entry ban is politics, pure and simple, pandering to Islamophobia and his perceived base, Daniel Benjamin, a former State Department counterterrorism adviser, said in an interview. It alienates Muslims at home, on whom law enforcement depends for tips, and angers allies abroad. It “has nothing to do with counterterrorism,” he said.\n\nLet’s review the facts: Not one American has been killed on US soil due to terrorism committed by someone from any of the seven affected countries – Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen, according to a comprehensive Cato Institute review of government statistics and outside databases tracking terrorism over 40 years. The risk of an American being killed by a foreign terrorist is smaller than that of being killed by an armed toddler, lightning, or falling out of bed — statistics Kim Kardashian tweeted Sunday. When a reality TV star is sharing more reliable statistics than the president, it’s time to worry.\n\nThe worst jihadi attack on American soil was 9/11. Fifteen of the 19 attackers were Saudis. Two were from United Arab Emirates, one from Egypt and one from Lebanon. Yet none of those countries is included in the ban. One thing Saudi Arabia, UAE, and Egypt have in common — along with countries affected by terrorism such as Turkey, India and the Philippines that were also excluded from the list — is they’re all places where Trump has business interests.\n\nTrump raised the idea of a Muslim or refugee ban after attacks in San Bernardino and Orlando. Those were carried out by native-born Americans and the Pakistani-born wife of an American; neither of those attacks would have been stopped by the new policy.\n\nAdvertisement\n\nTrump’s and his advisers’ views appear to be ideological rather than based on facts like these. The problem is that ideology is not an effective counterterrorism strategy.\n\nIndira A.R. Lakshmanan is a Washington columnist. Follow her on Twitter @Indira_L", "authors": ["Indira A.R. Lakshmanan"], "publish_date": "2017-01-30", "source": "bostonglobe", "top_words": ["national", "trump", "ban", "counterterrorism", "security", "order", "american", "stupid", "trumps", "countries", "law", "war", "terrorism", "ideology"], "summary": "Donald Trump the candidate declared war on Islamic terrorism.\nDonald Trump the president is now at war with his own national security apparatus and norms of how best to protect our country.\nThe order reads like the slapdash document it is: it even cites the wrong statute of immigration law.\nAdvertisementThis is not just about Trump running roughshod over national security experts who know more about protecting America (notwithstanding Trump’s boast that he knows “more about ISIS than the generals”).\nNational security law analyst Benjamin Wittes of the Brookings Institution obtained a stinging critique of the entry ban drafted through the dissent channel at the State Department that he said hundreds of employees are expected to sign."}