{"url": "https://www.bostonglobe.com/metro/2017/07/13/iranian-researcher-expulsion-worries-boston-scientists/v3yk8w10GAL5xmzWZjIK5K/story.html", "id": "165", "title": "Iranian researcher’s expulsion worries Boston scientists", "text": "Dr. Thomas Michel’s worries ratcheted up a few notches Tuesday when an Iranian cancer researcher bound for Boston Children’s Hospital was denied entry to the United States even though he held a valid visa.\n\nMichel, a cardiologist at Brigham and Women’s Hospital and a professor at Harvard Medical School, is still waiting for his own postdoctoral researcher from Iran, and continues to fret about whether the young scientist will be able to work in Boston.\n\nMichel is among many biomedical researchers in Massachusetts whose labs include highly educated immigrants, and who have been unnerved by the Trump administration’s travel restrictions and anti-immigrant rhetoric.\n\nAdvertisement\n\n“The travel ban has a huge impact on Boston,” Michel said. “Boston in particular has been a magnet for the best scientists and best biomedical researchers in the world.”\n\nGet Fast Forward in your inbox: Forget yesterday's news. Get what you need today in this early-morning email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nBut it’s hard to pinpoint an immediate effect beyond the heightened anxiety.\n\nClaire Ayer, director of the Partners Office for International Professionals and Students, said that just this week two Iranian researchers, a physician working with pathologists at Massachusetts General Hospital and a graduate student studying cancer cells at the Brigham, entered the country without incident.\n\nAbout 40 of the 1,500 researchers at Partners HealthCare are from the six countries affected by the travel restrictions, and Ayer said she has not seen any change in the number of positions offered to people from those countries.\n\nThe US Supreme Court recently allowed the Trump administration to ban travelers from Iran, Libya, Somalia, Sudan, Syria, and Yemen. But the court made an exception for people with a “bona fide relationship” in the United States, such as an offer of employment.\n\nAdvertisement\n\nThe would-be Boston Children’s researcher, Dr. Mohsen Dehnavi, was detained Monday after arriving at Logan Airport with his wife and three children. They were sent back Tuesday night, even though Dehnavi had a J-1 visa for visiting scholars.\n\nUS Customs and Border Protection said Dehnavi’s detention was unrelated to the president’s executive order banning travel from Iran and five other countries. The agency never gave a reason for sending Dehnavi back, citing privacy rules, and Children’s officials said Dehnavi’s visa had been approved by the State Department before he left Iran. The hospital said it had no additional information about why he was turned away.\n\nIranian state television reported Thursday that Dehnavi previously headed a student branch of a volunteer paramilitary militia, according to the Associated Press.\n\nDehnavi said on arrival in Tehran that he and his family had been detained for around 30 hours in Boston.\n\n“They kept me and my family under detention-like conditions for 28 to 30 hours in a room,” he said in the TV report quoted by AP. “They didn’t allow us to call anyone or exit the room.”\n\nAdvertisement\n\nThe incident renewed fears for Michel, the Brigham cardiologist. The researcher scheduled to work in his lab, Seyed Soheil Saeedi Saravi, had his visa revoked in January after President Trump’s first executive order. Saravi’s visa has since been reinstated and he is scheduled to start work in Michel’s lab in September — but Saravi is still waiting for a visa for his wife.\n\nIf he gets to Boston, Saravi — whom Michel described as “one of the top young life sciences PhDs in all of Iran” — will spend two years researching the effects of diabetes on the heart.\n\n“The delay in his arrival to my lab has undermined research,” Michel said. “To deny the opportunity for these talented people to come here and contribute is very short-sighted and will ultimately undermine American science.”\n\nThe travel ban could also affect medical school graduates seeking to pursue postgraduate training at American hospitals.\n\nThe University of Massachusetts Medical School this month welcomed three residents from the countries targeted by the executive order, one each from Iran, Sudan, and Syria.\n\n“All three were, however, already in the US, with visa status appropriate for working as resident physician trainees, and they all began their residencies here without incident,” UMass spokesman Mark L. Shelton said in an e-mail. UMass has also offered positions to two faculty members from the affected countries.\n\nDr. Jatin Vyas, director of the internal medicine residency program at Massachusetts General Hospital, said he is worried about the future residents, who will begin applying for positions in September.\n\nIn the past, he said, the United States “sent a strong positive invitation to the rest of the world that we were interested in the very best coming here. Now that invitation is quite muted.” As a result talented people are considering the United Kingdom or Canada instead.\n\n“The worst thing they could do is commit to a research program, and find out in the middle of that time that they’re no longer welcome here,” Vyas said.\n\nAyer, the director of the Partners international office, said that despite the current climate — the most inhospitable she has ever seen — she is confident that the fervor to pursue science and medicine will overcome the political obstacles.\n\n“Science knows no nationality,” Ayer said.\n\nFelice J. Freyer can be reached at felice.freyer@globe.com . Follow her on Twitter @felicejfreyer", "authors": ["Felice J. Freyer", "Globe Staff"], "publish_date": "2017-07-13", "source": "bostonglobe", "top_words": ["iran", "travel", "expulsion", "researcher", "researchers", "hospital", "worries", "massachusetts", "iranian", "united", "boston", "scientists", "michel", "visa"], "summary": "Dr. Thomas Michel’s worries ratcheted up a few notches Tuesday when an Iranian cancer researcher bound for Boston Children’s Hospital was denied entry to the United States even though he held a valid visa.\nAdvertisement“The travel ban has a huge impact on Boston,” Michel said.\n“Boston in particular has been a magnet for the best scientists and best biomedical researchers in the world.”Get Fast Forward in your inbox: Forget yesterday's news.\nAdvertisementThe would-be Boston Children’s researcher, Dr. Mohsen Dehnavi, was detained Monday after arriving at Logan Airport with his wife and three children.\nDehnavi said on arrival in Tehran that he and his family had been detained for around 30 hours in Boston."}