{"url": "https://www.bostonglobe.com/metro/2017/07/05/cambridge-welcomes-refugees-but-few-are-resettled-there/HjZmg2dgug3hvalUdOT8zI/story.html", "id": "195", "title": "Cambridge welcomes refugees, but few are resettled there", "text": "Opponents of President Trump’s travel ban gathered to hear speakers from the Harvard Islamic Society during a protest in Harvard Square in March.\n\n“Help us welcome local refugees to our community!” read a flier advertising the carnival in Cambridge, where attendees would later pose at a photo booth, mingle, and munch on baked goods inside a balloon-festooned gymnasium.\n\n“We wanted to have . . . an opportunity for refugee families to come and have a fun time, relax, play games,” said Caitlin Nichols, a Harvard PhD student who helped organize last month’s event.\n\nBut notably absent from the event? Refugees.\n\nAdvertisement\n\nAs the devastating civil war in Syria rages on, many Cambridge residents have expressed their desire to welcome some of the country’s 4.8 million refugees into their neighborhoods and homes. But well-meaning residents and local politicians have hit a brick wall — not President Trump’s travel ban, but the city’s high cost of living and the limited capacity of local government to address an international crisis.\n\nGet Fast Forward in your inbox: Forget yesterday's news. Get what you need today in this early-morning email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nIn September 2015, after watching the number of Syrians displaced by violence soar, Cambridge City Councilor Nadeem Mazen decided the council had “a moral and economic imperative” to act. He won passage of legislation calling on city officials to determine Cambridge’s capacity to take in Syrian refugees and then provide those families with the housing and support they would need.\n\nBut when peace commissioner Brian Corr — the local official charged with promoting “peace and social justice within Cambridge and in the wider world”— began reaching out to refugee resettlement agencies and government officials, he was told, politely, no thanks.\n\n“I spoke to a lot of people and got a lot of e-mail information. Long story short . . . Cambridge is not the place where refugees get resettled,” Corr said.\n\nWhere refugees end up is largely at the discretion of the State Department and nine resettlement agencies nationwide. From 2014 to 2016, 233 Syrian refugees arrived in Massachusetts. More than half went to Lowell, Springfield, or West Springfield, according to State Department records. None wound up in Cambridge.\n\nAdvertisement\n\nFinancial support is limited for new arrivals. Representatives of the State Department and Massachusetts resettlement agencies said they consider two factors when placing refugees, in addition to family ties.\n\n“The key factor is a combination of cost of living and employment opportunities that will allow them to become economically self-sufficient quickly because the support that the federal government provides is extremely limited,” said Jeffrey Thielman, president and CEO of the International Institute of New England, the area’s largest resettlement agency.\n\nEach refugee receives a one-time stipend of $2,075 from the federal government, and nearly half of that goes to the resettlement agency to help finance their work, according to a State Department spokeswoman. Agencies sometimes provide refugees additional cash assistance, and some refugees can receive $428 per month from the state for up to 18 months.\n\nSuch small sums don’t go far in Cambridge, where two-bedroom apartments rent for around $3,000 a month. That’s twice as expensive as housing in Springfield or Lowell.\n\nThroughout Greater Boston, inexpensive housing options are few and shrinking. Thielman said the only places in the area where his agencycan find housing for refugees are shared units for single individuals in Lynn or Dorchester — places where they can pay $350 or less in rent per month.\n\nAdvertisement\n\nCorr reported his findings to the Cambridge Council at a hearing in October 2015, and from his perspective, the city’s hands were tied. But Mazen urged administrators to try to settle just one or two families as a powerful symbol for the community. He said he knew the high cost of living in the city would pose a challenge, but he’s disappointed city officials did not pursue further action.\n\n‘’\n\n“The idea is to do our part by resettling any number of families — including one family — to show our commitment to the city, to show it can be done, to show we are paying attention, that we’re having the conversation,” Mazen said.\n\nBut the chances of this have grown increasingly slim since a recent Supreme Court decision allowed part of Trump’s travel ban to take effect, lowering the ceiling on refugee admissions to 50,000 and effectively barring refugees without family ties from coming to the United States for 120 days.\n\nDespite this, efforts to house refugees continue in Cambridge. Lydia Marik, who lived in Central Square until recently, started an online survey in 2015 to gauge interest among local residents in taking refugees into their homes — with the idea of eventually petitioning resettlement authorities to send their clients to Cambridge. Over 300 people across the Boston area have signed up since then, indicating a capacity to house 776 refugees.\n\nBut while resettlement agencies rely on donations and volunteers, they don’t endorse this host family approach.\n\n“For the refugee families, the ideal situation is to be placed in permanent housing the day they arrive,” Thielman said.\n\nAnd with refugees putting down roots elsewhere, Cambridge residents have turned to other ways to help. They organized clothing drives and poster campaigns, and started an advocacy group, “Cambridge Support for Syrian Refugees.” At the World Refugee Day event last month, they donated money and supplies to a Boston-area agency.\n\nBut Marik, at least, has not let go of the idea that Cambridge might one day house displaced Syrians. When she heard about a new initiative by Airbnb that allows hosts to offer their spare rooms to refugees for free, she pulled up the 300-person list she had started gathering two years before and sent them a link.\n\n“Now that there’s a hope for [the list] to be more than symbolic, it’s so exciting,” Marik said.\n\nFollow her on Twitter @ClaireParkerDC\n\nClaire Parker can be reached at claire.parker@globe.com", "authors": ["Claire Parker", "Globe Correspondent"], "publish_date": "2017-07-05", "source": "bostonglobe", "top_words": ["state", "housing", "cambridge", "refugee", "local", "welcomes", "families", "resettlement", "city", "refugees", "agencies", "resettled"], "summary": "Cambridge is not the place where refugees get resettled,” Corr said.\nWhere refugees end up is largely at the discretion of the State Department and nine resettlement agencies nationwide.\nRepresentatives of the State Department and Massachusetts resettlement agencies said they consider two factors when placing refugees, in addition to family ties.\nAgencies sometimes provide refugees additional cash assistance, and some refugees can receive $428 per month from the state for up to 18 months.\nBut while resettlement agencies rely on donations and volunteers, they don’t endorse this host family approach."}