{"url": "https://www.bostonglobe.com/news/nation/2017/02/08/trump-refers-boston-case-again-makes-argument-for-travel-ban/5bKtvvU856haycbM8LZD7K/story.html", "id": "24", "title": "Trump refers to Boston case again as he makes argument for travel ban", "text": "President Donald J. Trump, in a speech Wednesday, again cited a Boston federal court ruling as he launched into an argument that the courts should reinstate his controversial travel ban.\n\n“As you know, in Boston, we won it with a highly respected judge and a very strong opinion,” he said.\n\nHe then read and expounded upon a portion of the federal law that the administration says empowers him to impose restrictions on immigration.\n\nAdvertisement\n\nTrump spoke at the winter meeting of the Major Cities Chiefs Association. His remarks came after a three-judge appeals court panel in San Francisco Tuesday night heard arguments on whether to continue a suspension of the travel ban. Trump said he had listened to audio of the arguments — and had developed his own opinions.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n“I listened to lawyers on both sides last night,” he said. “I have to be honest that if these judges wanted to, in my opinion, help the court in terms of respect for the court, they’d do what they should be doing. It’s so sad.”\n\n“I watched last night in amazement, and I heard things that I couldn’t believe,” he said. “Things that really had nothing to do with what I just read.”\n\n“I was a good student. I understand things. I comprehend very well. OK? Better than I think almost anybody. And I want to tell you I listened to a bunch of stuff last night on TV that was disgraceful.”\n\nHe returned again to the Boston case, saying, “I said to my people, ‘Why don’t you use the Boston case?’ And there were reasons why they couldn’t use the Boston case.\n\nAdvertisement\n\n“There were statements made by that judge ... that were right on. They were perfect. They were perfect,” he said.\n\nTrump has repeatedly suggested the Boston case could somehow be used in the West Coast case\n\nHe claimed that the country’s security was threatened because the travel ban has been suspended. “Right now we are at risk because of what happened. ... I think our security is at risk today,” he said.\n\nOn Feb. 3, US District Judge Nathaniel M. Gorton in Boston refused to extend a temporary stay on the president’s travel ban, saying Trump would likely succeed in the case on the grounds that he has broad authority over federal immigration laws. But a judge in Seattle ruled the other way the same day. That’s the case that’s now in the San Francisco appeals court.", "authors": ["Globe Staff"], "publish_date": "2017-02-08", "source": "bostonglobe", "top_words": ["travel", "case", "refers", "trump", "ban", "night", "listened", "makes", "argument", "judge", "court", "federal", "boston", "things"], "summary": "President Donald J. Trump, in a speech Wednesday, again cited a Boston federal court ruling as he launched into an argument that the courts should reinstate his controversial travel ban.\n“As you know, in Boston, we won it with a highly respected judge and a very strong opinion,” he said.\nHis remarks came after a three-judge appeals court panel in San Francisco Tuesday night heard arguments on whether to continue a suspension of the travel ban.\nAnd I want to tell you I listened to a bunch of stuff last night on TV that was disgraceful.”He returned again to the Boston case, saying, “I said to my people, ‘Why don’t you use the Boston case?’ And there were reasons why they couldn’t use the Boston case.\nTrump has repeatedly suggested the Boston case could somehow be used in the West Coast caseHe claimed that the country’s security was threatened because the travel ban has been suspended."}