{"url": "https://www.bostonglobe.com/news/politics/2017/06/12/another-appeals-court-upholds-decision-blocking-trump-travel-ban/7E4Z35lvHyDFj4Ya6DvfNL/story.html", "id": "25", "title": "Another US appeals court upholds decision blocking Trump’s travel ban", "text": "WASHINGTON — A West Coast federal appeals court upheld the freeze on President Trump’s travel ban Monday, declaring that he had exceeded his lawful authority in suspending the issuance of visas to residents of six Muslim majority countries and suspending the US refugee program.\n\nA three-judge panel with the US Court of Appeals for the Ninth Circuit ruled against the administration unanimously.\n\nThe ruling is the second setback for Trump’s revised immigration order.\n\nAdvertisement\n\nThe Court of Appeals for the Fourth Circuit in Virginia last month cited the president’s campaign statements calling for a ‘‘total and complete shutdown’’ on Muslims entering the United States as evidence that the 90-day ban was unconstitutionally ‘‘steeped in animus and directed at a single religious group,’’ rather than necessary for national security.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe administration has asked the Supreme Court to intervene.\n\nLawyers for Hawaii told the high court Monday that letting the administration enforce the ban while the case is being decided by the justices would ‘‘thrust the country back into the chaos and confusion’’ that resulted when the policy was first announced in January.\n\nThe state urged the justices to deny an administration plea to reinstate the policy. They could act on the administration’s request before the session ends at the end of June.\n\nMonday’s ruling by the Ninth Circuit was both logistically and symbolically important — keeping in place the broadest blockade on Trump’s ban and creating new legal and practical paths for the directive to meet its ultimate demise.\n\nAdvertisement\n\nUnlike other courts, the three judges on the Ninth Circuit did not dwell on Trump’s public comments, nor did they declare the president had run afoul of the constitution because his intent was to discriminate.\n\nInstead, they ruled that Trump’s travel ban lacked a sufficient national security or other justification that would make it legal, and that violated immigration law.\n\nThey offered no opinion on whether the ban was constitutional.\n\n‘‘There is no finding that present vetting standards are inadequate, and no finding that absent the improved vetting procedures there likely will be harm to our national interests,’’ the judges wrote. ‘‘These identified reasons do not support the conclusion that the entry of nationals from the six designated countries would be harmful to our national interests.’’\n\nA Justice Department spokesman said officials were preparing a response.\n\nAdvertisement\n\nNeal Katyal, one of the lawyers representing those challenging the ban, said on Twitter that the decision was a ‘‘complete win’’ and noted it was different than previous victories in other cases.\n\nWhile the US Court of Appeals for the Fourth Circuit had upheld a separate freeze on Trump’s ban, that freeze did not apply to the portion of Trump’s order dealing with refugees.\n\nThe Ninth Circuit was considering a freeze that did, and concluded Trump had not provided sufficient justification to either temporarily suspend refugee admission or lower the refugee cap for fiscal 2017 to 50,000.\n\nThe opinion also clarified that the administration could conduct an internal review to assess vetting procedures.\n\nThat could be construed as a victory for Trump: The appeals court said a federal judge in Hawaii was wrong to restrict his administration from conducting such a review. But it also forces the Supreme Court to act quickly if the travel ban is to be salvaged.\n\nThat is because the measure is supposed to be temporary — barring the issuance of new visas to residents of six Muslim majority countries for 90 days and suspending the US refugee program for 120 days so officials could review vetting procedures.\n\nThe Justice Department had argued that it felt blocked from conducting such a review by the Hawaii judge, meaning the clock had essentially stopped.\n\nTrump seemed to suggest on Twitter recently that he did not view the measure as a temporary one.\n\n‘‘People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a travel ban!’’ he wrote. Trump’s own press secretary had previously disputed calling the measure a ban, and the Justice Department has sought in court to characterize it as a ‘‘temporary pause.’’\n\nThe Ninth Circuit opinion was written by judges Michael Daly Hawkins, Ronald Gould, and Richard Paez, all appointed by Bill Clinton.\n\nThe judges heard arguments in the case last month and focused much of their questioning on Trump’s public comments, which other judges have cited as evidence the president meant to discriminate against Muslims in imposing a ban.\n\nTrump earlier this month doubled down on some of those comments, deriding the revised travel ban as a ‘‘watered down’’ version of the first and calling the new measure ‘‘politically correct.’’ Legal analysts said that might ultimately hurt his case.\n\nIn their ruling, though, the Ninth Circuit judges criticized the Trump administration not for its public opining, but for its lack of a real justification for the directive.\n\nThe judges noted that a Department of Homeland Security report concluded citizenship was an ‘‘unreliable’’ threat indicator, and most foreign-born extremists are radicalized years after coming to the United States. The judges said the president had broad authority to set immigration policy, but it was ‘‘not unlimited.’’", "authors": ["Matt Zapotosky", "Washington Post"], "publish_date": "2017-06-12", "source": "bostonglobe", "top_words": ["ninth", "travel", "judges", "ban", "appeals", "circuit", "vetting", "blocking", "court", "trumps", "upholds", "administration", "decision"], "summary": "A three-judge panel with the US Court of Appeals for the Ninth Circuit ruled against the administration unanimously.\nInstead, they ruled that Trump’s travel ban lacked a sufficient national security or other justification that would make it legal, and that violated immigration law.\nWhile the US Court of Appeals for the Fourth Circuit had upheld a separate freeze on Trump’s ban, that freeze did not apply to the portion of Trump’s order dealing with refugees.\nBut it also forces the Supreme Court to act quickly if the travel ban is to be salvaged.\n‘‘People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a travel ban!’’ he wrote."}