{"url": "https://www.bostonglobe.com/news/nation/2017/03/15/trump-latest-travel-ban-was-put-hold-what-happens-next/5ewtng9o6Jpn6SegnQsz0K/story.html", "id": "22", "title": "Trump’s latest travel ban was put on hold. What happens next?", "text": "President Donald Trump spoke during a rally in Nashville on Wednesday, shortly after a judge in Hawaii put Trump’s revised travel ban on hold.\n\nOn Wednesday night, a federal court in Hawaii blocked President Trump’s latest effort to impose a temporary travel ban on people from six predominantly Muslim countries. It’s a major setback for the Trump administration, especially as this was its second attempt to impose travel restrictions — and many of the revisions were specifically designed to pass legal muster.\n\nTo appreciate the full, Beckettian absurdity of this second injunction, you have to back up a few weeks.\n\nIn late January, Trump signed a controversial executive order blocking immigrants and visitors from a clique of mostly Muslim countries. Implementation was immediate and chaotic, sparking protests at airports and raising questions about whether the order had been rushed into law without adequate vetting.\n\nAdvertisement\n\nAmidst the turmoil, courts acted quickly to block Trump’s order. That speedy interference helped people who were trapped in airport limbo, but it also suggested that the White House would face a difficult legal battle moving forward.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nSo team Trump went back to the drawing board, removing some of the more inflammatory elements of their order in order to produce a tempered version that they hoped would survive legal scrutiny.\n\nBut that hope foundered Wednesday, when a Hawaii judge ruled that the ban could not go into effect. It seems that while the Trump administration trimmed up the edges of its ban, the central issue was basically untouched: Is this a Muslim ban by another name? Or is there a legitimate, nondiscriminatory rationale for blocking travelers from these select countries?\n\nThe court was unequivocal in finding that the order was indeed discriminatory, arguing that “a reasonable, objective observer would conclude that the Executive Order was issued with a purpose to disfavor a particular religion, in spite of its stated, religiously-neutral purpose.”\n\nAnd for evidence, they cited Trump’s own words, including an infamous campaign press release that read “Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States.”\n\nAdvertisement\n\nStatements like this, they concluded, expose the real, discriminatory basis of Trump’s order.\n\nNow, this is merely the beginning of a long legal battle. Many legal experts continue to argue that the courts are overreaching, and that the president has wide authority to limit immigration in the name of national security.\n\nIn the days ahead, the Justice Department will probably appeal Wednesday’s decision. And beyond that, there will be room for further appeals and additional argument — all the way to the Supreme Court, if necessary.\n\nOr, if they prefer, the administration could also opt for yet another rewrite, in hopes of finding a more legally secure basis.\n\nBut if Trump pushes ahead with this version, the road might prove bumpy indeed. Not because of any problems with the language of the order itself, but because in the view of some federal courts, the whole approach has been tainted by Trump’s campaign rhetoric.\n\nEvan Horowitz digs through data to find information that illuminates the policy issues facing Massachusetts and the United States. He can be reached at evan.horowitz@globe.com . Follow him on Twitter @GlobeHorowitz.", "authors": ["Globe Staff"], "publish_date": "2017-03-15", "source": "bostonglobe", "top_words": ["travel", "hawaii", "trump", "courts", "ban", "order", "happens", "trumps", "hold", "latest", "president", "muslim", "legal"], "summary": "President Donald Trump spoke during a rally in Nashville on Wednesday, shortly after a judge in Hawaii put Trump’s revised travel ban on hold.\nOn Wednesday night, a federal court in Hawaii blocked President Trump’s latest effort to impose a temporary travel ban on people from six predominantly Muslim countries.\nIn late January, Trump signed a controversial executive order blocking immigrants and visitors from a clique of mostly Muslim countries.\nAdvertisementAmidst the turmoil, courts acted quickly to block Trump’s order.\nIt seems that while the Trump administration trimmed up the edges of its ban, the central issue was basically untouched: Is this a Muslim ban by another name?"}