{"url": "https://www.bostonglobe.com/news/nation/2017/06/06/attorney-general-jeff-sessions-offered-resign/EcueGL3l6AUfrhVJaErO9J/story.html", "id": "210", "title": "Attorney General Jeff Sessions offered to resign", "text": "WASHINGTON — Attorney General Jeff Sessions offered to resign in recent weeks as he told President Trump he needed the freedom to do his job, according to two people who were briefed on the discussion. On Tuesday, the White House declined to say whether Trump still had confidence in his attorney general.\n\n“I have not had that discussion with him,” Sean Spicer, the White House press secretary, told reporters in the White House briefing room, responding to questions about whether the president had soured on Sessions.\n\nSpicer’s remarks came after The New York Times reported that Trump had vented intermittently about Sessions since the attorney general recused himself in March from any Russia-related investigations conducted by the Department of Justice. Trump has fumed to allies and advisers ever since, suggesting that Sessions made a needless decision.\n\nAdvertisement\n\nHe has also blamed Sessions for the fallout from an executive order that the president signed putting in place a travel ban on seven primarily Muslim countries, which courts have blocked.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe situation between Sessions and Trump has grown so tense that the attorney general told Trump in recent weeks that he needed the freedom to do his job and that he could resign if that was what was wanted, according to the two people who spoke on the condition of anonymity to discuss internal White House matters. Trump did not take him up on the offer.\n\nThe Washington Post reported the moment was brief and Sessions made the suggestion after weeks of Trump’s disgruntlement and tense private meetings, according to the two people close to the White House who requested anonymity to speak candidly. Trump made clear to Sessions that while he did not like Sessions’ decision to recuse himself, these people said, he still had faith in his attorney general.\n\nThe offer to resign was first reported by ABC News. A spokesman for Sessions declined to comment. A White House spokeswoman did not respond to an e-mail seeking comment.\n\nOn Monday, Trump derided the revised travel ban and criticized his own Justice Department’s handling of the controversial case.\n\nAdvertisement\n\nIn his Twitter posts, Trump complained that his original executive order barring visitors from select Muslim-majority nations and refugees from around the world was revised in hopes of passing legal muster after it was struck down by multiple federal courts. The second version, however, has also been blocked, and last week the Justice Department appealed to the Supreme Court.\n\n“The Justice Dept. should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C.,” Trump wrote.\n\nThen he added: “The Justice Dept. should ask for an expedited hearing of the watered down Travel Ban before the Supreme Court — & seek much tougher version!”\n\nBut the messages caused considerable head scratching around Washington since it was Trump who signed the revised executive order and, presumably, agreed to the legal strategy in the first place. His posts made it sound like the Justice Department was not part of his administration.\n\nThe frustration at times goes both ways. Sessions was upset when the president appointed a task force to tackle the opioids crisis in March and tapped Governor Chris Christie of New Jersey to lead it without consulting the attorney general, according to an administration official who asked not to be named discussing internal matters.\n\nAdvertisement\n\nThe offer by Sessions to discuss resigning, however lightly he made it, was a surprising move from one of the president’s earliest and most vocal supporters. Sessions was an early endorser of Trump’s candidacy, and his former spokesman, Stephen Miller, is now Trump’s main speechwriter and a policy adviser.\n\nTrump and Sessions share a similar world view on key issues, including crime and immigration. In the Senate, Sessions crusaded for a hard-line stance on immigration and continues to speak out about arresting and prosecuting illegal immigrants as he travels across the country.\n\nTrump spoke of rising crime in his inaugural address and vowed to end the ‘‘American carnage.’’ Sessions has made a tough crackdown on crime his top priority, reversing the Obama administration’s charging policy and directing his federal prosecutors to pursue the most severe penalties possible, including mandatory minimum sentences, in a step toward a return to the war on drugs of the 1980s and 1990s.\n\nMaterial from the Washington Post was used in this report.", "authors": ["Maggie Haberman", "Peter Baker", "New York Times"], "publish_date": "2017-06-06", "source": "bostonglobe", "top_words": ["travel", "trump", "offered", "sessions", "house", "president", "general", "attorney", "justice", "jeff", "resign", "white", "washington"], "summary": "WASHINGTON — Attorney General Jeff Sessions offered to resign in recent weeks as he told President Trump he needed the freedom to do his job, according to two people who were briefed on the discussion.\nOn Tuesday, the White House declined to say whether Trump still had confidence in his attorney general.\nSpicer’s remarks came after The New York Times reported that Trump had vented intermittently about Sessions since the attorney general recused himself in March from any Russia-related investigations conducted by the Department of Justice.\nTrump made clear to Sessions that while he did not like Sessions’ decision to recuse himself, these people said, he still had faith in his attorney general.\nA White House spokeswoman did not respond to an e-mail seeking comment."}