{"url": "https://www.bostonglobe.com/news/nation/2017/04/12/trump-undercuts-steve-bannon-whose-job-may-danger/XUH4O5EMM1juJhDu4R6MbI/story.html", "id": "214", "title": "Trump undercuts Steve Bannon, whose job may be in danger", "text": "By criticizing Bannon, Trump has made it hard for the chief strategist to remain in place without appearing undermined.\n\nWASHINGTON — Stephen K. Bannon, President Trump’s grenade-lobbing pugilist of a chief strategist, has a fitting nickname for his West Wing office: “the war room.”\n\nBut more and more, war is being waged on Bannon himself. And it is unclear how much longer he can survive in his job.\n\nHis isolation inside the White House, after weeks of bitter battle with other senior aides aligned with Jared Kushner, the president’s son-in-law, appeared to grow even starker this week after Trump undercut Bannon in an interview and downplayed his role as the Trump campaign’s chief executive.\n\nAdvertisement\n\n“I didn’t know Steve,” Trump told the New York Post columnist Michael Goodwin in an interview Tuesday, explaining that Bannon was a latecomer to his presidential campaign. “I am my own strategist,” the president added, a pointed reference to what aides described as his growing irritation that Bannon is receiving credit for being the mastermind behind Trump’s victory.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe remarks were at least, in part, not true — Trump has known Bannon for some time and has appeared on the radio show he used to host. But it was an unusually public rejection by a chief executive who generally keeps such criticism behind closed doors.\n\nOne person with firsthand knowledge of internal White House dynamics, who asked not to be identified given how tense the situation had become, insisted that no immediate changes were likely. But by openly criticizing Bannon, Trump has created a situation that makes it hard for the swaggering chief strategist to remain in place without appearing deeply undermined.\n\nAllies of Trump’s say he has become more impatient with the infighting — and the overwhelming attention it is receiving in the media. In a lengthy conversation with Bannon this week, the president repeated his admonition that the chief strategist and his adversaries needed to “knock off” their back-and-forth sniping.\n\nTrump insisted as much in the Post interview, saying, “Steve is a good guy, but I told them to straighten it out or I will.” His comments in private, people who have spoken with him say, have been more pointed.\n\nAdvertisement\n\nBannon appears to now recognize the peril of his situation and has kept a low profile inside the White House while Kushner has been away with his family. He has told friends and associates, using his trademark military vernacular, that he understands he cannot throw bombs every day and needs to pick his battles carefully.\n\nHe had told several associates over the weekend that he believed that things had cooled off with Kushner. But the comments from the president suggested the truce is uneasy and might not last.\n\nBannon’s allies have already begun discussing a post-White House future for him. Last Friday, Bannon’s main political patron, the financier Rebekah Mercer, the daughter of Robert Mercer, a major Trump donor, holed up in her office at Cambridge Analytica in New York, discussing possibilities for Bannon should he leave, according to two people briefed on the meeting. Bannon served on the board of the data-mining firm until last summer.\n\nThe split between the hard-nosed Bannon and the far more reserved and soft-spoken Kushner has evolved into much more than a personality clash.\n\nFairly or not, Bannon, in the eyes of the president, has become tainted with the new administration’s major losses: the controversial travel ban and the failed effort to pass an Affordable Care Act replacement. He was heavily involved in overseeing the drafting of the travel ban order. He played a limited role in the health care negotiations with congressional leaders but joined them at critical moments, taking a hard-line approach.\n\nAdvertisement\n\nGiven Bannon’s nature, he has objected to the advice of others inside the administration. Those include not only Kushner and his wife Trump’s daughter Ivanka, but other advisers who share a similar, more moderate mind-set such as Gary Cohn, the chief economic adviser, and Dina Powell, a deputy national security adviser, most of whom believe the president should ease up on some of his hard-line campaign promises.\n\nBannon’s removal from the White House would not come without political consequences, given his stature on the right. Conservative talk radio has already been abuzz with worry that “the Democrats,” the epithet they use to describe the Kushner faction in the West Wing, were co-opting the president’s agenda.\n\nStill, Kushner has some powerful allies inside the White House. The person with perhaps the most powerful voice — Ivanka Trump — has also soured on Bannon, according to several people familiar with her thinking.", "authors": ["Jeremy W. Peters", "Maggie Haberman", "New York Times"], "publish_date": "2017-04-12", "source": "bostonglobe", "top_words": ["trump", "steve", "bannon", "job", "told", "kushner", "undercuts", "chief", "strategist", "white", "trumps", "danger", "president", "house"], "summary": "By criticizing Bannon, Trump has made it hard for the chief strategist to remain in place without appearing undermined.\nWASHINGTON — Stephen K. Bannon, President Trump’s grenade-lobbing pugilist of a chief strategist, has a fitting nickname for his West Wing office: “the war room.”But more and more, war is being waged on Bannon himself.\nAdvertisement“I didn’t know Steve,” Trump told the New York Post columnist Michael Goodwin in an interview Tuesday, explaining that Bannon was a latecomer to his presidential campaign.\nBut by openly criticizing Bannon, Trump has created a situation that makes it hard for the swaggering chief strategist to remain in place without appearing deeply undermined.\nBannon’s removal from the White House would not come without political consequences, given his stature on the right."}