{"url": "https://www.bostonglobe.com/news/nation/2017/01/28/google-recalls-staff-members-after-trump-immigration-order/GZAmO42kxRoiRjzFj858YN/story.html", "id": "201", "title": "Google recalls staff members to US after Trump’s immigration order", "text": "Google CEO Sundar Pichai on Friday told employees who may be affected by President Trump’s immigration order to return to the United States right away.etty Images\n\nAlphabet Inc.’s Google delivered a sharp message to staff traveling overseas who may be impacted by a new executive order on immigration from President Donald Trump: Get back to the U.S. now.\n\nGoogle Chief Executive Officer Sundar Pichai slammed Trump’s move in a note to employees Friday, telling them that more than 100 company staff are affected by the order.\n\n“It’s painful to see the personal cost of this executive order on our colleagues,” Pichai wrote in the memo, a copy of which was obtained by Bloomberg News. “We’ve always made our view on immigration issues known publicly and will continue to do so.”\n\nAdvertisement\n\nThe comments underscore a growing rift between the Trump administration and several large U.S. technology companies, which include many immigrants in their ranks and have lobbied for fewer immigration restrictions. Pichai’s note echoed similar statements from tech peers voicing concerns about the harm such policies could have on their businesses.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nTrump signed an executive order Friday prohibiting entry by people from seven majority-Muslim nations for 90 days. Citizens of Syria, Iraq, Iran, Sudan, Somalia, Yemen and Libya would be banned from entering the U.S. for the period, while the government determines what information it needs to safely admit visitors.\n\nThe Department of Homeland Security issued a directive on Friday afternoon ordering the Customs and Border Control agency to enforce the order, the New York Daily News reported. Late Friday, some green card and visa holders were already being blocked from boarding flights to the U.S., the newspaper said.\n\n“We’re concerned about the impact of this order and any proposals that could impose restrictions on Googlers and their families, or that create barriers to bringing great talent to the U.S.,” a Google spokeswoman said in a statement. “We’ll continue to make our views on these issues known to leaders in Washington and elsewhere.”\n\nSome Google employees were traveling abroad and were trying to get back to the U.S. before the order took effect. The company asked them to reach out to Google’s security, travel, and immigration teams for assistance, according to a person familiar with the situation. The person asked not to be identified talking about internal company communications.\n\nAdvertisement\n\nThe employees in question normally work in the U.S. but just happened to be abroad either on work assignments or vacations. The concern is that even if Google staff have valid visas, they may still be at risk if they’re from one of the seven countries and they’re outside the U.S. when the order kicks in, the person also said.\n\nOne employee rushed back from a trip to New Zealand to make it into the U.S. before the order was signed, Google’s Pichai wrote in his memo.\n\n“We are advising our clients from those seven countries who have green cards or any type of H-1B visa not to travel outside the U.S.” said Ava Benach, a partner at immigration law firm Benach Collopy LLP, while noting that the order takes effect immediately.\n\n“No one is really sure whether a green card holder from these seven countries can return to the U.S. now. It’s fairly clear that an H-1B visa holder can’t,” Benach said. The H-1B lets U.S. companies employ graduate-level workers from other countries in technical occupations such as technology, engineering and science.\n\n“If anyone in these situations has the misfortune to have gone abroad recently, it’s a treacherous moment, possibly for green card holders too,” Benach said.\n\nAdvertisement\n\nOther technology companies are likely in a similar situation, she added.\n\nFacebook Inc. Chief Executive Officer Mark Zuckerberg said Friday he was “concerned” by Trump’s recent moves to restrict immigration.\n\nMicrosoft Corp. inserted language in a securities filing on Thursday on the issue, cautioning investors that immigration restrictions “may inhibit our ability to adequately staff our research and development efforts.”", "authors": ["Mark Bergen", "Bloomberg News"], "publish_date": "2017-01-28", "source": "bostonglobe", "top_words": ["executive", "seven", "immigration", "employees", "google", "members", "trumps", "countries", "staff", "green", "order", "pichai", "recalls"], "summary": "Google Chief Executive Officer Sundar Pichai slammed Trump’s move in a note to employees Friday, telling them that more than 100 company staff are affected by the order.\n“It’s painful to see the personal cost of this executive order on our colleagues,” Pichai wrote in the memo, a copy of which was obtained by Bloomberg News.\nSign up for more newsletters hereTrump signed an executive order Friday prohibiting entry by people from seven majority-Muslim nations for 90 days.\n“No one is really sure whether a green card holder from these seven countries can return to the U.S. now.\nFacebook Inc. Chief Executive Officer Mark Zuckerberg said Friday he was “concerned” by Trump’s recent moves to restrict immigration."}