{"url": "https://www.bostonglobe.com/metro/2017/01/29/who-affected-trump-immigration-ban/txCbriUUf7PS3ouT6RNofN/story.html", "id": "221", "title": "Who is affected by Trump’s immigration ban?", "text": "President Trump’s executive order issued Friday suspended all refugee admissions for 120 days, barred Syrian refugees indefinitely, and prevented citizens of seven majority Muslim countries — Iran, Iraq, Libya, Somalia, Sudan, Syria, and Yemen — from entering the United States for 90 days. Who are the people affected by Trump’s order, and how does it affect them?\n\nRefugees\n\nThey are defined by the United Nations as anyone forced to leave their countries because of persecution, war, or violent conflict. According to the UN, many are afraid to return to their home countries, or can’t. War and religious violence are leading causes of refugees fleeing their countries, but some face persecution because of sexual orientation or gender identity. Trump’s order closed the country to refugees from the seven countries and revoked the previous administration’s promise to accept 50,000 refugees in fiscal year 2017 until the president “determine[s] that additional admission would be in the national interest.”\n\nForeign visitors with visas\n\nVisas let foreign nationals enter the United States. But according to the Department of State, visa holders are not guaranteed access to the country. Obtaining a visa means an embassy or consulate has determined an individual is eligible to enter for a particular purpose, such as school or specialized work. The United States offers visas for a variety of reasons, including tourism, education, and employment. Trump’s executive order banned the State Department from issuing visas to people from the seven “Countries of Particular Concern.”\n\nAdvertisement\n\n“While their status to be in the country is legal, they can’t leave the country because they won’t be let back in,” said Gadeir Abbas, an attorney with the Council on American-Islamic Relations who is drafting a lawsuit against Trump’s immigration ban. For example, some academics and people working in research labs at universities in New England have been blocked from reentering the country.\n\nGreen card holders\n\nGet Fast Forward in your inbox: Forget yesterday's news. Get what you need today in this early-morning email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nForeign nationals living in the United States with a green card are considered permanent residents, the Department of Homeland Security says. They can legally work and pay taxes as US citizens. The Trump administration said the executive order will not affect green card holders, but Abbas said those who must reapply for green cards may be denied.\n\nBrett Hauff can be reached at brett.hauff@globe.com Follow him on Twitter @b_hauff", "authors": ["Bret Hauff", "Globe Correspondent"], "publish_date": "2017-01-29", "source": "bostonglobe", "top_words": ["executive", "seven", "affected", "ban", "immigration", "refugees", "united", "states", "trumps", "countries", "country", "green", "order"], "summary": "Who are the people affected by Trump’s order, and how does it affect them?\nRefugeesThey are defined by the United Nations as anyone forced to leave their countries because of persecution, war, or violent conflict.\nThe United States offers visas for a variety of reasons, including tourism, education, and employment.\nSign up for more newsletters hereForeign nationals living in the United States with a green card are considered permanent residents, the Department of Homeland Security says.\nThe Trump administration said the executive order will not affect green card holders, but Abbas said those who must reapply for green cards may be denied."}