{"url": "https://www.bostonglobe.com/news/world/2017/02/23/trickle-refugees-fleeing-canada-could-become-deluge-spring/TcZlOkfd8BVg58bGHOGtNJ/story.html", "id": "209", "title": "Trickle of refugees fleeing US to Canada could become deluge in spring", "text": "A mother and child from Turkey were escorted by Royal Canadian Mounted Police after they crossed the U.S.-Canada border into Hemmingford, Quebec, on Thursday.\n\nOTTAWA — As desperate asylum seekers continue to flee the Trump administration’s immigration crackdown by crossing into Canada, concern is growing here over whether the country will be able to cope if the number of migrants keeps growing.\n\nStories of migrants hauling children and suitcases across frozen fields and snow-covered ditches into Canada have become headline news. The asylum seekers, who are fleeing President Trump’s travel and refugee bans as well as stepped-up arrests of undocumented immigrants, have received warm welcomes. But opposition politicians are criticizing the government of Justin Trudeau for being too harsh or too lax in its approach.\n\nIn a recent survey from the Angus Reid Institute, a Vancouver-based opinion research firm, most Canadians were supportive of the government’s decision to maintain its target of accepting 40,000 refugees in 2017. But 25 percent wanted to see Ottawa enact a travel ban similar to the Trump order.\n\nAdvertisement\n\nIn answer to a separate question, 40 percent said they think Canada is accepting too many refugees. The number of refugee claims has spiked since Trump’s election. On the Quebec border with the United States alone, there were 452 claims in January, compared with 137 in the same month a year ago.\n\nGet Today's Headlines in your inbox: The day's top stories delivered every morning. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nWith so many migrants willing to traipse through the ice and snow to reach Canada, there are concerns that numbers could soar with the advent of spring. ‘‘Will we be facing down our own mini-Greece or mini-Italy moment? What are we going to see when the snow melts?’’ said Shachi Kurl, the executive director of the Angus Reid Institute.\n\nJenny Kwan, a member of Parliament for the left-leaning New Democratic Party, wants Ottawa to withdraw from its Safe Third Country Agreement with the United States. That pact states that an individual arriving at an official Canadian border point from the United States isn’t allowed to make a refugee claim, an effort to avoid ‘‘asylum shopping.’’ But if an asylum seeker crosses into Canada irregularly — as the current wave of migrants is — and then calls the police, he or she can make a claim legally.\n\n‘‘We need to stand up for human rights,’’ she told The Washington Post. ‘‘We are seeing people who are crossing to Canada through the back door. They are literally risking life and limb. I don’t think the US can be considered a safe country for refugees at this moment.’’\n\nBut the Conservative Party says the Trudeau government isn’t doing enough to protect ‘‘the integrity of our border,’’ said Michelle Rempel, Conservative member of Parliament. She wants the government to make it clear that crossing the border outside official crossings is ‘‘illegal and unsafe.”\n\nAdvertisement\n\n‘‘I have this feeling that we’re going to see big numbers coming across once the weather gets better,’’ said Greg Janzen, the reeve — the equivalent of a mayor — of Emerson, Manitoba, a town on the border with North Dakota that has seen growing numbers of asylum seekers.\n\nThe arrivals were once simply a weekend phenomenon, but refugees are now turning up on a daily basis. ‘‘We had six this morning,’’ Janzen said Wednesday. ‘‘I think they walked up to the hotel. They kept them in the lobby until the [The Royal Canadian Mounted Police] came.’’\n\nThe Royal Canadian Mounted Police bring the refugees to the local border post, where they are processed and then driven to Winnipeg, the nearest large city. There have been no incidents involving the refugees aside from two Ghanaians who suffered serious frostbite before Christmas, but Janzen remains worried. He’d like to see a change in the law that would allow claims to be made at the border point — even if numbers increase as a result.\n\n‘‘That way they’re not coming through town,’’ he said. ‘‘It’s safer for them and it’s safer for townspeople.’’", "authors": ["Alan Freeman", "Washington Post"], "publish_date": "2017-02-23", "source": "bostonglobe", "top_words": ["numbers", "spring", "trickle", "united", "asylum", "states", "think", "border", "migrants", "refugees", "canadian", "deluge", "fleeing", "canada"], "summary": "Stories of migrants hauling children and suitcases across frozen fields and snow-covered ditches into Canada have become headline news.\nThe asylum seekers, who are fleeing President Trump’s travel and refugee bans as well as stepped-up arrests of undocumented immigrants, have received warm welcomes.\nAdvertisementIn answer to a separate question, 40 percent said they think Canada is accepting too many refugees.\nOn the Quebec border with the United States alone, there were 452 claims in January, compared with 137 in the same month a year ago.\nJenny Kwan, a member of Parliament for the left-leaning New Democratic Party, wants Ottawa to withdraw from its Safe Third Country Agreement with the United States."}