{"url": "https://www.bostonglobe.com/metro/2017/02/02/for-many-veterans-trump-travel-ban-makes-sense/DCBDAaI7VRpcEIN2hri1MM/story.html", "id": "28", "title": "For many US veterans, Trump travel ban makes sense", "text": "They fought beside Iraqi soldiers, handed candy to Iraqi children, and depended on Iraqis to tell friend from foe.\n\nBut many veterans of that long, grinding war support President Trump’s executive order that bars citizens from Iraq and six other Middle East and African nations from the United States, a controversial move that has sparked protests across the country.\n\nTo these veterans, Trump’s “America First” policies seem to be a common-sense approach to unpredictable danger — even though refugees can take years to be vetted and visitors often wait weeks and more for visas.\n\nAdvertisement\n\n“I think it’s fantastic,” said Kathleen White, a 42-year-old Army National Guard veteran from Raynham who was wounded in Iraq, where she served in 2003 and 2004. “I feel a lot safer, to be sure. It’s about time.”\n\nGet Fast Forward in your inbox: Forget yesterday's news. Get what you need today in this early-morning email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nFor White, who suffered a traumatic brain injury in Iraq, the United States remains vulnerable to terrorists — even though no one from the seven countries listed in Trump’s order has carried out a fatal terror attack on American soil since before Sept. 11, 2001.\n\nStill, she said, the order adds another layer of needed security against would-be terrorists, a concern that resonated with William Brbovic, a 34-year-old Marine veteran from Chicopee whose grandfather was a Muslim from Yugoslavia.\n\n“They would be friends with us one day, kill us the next, and then be friends with us again,” Brbovic said of some Iraqis in the restive city of Fallujah, where he was posted in 2006. “What are we getting for letting them in?”\n\nThat sense of uncertainty about who is an ally and who is the enemy was echoed by Robert Martin, a 48-year-old who served one Army tour in Iraq and two in Afghanistan and lives in veterans housing in Northampton.\n\nAdvertisement\n\n“A lot of people over there take kindness for weakness,” Martin said. “They’ll wave at you. They’ll smile at you. They’ll take everything you bring in, and then when you leave, you get blown up. I’ve seen it happen.”\n\nMost of the dozen veterans interviewed by the Globe said the United States needs better vetting of refugees and citizens from the countries Trump singled out — Iraq, Iran, Syria, Yemen, Libya, Sudan, and Somalia.\n\nTrump’s order, signed Friday, suspends the admission of all refugees to the United States for 120 days and bars any citizen from six of the Muslim-majority countries for 90 days pending a review of screening procedures. Refugees from Syria have been barred indefinitely.\n\nSupport among veterans appears to reflect their preferences at the polls, where 60 percent voted for Trump, compared with 34 percent for Hillary Clinton, according to CNN exit polls.\n\nSome veterans, however, are outspoken opponents of Trump’s approach.\n\nAdvertisement\n\nTo Andrew Bacevich, a retired Army colonel who teaches at Boston University, the travel ban sends a “wrong-headed” message to an important ally whose soldiers continue to fight alongside Americans in the grinding effort to defeat ISIS extremists.\n\n“I would hope that Iraqis who have helped us would not see President Trump’s action as reflecting the attitude of Americans in general,” said Bacevich, whose son, Andrew Jr., an Army officer, was killed in Iraq in 2007.\n\n“I can understand that they might. It has to be a slap in their face,” Bacevich added. “It’s more than disloyalty. It’s extreme disgratitude for people who put their lives on the line for the United States.”\n\nBrian Willette, a 51-year-old Army National Guard veteran from South Hadley who was wounded in Afghanistan, said he sympathizes with those Iraqis who aided US forces and wish to move to the United States.\n\n“They put our lives in their hands helping us,” said Willette, who is commander of the Western Massachusetts chapter of the Military Order of the Purple Heart. “Everybody knows what the other guy is doing over there.”\n\nA State Department official said Wednesday that no Iraqi holding a Special Immigrant Visa — issued to interpreters and others who helped the US military or government — will be denied entrance to the United States.\n\nIn addition, the official said that US embassies and consulates will continue to process and issue those visas to qualified applicants, many of whom are in danger.\n\nStill, Willette believes that stepping back for security’s sake is prudent in other cases.\n\n“I think we’re always right to be cautious. We’ve been cautious in the past, but I guess this was not rolled out in the best of style,” Willette said of the order, whose implementation led to chaos and confusion at several airports last weekend.\n\nJonathan Janiec, a 33-year-old veteran from Dorchester, also said he supports the 90-day review.\n\n“It’s unfair that we have to resort to these measures, but it will take some time to look at the vetting process. It can’t hurt us,” said Janiec, a former Army captain who served one tour in Iraq and two in Afghanistan.\n\n“I think we should take a long, hard look at who we’re letting in and how many we’re letting in. We ultimately have a right to control our own destiny,” Janiec said.\n\nJosh Foster, a former Army comrade of Janiec’s, works for a contractor that provides biometric services for the US government in Iraq, Afghanistan, and elsewhere. To Foster, the delay is a mere “hiccup.”\n\nAlthough biometrics — measuring unique physical traits such as facial and retinal features — are critically important in confirming someone’s identity, the data cannot verify whether biographical information such as birth date, hometown, and even a name are accurate.\n\n“We didn’t know who they are in Iraq unless we had encountered them previously,” said Foster, who is based in Fredericksburg, Va.\n\nJorge Castro, a 62-year-old Army veteran from Dorchester who served in Iraq in 2003, said patience is prudent.\n\n“You’ve got to let the system play itself out,” Castro said. “A lot of the country actually didn’t want us there. I’m think I’m lucky to be alive.”\n\nBrian MacQuarrie can be reached at brian.macquarrie@globe.com", "authors": ["Globe Staff"], "publish_date": "2017-02-02", "source": "bostonglobe", "top_words": ["veterans", "sense", "travel", "veteran", "trump", "ban", "makes", "iraq", "think", "united", "states", "trumps", "army", "order", "willette"], "summary": "They fought beside Iraqi soldiers, handed candy to Iraqi children, and depended on Iraqis to tell friend from foe.\nTo these veterans, Trump’s “America First” policies seem to be a common-sense approach to unpredictable danger — even though refugees can take years to be vetted and visitors often wait weeks and more for visas.\nI’ve seen it happen.”Most of the dozen veterans interviewed by the Globe said the United States needs better vetting of refugees and citizens from the countries Trump singled out — Iraq, Iran, Syria, Yemen, Libya, Sudan, and Somalia.\nSupport among veterans appears to reflect their preferences at the polls, where 60 percent voted for Trump, compared with 34 percent for Hillary Clinton, according to CNN exit polls.\nIt can’t hurt us,” said Janiec, a former Army captain who served one tour in Iraq and two in Afghanistan."}