{"url": "https://www.bostonglobe.com/business/2017/02/03/baker-pushes-immigrant-visas-for-mass-companies-urges-trump-reconsider-wider-ban/RNJAjjAfOZmHMAJGRLPpnL/story.html", "id": "200", "title": "Baker pushes immigrant visas for Mass. companies, urges Trump to reconsider wider ban", "text": "Governor Charlie Baker sought to protect and promote immigrants at Massachusetts businesses, asking the Trump administration on Friday to preserve a visa program widely used by tech companies and even create a new visa to attract foreign entrepreneurs.\n\nBaker made those suggestions in a six-page letter to Homeland Security Secretary John F. Kelly, in which he urged the administration to abandon its controversial restrictions, saying measures to confront security threats must not block the economic benefits immigrants bring to Massachusetts and the United States.\n\nIn addition to a broad defense of immigrants, Baker specifically cited several measures important to local companies. For example, the White House has signaled it will conduct a deep review of H1-B visas, which Trump has derided as a source of cheap foreign labor that displaces American workers.\n\nAdvertisement\n\nTech and biotech companies in Massachusetts especially use the H1-B program to hire highly skilled foreign workers, and Baker said it is among several visas that are “valuable tools that should be maintained to support the many American companies who abide by their rules.” However, the governor said he would support a crackdown on companies that game skilled-worker visa programs to undercut American wages.\n\nGet Talking Points in your inbox: An afternoon recap of the day’s most important business news, delivered weekdays. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nAnd Baker suggested a new visa program to encourage immigration of entrepreneurs “whose admission to the United States will spur our economy by creating new jobs and industries,” adding those visas can be renewed “only if the business hits specific job creation or revenue benchmarks.”\n\nBaker, a Republican, has also supported Democratic state Attorney General Maura Healey’s lawsuit challenging the Trump administration’s Jan. 27 executive order, which suspended refugee resettlements from any country and legal immigration from seven majority-Muslim countries. On Friday, a federal judge in Boston refused to extend a restraining order blocking implementation of the ban, while a judge in Seattle did the opposite, halting enforcement of it.\n\nThe White House has argued the ban is necessary to prevent terrorists from entering the United States. But Baker said the country should instead focus on “illegal immigration and inadequate border security. These are real problems.”\n\nHis letter echoed arguments made by several Massachusetts employers who are supporting Healey’s lawsuit, saying Trump’s order hurts their ability to hire new employees, work with international partners, and market overseas.\n\nAdvertisement\n\nTripAdvisor Inc. of Needham has at least four Massachusetts workers who are essentially stuck in the United States, unable to travel for fear they cannot return, the company said in court documents. Another, a foreign national who works in Canada, had to skip a weeklong strategy session at company headquarters because of the restrictions. The company did not identify the nationalities of those employees.\n\nTripAdvisor also said it recently lost two promising job candidates because of worries they wouldn’t be able to work in the United States.\n\nThe Broad Institute, a Harvard and MIT initiative that researches cures for diseases, said in a court filing supporting Healey’s suit that at least eight of its scientists are from the countries listed in Trump’s order, and here on work visas.\n\nTwo more people about to start jobs at the Broad, and three scientists being recruited for specialized positions, may not be able to secure work visas because they are from one of the seven named countries, director Eric Lander wrote in a court filing.\n\nThere is bipartisan support for some overhaul of the H-1B program, which critics say allows companies to import employees at lower wages than American workers. The largest applicants for those visas, which are distributed by lottery, are typically outsourcing firms that provide software development and other high-tech work for companies.\n\nAdvertisement\n\nOn Friday, Baker said the federal government should use existing wage-protection rules and more stringent audits of guest-worker applicants to ensure the visas aren’t being used to push down wages.\n\nThe state’s tech and biotech companies rely on the H1-B visa program to hire highly skilled foreign workers, said the governor.\n\nBaker said the administration should work with a cross-section of officials from affected industries before implementing new immigration policies, an implicit criticism of the recent travel ban’s swift implementation.\n\nCurt Woodward can be reached at curt.woodward@globe.com . Follow him on Twitter @curtwoodward", "authors": ["Globe Staff"], "publish_date": "2017-02-03", "source": "bostonglobe", "top_words": ["immigrant", "reconsider", "mass", "trump", "companies", "pushes", "visas", "ban", "foreign", "massachusetts", "workers", "united", "work", "urges", "program", "baker", "visa", "wider"], "summary": "In addition to a broad defense of immigrants, Baker specifically cited several measures important to local companies.\nThe White House has argued the ban is necessary to prevent terrorists from entering the United States.\nTripAdvisor also said it recently lost two promising job candidates because of worries they wouldn’t be able to work in the United States.\nThe largest applicants for those visas, which are distributed by lottery, are typically outsourcing firms that provide software development and other high-tech work for companies.\nThe state’s tech and biotech companies rely on the H1-B visa program to hire highly skilled foreign workers, said the governor."}