{"url": "https://www.bostonglobe.com/news/politics/2017/02/08/harvard-square-bookstore-mocks-kellyanne-conway-bowling-green-massacre/jKlQZHhash9VBZy4KV1CQO/story.html", "id": "213", "title": "Harvard Square bookstore mocks Kellyanne Conway’s ‘Bowling Green massacre’", "text": "Kellyanne Conway prior to a forum at Harvard University's Kennedy School of Government in Cambridge.\n\nA Harvard Square bookstore is having some fun with Kellyanne Conway’s “Bowling Green massacre” gaffe.\n\nThe Harvard Book Store posted a photo on Instagram Wednesday advertising a section dedicated to “commemorating the victims of the Bowling Green Massacre.” The section was filled with books with titles like “Anit-Intellectualism in American Life,” “The Anatomy of Fascism,” and “The Plot Against America.”\n\nLast week, Conway defended President Donald Trump’s travel ban in an interview with Chris Matthews by citing the “Bowling Green Massacre” that prompted former President Obama to impose restrictions on Iraqi refugees.\n\nAdvertisement\n\nNo such massacre took place. Conway tweeted Friday morning that she meant to say “Bowling Green terrorists” during the interview, referring to the arrest of two men in Kentucky charged with plotting to send weapons and money to Al Qaeda operatives.\n\nIn the time since the interview, Conway has been mocked on social media and a satirical website dedicated to the “victims” of Bowling Green appeared online, with a donate link that directed users to the ACLU.\n\nMaterial from the Associated Press was used in this report.", "authors": ["Globe Staff"], "publish_date": "2017-02-08", "source": "bostonglobe", "top_words": ["mocks", "bowling", "harvard", "kellyanne", "bookstore", "conway", "interview", "victims", "green", "president", "massacre", "dedicated", "square", "conways"], "summary": "Kellyanne Conway prior to a forum at Harvard University's Kennedy School of Government in Cambridge.\nA Harvard Square bookstore is having some fun with Kellyanne Conway’s “Bowling Green massacre” gaffe.\nAdvertisementNo such massacre took place.\nConway tweeted Friday morning that she meant to say “Bowling Green terrorists” during the interview, referring to the arrest of two men in Kentucky charged with plotting to send weapons and money to Al Qaeda operatives.\nIn the time since the interview, Conway has been mocked on social media and a satirical website dedicated to the “victims” of Bowling Green appeared online, with a donate link that directed users to the ACLU."}