{"url": "https://www.bostonglobe.com/opinion/editorials/2017/02/05/counter-trump-act-like-act/7Aw2KSUUMnC2BIkf7gpgQN/story.html", "id": "204", "title": "To counter Trump, act like ACT UP", "text": "Members of the gay activist group ACT UP march through Times Square in New York on April 6, 1992. The activists planned civil disobedience and disruption of traffic outside presidential candidates’ headquarters, in an effort to make AIDS a campaign issue.\n\nFrom the bodega owners of New York to more than a million angry petitioners in the United Kingdom, people are quickly learning how to act up and fight back against President Trump.\n\nAmid all the rancor, confusion, and potential constitutional crises Trump has ushered in, protesters have formed a nimble, tenacious political movement that crashes gender, racial, ethnic, sexual orientation, and class lines and shows an intensity unseen in more than a generation. It reminds me of when the AIDS Coalition to Unleash Power, or ACT UP, was at its raucous peak, interrupting Mass at St. Patrick’s Cathedral, infiltrating the New York Stock Exchange, and blocking traffic on major thoroughfares with massive “die-ins.” Protesters would lay down on the ground, representing those who had died — or might still die — not just from AIDS, but because of willful inaction by Ronald Reagan’s government.\n\nThis moment demands ACT UP’s sense of outrage.\n\nAdvertisement\n\nDavid France, a filmmaker and author of “How to Survive a Plague: The Inside Story of How Citizens and Science Tamed AIDS,” attended ACT UP meetings before the New York-born group even had a name, and he watched it expand into 148 chapters in 19 countries. While participating in several anti-Trump rallies, he noted similarities between these two eras of protest.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n“In that first weekend, there was a sense of relief that seemed so familiar from the early AIDS epidemic. You were among people who understood the way you understood,” France told me Wednesday. “The development of community — that’s the first step to building a movement. The idea that you’re not alone and that people share not only your fears, but your ideas about solutions, and about process going forward — that brings you all together in an attempt to get there.”\n\nHundreds of New York bodegas owned and worked at by Yemenis were closed for much of Thursday to protest Trump’s executive order banning US entry to immigrants from seven Muslim-majority countries. Scientists are planning a March for Science in Washington in April. LGBTQ activists were scheduled to host a dance party protest Friday weaving a path from Trump’s D.C. hotel to the White House. In Britain, more than 1 million people have asked Parliament to cancel Trump’s state visit — and are planning demonstrations if and when he gets there.\n\nLast week, Trump was even forced to scuttle a visit to a Harley-Davidson factory in Wisconsin, a state that helped him win the election, after company officials expressed concerns about demonstrations. They reportedly suggested that Trump stay home, and he agreed. Barely two weeks ago, many wondered if the momentum generated by worldwide marches against the Trump administration could coalesce into a movement; now it’s changing travel plans at the White House.\n\nIn hip-hop parlance, protesters got Trump shook.\n\nAdvertisement\n\nEven if many of today’s protesters are too young to remember ACT UP, they may have cut their teeth on Occupy Wall Street and, especially, the Black Lives Matter movement. Veterans of both groups can be found among the anti-Trump protesters. Some complain that not having a central goal, such as challenging official indifference toward a pandemic, will unravel the current activism. But they have it twisted — opposing Trump and his destructive policies is the focus. That it has drawn in so many disparate groups together speaks to the urgency of the dissent. And urgency is the oxygen of a movement.\n\n“I hate to say it, because I lost so many people in that epidemic, but we might be at a bigger and more dangerous crossroads now,” said France, who also directed the Academy Award-nominated 2012 documentary “How to Survive a Plague.”\n\n“What’s at stake is our culture, the very essence of our being as a country and as a people,” he said. “What is democracy anymore? We’re asking all these really fundamental questions now. Back then, the question was, ‘Can we survive this?’ And I guess that’s the same bottom line now: ‘Can we survive this?’ ”\n\nWe’re still less than a month into this presidency, and time will gauge whether an anti-Trump movement can be sustained. Without question, protesters must prove as indefatigable as Trump’s pummeling of civil rights and liberties, and his assaults on the environment, health care, and any semblance of political decorum.\n\nWhat will give stamina to those in the streets now, and in the weeks and months to come, is the sobering knowledge that — like those early AIDS activists — they’re not just fighting against a president, but are fighting for their lives.\n\nRenee Graham can be reached at renee.graham@globe.com . Follow her on Twitter @reneeygraham.", "authors": ["Globe Columnist"], "publish_date": "2017-02-05", "source": "bostonglobe", "top_words": ["aids", "trump", "movement", "political", "france", "act", "survive", "trumps", "counter", "protesters", "york"], "summary": "Members of the gay activist group ACT UP march through Times Square in New York on April 6, 1992.\nFrom the bodega owners of New York to more than a million angry petitioners in the United Kingdom, people are quickly learning how to act up and fight back against President Trump.\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment.\nIn hip-hop parlance, protesters got Trump shook.\nBut they have it twisted — opposing Trump and his destructive policies is the focus."}