{"url": "https://www.bostonglobe.com/opinion/columns/2017/02/03/students-must-fight-anti-immigrant-sentiment/HwZ0u3rv0cBuX0JUFbo2eI/story.html", "id": "216", "title": "Students must fight anti-immigrant sentiment", "text": "Welcome signs were prepared at Logan Airport Terminal E on Feb. 3 for arriving refugees and immigrants who were previously not allowed to fly to Boston.\n\nMark Twain once said “history doesn’t repeat itself, but it does rhyme.” My US history teacher often repeats the quote, warning his class of high school juniors to look closely at the world and recognize echoes of the past.\n\nIn the same course, I took notes on the Chinese Exclusion Act of 1882. When I first saw the venomous anti-Chinese propaganda, I was appalled, and genuinely shocked that anyone could have identified and associated with such hateful sentiment. The same year, Franklin Delano Roosevelt was born, who would later write Executive Order 9066 ordering the incarceration of over 100,000 Japanese-Americans after the attack on Pearl Harbor.\n\nI’ve taken notes on these subjects time and again; I’ve been taught and tested on the racism and ignorant prejudices of the past. Inherent to each discussion and quiz was the comfort that we were looking back on obsolete missteps from the perspective of a more enlightened society, an assumption that was too obvious to need articulating.\n\nAdvertisement\n\nBut are these themes safely in the past? President Trump found his way into the Oval Office pushing for a “total and complete shutdown of Muslims entering the United States” and has now placed heavy restrictions on immigration from Muslim-majority countries. If that doesn’t rhyme with “Exclusion Act” or “Internment Camp,” what does?\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nWith the clarity of hindsight, it is easy to see through the logic of America’s leaders in the past. In 1942, the director of the War Relocation Authority said that they “knew that some among [the Japanese-Americans] were potentially dangerous” and determined that “all Japanese within the coastal areas should move inland.” His detached words described a simple precaution, not the disruptive displacement of thousands of innocent Americans that followed. The intensity of the racism that dwarfed any rational anxieties. Today, some supporters of Trump will exasperatedly tell you that the ban is not about Islam but securing the country’s borders from terrorism. They will not hear the unmistakable historical rhyme, nor anticipate where it might lead.\n\nThe US ban on Chinese immigration was not repealed until 1943, after being in place for 61 years, due to our World War II alliances. For just over a quarter of this nation’s existence, this melting pot of immigrants did not allow people from China to legally enter its borders.\n\nToday, it is not enough for us to read our textbooks and condemn the misguided bigotry of the past. My peers and I have to look up and look around. There will always be fear and paranoia, but shipping innocent immigrants back to dangerous war zones they barely escaped matches the misguidedness of our history’s mistakes.\n\nIf “Protecting the Nation from Foreign Terrorist Entry into the United States” is the latest line in our country’s stanza of racist scapegoating, the US must understand the importance in breaking the pattern.\n\nAdvertisement\n\nWhen future high schoolers look back on this chapter of history, I hope they see that we valued humanity over vague fears of insecurity. Students can play a role by being more vocal, seeking to convince our elected officials and those around us that it is not acceptable for the themes we have read about in our textbooks to taint our modern world. This is the time to prove that we care more about individuals than debasing stereotypes and will not let ugly preconceptions destroy more lives.\n\nThankfully, this troubling history is only one side of the story of America that we learn in class. As a country of immigrants, there are other rhymes that we can choose to build on. Poetry that has inspired and guided generations. As Langston Hughes wrote:\n\n“Let America be the dream the dreamers dreamed--\n\nLet it be that great strong land of love\n\nWhere never kings connive nor tyrants scheme\n\nThat any man be crushed by one above.”\n\n- Langston Hughes\n\nJason Altshuler is a junior at Brookline High School and a student journalist on the Sagamore", "authors": ["Jason Altshuler"], "publish_date": "2017-02-03", "source": "bostonglobe", "top_words": ["high", "world", "trump", "fight", "immigrants", "sentiment", "rhyme", "united", "antiimmigrant", "history", "war", "students", "look", "past"], "summary": "When I first saw the venomous anti-Chinese propaganda, I was appalled, and genuinely shocked that anyone could have identified and associated with such hateful sentiment.\nI’ve taken notes on these subjects time and again; I’ve been taught and tested on the racism and ignorant prejudices of the past.\nThe US ban on Chinese immigration was not repealed until 1943, after being in place for 61 years, due to our World War II alliances.\nToday, it is not enough for us to read our textbooks and condemn the misguided bigotry of the past.\nAdvertisementWhen future high schoolers look back on this chapter of history, I hope they see that we valued humanity over vague fears of insecurity."}