{"url": "https://www.bostonglobe.com/news/politics/2017/06/19/trump-silence-london-attack-against-muslims-adds-pattern-critics-say/2Fo4z3ApvjPbptOpv8wMII/story.html", "id": "215", "title": "Trump silence on London attack against Muslims adds to pattern, critics say", "text": "WASHINGTON — President Trump on Monday continued an apparent pattern of selectively commenting on hate crimes and terrorist attacks, leading White House critics to accuse him of failing to personally condemn violence carried out by non-Muslims.\n\nNearly 14 hours after a driver plowed through Muslim worshippers outside of a London mosque, killing at least one, Trump’s usually noisy personal Twitter account was uncharacteristically silent. White House press secretary Sean Spicer said in an off-camera press briefing that the administration’s “thoughts and prayers” were with those affected, but Trump personally had not weighed in using any format.\n\nTrump, as president, has repeatedly promised to heal cross-racial divisions, but his slow reaction to violence against minorities or hate-related violence not perpetrated by Muslims is drawing scorn.\n\nAdvertisement\n\n“If it was about terrorism, you would recognize these incidents regardless of who does it,” said Carol Anderson, a scholar of race and social justice at Emory University, in an interview Monday. “But this is situational. This situational concern underlies everything in this administration.”\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n“So when acts of terror are committed by Muslims, @POTUS can’t wait to tweet. When they are committed AGAINST Muslims, nothing,” David Axelrod, a former advisor to President Obama, said in a tweet on Monday.\n\nSince the president uses Twitter to frequently comment on the day’s headlines, there is a greater expectation that he — unlike past presidents — will be an active part of the commentary in every news cycle.\n\nSince he announced his presidential candidacy in 2015, Trump has used his social media accounts to denounce Muslim-perpetrated terrorist attacks in Britain, Turkey, Germany, and even Sweden. But as president, stateside violence that targets minority communities sometimes goes unnoticed.\n\nIt took the White House nearly a week to acknowledge the hate-driven shooting at a Kansas bar, where a man targeted two-Indian born engineers and a bystander. Trump faced criticism in April for his personal silence after a school shooting at North Park Elementary School in San Bernardino, which left a black woman dead. In March, Spicer refused to specifically condemn the slaying of a New York City man who was allegedly killed by a man who told police he is a white supremacist.\n\nAdvertisement\n\n“I don’t know all the details and I don’t want to reference any specific case,” Spicer said when asked about the subject.\n\nIn the most high-profile example, Trump waited nearly three days to acknowledge the murder of two men, allegedly at the hand of a white supremacist, in Portland, Ore., which led to a rash of frustrated newspaper editorials.\n\nFormer CBS journalist Dan Rather penned an open letter to Trump, asking him to personally denounce the violence.\n\n“Perhaps Portland, Oregon, is off your radar. It is, after all, a rather liberal place. It’s even a ‘sanctuary city.’ But it is still an American city. And you are its president,” Rather wrote. “Two Americans have died leaving family and friends behind. They are mourned by millions more who are also deeply worried about what might come next. I hope you can find it worthy of your time to take notice.”\n\nA day later, Trump called the Portland incident “unacceptable” from his @POTUS account.\n\nAdvertisement\n\n“The victims were standing up to hate and intolerance. Our prayers are w/ them,” Trump said.\n\nBetween the time of the incident and that statement, Trump had tweeted 21 times on his favored personal @realDonaldTrump account, on an assortment of issues such as anonymous sources in news media and a special election in Montana.\n\n“Whenever you see the words ‘sources say’ in the fake news media, and they don’t mention names . . .” read one tweet, posted May 28.\n\nThere have been times when Trump has acknowledged violence perpetrated against minority communities. As a candidate, Trump responded quickly when South Carolina, an important primary state in the presidential election, experienced the shocking killing of nine black churchgoers by a white supremacist.\n\n“The tragedy in South Carolina is incomprehensible.” he tweeted. “My deepest condolences to all.”\n\nCritics have remarked on the speed and ferocity by which Trump comments on crimes committed by Muslims. Earlier this month, he quickly chimed in on the twin terror attacks in Borough Market and on London Bridge, which he used to justify his proposed travel ban of Muslim-majority countries.\n\n“We must stop being politically correct and get down to the business of security for our people. If we don’t get smart it will only get worse,” Trump said.\n\nAnderson, the professor, said the contrast speaks for itself.\n\n“Think of how quickly [Trump] went after the mayor of London,” she said. “But then absolute silence when a white man gets into a van, goes to a mosque — a house of worship — and drives his van into people who were worshipping.”\n\nOne person who has used their Twitter account to condemn anti-Muslim violence is Trump’s daughter Ivanka, who is a special adviser to the president. On Sunday evening in the hours after the most recent London attack, she tweeted, “We must stand united against hatred and extremism in all it’s ugly forms.”\n\nOne person responded, “Tell your father. His selective silence is deafening.”\n\nCorrection: An earlier version of this story incorrectly categorized the stabbings in Portland, Ore.\n\nAstead W. Herndon can be reached at astead.herndon@globe.com . Follow him on Twitter @AsteadWH", "authors": ["Astead W. Herndon", "Globe Staff"], "publish_date": "2017-06-19", "source": "bostonglobe", "top_words": ["pattern", "attack", "portland", "trump", "silence", "adds", "man", "twitter", "house", "president", "london", "violence", "white", "muslims", "critics", "say"], "summary": "WASHINGTON — President Trump on Monday continued an apparent pattern of selectively commenting on hate crimes and terrorist attacks, leading White House critics to accuse him of failing to personally condemn violence carried out by non-Muslims.\nTrump, as president, has repeatedly promised to heal cross-racial divisions, but his slow reaction to violence against minorities or hate-related violence not perpetrated by Muslims is drawing scorn.\nWhen they are committed AGAINST Muslims, nothing,” David Axelrod, a former advisor to President Obama, said in a tweet on Monday.\nIt took the White House nearly a week to acknowledge the hate-driven shooting at a Kansas bar, where a man targeted two-Indian born engineers and a bystander.\n“My deepest condolences to all.”Critics have remarked on the speed and ferocity by which Trump comments on crimes committed by Muslims."}