{"url": "https://www.bostonglobe.com/opinion/2017/08/07/earning-points-under-trump-immigration-plan/oMyGnHVUdSqWAofUfO1apI/story.html", "id": "218", "title": "Earning points under Trump’s immigration plan", "text": "While President Trump is on his “not a vacation” in New Jersey, perhaps he is fine-tuning a questionnaire that will form the centerpiece of his administration’s new green-card policy, one that assigns a point value to a prospective immigrant’s job skills and other attributes. One imagines that Trump will administer the test at one of his rally-style events, where he’ll read the questions aloud to crowds of would-be Americans:\n\n[Trump enters, pumps fists, claps, points.] “USA! USA! Thank you! Thank you! What a crowd! There must be, what, 300 million people here? Listen to this applause. Are you hearing this? Let them all in. USA! USA!\n\n“OK, we have to get started here. I have to read this quiz. It’s an excellent quiz, by the way. My lovely daughter Ivanka worked on it. Come here, Ivanka. Isn’t she beautiful? If you’re lucky, and you make it into this country, maybe you’ll meet an Ivanka. But probably not.\n\nAdvertisement\n\n“OK, OK. Please answer as close to truthfully as possible and add up your scores below. If you’re having trouble with the math, we have Treasury Secretary Mnuchin to help you out. ‘Secretary Munchkin,’ I like to call him. You don’t know what that is because you come from countries where they don’t play ‘The Wizard of Oz,’ but you’ll see. It’s a tremendous movie about real estate, about a house that falls on a witch. I can think of a witch I’d like a house to fall on. USA! USA!\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n“You’re a terrific crowd, by the way. I wish I could let all of you in. And really, I could, technically, let you all in if I wanted. I could. So be nice. OK. Here we go. Write down your scores if you have the following:\n\n“A low golf handicap? 100 points. A physical handicap? Minus 100 points. Blonde hair? 150 points. No sweetheart. You don’t have blonde hair. I’m talking really light, really straight blonde hair, like Kayleigh McEnany’s. You know her? Terrific gal, she’s anchoring ‘Trump TV.’\n\n“Are you compassionate? Subtract 60 points. You know who’s compassionate? Nice guys. And we know where they finish, right? Last. Exactly. Who said that? Applaud that. [He claps.] We should just let him in. He looks OK. What’s your name? What? I can’t pronounce that. What about Toby? You like that name? If you get in, we’re going to call you Toby. Believe me, life will be much easier for you as Toby.\n\n“Where was I? Are you a snazzy dresser? 100 points. Can you dance to ‘Despacito’? 500 points. In heels? Lemme see those. Oh, those are heels. Look at that. If you can wear heels like that, if you’re female, you get 300 points; men, minus 300 points. We don’t need any more of those here.\n\nAdvertisement\n\n“Do friends say you look terrific in a shiny sash? I mean really, really terrific? 1,000 points. Are you a . . . what’s this word? I can’t read my own writing. I’ll sound it out. Are you a vo-ra-cious reader? Minus 200 points.\n\n“OK, are you: Tall? 1,000 points. Buxom? 500 points? Tall and Buxom? Lucky him! Who is that? Is that your boyfriend? Are you willing to relocate to Washington? Like, now? I’ll send a car.\n\n“Are you unattractive? It’s a brutal, brutal world. Intellectually curious? Enjoy France. Fluent in many languages? Nobody likes a show-off. Are you willing to sacrifice for your neighbor or the good of the community? Minus 500 points.\n\n“Do you hope to work as a journalist? Let yourself out. A librarian? Speak up, I can’t hear you. Just kidding. Get a ride home with the journalist. A teacher? Those other two probably have a Prius, but maybe you can squeeze in.\n\n“OK. That’s it. I can still get in nine holes. We’ll pick this up later. And, incidentally, if any of you have experience in politics, I may need another running mate. Stay tuned.”\n\nDebra A. Klein is a writer in San Francisco. Follow her on Twitter @IWishIHadTyped", "authors": ["Debra A. Klein"], "publish_date": "2017-08-07", "source": "bostonglobe", "top_words": ["trump", "minus", "terrific", "immigration", "dont", "plan", "know", "points", "youre", "trumps", "earning", "usa", "really", "let"], "summary": "You don’t know what that is because you come from countries where they don’t play ‘The Wizard of Oz,’ but you’ll see.\nMinus 100 points.\nIf you can wear heels like that, if you’re female, you get 300 points; men, minus 300 points.\nI mean really, really terrific?\nMinus 200 points."}