{"url": "https://www.bostonglobe.com/business/2017/03/14/study-lyft-has-gained-uber-but-still-has-long-way/t4sFU2xzn71vmf5CkHeiOK/story.html", "id": "206", "title": "Study: Lyft has gained on Uber (but still has a long way to go)", "text": "Uber’s recent stumbles could be giving Lyft a chance to gain ground in the ride-hailing market as customers shift allegiance, new market data suggest.\n\nThe study comes as Uber has been dealing with a run of bad news.\n\nLyft’s customer base has grown by 7 percent just since Jan. 29, when Lyft attempted to capitalize on controversy over the Trump administration’s executive order temporarily halting immigration from certain countries, according to 1010data, a New York City-based market research firm.\n\nAdvertisement\n\n1010data says the shift in customer allegiance coincides with a decision by Lyft to donate $1 million to the American Civil Liberties Union (ACLU) over four years to fight the travel ban. The ACLU has vowed to fight Trump’s travel ban affecting immigrants from several Muslim-majority countries and refugees.\n\nGet Talking Points in your inbox: An afternoon recap of the day’s most important business news, delivered weekdays. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nAbout the same time, as the order went into effect, Uber was seen as trying to undermine a protest against the same executive order by New York City cabdrivers - a charge the San Francisco-based company denied.\n\nIn fact, it didn’t seem to matter that Uber later said it had turned off surge pricing near the site of the protest to avoid profiting from it. It didn’t help that Uber co-founder and chief executive Travis Kalanick was among Trump’s business advisers, even though Lyft has ties to investor Peter Thiel, another Trump ally.\n\nIt’s not clear whether this is just a temporary blip. The data analytics company notes that although Lyft is growing at a faster rate, Uber remains the ride-hailing giant by having arranged about 86 percent of all app-based rides since 2014.\n\nStill, the firm’s data put numbers on the power of politics to influence a sales pitch - or show, at least, that the company knows who its audience is.\n\nAdvertisement\n\n1010data said in a statement that its data are sifted from ‘‘a number of sources of consumer spending data representing millions of consumers’’ in online and offline retail markets.\n\nGabrielle Jasinski, a spokeswoman for 1010data, says the study was not commissioned by either ride-hailing company and that 1010data has no affiliation with either company.", "authors": ["Fredrick Kunkle", "The Washington Post"], "publish_date": "2017-03-14", "source": "bostonglobe", "top_words": ["long", "gained", "executive", "lyft", "ridehailing", "order", "market", "company", "uber", "data", "study", "york", "1010data", "way"], "summary": "Uber’s recent stumbles could be giving Lyft a chance to gain ground in the ride-hailing market as customers shift allegiance, new market data suggest.\nThe study comes as Uber has been dealing with a run of bad news.\nIt didn’t help that Uber co-founder and chief executive Travis Kalanick was among Trump’s business advisers, even though Lyft has ties to investor Peter Thiel, another Trump ally.\nThe data analytics company notes that although Lyft is growing at a faster rate, Uber remains the ride-hailing giant by having arranged about 86 percent of all app-based rides since 2014.\nGabrielle Jasinski, a spokeswoman for 1010data, says the study was not commissioned by either ride-hailing company and that 1010data has no affiliation with either company."}