{"url": "https://www.bostonglobe.com/magazine/2017/03/15/trump-travel-ban-wouldn-work-anyway-but-this-would/TtD8Kwf661ZGD0Lei7l64L/story.html", "id": "3", "title": "Trump’s travel ban wouldn’t work anyway. But this would.", "text": "In this time of alternative facts, consider an alternative path President Trump might have chosen for cracking down on immigration, one that would have delivered the poll-obsessed president a reality far more to his liking.\n\nThe Trump administration’s initial travel ban — which ensnared legal green card holders and targeted seven Muslim- majority countries whose citizens have demonstrably not been the source of our terrorism problems here — was a mess. The new ban (which a federal judge in Hawaii put on hold on Wednesday) isn’t a whole lot better. Rather than completely rethink the policy after the courts rejected it, the Trump team merely tinkered with it, such as removing Iraq from the list of covered countries. The smarter approach would be to focus on deporting people who have already proved themselves dangerous criminals. And the good news is we already know who they are.\n\nTrump bragged after the election that he was going to deport up to 3 million criminal undocumented immigrants. To experts like Boston College Law School professor Daniel Kanstroom, Trump’s boast was preposterously high, at least if “criminal” means a violent or dangerous offender. That’s largely because President Obama, a man Trump accused of being soft on immigration, actually presided over a massive deportation of undocumented immigrants with criminal records. Kanstroom had criticized Obama for being too aggressive, since the criminal offenses of many people who were kicked out were minor, such as traffic violations. For others, their only criminal offense was immigration-related. Crossing the border illegally is a misdemeanor, but crossing again after having been deported is a felony.\n\nAdvertisement\n\nWhile it seems unlikely that the number of actual dangerous criminal immigrants is anywhere near 3 million, or even 1 million, the truth is we don’t know because immigration arrests are secret. However, the number is not zero.\n\nGet Today's Headlines in your inbox: The day's top stories delivered every morning. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nReaders of the Globe know this thanks to the dogged work of my former colleague Maria Sacchetti. Her 2012 investigation was packed with cases of illegal immigrants who had been convicted here of murder, rape, or other heinous crimes, but who were then quietly released, often with no notice given to victims. Many of them went on to commit new crimes.\n\nUS officials had released these criminals because they felt they had no choice: The US Supreme Court ruled in 2001 that the government cannot imprison criminal immigrants indefinitely if their home countries refused to take them back.\n\nThe fallout could be catastrophic. Take the case of a 46-year-old New York woman named Qian Wu. She thought the undocumented immigrant from China who had been convicted of brutally attacking her was out of her life for good. Three years later, he reappeared, bashing her head with a hammer and cutting out her heart and a lung with a knife.\n\nShining a light on a shadowy system, the Globe noted that the Immigration and Customs Enforcement (ICE) agency had over four years freed thousands of immigrants convicted of heinous crimes. Many of them had been given shorter sentences in expectation of deportation that never happened. When the Department of Homeland Security refused to reveal the names of those who’d been released, the Globe went to court and eventually won.\n\nAdvertisement\n\nThe reporting drew the attention of Congress, which demanded additional figures from ICE. Last year, US Senator Chuck Grassley wrote to the FBI to express his disgust that 121 criminal undocumented immigrants released between 2010 and 2014 were subsequently charged with 135 homicides. “In addition,” the Iowa Republican wrote, “of the 36,007 criminal aliens released from ICE custody in FY 2013, 1,000 have been re-convicted of additional crimes.”\n\nBut which countries were the biggest offenders in refusing to take back these criminals? They’re actually nowhere to be found on Trump’s travel ban.\n\nConsider Vietnam. Between 2012 and early 2016, the United States released 1,564 criminal immigrants after Vietnam wouldn’t take them back. That’s more than double the combined total from all seven Muslim-majority countries covered by Trump’s initial ban. If you take the total from those seven Muslim nations and combine it with the number from Trump’s other bogeyman, Mexico, it’s roughly comparable to the 1,121 released felons just from Laos. Cuba was the jackpot, refusing during that period to take back 4,550 criminals who were later released onto US streets.\n\nAnd Syria? In that same period, the US government released exactly eight Syrians because their home country would not take them back. That figure, incidentally, is less than many countries the Trump administration seems to view as friends, from Israel (17) to the United Kingdom (23) to Vladimir Putin’s Russia (55). The dirty little secret about dangerous immigrant criminals is that sometimes our friends are as unhelpful as our enemies.\n\nNow imagine that, instead of fear-mongering, Trump and his team had simply taken the list of released immigrants that the Globe went to court to get and started rounding up every violent felon on it. The administration could have then put the screws to all their home countries — friend and foe alike — holding up the papers their diplomats need to enter the United States until they changed their minds. (An early executive order seemed headed in this direction, before the administration turned its focus to the scapegoating travel ban.) I bet most of these nations would have responded to the pressure — amplified by a certain verified Twitter account — and agreed to take back their criminal nationals. Surely, the president’s poll numbers would have surged north. Trump might even have added to the pressure by getting Congress to let him use Guantanamo Bay to hold the worst offenders until their home countries came around.\n\nAdvertisement\n\nJuliette Kayyem, a senior Homeland Security official under Obama who now teaches at Harvard’s Kennedy School, says it’s important for pro-immigrant groups to admit that there are some dangerous felons who need to be removed. But she argues that Trump’s approach — which fails to distinguish between violent immigrants and immigrants who pose no threat to others — will only make this country less safe. With limited government resources and a new, understandable reluctance by peaceful immigrants to help law enforcement find the bad actors hiding in their communities, Kayyem says that “what you’re actually going to see is the pool of violent criminals here will expand.”\n\nIf that happens, the president will have a lot more than poll numbers to worry about.\n\nNeil Swidey is a Globe Magazine staff writer. Send comments to swidey@globe.com and follow him on Twitter @neilswidey", "authors": [], "publish_date": "2017-03-15", "source": "bostonglobe", "top_words": ["travel", "trump", "ban", "immigrants", "criminal", "wouldnt", "criminals", "work", "trumps", "countries", "dangerous", "globe", "violent", "released"], "summary": "The smarter approach would be to focus on deporting people who have already proved themselves dangerous criminals.\nAdvertisementWhile it seems unlikely that the number of actual dangerous criminal immigrants is anywhere near 3 million, or even 1 million, the truth is we don’t know because immigration arrests are secret.\nBetween 2012 and early 2016, the United States released 1,564 criminal immigrants after Vietnam wouldn’t take them back.\nThat’s more than double the combined total from all seven Muslim-majority countries covered by Trump’s initial ban.\nBut she argues that Trump’s approach — which fails to distinguish between violent immigrants and immigrants who pose no threat to others — will only make this country less safe."}