{"url": "https://www.bostonglobe.com/news/nation/2017/09/22/trump-travel-ban-replaced-restrictions-tailored-certain-countries/8HkuAillmONf278bDrcocK/story.html", "id": "39", "title": "Trump’s travel ban to be replaced by restrictions tailored to certain countries", "text": "WASHINGTON — President Trump’s ban on travelers from six majority-Muslim countries is set to be replaced as soon as this weekend with more targeted restrictions on visits to the United States that would vary by country, officials familiar with the plans said Friday.\n\nThe new restrictions, aimed at preventing security threats from entering the United States, could go into effect Sunday after the conclusion of a 90-day policy review undertaken as part of the administration’s original travel ban.\n\nThough the restrictions would differ for each country, people living in the targeted nations could be prevented from traveling to the United States or could face increased scrutiny as they seek to obtain a visa.\n\nAdvertisement\n\nAs part of the review, administration officials said that the Department of Homeland Security initially identified more than six nations that were failing to comply with security standards that could block terrorists from entering the United States.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nOfficials notified the governments in those nations that travel to the United States could be severely restricted if they did not increase those standards. It was not clear which countries would be targeted under the new restrictions or exactly how many would be affected.\n\nIn the end, officials said that some of those countries added measures to improve security for passports and to better identify potential terrorist threats. Those countries will not be included in the new restrictions, said the officials, who would not be named describing the policy before its announcement.\n\nOfficials did not say how many countries — and which countries — might be affected, insisting the president had yet to make a final decision on how to proceed.\n\nA spokesman from the Department of Homeland Security declined to discuss specifics of the agency’s recommendation to the White House, which was delivered in recent days and first reported by The Wall Street Journal.\n\nAdvertisement\n\n“The Trump administration will ensure that the people who travel to the United States are properly vetted and those that don’t belong here aren’t allowed to enter,” said Jonathan Hoffman, assistant secretary for public affairs at the department.\n\nTrump must still approve the new plan, but it appears to be similar to the kind the president tweeted about a week ago.\n\n“The travel ban into the United States should be far larger, tougher, and more specific,” Trump wrote after a crude bomb exploded on a London Underground train on Sept. 15.\n\nTrump’s original ban blocked all travel to the United States by refugees as well as nationals of seven countries: Iraq, Iran, Libya, Somalia, Sudan, Syria, and Yemen. Iraq was later deemed to have improved its screening of potential travelers and was taken off the banned list.\n\nThe ban — put in place just days after the president’s inauguration and without advance notice — caused chaos at airports around the country and prompted a torrent of criticism from immigrant rights activists, lawmakers in both parties, business executives, academic leaders, and diplomats from around the world.\n\nAdvertisement\n\nA furious legal assault on the president’s travel ban delayed its implementation for months, as federal judges agreed with immigrant rights groups that the original ban unconstitutionally targeted a particular religion or exceeded the president’s statutory authority to block immigration.\n\n‘The administration will ensure that the people who travel to the United States are properly vetted and those that don’t belong here aren’t allowed to enter.’\n\nIn June, the Supreme Court allowed the travel ban to take effect, with some significant restrictions, while the justices consider the merits of the case.\n\nThe changes to be announced this weekend could have a profound impact on the court case, complicating the review by the justices and potentially making parts of the case moot even before the oral arguments, which are scheduled for Oct. 10.\n\nThe original travel ban included restrictions on the entry into the United States of refugees from around the world. The new rules do not appear to alter the limits on refugees, leaving that question open for the Supreme Court to decide.\n\nThe justices are likely to seek new input from lawyers for the government and for the groups challenging the travel ban before arguments begin.\n\nTrump and his national security officials have argued from the beginning that the travel ban was intended to give the government time to ensure that terrorists are not able to enter the United States using travel documents for people on vacation or seeking temporary employment.\n\nCritics accused the administration of basing threat assessments of travelers solely on the religion of the majority of people who lived in the nations identified by the executive order.\n\nH.R. McMaster, Trump’s national security adviser, said Sunday that the president was weighing new restrictions in an effort to keep the American people safe.\n\n‘‘Well, this is something that we’re looking at, is how to protect the American people better, how to ensure that we know who these people are who are moving,’’ he said in an interview with ABC.\n\nIf ‘‘you can’t screen people effectively to know who’s coming into your country, then you shouldn’t allow people from that country to travel,’’ he said.", "authors": ["Michael D. Shear", "New York Times"], "publish_date": "2017-09-22", "source": "bostonglobe", "top_words": ["travel", "restrictions", "replaced", "ban", "targeted", "security", "officials", "united", "trumps", "countries", "country", "states", "certain", "tailored"], "summary": "It was not clear which countries would be targeted under the new restrictions or exactly how many would be affected.\n“The travel ban into the United States should be far larger, tougher, and more specific,” Trump wrote after a crude bomb exploded on a London Underground train on Sept. 15.\nTrump’s original ban blocked all travel to the United States by refugees as well as nationals of seven countries: Iraq, Iran, Libya, Somalia, Sudan, Syria, and Yemen.\nThe original travel ban included restrictions on the entry into the United States of refugees from around the world.\nThe justices are likely to seek new input from lawyers for the government and for the groups challenging the travel ban before arguments begin."}