{"url": "https://www.bostonglobe.com/news/politics/2017/07/14/trump-takes-travel-ban-dispute-supreme-court-again/JWnm0RRUhHutAjC2zM6w5J/story.html", "id": "43", "title": "Trump Takes Travel Ban Dispute to U.S. Supreme Court Again (1)", "text": "U.S President Donald Trump attends a press conference with French President Emmanuel Macron at the Elysee Palace in Paris.\n\nThe Trump administration is seeking to close a legal window opened for tens of thousands of refugees to enter the United States, appealing a federal judge’s order directly to the Supreme Court.\n\nU.S. District Judge Derrick Watson had ordered the government to allow in refugees formally working with a resettlement agency in the United States. His order also vastly expanded the list of U.S. family relationships that refugees and visitors from six Muslim-majority countries can use to get into the country, including grandparents and grandchildren.\n\nIn its appeal Friday night, the Justice Department said Watson’s interpretation of the Supreme Court’s ruling on what family relationships qualify refugees and visitors from the six Muslim-majority countries to enter the U.S. ‘‘empties the court’s decision of meaning, as it encompasses not just ‘close’ family members, but virtually all family members. Treating all of these relationships as ‘close familial relationship(s)’ reads the term ‘close’ out of the Court’s decision.’’\n\nAdvertisement\n\nOnly the Supreme Court can decide these issues surrounding the travel ban, the Justice Department said. ‘‘Only this Court can definitively settle whether the government’s reasonable implementation is consistent with this Court’s stay,’’ it said.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe long, tangled legal fight is expected to culminate with arguments before the nation’s high court in October.\n\nWatson’s ruling could help more than 24,000 refugees already vetted and approved by the United States but barred by the 120-day freeze on refugee admissions, said Becca Heller, director of the International Refugee Assistance Project, a resettlement agency.\n\n‘‘Many of them had already sold all of their belongings to start their new lives in safety,’’ she said. ‘‘This decision gives back hope to so many who would otherwise be stranded indefinitely.’’\n\nCiting a need to review its vetting process to ensure national security, the administration capped refugee admissions at 50,000 for the 12-month period ending Sept. 30, a ceiling it hit this week.\n\nAdvertisement\n\nThe federal budget can accommodate up to 75,000 refugees, but admissions have slowed under Trump, and the government could hold them to a trickle, resettlement agencies say.\n\n‘‘Absolutely this is good news for refugees, but there’s a lot of uncertainty,’’ said Melanie Nezer, spokeswoman for HIAS, a resettlement agency. ‘‘It’s really going to depend on how the administration reacts to this.’’\n\nAttorney General Jeff Sessions had said the administration would ask the Supreme Court to weigh in, bypassing the San Francisco-based 9th U.S Circuit Court of Appeals, which has ruled against it in the case.\n\nThe Supreme Court allowed a scaled-back version of the travel ban to take effect last month.\n\n‘‘Once again, we are faced with a situation in which a single federal district court has undertaken by a nationwide injunction to micromanage decisions of the co-equal executive branch related to our national security,’’ Sessions said. ‘‘By this decision, the district court has improperly substituted its policy preferences for the national security judgments of the executive branch in a time of grave threats.’’\n\nAdvertisement\n\nThe administration took a first step by filing a notice of appeal to the 9th Circuit, allowing it to use a rule to petition the high court directly. There was no timetable for the Supreme Court to act, but the administration sought quick action to clarify the court’s June opinion.\n\nThe justices now are scattered during their summer recess, so any short-term action would come in written filings.\n\nThe administration has lost most legal challenges on the travel ban, which applies to citizens of Syria, Sudan, Somalia, Libya, Iran and Yemen.\n\nThe Supreme Court’s ruling exempted a large swath of refugees and travelers with a ‘‘bona fide relationship’’ with a person or an entity in the U.S. The justices did not define those relationships but said they could include a close relative, a job offer or admission to a college or university.\n\nThe Trump administration defined the relationships as people who had a parent, spouse, fiance, son, daughter, son-in-law, daughter-in-law or sibling already in the U.S.\n\nWatson enlarged that group to include grandparents, grandchildren, brothers-in-law, sisters-in-law, aunts, uncles, nieces, nephews and cousins.\n\nHawaii Attorney General Douglas S. Chin, who sought the broader definition, said Thursday’s ruling ‘‘makes clear that the U.S. government may not ignore the scope of the partial travel ban as it sees fit.’’\n\n‘‘Family members have been separated and real people have suffered enough,’’ Chin said.", "authors": ["Alicia A. Caldwell", "Elliot Spagat", "Associated Press"], "publish_date": "2017-07-14", "source": "bostonglobe", "top_words": ["dispute", "ruling", "travel", "courts", "trump", "ban", "supreme", "court", "close", "relationships", "takes", "refugees", "administration"], "summary": "The Trump administration is seeking to close a legal window opened for tens of thousands of refugees to enter the United States, appealing a federal judge’s order directly to the Supreme Court.\nTreating all of these relationships as ‘close familial relationship(s)’ reads the term ‘close’ out of the Court’s decision.’’AdvertisementOnly the Supreme Court can decide these issues surrounding the travel ban, the Justice Department said.\nThe Supreme Court allowed a scaled-back version of the travel ban to take effect last month.\nThere was no timetable for the Supreme Court to act, but the administration sought quick action to clarify the court’s June opinion.\nThe Supreme Court’s ruling exempted a large swath of refugees and travelers with a ‘‘bona fide relationship’’ with a person or an entity in the U.S."}