{"url": "https://www.bostonglobe.com/news/nation/2017/09/11/kennedy-order-temporarily-leaves-place-trump-travel-ban-refugees/uobNKhVTNk5xaSm1p7IUUM/story.html", "id": "44", "title": "Kennedy’s order temporarily leaves in place Trump travel ban on refugees", "text": "WASHINGTON — Justice Anthony M. Kennedy on Monday issued a temporary order allowing the Trump administration to exclude most refugees from entering the United States while the Supreme Court considers challenges to its revised travel ban.\n\nThe administrative stay will probably be in place for only a short time, and the court is likely to issue a more considered ruling in a matter of days.\n\nHad the Supreme Court not acted, an Appeals Court ruling lifting the ban on refugees would have gone into effect Tuesday.\n\nAdvertisement\n\nThe Supreme Court has now interceded three times to fine-tune the scope of President Trump’s revised ban while it considers broader issues about its lawfulness.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nIssued in January and revised in March, the ban caused chaos at airports nationwide and gave rise to a global outcry, prompting a cascade of litigation as well.\n\nTwo federal appeals courts blocked central parts of the ban. One said it violated the Constitution because it discriminated based on religion; the other said that it exceeded the president’s statutory authority to control immigration.\n\nIn June, the Supreme Court agreed to hear appeals from those rulings and temporarily reinstated part of the ban — but only for people without “a credible claim of a bona fide relationship with a person or entity in the United States.”\n\nThe Trump administration interpreted the Supreme Court’s decision to mean excluding most refugees.\n\nAdvertisement\n\nIt also said that only some relatives of US residents — parents, children, spouses, siblings, parents-in-law, sons- and daughters-in-law, and people engaged to be married — could enter.\n\nThe administration barred other relatives, including grandparents, grandchildren, aunts, uncles, nephews, nieces, and cousins.\n\nIn July, Judge Derrick K. Watson of the US District Court in Honolulu disagreed with the administration’s interpretation of the Supreme Court’s ruling as to both refugees and relatives.", "authors": ["Adam Liptak"], "publish_date": "2017-09-11", "source": "bostonglobe", "top_words": ["leaves", "ruling", "travel", "courts", "trump", "revised", "temporarily", "place", "kennedys", "ban", "supreme", "appeals", "order", "court", "relatives", "refugees", "administration"], "summary": "WASHINGTON — Justice Anthony M. Kennedy on Monday issued a temporary order allowing the Trump administration to exclude most refugees from entering the United States while the Supreme Court considers challenges to its revised travel ban.\nHad the Supreme Court not acted, an Appeals Court ruling lifting the ban on refugees would have gone into effect Tuesday.\nAdvertisementThe Supreme Court has now interceded three times to fine-tune the scope of President Trump’s revised ban while it considers broader issues about its lawfulness.\nTwo federal appeals courts blocked central parts of the ban.\nIn July, Judge Derrick K. Watson of the US District Court in Honolulu disagreed with the administration’s interpretation of the Supreme Court’s ruling as to both refugees and relatives."}