{"url": "https://www.bostonglobe.com/news/politics/2017/09/24/trump-travel-ban-expires-sunday-new-restrictions-expected/uC6Mc58vviA43rQL3REcRN/story.html", "id": "41", "title": "Trump travel ban expires Sunday; new restrictions expected", "text": "US President Donald Trump paused to speak to the press while boarding Air Force One at Morristown Airport.\n\nWASHINGTON (AP) — President Donald Trump is expected to announce new restrictions on travel to the United States as his ban on visitors from six Muslim-majority countries expires Sunday, 90 days after it went into effect.\n\nThe Department of Homeland Security has recommended the president sign off on new, more targeted restrictions on foreign nationals from countries it says refuse to share information with the U.S. or haven’t taken necessary security precautions.\n\nTrump appeared to preview his intentions as he spoke with reporters on the tarmac of a New Jersey airport Sunday, saying: ‘‘the tougher the better.’’\n\nAdvertisement\n\nOfficials haven’t said which — or how many — countries will be affected by the new restrictions, which could take effect as soon as Sunday.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n‘‘The acting secretary has recommended actions that are tough and that are tailored, including restrictions and enhanced screening for certain countries,’’ said Miles Taylor, counselor to acting Homeland Security Secretary Elaine Duke.\n\nThe current ban bars citizens of Iran, Libya, Somalia, Sudan, Syria and Yemen who lack a ‘‘credible claim of a bona fide relationship with a person or entity in the United States’’ from entering the U.S.\n\nUnlike Trump’s first travel ban, which sparked chaos at airports across the country and a flurry of legal challenges, officials said they have been working for months on the new rules, in collaboration with various agencies and in conversation with foreign governments.\n\nThe recommendations are based on a new baseline developed by DHS that includes factors such as whether countries issue electronic passports with biometric information and share information about travelers’ terror-related and criminal histories. The U.S. then shared those benchmarks with every country in the world and gave them 50 days to comply.\n\nAdvertisement\n\nThe citizens of countries that refused could now face travel restrictions and more stringent screening measures that would last indefinitely, until their governments complied.\n\nTrump last week called for a ‘‘tougher’’ travel ban after a bomb partially exploded on a London subway.\n\n‘‘The travel ban into the United States should be far larger, tougher and more specific-but stupidly, that would not be politically correct!’’ he tweeted.\n\nCritics have accused Trump of overstepping his authority and violating the U.S. Constitution’s protections against religious bias. Trump had called for a ‘‘total and complete shutdown of Muslims entering the United States’’ during his campaign.", "authors": [], "publish_date": "2017-09-24", "source": "bostonglobe", "top_words": ["tougher", "travel", "restrictions", "expires", "trump", "ban", "security", "united", "countries", "sign", "expected", "states"], "summary": "WASHINGTON (AP) — President Donald Trump is expected to announce new restrictions on travel to the United States as his ban on visitors from six Muslim-majority countries expires Sunday, 90 days after it went into effect.\nAdvertisementThe citizens of countries that refused could now face travel restrictions and more stringent screening measures that would last indefinitely, until their governments complied.\nTrump last week called for a ‘‘tougher’’ travel ban after a bomb partially exploded on a London subway.\n‘‘The travel ban into the United States should be far larger, tougher and more specific-but stupidly, that would not be politically correct!’’ he tweeted.\nTrump had called for a ‘‘total and complete shutdown of Muslims entering the United States’’ during his campaign."}