{"url": "https://www.bostonglobe.com/news/nation/2017/02/06/former-secretary-state-john-kerry-expresses-opposition-trump-travel-ban/RTqMYLgvkw1OX1WbHDnRdO/story.html", "id": "48", "title": "Former secretary of state John Kerry expresses opposition to Trump travel ban", "text": "Former secretaries of state John Kerry and Madeleine Albright have joined former national security officials under President Obama in a statement opposing President Donald J. Trump’s travel ban.\n\nThe declaration was filed in federal appeals court, which is considering whether to maintain the suspension of the travel ban ordered by a Seattle judge. The declaration was attached to a filing in the case by the states of Washington and Minnesota, which want to block the travel ban.\n\nThe declaration said Trump’s ban would disrupt lives and cripple US counterterrorism partnerships around the world without making the nation safer.\n\nAdvertisement\n\n‘‘It will aid ISIL’s propaganda effort and serve its recruitment message by feeding into the narrative that the United States is at war with Islam,’’ according to the six-page declaration.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n‘‘Blanket bans of certain countries or classes of people are beneath the dignity of the nation and Constitution that we each took oaths to protect,’’ the declaration added.\n\nLawyers for Washington and Minnesota have told the 9th US Circuit Court of Appeals in San Francisco that restoring the ban on refugees and travelers from seven predominantly Muslim countries would ‘‘unleash chaos again.’’\n\nThe filings came early Monday after the White House said it expected the federal courts to reinstate the ban.\n\nWashington and Minnesota said their underlying lawsuit was strong and a nationwide temporary restraining order was appropriate. If the appeals court reinstated Trump’s ban, the states said, the ‘‘ruling would reinstitute those harms, separating families, stranding our university students and faculty, and barring travel.’’\n\nAdvertisement\n\nThe technology industry also has weighed in against the ban, contending it would harm their companies by making it more difficult to recruit employees. Tech giants like Apple and Google, along with Uber, filed their arguments with the court late Sunday.\n\nThe next opportunity for Trump’s team to argue in favor of the ban will come in the form of a response to the Washington state and Minnesota filings. The 9th Circuit ordered the Justice Department to file its briefs by 6 p.m. Monday. It had already turned down a Justice request to set aside immediately the Seattle judge’s ruling, which put a temporary hold on the ban nationwide.\n\nThe government had told the appeals court that the president alone has the power to decide who can enter or stay in the United States, an assertion that appeared to invoke the wider battle to come over illegal immigration.\n\nCongress ‘‘vests complete discretion’’ in the president to impose conditions on entry of foreigners to the United States, and that power is ‘‘largely immune from judicial control,’’ according to the government.\n\nSen. Dianne Feinstein, the top Democrat on the Judiciary Committee, predicted the appeals court would not have the last word. ‘‘I have no doubt that it will go to the Supreme Court, and probably some judgments will be made whether this president has exceed his authority or not,’’ she said on Fox News.\n\nAdvertisement\n\nTrump’s order applied to Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen — Muslim-majority countries that the administration said raise terrorism concerns. The State Department said last week that as many as 60,000 foreigners from those seven countries had had their visas canceled. After the decision by the Seattle judge, the department reversed course and said they could travel to the U.S. if they had valid visas.\n\nThe department also advised refugee aid agencies that refugees set to travel before Trump signed his order would now be allowed in.\n\nThe Homeland Security Department no longer was directing airlines to prevent visa-holders affected by Trump’s order from boarding U.S.-bound planes. The agency said it had ‘‘suspended any and all actions’’ related to putting in place Trump’s order.", "authors": ["The Associated Press"], "publish_date": "2017-02-06", "source": "bostonglobe", "top_words": ["travel", "trump", "john", "ban", "appeals", "state", "court", "order", "minnesota", "secretary", "trumps", "president", "opposition", "states", "expresses", "department", "kerry"], "summary": "Former secretaries of state John Kerry and Madeleine Albright have joined former national security officials under President Obama in a statement opposing President Donald J. Trump’s travel ban.\nThe declaration was filed in federal appeals court, which is considering whether to maintain the suspension of the travel ban ordered by a Seattle judge.\nThe declaration said Trump’s ban would disrupt lives and cripple US counterterrorism partnerships around the world without making the nation safer.\nSen. Dianne Feinstein, the top Democrat on the Judiciary Committee, predicted the appeals court would not have the last word.\nThe agency said it had ‘‘suspended any and all actions’’ related to putting in place Trump’s order."}