{"url": "https://www.bostonglobe.com/metro/2017/02/05/people-affected-trump-travel-ban-advised-get-flights-immediately/vITnKgFPySFjRx8ZfMCS9N/story.html", "id": "53", "title": "People affected by Trump’s travel ban advised to get on flights immediately", "text": "Mohammad Alizadeh (left) witnessed his mother-in-law, Tahereh Marvdashti, meeting her grandson Omid for the first time at Logan International Airport.\n\nFollowing an appeals court ruling early Sunday morning that maintained the halt on President Trump’s immigration order until at least Monday, attorneys in Massachusetts were advising people affected to get on flights to the United States immediately.\n\nAs the appeals process currently stands, everyone who has proper documentation can board flights and come home, said Kerry Doyle, an immigration attorney with Graves & Doyle, said on Sunday.\n\nThroughout Sunday many reunions took place at Logan International Airport between those who had been affected by the ban and relieved loved ones.\n\nAdvertisement\n\n“People need to get in fast,” said Susan Church, an immigration attorney who chairs the New England chapter of the American Immigration Lawyers Association. “This is a dire situation.”\n\nGet Fast Forward in your inbox: Forget yesterday's news. Get what you need today in this early-morning email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nAs the nation entered the second week of confusion and controversy surrounding Trump’s executive order on immigration, the Ninth Circuit Court of Appeals in San Francisco early Sunday morning denied an immediate stay of the federal ruling issued Friday by a Seattle judge that halted the order nationwide.\n\nRelated Links Read Story Logan airport was site of many family reunions Saturday About 40 Iranian nationals who had been barred from entering the US for a week made it onto a Lufthansa flight.\n\nIt was unclear how the stop-and-go whirlwind of rulings will affect immigration in days to come.\n\nThe appeals court asked those challenging the ban to file written arguments by 3 a.m. EST Monday, and Justice Department lawyers to reply by 6 p.m. EST. The court could then schedule a hearing, or rule whether the immigration order should remain on hold.\n\nThe American Civil Liberties Union of Massachusetts said that although the Seattle judge’s ruling offers additional protection to immigrants, people affected by the order should “monitor the rapidly evolving situation closely, and consider making needed trips or returns to the United States as early as possible.”\n\nAdvertisement\n\nTrump’s Jan. 27 executive order prevented entry by visa holders from seven countries — Iran, Iraq, Libya, Somalia, Sudan, Syria, and Yemen — for 90 days. It also halted refugees from entering the country for 120 days, and closed the door to the Syrian refugees indefinitely. Administration officials have since stated that the order does not apply to green-card holders.\n\nAttorneys and the ACLU of Massachusetts on Sunday said they believe the seven-day restraining order issued early on the morning of Jan. 29 by a federal judge in Massachusetts would remain in place until 11:59 p.m. Monday. The federal rules of civil procedure require that “if the last day is a Saturday, Sunday, or legal holiday, the period continues to run until the end of the next day that is not a Saturday, Sunday, or legal holiday.”\n\nHowever, Church said, “We haven’t gotten a confirmation from the government that they interpret it that way.”\n\nOn Friday afternoon, another federal judge in Massachusetts ruled against extending the order, saying Trump would likely succeed in the case on the grounds that he has broad authority over federal immigration laws. That ruling was made shortly before US District Judge James Robart in Seattle issued his nationwide halt.\n\nIn a series of tweets Saturday, Trump criticized Robart as a “so-called judge” and the ruling as “ridiculous.”\n\nAdvertisement\n\n“Why aren’t the lawyers looking at and using the Federal Court decision in Boston, which is at conflict with ridiculous lift ban decision?” he tweeted later.\n\nSupporters of Trump’s executive order expressed hope that the courts would ultimately uphold it, citing national security concerns.\n\nRichard D’Agostino, an attorney who practices in Massachusetts and campaigned for Trump, said he empathizes with the people affected by the ban who have good intentions but believes “we’ve lost sight of why any country even has an immigration policy.”\n\n“ ‘Give me your tired, your poor’ is not part of the US Constitution, it’s part of a lovely poem,” said D’Agostino. “We would implode. We can’t help everyone in the world, as much as we’d love to.”\n\nThe ACLU of Massachusetts has continued to offer free legal assistance at Logan for international passengers who may be affected by the order.\n\n“It makes you appreciate our system of government and shows how great America really can be,” said Doyle. “We have checks and balances ... The executive branch doesn’t have unchecked authority.”\n\nA combination of stress and hope was palpable Sunday at Logan’s international terminal, where volunteer lawyers gathered — as they have for days — by the arrival doors, offering help to waiting families and travelers.\n\nMany people waiting in the terminal brought signs, one with the hashtag “#LetThemFly!” printed in black type, and another with the words “NO BAN” written with a purple marker. Others held signs bearing the names of loved ones expected to join them in Boston.\n\nArsalan Hashemiaghdam, a research fellow at Massachusetts General Hospital, had come to Boston from Iran in October and had waited for his friend, Sahand Faraji, to join him Sunday. Faraji, who had been living in Istanbul for several years, plans to study for a PhD in engineering from South Carolina University. He arrived on a Lufthansa flight from Frankfurt at about 1 p.m.\n\n“It was really frustrating and disappointing,” Faraji said. “I had to cancel my ticket two times.”\n\nHashemiaghdam said he and Faraji each went through several months of “extreme” vetting before they could get visas. It was frustrating to know they could still be kept from coming to the United States even after they received their visas, Hashemiaghdam said.\n\nFaraji, 27, had moved to Istanbul to work on his master’s degree. He and many of his friends had hoped to come to the United States to continue their education and careers.\n\n“We are not the bad people that President Trump says every day on his Twitter,” Faraji said.\n\nNaser Sharifi, who lives near the Worcester Polytechnic Institute where he studies, was waiting with several friends at the terminal for his wife, Hoda Jalali, and two family friends, who were on the Lufthansa afternoon flight. They all arrived without any trouble on Sunday, they said.\n\nHe said his wife had attempted to fly to Chicago last Saturday, hours after Trump’s policy was enacted, and she was sent back to Iran.\n\n“She was just crying and crying,” he said. “Heartbroken.”\n\nHis wife had booked another flight from Istanbul to Boston this weekend, knowing she could be turned away again.\n\n“If you are deported twice, it’s going to have a bad effect on you,” Sharifi said. “She was brave enough to take the risk.”\n\nNicole Fleming can be reached at nicole.fleming@globe.com . Felicia Gans can be reached at felicia.gans@globe.com . Follow her on Twitter @FeliciaGans", "authors": ["Nicole Fleming", "Felicia Gans", "Globe Correspondents"], "publish_date": "2017-02-05", "source": "bostonglobe", "top_words": ["ruling", "faraji", "travel", "immediately", "ban", "affected", "immigration", "advised", "massachusetts", "judge", "court", "trumps", "flights", "federal", "order"], "summary": "Mohammad Alizadeh (left) witnessed his mother-in-law, Tahereh Marvdashti, meeting her grandson Omid for the first time at Logan International Airport.\nFollowing an appeals court ruling early Sunday morning that maintained the halt on President Trump’s immigration order until at least Monday, attorneys in Massachusetts were advising people affected to get on flights to the United States immediately.\nThroughout Sunday many reunions took place at Logan International Airport between those who had been affected by the ban and relieved loved ones.\nThe court could then schedule a hearing, or rule whether the immigration order should remain on hold.\nSupporters of Trump’s executive order expressed hope that the courts would ultimately uphold it, citing national security concerns."}