{"url": "https://www.bostonglobe.com/news/world/2017/06/04/susan-rice-says-evidence-trump-travel-ban-would-make-safer/eRgX77KmKSLWek6E4hTjsK/story.html", "id": "56", "title": "Susan Rice says no evidence Trump travel ban would make US safer", "text": "(Bloomberg) -- There’s no evidence President Donald Trump’s travel ban, struck down in the courts and awaiting Supreme Court review, would make the U.S. safer from the kinds of attacks carried out in London overnight, his predecessor’s national security adviser said.\n\n“There’s a very real risk that by stigmatizing and isolating Muslims from particular countries, and Muslims in general, that we alienate the very communities here in the United States whose cooperation we most need to detect and prevent these home-grown extremists from being able to carry out attacks,’’ Susan Rice said on ABC’s “This Week’’ on Sunday.\n\nTrump responded quickly to Saturday night’s terror attack in London with a Twitter message arguing for U.S. courts to reinstate his executive order on travel to the U.S. by people from six predominantly Muslim countries.\n\nAdvertisement\n\n“We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety,’’ Trump tweeted. He followed up on Sunday saying “we must stop being politically correct and get down to the business of security.”\n\nGet Today's Headlines in your inbox: The day's top stories delivered every morning. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nRice said the U.S. and other countries need to remain focused on recognizing and stopping home-grown terrorists, and that Trump’s order doesn’t help in that regard. “That is, I believe, one of the major reasons why the courts thus far have been very skeptical of the travel ban,’’ Rice said.\n\n‘Extreme Vetting’\n\nThe White House on Thursday asked the U.S. Supreme Court to immediately reinstate the ban, which the administration has described as an effort to protect the country from terrorists. There’s been a string of court rulings against the measure since it was introduced in January and amended in March.\n\nSenator Roy Blunt, a Republican from Missouri and a member of the Senate Intelligence Committee, said Trump does “have the right to put in place extreme vetting,” whether the travel ban moves ahead or not.\n\nAdvertisement\n\n“The terror threat is real,” Blunt said on “Fox News Sunday.”\n\nRepublican Senator Susan Collins of Maine said on CBS’s “Face the Nation” that she didn’t agree with Trump that the London attack showed the need for his executive order.\n\n“I think that the travel ban is too broad and that is why it’s been rejected by the courts,” Collins said. “The president is right, however, that we need to do a better job of vetting individuals who are coming from war-torn countries into our nation.”\n\n‘Slap in the Face’\n\nThe Trump administration has had time to review and implement new vetting procedures instead of continuing to call for a travel ban, U.S. Senator Mark Warner of Virginia, the intelligence committee’s top Democrat, said on CBS’s “Face the Nation.” Intelligence leaders have said such an edict is “in effect a slap in the face to Muslim-Americans and others, and in many ways might actually incite more incidents,” he said.\n\nAdvertisement\n\nIn a separate appearance on CNN, Warner said that “in many ways the Muslim-American community is better integrated into our society” than in Europe, which is the “secret sauce” that helps stops attacks like those in Europe.\n\n“That’s why it troubles me so much to see the type of tweets the president has put out in the last 12 hours or so,” Warner said.", "authors": ["Mark Niquette", "Ben Brody", "Bloomberg News"], "publish_date": "2017-06-04", "source": "bostonglobe", "top_words": ["warner", "travel", "courts", "trump", "safer", "ban", "intelligence", "rice", "evidence", "vetting", "susan", "need", "london", "president"], "summary": "(Bloomberg) -- There’s no evidence President Donald Trump’s travel ban, struck down in the courts and awaiting Supreme Court review, would make the U.S. safer from the kinds of attacks carried out in London overnight, his predecessor’s national security adviser said.\nWe need the Travel Ban as an extra level of safety,’’ Trump tweeted.\n“That is, I believe, one of the major reasons why the courts thus far have been very skeptical of the travel ban,’’ Rice said.\nSenator Roy Blunt, a Republican from Missouri and a member of the Senate Intelligence Committee, said Trump does “have the right to put in place extreme vetting,” whether the travel ban moves ahead or not.\n“I think that the travel ban is too broad and that is why it’s been rejected by the courts,” Collins said."}