{"url": "https://www.bostonglobe.com/news/nation/2017/02/05/appeals-court-denies-donald-trump-request-stay-previous-ruling-travel-ban/d12KBnizF6T5q6RbnnJ7fJ/story.html", "id": "51", "title": "White House says it expects ban will be reinstated", "text": "Protesters who object to President Trump’s travel ban held signs Sunday in Hong Kong in front of the US consulate.\n\nWASHINGTON — A federal appeals court ruled Sunday that President Trump’s controversial immigration order will remain suspended for the time being, allowing travelers previously banned from coming to the United States at least another day to get here.\n\nThe decision, by the US Court of Appeals for the Ninth Circuit, preserves the order by a federal judge in Seattle to temporarily halt the ban.\n\nThe stay will remain in place at least until Monday evening, and the Justice Department said it would not elevate the dispute to the Supreme Court before that.\n\nAdvertisement\n\nTrump responded to the development Sunday by writing on Twitter that he had ‘‘instructed Homeland Security to check people coming into our country very carefully.’’ The department did not immediately say how that screening would be implemented.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n‘‘Just cannot believe a judge would put our country in such peril,’’ Trump wrote. ‘‘If something happens blame him and court system. People pouring in. Bad!’’\n\nThe appeals court asked those challenging the ban to file written arguments by 3 a.m. EST Monday, and Justice Department lawyers to reply by 6 p.m. EST. The court could then schedule a hearing, or rule whether the ban should remain on hold.\n\nIn the meantime, people who had been stranded in legal limbo rushed Sunday to fly back to the United States. Some successfully reunited with family members, while others — particularly those whose visas were physically taken or marked as invalid — ran into roadblocks trying to board planes overseas.\n\nAt Dulles International Airport in Virginia, immigration lawyers could be heard on phones, arguing with airline representatives to let their passengers board as some seemed confused over the various court rulings and what they meant.\n\nAdvertisement\n\nFederal courts in New York, California, and elsewhere have blocked aspects of the ban from being implemented. The lawsuits now range from the District of Columbia to Hawaii.\n\nThe Trump administration has been steadfast in its support of the executive order, which it says is necessary for national security reasons, and the president tweeted his disdain for the judge in Washington state who put a stop to it.\n\n‘‘The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!’’ Trump wrote Saturday.\n\nVice President Mike Pence said Sunday on NBC’s ‘‘Meet the Press’’ that White House officials felt Trump was ‘‘operating within his authority as president, both under the Constitution, and under clear statutory law.’’\n\nPence defended Trump’s personal attack on US District Judge James L. Robart in Seattle, who blocked the travel ban nationwide, saying the president’s remarks did not risk undermining the bedrock principle of the separation of powers.\n\nAdvertisement\n\nAsked about Trump’s reference on Twitter to the “so-called judge.” Pence said: “Well, look, the president of the United States has every right to criticize the other two branches of government. And we have a long tradition of that in this country.”\n\n“The judge’s actions in this case,” Pence added, “making decisions about American foreign policy and national security, it’s just very frustrating to the president, to our whole administration, to millions of Americans who want to see judges that will uphold the law and recognize the authority the president of the United States has under the Constitution to manage who comes into this country.”\n\nLegal analysts have said the president does have broad authority to set immigration policy, though civil liberties advocates have countered that the order essentially amounts to a discriminatory ban on Muslims, with no real national security purpose.\n\n‘‘We’re very confident that we’re going to prevail,’’ Pence said. ‘‘We’ll accomplish the stay and will win the case on the merits. But again, the focus here is on the safety and security of the American people.’’\n\nOn Sunday television talk shows, some Republicans in Congress took issue with comments by the president, particularly his description of Robart as a ‘‘so-called judge.’’\n\n‘‘I’ll be honest, I don’t understand language like that,’’ said Senator Ben Sasse, Republican of Nebraska. ‘‘We don’t have so-called judges, we don’t have so-called senators, we don’t have so-called presidents. We have people from three different branches of government who take an oath to uphold and defend the Constitution. . . . So, we don’t have any so-called judges, we have real judges.’’\n\nSenate majority leader Mitch McConnell, Republican of Kentucky, said: ‘‘We all get disappointed from time to time at the outcome in courts on things that we care about. But I think it is best to avoid criticizing judges individually.’’\n\nMcConnell went on to offer a broader critique of Trump’s executive order than he had previously: ‘‘We all want to try to keep terrorists out of the United States. But we can’t shut down travel. We certainly don’t want Muslim allies who have fought with us in countries overseas to not be able to travel to the United States. We need to be careful about this.’’\n\nWhile several judges have ruled against the administration’s ban, the case now before the Ninth Circuit is perhaps the most significant one. It stems from a lawsuit by the states of Washington and Minnesota, which alleged the immigration order was ‘‘separating families, harming thousands of the states’ residents, damaging the states’ economies, hurting state-based companies, and undermining both states’ sovereign interest in remaining a welcoming place for immigrants and refugees.’’\n\nRobart temporarily halted the ban Friday. Then two Ninth Circuit judges, William C. Canby Jr., appointed by Jimmy Carter, and Michelle Taryn Friedland, appointed by Barack Obama, denied the Justice Department’s request on Sunday to immediately restore it.\n\nThe Justice Department could have gone straight to the Supreme Court, but a department spokesman said it would not do so. ‘‘With the fast briefing schedule the appeals court laid out, we do not plan to ask the Supreme Court for an immediate stay but instead let the appeals process play out,’’ spokesman Peter Carr said.\n\nSenator Dianne Feinstein of California, the top-ranking Democrat on the Judiciary Committee, predicted the matter would be decided by the Supreme Court. “The president is not a dictator,” Feinstein said on “Fox News Sunday.”\n\nLeon Fresco, a deputy assistant attorney general for the Office of Immigration Litigation in Obama’s Justice Department, said he was ‘‘surprised that there is this exuberance to immediately rescind the executive order,’’ particularly given the timing issues.\n\nTrump’s order, which barred refugees and citizens of seven Muslim-majority countries, was temporary. Refugees were banned for 120 days, the others for 90 days, save those from Syria, whose travel to the United States was blocked indefinitely. The order was purportedly designed to give the administration time to formulate a plan for on how to vet those emanating from countries with terrorist activity.\n\n‘‘It is perplexing why the government wouldn’t want to simply, at this point, maintain an orderly process in one court, as opposed to fighting it out all across the country in different courts, and working its way to the Supreme Court,’’ Fresco said.\n\nIf Trump’s ban were immediately reinstated, that might spark chaos similar to what occurred when it was first rolled out Jan. 27. The State Department provisionally revoked tens of thousands of visas. When people began landing at US airports, Customs and Border Protection officers detained more than 100 and deported some, sparking protests and lawsuits.\n\nIt was unclear Sunday whether officials had a plan to avoid a repeat of that outcome, though much would depend on specifically what was ordered by a court, and when.\n\nThe Department of Homeland Security said Saturday that, because of Robart’s ruling, it was suspending enforcement of the executive order entirely, and the State Department restored those visas that had been provisionally revoked.\n\nRead the appeals court’s ruling", "authors": ["Matt Zapotosky", "Robert Barnes", "Washington Post"], "publish_date": "2017-02-05", "source": "bostonglobe", "top_words": ["socalled", "judges", "ban", "expects", "court", "order", "house", "president", "united", "department", "trumps", "states", "reinstated", "white"], "summary": "Protesters who object to President Trump’s travel ban held signs Sunday in Hong Kong in front of the US consulate.\nIn the meantime, people who had been stranded in legal limbo rushed Sunday to fly back to the United States.\n‘‘We don’t have so-called judges, we don’t have so-called senators, we don’t have so-called presidents.\nWe certainly don’t want Muslim allies who have fought with us in countries overseas to not be able to travel to the United States.\nIf Trump’s ban were immediately reinstated, that might spark chaos similar to what occurred when it was first rolled out Jan. 27."}