{"url": "https://www.bostonglobe.com/news/politics/2017/06/05/trump-latest-tweets-could-hurt-effort-restore-travel-ban/0WzocSXj9mZiqr9OMtqpUM/story.html", "id": "57", "title": "Trump’s latest tweets could hurt effort to restore travel ban", "text": "President Trump said the Justice Department should seek a ‘‘much tougher version’’ of the travel restrictions and made clear — despite his own press secretary’s past remarks to the contrary — that the executive order is a ‘‘ban,’’ not a pause on some sources of immigration or an enhanced vetting system.\n\nWASHINGTON — President Trump on Monday derided the revised travel ban as a ‘‘watered down’’ version of the first and criticized his own Justice Department’s handling of the case — potentially hurting the administration’s defense of the ban as the legal battle over it reaches a critical new stage.\n\nIn a tweet, Trump called the new ban ‘‘politically correct,’’ ignoring that he himself signed the executive order replacing the first ban with a revised version that targeted six, rather than seven, Muslim-majority countries and blocked the issuance of new visas, rather than revoking current ones.\n\nTrump said the Justice Department should seek a ‘‘much tougher version’’ and made clear — despite his own press secretary’s past remarks to the contrary — that the executive order is a ‘‘ban,’’ not a pause on some sources of immigration or an enhanced vetting system.\n\nAdvertisement\n\n‘‘People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!’’ Trump wrote.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe president’s tweets could significantly damage his administration’s effort to restore the ban, which has been put on hold by two federal courts.\n\nNext week, those suing are expected to file arguments on the matter with the Supreme Court, and Trump’s latest remarks will surely be a part of their briefs. The administration appealed to the nation’s highest court after the US Court of Appeals for the Fourth Circuit upheld the freeze on the ban last month.\n\nNeal Katyal, the lawyer who argued for the challengers in the US Court of Appeals for the Ninth Circuit, wrote on Twitter, ‘‘Its kinda odd to have the defendant in Hawaii v Trump acting as our co-counsel. We don’t need the help but will take it!’’ He also wrote that he was ‘‘waiting now for the inevitable cover-my-tweet posts from him that the Solicitor General will no doubt insist upon.’’\n\nA Justice Department spokesman declined to comment.\n\nAdvertisement\n\nFederal judges across the country have focused acutely on Trump’s own comments in ordering the ban be frozen, determining that the president’s words expose the measure as being a tool for discrimination disguised as a national security directive.\n\nThe majority opinion in the US Court of Appeals for the Fourth Circuit maintaining the freeze on the ban quoted extensively from Trump’s tweets and media interviews, and from those of his advisers. On the campaign trail, Trump called for a ‘‘total and complete shutdown of Muslims entering the United States.’’\n\nOmar Jadwat, who argued the case in the US Court of Appeals for the Fourth Circuit, wrote that Trump’s tweets amounted to ‘‘a promise: let me do this and I’ll take it as license to do even worse.’’\n\nGovernment lawyers have sought to convince judges they should not consider the president’s statements but instead limit their analysis to the text of the ban themselves. They have also sought to portray the president’s words as campaign trail rhetoric, and noted that many of the remarks in question — though not all — came before Trump was elected.\n\n‘‘We shouldn’t start down the road of psychoanalyzing what people meant on the campaign trail,’’ acting solicitor general Jeffrey Wall told judges at a recent court hearing in the US Court of Appeals for the Ninth Circuit.\n\nAdvertisement\n\nTrump’s latest tweets will provide those challenging the ban more examples of post-election remarks and a stronger case that Trump’s revised travel ban had the same purpose as the original version.\n\nThat version, which unilaterally revoked visas from tens of thousands of people from seven Muslim majority countries, was seen as much harder to defend because it was much more onerous and had a provision in the text itself that seemed designed to exempt Christian travelers.\n\nTrump tweeted Monday that the Justice Department ‘‘should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted’’ to the Supreme Court. In addition to creating possible headaches in court, that misstates the process. Trump himself signed the executive order imposing the ban. The Justice Department defends his policies in court.\n\nTrump also wrote that the Justice Department ‘‘should ask for an expedited hearing of the watered down Travel Ban before the Supreme Court - & seek much tougher version!’’ The Supreme Court would not be the body to enact a ban; they are merely weighing whether Trump’s order can pass constitutional muster.\n\nThe travel ban seems to have been on Trump’s mind since the terrorist attack in London Saturday, when Trump wrote on Twitter, ‘‘We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!’’\n\nLegal analysts were quick to point out that the president was hurting his own case.\n\n‘‘In case it’s not obvious, these will only undermine the government’s case before #SCOTUS for both a stay & on the merits of the #TravelBan,’’ University of Texas law professor Stephen Vladeck posted on Twitter. ‘‘These will also go a long way toward mooting debate over use of campaign statements; no need when, as President, he still says these things.’’\n\nTrump also wrote on Twitter that the administration was already ‘‘EXTREME VETTING’’ travelers coming into the United States — which he said was necessary to keep the country safe because courts are ‘‘slow and political!’’ The Department of Homeland Security has previously suggested such vetting was taking place, but that, too, seems to undercut the Justice Department’s legal position.\n\nThe travel ban was supposed to be a temporary measure, designed to afford the administration time to conduct a review and decide what new vetting procedures were necessary. When a federal judge in Hawaii ordered the ban frozen, though, the government interpreted his order as stopping even that review — and the judge declined to clarify that it did not.\n\nWall told the Fourth Circuit last month that the administration had ‘‘put our pens down’’ and had ‘‘done nothing to review the vetting procedures for these countries.’’\n\nIf the administration already has implemented new vetting procedures, that would seem to call into question the necessity of a temporary ban. Legal analysts, though, have previously said that president’s remarks indicate he might not view the measure as temporary — despite what the text of the executive order itself says.", "authors": ["Matt Zapotosky", "Washington Post"], "publish_date": "2017-06-05", "source": "bostonglobe", "top_words": ["travel", "hurt", "tweets", "trump", "ban", "vetting", "court", "version", "order", "trumps", "restore", "justice", "latest", "department", "effort"], "summary": "Advertisement‘‘People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!’’ Trump wrote.\nAdvertisementTrump’s latest tweets will provide those challenging the ban more examples of post-election remarks and a stronger case that Trump’s revised travel ban had the same purpose as the original version.\nThe travel ban seems to have been on Trump’s mind since the terrorist attack in London Saturday, when Trump wrote on Twitter, ‘‘We need to be smart, vigilant and tough.\nWe need the Travel Ban as an extra level of safety!’’Legal analysts were quick to point out that the president was hurting his own case.\nThe travel ban was supposed to be a temporary measure, designed to afford the administration time to conduct a review and decide what new vetting procedures were necessary."}