{"url": "https://www.bostonglobe.com/news/nation/2017/01/31/new-attorney-general-says-enforce-president-trump-travel-ban/NB46XtoVU8exvu7yckY30H/story.html", "id": "61", "title": "New attorney general says he’ll enforce President Trump’s travel ban", "text": "Dana Boente, the new acting attorney general, formerly served as US Attorney for the Eastern District of Virginia.\n\nWASHINGTON — Longtime federal prosecutor Dana Boente, the US Attorney for the Eastern District of Virginia, was named Monday by President Trump to replace Sally Yates as acting attorney general.\n\nYates was fired after she publicly questioned the constitutionality of his controversial refugee and immigration ban and refused to defend it in court.\n\nBoente was sworn in privately, the White House said.\n\nAdvertisement\n\nBoente promptly ordered Justice Department lawyers to ‘‘do our sworn duty and to defend the lawful orders of our President.’’\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nBoente said Trump’s executive order was ‘‘both lawful on its face and properly drafted.’’\n\nYates’ refusal to defend the executive order was largely symbolic given that Sen. Jeff Sessions, Trump’s pick for attorney general, will almost certainly defend the policy once he’s sworn in. He’s expected to be confirmed Tuesday by the Senate Judiciary Committee and could be approved within days by the full Senate.", "authors": ["The Associated Press"], "publish_date": "2017-01-31", "source": "bostonglobe", "top_words": ["hes", "travel", "ban", "trumps", "sworn", "general", "attorney", "sign", "hell", "order", "president", "senate", "enforce", "defend", "lawful"], "summary": "Dana Boente, the new acting attorney general, formerly served as US Attorney for the Eastern District of Virginia.\nWASHINGTON — Longtime federal prosecutor Dana Boente, the US Attorney for the Eastern District of Virginia, was named Monday by President Trump to replace Sally Yates as acting attorney general.\nYates was fired after she publicly questioned the constitutionality of his controversial refugee and immigration ban and refused to defend it in court.\nSign up for more newsletters hereBoente said Trump’s executive order was ‘‘both lawful on its face and properly drafted.’’Yates’ refusal to defend the executive order was largely symbolic given that Sen. Jeff Sessions, Trump’s pick for attorney general, will almost certainly defend the policy once he’s sworn in.\nHe’s expected to be confirmed Tuesday by the Senate Judiciary Committee and could be approved within days by the full Senate."}