{"url": "https://www.bostonglobe.com/news/nation/2017/09/25/supreme-court-cancels-hearing-trump-travel-ban-targeted-nations-criticize-policy/wPGxVXeiq9TpYc55BJMF2O/story.html", "id": "60", "title": "Supreme Court cancels hearing on Trump travel ban; targeted nations criticize policy", "text": "WASHINGTON — The Supreme Court on Monday canceled arguments on President Trump’s travel ban that had been scheduled for Oct. 10, and asked parties in the case to submit briefs on whether the appeal has been rendered moot by a revised policy announced Sunday.\n\nThe court asked lawyers in the case to present briefs by Oct. 5 discussing the effect of Trump’s new proclamation replacing the travel ban he issued in March.\n\nThe new order indefinitely bans almost all travel to the United States from seven countries, including most of the nations covered by his original travel ban, citing threats to national security posed by letting their citizens into the country.\n\nAdvertisement\n\nThe indefinite restrictions apply to citizens of Chad, Iran, Libya, North Korea, Somalia, Syria, and Yemen. The new ban took effect immediately for people in countries affected by both versions of the ban. The rest of it will be enforced starting Oct. 18.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nAs part of the presidential proclamation signed Sunday, the United States will also bar the entry of certain Venezuelan government officials and their immediate families.\n\nVenezuela’s president, Nicolas Maduro, said Monday that the administration’s decision to include Venezuelan officials on a travel ban is a form of ‘‘political and psychological terrorism,’’ the Associated Press reported.\n\nThe country’s Foreign Ministry said the travel restrictions violate the values of the United Nations charter and international law and are part of a continuing effort by the United States to oust Maduro from power.\n\nThe ministry said it is considering ‘‘all necessary measures’’ to defend Venezuela’s sovereignty and national interest.\n\nAdvertisement\n\nThe Trump administration has said Venezuela’s government has been uncooperative in verifying whether its citizens represent national security threats and says the travel restrictions target officials at agencies and ministries responsible for screening.\n\nThe administration also calls for Venezuelan nationals who are already visa holders to be subject to ‘‘appropriate additional measures’’ to ensure their traveler information remains current.\n\nChad’s government said Monday that it learned ‘‘with astonishment’’ of the decision by the US government to put its country on a list whose nationals will be prohibited from entering the United States.\n\nThe government expressed its incomprehension about the ‘‘official reasons for this decision; which contrasts with Chad’s constant efforts and commitments in the fight against terrorism at regional and global levels,’’ the AP reported\n\nChad’s government called for a better appreciation of the situation and for Trump to reconsider the decision which it says ‘‘undermines the image of Chad and the good relations between the two countries.’’\n\nAdvertisement\n\nIt said it was open to discussions on strengthening collaborations with Washington.\n\nChad is the headquarters for a multinational force set up to fight Nigeria-based Boko Haram Islamic extremists.\n\nIn canceling arguments for now, the justices asked the parties to address “whether, or to what extent, the proclamation” may render the case moot.\n\nThe court also asked for briefings on a question not addressed in the proclamation, concerning the earlier ban’s suspension of the nation’s refugee program. That suspension is scheduled to expire next month. On that question, too, the court asked the parties to explain whether the issue would soon be moot.\n\nIf the court does eventually dismiss the case as moot, a further legal question will remain. The Trump administration will ask the court to vacate the appeals court decisions striking down the earlier ban, while the challengers will ask that the decisions remain on the books.\n\nTrump’s latest order is likely to start a third round of litigation, which may eventually reach the Supreme Court.\n\nTwo federal appeals courts found the March ban violated the Constitution or federal immigration law. Advocates for immigrant groups say the new policy still largely targets Muslims.", "authors": ["Adam Liptak", "New York Times"], "publish_date": "2017-09-25", "source": "bostonglobe", "top_words": ["cancels", "travel", "case", "trump", "national", "ban", "supreme", "venezuelan", "court", "proclamation", "nations", "united", "asked", "targeted", "criticize", "hearing", "policy", "decision"], "summary": "The court asked lawyers in the case to present briefs by Oct. 5 discussing the effect of Trump’s new proclamation replacing the travel ban he issued in March.\nThe new ban took effect immediately for people in countries affected by both versions of the ban.\nVenezuela’s president, Nicolas Maduro, said Monday that the administration’s decision to include Venezuelan officials on a travel ban is a form of ‘‘political and psychological terrorism,’’ the Associated Press reported.\nOn that question, too, the court asked the parties to explain whether the issue would soon be moot.\nTrump’s latest order is likely to start a third round of litigation, which may eventually reach the Supreme Court."}