{"url": "https://www.bostonglobe.com/news/nation/2017/01/28/federal-judge-bars-from-deporting-travelers-with-valid-visas-covered-trump-order/4SatBhv4X0Vs5EiLBEVtVM/story.html", "id": "68", "title": "Federal judge bars US from deporting travelers with valid visas covered by Trump order", "text": "WASHINGTON — A federal judge in New York came to the aid of scores of refugees and others who were trapped at airports across the United States on Saturday after an executive order signed by President Trump, which sought to keep many foreigners from entering the country, led to chaotic scenes across the globe.\n\nThe judge’s ruling blocked part of the president’s actions, preventing the government from deporting some arrivals who found themselves ensnared by the presidential order. But it stopped short of letting them into the country or issuing a broader ruling on the constitutionality of Trump’s actions.\n\nThe high-stakes legal case played out Saturday amid global turmoil, as the executive order signed by the president Friday afternoon slammed shut US borders for an Iranian scientist headed to a lab in the Boston area, a Syrian refugee family headed to a new life in Ohio and countless others across the world.\n\nAdvertisement\n\nTrump — in office just a week — found himself accused of constitutional and legal overreach by two Iraqi immigrants, defended by the American Civil Liberties Union. Meanwhile, large crowds of protesters turned out at airports around the country to denounce Trump’s ban on the entry of refugees and people from seven predominantly Muslim countries.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nLawyers who sued the government to block the White House order said the judge’s decision could affect an estimated 100 to 200 people who were detained upon arrival at US airports.\n\nJudge Ann M. Donnelly of US District Court in Brooklyn, who was nominated by President Obama, ruled just before 9 p.m. that implementing Trump’s order by sending the travelers home could cause them irreparable harm. She said the government was “enjoined and restrained from, in any manner and by any means, removing individuals” who had arrived in the United States with valid visas or refugee status.\n\nThe ruling does not appear to force the administration to let in people otherwise blocked by Trump’s order who have not yet traveled to the United States.\n\nThe judge’s one-page ruling came swiftly after lawyers for the ACLU testified in her courtroom that one of the people detained at an airport was being put on a plane to be deported back to Syria at that very moment. A government lawyer, Gisela A. Westwater, who spoke to the court by phone from Washington, said she simply did not know.\n\nAdvertisement\n\nHundreds of people waited outside of the courthouse chanting, “Set them free,” as lawyers made their case. When the crowd learned that Donnelly had ruled in favor of the plaintiffs, a cheer went up in the crowd.\n\nMinutes after the judge’s ruling in New York City, another judge, Leonie M. Brinkema in US District Court in Virginia, issued a temporary restraining order for a week to block the removal of any green card holders being detained at Dulles International Airport.\n\nAround the nation, security personnel at major international airports had new rules to follow, although the application of the order appeared chaotic and uneven. Humanitarian organizations delivered the bad news to overseas families that had overcome the bureaucratic hurdles previously in place and were all set to travel. And refugees on flights when the order was signed Friday found themselves detained upon arrival.\n\n“We’ve gotten reports of people being detained all over the country,” said Becca Heller, director of the International Refugee Assistance Project. “They’re literally pouring in by the minute.”\n\nEarlier in the day, at the White House, Trump shrugged off the sense of anxiety and disarray, suggesting that there had been an orderly rollout. “It’s not a Muslim ban, but we were totally prepared,” he said. “It’s working out very nicely. You see it at the airports; you see it all over.”\n\nAdvertisement\n\nBut to many, the government hardly seemed prepared for the upheaval that Trump’s actions put into motion.\n\nThere were numerous reports of students attending US universities who were blocked from returning to the United States from visits abroad. One student said in a Twitter post that he would be unable to study at Yale. Another who attends the Massachusetts Institute of Technology was refused permission to board a plane. A Sudanese graduate student at Stanford University was blocked for hours from entering the country.\n\nHuman rights groups reported that legal permanent residents of the United States who hold green cards were being stopped in foreign airports as they sought to return from funerals, vacations or study abroad. There was widespread condemnation of the order, from religious leaders, business executives, academics, political leaders and others. Trump’s supporters offered praise, calling it a necessary step on behalf of the nation’s security.\n\nHomeland Security officials said Saturday night that 109 people who were already in transit to the United States when the order was signed were denied access; 173 were stopped before boarding planes heading to America. Eighty-one people who were stopped were eventually given waivers to enter the United States, officials said.\n\nThe president’s order, enacted with the stroke of a pen at 4:42 p.m. Friday, suspended entry of all refugees to the United States for 120 days, barred Syrian refugees indefinitely and blocked entry into the United States for 90 days for citizens of seven predominantly Muslim countries: Iran, Iraq, Libya, Somalia, Sudan, Syria, and Yemen.\n\nThe Department of Homeland Security said the order also barred green card holders from those countries from re-entering the United States. In a briefing for reporters, White House officials said that green card holders from the seven affected countries who are outside the United States would need a case-by-case waiver to return.\n\nLegal residents who have a green card and are in the United States should meet with a consular officer before leaving the country, a White House official, who spoke on the condition of anonymity, told reporters. Officials did not clarify the criteria that would qualify someone for a waiver, other than that it would be granted “in the national interest.”\n\nBut the week-old administration appeared to be implementing the order chaotically, with agencies and officials around the globe interpreting it in different ways.\n\nThe Stanford student, Nisrin Omer, a legal permanent resident, said she was held at Kennedy International Airport in New York for about five hours, but was eventually allowed to leave the airport. Others who were detained appeared to be still in custody or sent back to their home countries.\n\nWhite House aides claimed Saturday that there had been consultations with State Department and Homeland Security officials about carrying out the order. “Everyone who needed to know was informed,” one aide said.\n\nBut that assertion was denied by multiple officials with knowledge of the interactions, including two officials at the State Department. Leaders of Customs and Border Protection and of Citizenship and Immigration Services — the two agencies most directly affected by the order — were on a telephone briefing on the new policy even as Trump signed it Friday, two officials said.\n\nThe ACLU’s legal case began with two Iraqis detained at Kennedy Airport, the named plaintiffs in the case. One was en route to reunite with his wife and son in Texas. The other had served alongside Americans in Iraq for a decade.\n\nShortly after noon Saturday, Hameed Khalid Darweesh, an interpreter who worked for more than a decade on behalf of the US government in Iraq, was released. After nearly 19 hours of detention, Darweesh began to cry as he spoke to reporters, putting his hands behind his back and miming handcuffs.\n\n“What I do for this country? They put the cuffs on,” Darweesh said. “You know how many soldiers I touch by this hand?”\n\nThe other man the lawyers are representing, Haider Sameer Abdulkhaleq Alshawi, who was en route to Houston, was released Saturday night.\n\nBefore the two men were released, one of the lawyers, Mark Doss, a supervising attorney at the International Refugee Assistance Project, asked an official, “Who is the person we need to talk to?”\n\n“Call Mr. Trump,” said the official, who declined to identify himself.\n\nWhile the judge’s ruling means that none of the detainees will be sent back immediately, lawyers for the plaintiffs expressed concern that all those at the airports would now be put in detention, pending a resolution of the case.\n\nThe White House said the restrictions would protect “the United States from foreign nationals entering from countries compromised by terrorism” and give the administration time to put in place “a more rigorous vetting process.” But critics condemned Trump over the collateral damage on people who had no sinister intentions in trying to come to the United States.\n\nPeaceful protests began forming Saturday afternoon at Kennedy Airport, where nine travelers had been detained upon arrival at Terminal 7 and two others at Terminal 4, an airport official said. Similar scenes were playing out at other airports across the nation.\n\nAn official message to all US diplomatic posts around the world provided instructions about how to treat people from the countries affected: “Effective immediately, halt interviewing and cease issuance and printing” of visas to the United States.\n\nInternationally, confusion turned to panic as travelers found themselves unable to board flights bound for the United States. In Dubai and Istanbul, airport and immigration officials turned passengers away at boarding gates and, in at least one case, ejected a family from a flight it had boarded.\n\nSeyed Soheil Saeedi Saravi, a promising young Iranian scientist, had been scheduled to travel in the coming days to Boston, where he had been awarded a fellowship to study cardiovascular medicine at Harvard, according to Thomas Michel, the professor who was to supervise the research fellowship.\n\nBut Michel said the visas for the student and his wife had been indefinitely suspended.\n\n“This outstanding young scientist has enormous potential to make contributions that will improve our understanding of heart disease, and he has already been thoroughly vetted,” Michel wrote to The New York Times.\n\nSix members of a Syrian family who have been living in a Turkish refugee camp since fleeing their home in 2014 were scheduled to arrive in Cleveland on Tuesday. Instead, their trip has been called off.\n\n“Everyone is just so heartbroken, so angry, so sad,” said Danielle Drake, the community manager for US Together, an agency that resettles refugees.\n\nA Christian family of six from Syria said in an e-mail to Representative Charlie Dent, Republican of Pennsylvania, that they were being detained at Philadelphia International Airport Saturday morning despite having legal paperwork, green cards and visas that had been approved.\n\nIn the case of the two Iraqis held at Kennedy Airport, the legal filings by his lawyers say that Darweesh was granted a special immigrant visa Jan. 20, the same day Trump was sworn in as president.\n\nA husband and father of three, Darweesh arrived at Kennedy Airport with his family. Darweesh’s wife and children made it through passport control and customs, but agents of Customs and Border Protection detained him.\n\nIn Istanbul, during a stopover Saturday, passengers reported that security officers had entered a plane after everyone had boarded and ordered a young Iranian woman and her family to leave the aircraft.\n\nIranian green card holders who live in the United States were blindsided by the decree while on vacation in Iran, finding themselves in a legal limbo and unsure whether they would be able to return to the United States.\n\n“How do I get back home now?” said Daria Zeynalia, a green card holder who was visiting family in Iran. He had rented a house and leased a car, and would be eligible for citizenship in November. “What about my job? If I can’t go back soon, I’ll lose everything.”\n\nMichael D. Shear reported from Washington, and Nicholas Kulish and Alan Feuer from New York. New York Times writers Mark Mazzetti, Matthew Rosenberg, Ron Nixon and Adam Liptak in Washington; Thomas Erdbrink in Tehran; Manny Fernandez in Houston; Julie Bosman in Chicago; and Liam Stack, Russell Goldman, Joe Goldstein, Liz Robbins, Stephanie Saul and Sean Piccoli in New York contributed to this report.", "authors": ["Michael D. Shear", "Nicholas Kulish", "Alan Feuer", "New York Times"], "publish_date": "2017-01-28", "source": "bostonglobe", "top_words": ["bars", "airport", "trump", "deporting", "visas", "travelers", "judge", "officials", "united", "states", "house", "federal", "valid", "covered", "order", "green", "york", "detained", "legal"], "summary": "She said the government was “enjoined and restrained from, in any manner and by any means, removing individuals” who had arrived in the United States with valid visas or refugee status.\nThere were numerous reports of students attending US universities who were blocked from returning to the United States from visits abroad.\nEighty-one people who were stopped were eventually given waivers to enter the United States, officials said.\nThe Department of Homeland Security said the order also barred green card holders from those countries from re-entering the United States.\nInternationally, confusion turned to panic as travelers found themselves unable to board flights bound for the United States."}