{"url": "https://www.bostonglobe.com/opinion/2017/03/19/the-muslim-ban-and-american-history/jf8g3ogrBZ2zkdIJRYELbN/story.html", "id": "69", "title": "The Muslim ban and American history", "text": "Donald Trump’s revised executive order to bar entry to the United States from six Muslim-majority countries is the latest salvo in America’s epic culture wars over race and American identity. As a matter of national security and law, the policy makes no sense, as the US District Court for the District of Hawaii has made clear. Yet Trump figures that he wins politically even as he loses again in court. Trump’s politics depend on making Muslims a target of hatred among working-class white voters, a strategy with a long and successful history in US politics. While this approach succeeded in putting Trump in the White House, I doubt that it will play well for long.\n\nViewed from a national security perspective, Trump’s entry ban doesn’t pass muster. As the federal courts have pointed out, not a single terrorist attack in the United States has involved a visa-holder from any of the six Muslim countries named in the ban (Iran, Libya, Somalia, Sudan, Syria, and Yemen, with Iraq now removed from the preceding executive order). In fact, 9/11 was carried out by Saudis, and most of the other terrorist attacks have been carried out by US citizens. A draft report by the Department of Homeland Security itself noted that citizenship is an “unlikely indicator” of terrorist threats. Some observers have argued that the Muslim ban skips any Muslim-majority country where Trump has business interests. Trump himself claims that the list of seven (now six) countries comes from the Obama administration, but the Obama administration list was merely to require visas for individuals who had recently visited one of the countries, not to bar entry by nationals of those countries.\n\nTrump’s real purpose isn’t antiterrorism at all. The real goal is to fan the perception among Trump’s political base that Islam is an existential threat to Western civilization and that allowing Muslims to enter the United States would be to permit a fifth column to grow inside the United States. Trump said as much in his speech to Congress: “We cannot allow a beachhead of terrorism to form inside America. We cannot allow our nation to become a sanctuary for extremists.”\n\nAdvertisement\n\nFor many Americans, including myself, this seems like a vulgarity. It is outrageous for the President to conflate refugees escaping from a war-torn region, and scientists and students visiting the United States on short-term visits or student visas, with terrorists forming a beachhead. It is even more hateful to do so when the United States has been the key instigator of the wars that the refugees are trying to flee. The United States has launched five major wars in the Middle East since 1990 (two in Iraq and one each in Afghanistan, Libya, and Syria), and is fighting in countless smaller wars (in Yemen and Somalia, among other places). Yet the United States has the audacity to close the doors to any and all victims of the violence.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nBut Trump’s moves are about identity, emotion, and politics, not logic, national security, and the law. For many Americans, 9/11 is a continuing trauma, fanned by repeated viewing of the horrors in the media. Psychological research shows that repeated viewings of the 9/11 and Iraq War carnage have been associated with adverse mental health consequences — a media-induced posttraumatic stress. Trump is playing straight to that trauma. We recall that in the immediate aftermath of 9/11, many Americans, including the Bush White House itself, were uninterested as to whether Saddam Hussein had been part of 9/11. Trauma was trauma, and the United States needed to respond with war, against somebody.\n\nThere is plenty of evidence regarding the exaggerated fears of middle America. Many Americans now believe that America is being overrun with Muslims. Ask yourself the question: What share of the US population is Muslim? Americans, on average, guess 17 percent. But the correct answer is around 1 percent.\n\nTrump is mining that deep vein of fear and hate. His message plays especially well among white working-class men, Trump’s base.\n\nAmerican attitudes towards Islam vary strongly with educational attainment. College-educated Americans, who tended to vote against Trump, see Islam favorably, while Americans with less than a college education, Trump’s base, tend to see Islam unfavorably. In a 2010 Pew Survey, for example, the favorable-unfavorable divide was 47-28 among college grads; 29-37 among those with some college but no degree; and 20-45 among those with a high-school diploma.\n\nAdvertisement\n\nThe fact that more-educated individuals harbor less negative views of Islam is a familiar pattern found in social psychology. Education generally breaks down us-versus-them stereotypes. More education also makes one’s job prospects more secure, so better-educated Americans have less fear of losing their wages or jobs to immigrants.\n\nIn playing to his base, Trump is of course tapping into one of the most familiar motifs of American history: the visceral fear that the white working class has long held for nonwhite immigrants. Such fears are reaching a new crescendo as the United States shifts from being a majority-white (non-Hispanic) society to a white-minority society. According to the Census Bureau, by around 2044 the white, non-Hispanic population will become less than half of the total population for the first time in the nation’s history. White House chief strategist Stephen Bannon and the Breitbart crowd are actively promoting immigration bans, deportations, heavy police tactics, and other fearmongering to try to shift this demographic trend before it is “too late” for the white, non-Hispanic majority.\n\nThe long history of the United States is of two white classes, a rich elite (one that originally included the slave-owning class) and a hardscrabble working class that takes solace in their social status remaining above that of even more desperate African-Americans, Native Americans, and other minorities. Rich whites have long sought the political allegiance of poor whites by promising to keep minority groups from rising too far, too fast in economic, social, and political terms. The goal of the elites has been to forestall a class-based politics in which poor whites and poor minority groups actually join together to demand redistribution from the rich. In this the rich have been remarkably cynical and remarkably successful.\n\nIt is no accident that the very first naturalization legislation of the United States, the 1790 Naturalization Act, limited naturalized citizenship to “free white persons of good character,” thereby excluding Africans, Native Americans, and, later, Asians. Forty years later, in 1830, Andrew Jackson, the president to whom Trump is most often compared in terms of personality and temperament, signed the Indian Removal Act. This act began the ethnic cleansing of the Southeastern United States (east of the Mississippi) with the forced resettlement of the Cherokee Nation along the deadly Trail of Tears to Oklahoma. Poor white farmers as well as large land owners (including Jackson himself) grabbed the land dispossessed from the departing Cherokee. Thousands of Cherokees died in this act of stunning barbarity and cruelty. These expulsions were followed by further acts of war and genocide, until the Native populations were entirely conquered or eliminated by the end of the 19th century.\n\nIn 1882, President Chester Arthur signed the China Exclusion Act, designed to prevent the “yellow hordes” of Asia from becoming the next threat to the white homeland. The act barred Chinese “skilled and unskilled laborers and Chinese employed in mining.” Chinese families were divided between those in the United States and those still back in China. Chinese living in the United States who sought to visit their families back in China were told that they would not be allowed to return. Senator George Frisbie Hoar of Massachusetts declared the act to be “nothing less than the legalization of racial discrimination.”\n\nAdvertisement\n\nThe Chinese Exclusion Act was a watershed, as it opened up more than 80 years of immigration policy based on the national origin of immigrants, a policy not unlike Trump’s travel ban. By the early 1900s, the racial fears shifted from Chinese immigration, now suppressed, to Jews and rural poor flooding in from Eastern and Southern Europe. This new immigration was squelched by the 1924 Immigration Act, which established immigration quotas according to national origin, with the number of immigrants allowed from each country based on the foreign-born residents in the United States as of 1890.\n\nFor the years 1925-27, for example, the total number of immigrants was capped at 164,667 arrivals, roughly one-fifth of the annual immigrant arrivals in the period before World War I. Of those 164,667 slots, 86.5 percent were reserved for Northern European immigrants, with more than half of that total reserved for immigrants from Germany and the United Kingdom. Only 11.2 percent of the total could come from Southern and Eastern Europe. And the total number of migrants from all the rest of the world, including Latin America, Africa, and Asia, was capped at just 3,745 per year, or 2.3 of the total immigrants allowed entry to the United States.\n\nThe 1924 Immigration Act, in short, achieved two goals: first, to reduce dramatically the total arrival of new immigrants, and second, to ensure that almost 90 percent of the immigrants let in to the United States were from Northern Europe.\n\nDuring this process, there was an attentive and approving observer abroad, Adolf Hitler. Hitler praised the new US immigration policy in “Mein Kampf,” writing among other things, that “There is currently one state in which one can observe at least weak beginnings of a better conception. This is of course not our exemplary German Republic, but the American Union, in which an effort is being made to consider the dictates of reason to at least some extent. The American Union categorically refuses the immigration of physically unhealthy elements, and simply excludes the immigration of certain races. In these respects, America already pays obeisance, at least in tentative first steps, to the characteristic völkich conception of the state.”\n\nIn fact, in the 1930s the Nazi lawyers looked to various aspects of US racial legislation — including the immigration codes based on country of national origin, the second-class citizenship of African-Americans, the noncitizenship of colonial subjects such as Filipinos and Puerto Ricans, and the nonnational status of Native Americans — as role models for Germany’s race-based citizenship, which of course culminated in the Nuremberg Codes. This point has been valiantly, if painfully, documented by the Yale legal historian James Whitman, in his new book, “Hitler’s American Model: The United States and the Making of Nazi Race Law.” Whitman’s point, of course, is not that the United States caused the Nazi crimes; it is that the US racial approach resonated with the Nazi racists.\n\nThe 1924 Immigration Act mostly closed America’s doors and kept them closed for decades, even when Europe’s Jews were desperately pleading for entry to the United States to save their lives. It was not until the 1965 Immigration and Nationality Act that the United States eventually relented on national origin. In the revised framework, which has now been the core of US immigration law for a half-century, family and personal connections, and special categories of immigrants, were added to the immigrant roster, and the overall number of immigrants per year was expanded.\n\nNot only did US immigration increase markedly, but it also shifted from Northern Europe to Latin America and Asia. Overall, the foreign-born population of the United States, which had fallen from around 13 percent of the US population in the 1920 census to as low as 4.7 percent of the US population in 1970, has now risen to around 14 percent of the US population, with nearly 40 percent of the foreign-born now from Mexico and Central America.\n\nTrump’s appeal to the white working class has combined the fears of Middle East terrorism with the white, working-class backlash against the rising Hispanic population. He has added in anti-Chinese hysteria as well. In the good old American tradition of the elite class, the one thing Trump has never suggested is the idea that America’s super-rich might somehow help America’s poor. Fomenting fear is a lot cheaper for America’s elites.\n\nRather than slamming doors shut on the basis of religion or nation of origin, we should be insisting that the United States remain an open society, welcoming students and visitors from all parts of the world; enabling migration, subject to law and in reasonable numbers per year, from all parts of the world; accepting refugees fleeing for their lives, until their homelands are restored to peace and they can return safely; and policing our borders so that we enjoy the benefits of a law-based, safe, and responsible immigration policy.\n\nLike Canada, the United States should limit the number of long-term immigrants per year and enforce the limits, but the limits should be reasonable and nondiscriminatory against any single religion, and should balance several objectives: family unification, job skills, business opportunities and needs, geographical diversity, caregivers, hardship cases, and other considerations. The reason for limits is clear: without them, literally hundreds of millions, perhaps billions of people would decamp for the high-income countries. Still, limiting immigration should not mean zero immigration, nor immigration on the basis of disfavored religions, races, or regions.\n\nCanada sets a goal of around 300,000 new immigrants each year, roughly 0.85 percent of the population, allocated across several distinct objectives. For the United States, current arrivals per year are around 1.4 million, or roughly 0.43 of the population, about half the immigration rate aimed for by Canada. Whether the US targets the lower or upper end of this range, it has the wherewithal to accept more refugees and to welcome people from all parts of the world.\n\nAmerica’s Muslim and Hispanic populations are especially fearful these days. It’s everyone’s job as citizens to defend their rights, their safety, their dignity, and their well-being. In this season, the Jewish Passover reminds us of a vital truth: “You shall not oppress a stranger, for you know the feelings of the stranger, having yourselves been strangers in the land of Egypt.”\n\nJeffrey D. Sachs is University Professor and director of the Center for Sustainable Development at Columbia University, and author of “The Age of Sustainable Development.”", "authors": ["Jeffrey D. Sachs"], "publish_date": "2017-03-19", "source": "bostonglobe", "top_words": ["population", "trump", "ban", "immigrants", "immigration", "act", "united", "trumps", "history", "states", "muslim", "white", "american", "americans"], "summary": "Some observers have argued that the Muslim ban skips any Muslim-majority country where Trump has business interests.\nIt is even more hateful to do so when the United States has been the key instigator of the wars that the refugees are trying to flee.\nYet the United States has the audacity to close the doors to any and all victims of the violence.\nTrauma was trauma, and the United States needed to respond with war, against somebody.\nSuch fears are reaching a new crescendo as the United States shifts from being a majority-white (non-Hispanic) society to a white-minority society."}