{"url": "https://www.bostonglobe.com/news/nation/2017/06/29/hawaii-files-court-challenge-avoid-travel-ban/cOVy8Xdwt2Ll84mEf5zcGN/story.html", "id": "62", "title": "Hawaii files court challenge to avoid travel ban", "text": "Hawaii has filed a court challenge to the Trump administration’s limitations on the family relationships people from six mostly Muslim countries need to claim to avoid a travel ban.\n\nThe US Supreme Court on Monday exempted people from the ban if they can prove a ‘‘bone fide’’ relationship with a US citizen or entity. The Trump administration had said the exemption would apply to citizens of Syria, Sudan, Somalia, Libya, Iran and Yemen with a parent, spouse, child, adult son or daughter, son-in-law, daughter-in-law or sibling already in the U.S.\n\nHawaii filed an emergency motion Thursday asking a federal judge to clarify that the administration cannot enforce the ban against fiancés or relatives not defined by the administration guidelines.\n\nAdvertisement\n\nUS District Judge Derrick Watson did not immediately issue a ruling.", "authors": ["Associated Press"], "publish_date": "2017-06-29", "source": "bostonglobe", "top_words": ["travel", "hawaii", "avoid", "trump", "ban", "challenge", "yemen", "judge", "court", "files", "ushawaii", "filed", "watson", "administration"], "summary": "Hawaii has filed a court challenge to the Trump administration’s limitations on the family relationships people from six mostly Muslim countries need to claim to avoid a travel ban.\nThe US Supreme Court on Monday exempted people from the ban if they can prove a ‘‘bone fide’’ relationship with a US citizen or entity.\nThe Trump administration had said the exemption would apply to citizens of Syria, Sudan, Somalia, Libya, Iran and Yemen with a parent, spouse, child, adult son or daughter, son-in-law, daughter-in-law or sibling already in the U.S.Hawaii filed an emergency motion Thursday asking a federal judge to clarify that the administration cannot enforce the ban against fiancés or relatives not defined by the administration guidelines.\nAdvertisementUS District Judge Derrick Watson did not immediately issue a ruling."}