{"url": "https://www.bostonglobe.com/news/politics/2017/07/19/supreme-court-says-trump-administration-can-enforce-refugee-ban-for-now/rRS62Y8JOMpXLHRkV2Fu1K/story.html", "id": "79", "title": "Supreme Court says Trump administration can enforce refugee ban for now", "text": "WASHINGTON — The Supreme Court says the Trump administration can strictly enforce its ban on refugees, but at the same time is leaving in place a weakened travel ban that includes grandparents among relatives who can help visitors from six mostly Muslim countries get into the U.S.\n\nThe justices acted Wednesday on the administration’s appeal of a federal judge’s ruling last week. U.S. District Judge Derrick Watson ordered the government to allow in refugees formally working with a resettlement agency in the United States. Watson also vastly expanded the family relations that refugees and visitors can use to get into the country.\n\nThe high court blocked Watson’s order as it applies to refugees for now, but not the expanded list of relatives. The justices said the federal appeals court in San Francisco should now consider the appeal. It’s not clear how quickly that will happen.\n\nAdvertisement\n\nIn the meantime, though, up to 24,000 refugees who already have been assigned to a charity or religious organization in the U.S. will not be able to use that connection to get into the country.\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n‘‘This ruling jeopardizes the safety of thousands of people across the world including vulnerable families fleeing war and violence,’’ said Naureen Shah, Amnesty International USA’s senior director of campaigns.\n\nThat part of the court’s ruling was a victory for President Donald Trump, who rolled out a first ban on travelers and refugees after just a week in office, prompting a legal fight that has raged ever since.\n\nBut the Supreme Court also denied the administration’s request to clarify its ruling last month that allowed the administration to partially reinstate a 90-day ban on visitors from Iran, Libya, Somalia, Sudan, Syria and Yemen and a 120-day ban on refugees from anywhere in the world.\n\nThe court’s ruling exempted a large swath of refugees and travelers with a ‘‘bona fide relationship’’ with a person or an entity in the U.S. The justices did not define those relationships but said they could include a close relative, a job offer or admission to a college or university.\n\nAdvertisement\n\nWatson’s order added grandparents, grandchildren, brothers-in-law, sisters-in-law, aunts, uncles, nieces, nephews and cousins to a list that already included a parent, spouse, fiance, son, daughter, son-in-law, daughter-in-law or sibling in the U.S. The expanded list of relatives remains in effect, and the State Department already has instructed diplomats to use the broader list when considering visa applicants from the six countries.\n\nHawaii Attorney General Doug Chin said the court’s order Wednesday ‘‘confirms we were right to say that the Trump administration over-reached in trying to unilaterally keep families apart from each other.’’\n\nJustices Samuel Alito, Neil Gorsuch and Clarence Thomas would have blocked Watson’s order in its entirety. Those same three justices said last month they would have allowed the Trump travel ban to take full effect.\n\nAlso on Wednesday, the court scheduled argument over the travel ban for October 10, though the 90-day pause will have expired by then.", "authors": ["Mark Sherman", "Associated Press"], "publish_date": "2017-07-19", "source": "bostonglobe", "top_words": ["ruling", "list", "justices", "trump", "visitors", "ban", "supreme", "refugee", "court", "order", "week", "refugees", "enforce", "administration"], "summary": "WASHINGTON — The Supreme Court says the Trump administration can strictly enforce its ban on refugees, but at the same time is leaving in place a weakened travel ban that includes grandparents among relatives who can help visitors from six mostly Muslim countries get into the U.S.\nWatson also vastly expanded the family relations that refugees and visitors can use to get into the country.\nThe high court blocked Watson’s order as it applies to refugees for now, but not the expanded list of relatives.\nThose same three justices said last month they would have allowed the Trump travel ban to take full effect.\nAlso on Wednesday, the court scheduled argument over the travel ban for October 10, though the 90-day pause will have expired by then."}