{"url": "https://www.bostonglobe.com/metro/2017/03/07/hundreds-rally-harvard-square-against-trump-new-travel-ban/ECwYFObvJuMwuFiPcREJyH/story.html", "id": "89", "title": "Hundreds rally in Harvard Square against Trump’s new travel ban", "text": "Hundreds of protesters have gathered in Harvard Square on Tuesday to protest against President Trump’s new travel ban.\n\nCAMBRIDGE, Mass. — Hundreds of protesters have gathered in a plaza at Harvard University to voice opposition to Republican President Donald Trump’s revised travel ban targeting visitors from majority Muslim countries.\n\nThe Harvard Islamic Society, the Society of Arab Students, and other student groups organized the Tuesday night rally at Harvard Square after Trump issued the new executive order Monday. Roughly 300 people turned out holding signs opposed to the order and the Trump administration.\n\nPolice set up a perimeter around the growing crowd. But the event appeared peaceful at its outset. Organizers say they plan to march through the square to a nearby park.\n\nAdvertisement\n\nThe new measure prevents citizens of Syria, Iran, Libya, Somalia, Sudan and Yemen from obtaining U.S. visas for at least 90 days. It also suspends the refugee resettlement process for 120 days.", "authors": ["Associated Press"], "publish_date": "2017-03-07", "source": "bostonglobe", "top_words": ["travel", "trump", "ban", "hundreds", "harvard", "rally", "president", "trumps", "society", "order", "protesters", "square"], "summary": "Hundreds of protesters have gathered in Harvard Square on Tuesday to protest against President Trump’s new travel ban.\n— Hundreds of protesters have gathered in a plaza at Harvard University to voice opposition to Republican President Donald Trump’s revised travel ban targeting visitors from majority Muslim countries.\nThe Harvard Islamic Society, the Society of Arab Students, and other student groups organized the Tuesday night rally at Harvard Square after Trump issued the new executive order Monday.\nRoughly 300 people turned out holding signs opposed to the order and the Trump administration.\nOrganizers say they plan to march through the square to a nearby park."}