{"url": "https://www.bostonglobe.com/news/politics/2017/01/30/trump/tteeta6A6ZhNHdHjCKFTVL/story.html", "id": "91", "title": "Trump fires acting AG after she defies order", "text": "President Trump in the Oval Office of the White House on Monday.\n\nWASHINGTON — In an extraordinary series of events, President Trump fired the acting US attorney general Monday night and replaced her with another appointee after she refused to defend his executive order on immigration in court.\n\nThe back-to-back developments began when Sally Yates — a holdover from the Obama administration filling in until the Senate takes a confirmation vote on Trump’s nominee, Jeff Sessions — defied Trump by announcing that she did not believe the immigration order was defensible in court.\n\nWithin hours, Trump fired her and asserted his control over the agency, replacing her with a more supportive US attorney from Virginia.\n\nAdvertisement\n\nThe White House said Yates “has betrayed the Department of Justice.’’\n\nGet This Week in Politics in your inbox: A weekly recap of the top political stories from The Globe, sent right to your email. Sign Up Thank you for signing up! Sign up for more newsletters here\n\n“Ms. Yates is an Obama administration appointee who is weak on borders and very weak on illegal immigration,’’ the White House said in a statement Monday night.\n\nThe latest turmoil came as protests mounted worldwide and in the United States against Trump’s order closing US borders to all immigrants from seven majority Muslim countries as well as all refugees worldwide.\n\nHouse and Senate Democrats marched out of the Capitol en masse Monday night and held a vigil outside the Supreme Court. Meanwhile, protesters continued to gather at airports around the country, and Barack Obama weighed in with his first public comments since leaving office.\n\nIn refusing to defend the order, Yates issued a strong statement of dissent.\n\nAdvertisement\n\n“I am responsible for ensuring that the positions we take in court remain consistent with this institution’s solemn obligation to always seek justice and stand for what is right,” Yates, a career federal prosecutor from Georgia, wrote in a letter to the agency’s attorneys. “At present, I am not convinced that the defense of the executive order is consistent with these responsibilities, nor am I convinced that the executive order is lawful.”\n\nTrump replaced Yates with Dana Boente, the US attorney for the Eastern District of Virginia, who was named to his post by Obama. His temporary post as the nation’s top law enforcement official may last just a few days.\n\n“I am honored to serve President Trump in this role until Senator Sessions is confirmed. I will defend and enforce the laws of our country to ensure that our people and our nation are protected,” the White House statement quoted Boente as saying.\n\nThe events immediately drew comparisons to President Richard Nixon’s ‘‘Saturday Night Massacre,’’ when Attorney General Elliot Richardson and the deputy attorney general resigned rather than follow an order to fire a special prosecutor investigating the Watergate scandal.\n\nThe Senate Judiciary Committee is scheduled to vote on Sessions’ nomination Tuesday morning, which could set up a vote by the full Senate on Friday. Democrats have been calling for a delay on the vote, but they would need Republicans to join in that call.\n\nAdvertisement\n\nWith world leaders, US diplomats, and the chief executive of Ford Motor Co. also criticizing the executive order on immigration, the White House defended the decision Monday by claiming the need for enhanced national security.\n\nJ. David Ake/Associated Press/File 2016 Acting attorney general Sally Yates, fired later Monday, said that she was not “convinced that the executive order is lawful.”\n\nThe order, which was signed Friday, tested the powers of the presidency. Multiple federal courts, including one in Boston, ruled against parts of the directive in preliminary orders over the weekend. As members of Congress returned to Washington Monday, they called his moves unconstitutional, un-American, and poorly coordinated, raising sharp questions about the spirit behind the bans but also about White House competence.\n\nDemocrats were united in opposing Trump’s order and introduced legislation to upend it. Republicans were more muted — particularly the House and Senate GOP leadership — but a growing number from the president’s own party said he acted rashly and in a way that runs counter to his stated goal of making the country safe.\n\nSenator Dianne Feinstein, a California Democrat and the ranking member on the Senate Intelligence Committee, accused the Trump administration of being in contempt of a court’s temporary restraining order. Citing a case from California, Feinstein said the administration ignored a stay and sent a student intercepted in Los Angeles back to her home country even though she had a valid student visa.\n\nWhile introducing a bill to repeal Trump’s executive order, she said that it not just violated bedrock American values but was executed so poorly that it sowed further “chaos and confusion.’’ Government officials from high-ranking administration personnel to individual customs agents at the nation’s airports struggled to apply the rules during the weekend.\n\nTrump lashed out early Monday, saying the news media was blowing the situation out of proportion. In the morning, he even falsely blamed Delta for the delays.\n\n“Only 109 people out of 325,000 were detained and held for questioning,” he wrote on Twitter at 7:16 a.m. “Big problems at airports were caused by Delta computer outage.”\n\nThe computer issues occurred for about five hours on Sunday night, long after Trump’s order was implemented and after those with green cards and visas were detained as they arrived at US airports.\n\nTrump also criticized Senate minority leader Charles Schumer for tearing up on Sunday when he stood with immigrants and called Trump’s decision “mean spirited and un-American.”\n\n“I noticed Chuck Schumer yesterday with fake tears,” Trump told reporters at the start of a meeting with business leaders. “I’m going to ask him who is his acting coach.”\n\nDuring an hourlong briefing, White House press secretary Sean Spicer was peppered with questions about the executive order.\n\n“The president’s going to be very proactive with protecting this country,” he said. “We’re not going to wait until we get attacked and figure out how we can make sure it doesn’t happen again. ”\n\nAsked about the abrupt imposition of the new restrictions, Spicer said there was no specific threat that prompted Trump’s signing of the order.\n\nA key point of confusion was over foreigners who are permanent residents with green cards. Numerous green card holders were detained at airports Saturday and Sunday. On Sunday, Trump’s chief of staff, Reince Priebus, said on “Meet the Press” that green card holders would not be affected, apparently walking back a controversial element of the executive order.\n\nBut Senator Tim Kaine, a Virginia Democrat, said he was told by Department of Homeland Security officials that people with valid green cards still were being detained and then given a waiver if agents could determine they posed no threat to the United States.\n\nA spokesman for Obama said that the former president “fundamentally disagrees with the notion of discriminating against individuals because of their faith or religion.” He also indicated support for the protests.\n\nChancellor Angela Merkel of Germany denounced the order, saying that it “runs counter to the basic idea of international refugee aid and to international cooperation.”\n\n“The necessary, resolute fight against terrorism in no way justifies a blanket suspicion against people of a certain faith — in this case Muslims — or a certain origin,” Merkel said.\n\nSenator Edward J. Markey, the Massachusetts Democrat, said his party is “100 percent united in opposition to this executive order.”\n\nMarkey and other Democrats are also calling on the Senate GOP leadership to delay a vote on Trump’s nominee for secretary of state, Rex Tillerson, until he answers questions about the latest executive order.\n\nWhile Democrats charge that Trump’s order violates the Constitution, Republican critics for the most part stopped short of that accusation. The harshest GOP attacks focused more on criticism that Trump’s order goes against American values, puts the country at increased terrorist risk, and was poorly considered and crafted.\n\n“I am deeply troubled by the appearance of [a] religious ban,” Senator Dean Heller, a Republican from Nevada, wrote on Twitter. “The use of an overly broad executive order is not the way to strengthen national security. I encourage the administration to partner with Congress to find a solution.”\n\nSenator John McCain, a Republican from Arizona, said that he was worried about Iraqi pilots who are trained in Tucson, and he remained concerned over interpreters who have helped American troops.\n\n“I worry a lot about our interpreters who literally put their lives in danger when they’re not allowed to come to the United States,” he said.\n\nSenator Susan Collins of Maine said Trump should have worked with relevant agencies including the Department of Homeland Security, Department of Justice, Department of State, and Department of Defense.\n\n“Those are the entities whose advice he should have sought so that he could thoroughly vet the implications of the order,” she said.\n\nWhen asked whether Congress should take action to revise the order, Collins said she hopes it will be worked out through the courts and the Trump administration.\n\nGlobe correspondent Tyler Pager contributed to this report. Victoria McGrane can be reached at victoria.mcgrane@globe.com . Follow her on Twitter @vgmac . Matt Viser can be reached at matt.viser@globe.com . Follow him on Twitter @mviser", "authors": ["Globe Staff"], "publish_date": "2017-01-30", "source": "bostonglobe", "top_words": ["executive", "trump", "ag", "house", "trumps", "department", "white", "acting", "country", "yates", "order", "fires", "senate", "defies"], "summary": "In refusing to defend the order, Yates issued a strong statement of dissent.\nDemocrats were united in opposing Trump’s order and introduced legislation to upend it.\n“I’m going to ask him who is his acting coach.”During an hourlong briefing, White House press secretary Sean Spicer was peppered with questions about the executive order.\nWhile Democrats charge that Trump’s order violates the Constitution, Republican critics for the most part stopped short of that accusation.\n“The use of an overly broad executive order is not the way to strengthen national security."}