{"url": "https://www.bostonglobe.com/news/nation/2017/06/30/court-fights-travel-ban-expected/4Y9txaY4b0OmOU595nMUOM/story.html", "id": "96", "title": "Court fights on travel ban expected", "text": "Marwa Rifahie, an attorney with the Council on American-Islamic Relations, answered questions at Los Angeles International Airport on Friday.\n\nWASHINGTON — A scaled-back version of President Trump’s travel ban is now in force, stripped of provisions that brought protests and chaos at airports worldwide in January yet still likely to generate a new round of court fights.\n\nThe new rules, the product of months of legal wrangling, aren’t so much an outright ban as a tightening of already-tough visa policies affecting citizens from six Muslim-majority countries. Refugees are covered, too.\n\nImplementation of the new rules started Thursday night. Customs and Border Protection reported no immediate disturbances Friday, with valid visa holders able to travel.\n\nAdvertisement\n\nStill, immigration and refugee advocates are vowing to challenge the new requirements. They said the State Department has defined “family ties’’ too narrowly and the administration has not fully explained how the rules will make the United States safer.\n\nGet Ground Game in your inbox: Daily updates and analysis on national politics from James Pindell. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe state of Hawaii has filed an emergency motion asking a federal judge to clarify that the Supreme Court ruling did not intend to ban relatives such as grandparents, aunts, or uncles, who are not included in the State Department’s definition of ‘‘bona fide’’ personal relationships.\n\nThe American Civil Liberties Union, one of the groups challenging the ban, called the new criteria ‘‘extremely restrictive,’’ “arbitrary’’ in their exclusions, and designed to ‘‘disparage and condemn Muslims.’’\n\nIn Iran, Foreign Minister Mohammad Javad Zarif denounced the partial reinstatement of the travel ban as a ‘‘truly shameful exhibition of blind hostility to all Iranians’’ — and argued that the measure will prevent Iranian grandmothers from seeing their grandchildren in America.\n\nZarif, who has persistently assailed the travel ban, wrote on his Twitter account that the ‘‘U.S. now bans Iranian grandmothers from seeing their grandchildren, in a truly shameful exhibition of blind hostility to all Iranians.’’\n\nAdvertisement\n\nUnder the temporary rules, citizens of Syria, Sudan, Somalia, Libya, Iran, and Yemen who already have visas will be allowed into the United States. But people from those countries who want new visas will have to prove a close family relationship or an existing relationship with an entity like a school or business in the United States.\n\nIt’s unclear how significantly the new rules will affect travel. In most of the countries singled out, few people have the means for leisure travel. Those that do already face intensive screenings before being issued visas.\n\nMuch of the confusion in January, when Trump’s first ban took effect, resulted from travelers with previously approved visas being kept off flights or barred entry on arrival in the United States. Immigration officials were instructed Thursday not to block anyone with valid travel documents and otherwise eligible to visit the United States.\n\nKaren Tumlin, legal director of the National Immigration Law Center, said the rules ‘‘would slam the door shut on so many who have waited for months or years to be reunited with their families.’’\n\nTrump, who made a tough approach to immigration a cornerstone of his election campaign, issued a ban on travelers from the six countries, plus Iraq, shortly after taking office in January. His order also blocked refugees from any country.\n\nAdvertisement\n\nTrump said these were temporary measures needed to prevent terrorism until vetting procedures could be reviewed. Opponents noted that visa and refugee vetting were already strict and said there was no evidence that refugees or citizens of those six countries posed a threat. They saw the ban as part of Trump’s campaign promise to bar Muslims from entering the United States.\n\nThe rules ‘would slam the door shut on so many who have waited for months or years to be reunited with their families.’\n\nLower courts blocked the initial ban and a second, revised Trump order intended to overcome legal hurdles. The Supreme Court on Monday partially reinstated the revised ban but exempted travelers who could prove a ‘‘bona fide relationship’’ with a US person or entity. The court offered only broad guidelines.\n\nIn guidance issued late Wednesday, the State Department said the personal relationships would include a parent, spouse, son, daughter, son-in-law, daughter-in-law, or sibling already in the United States.\n\nIt does not include other relationships such as grandparents, grandchildren, aunts, and uncles. On Thursday, the State and Homeland Security departments expanded the range of bona fide relationships to include fiancés.\n\nBusiness or professional links must be ‘‘formal, documented, and formed in the ordinary course rather than for the purpose of evading’’ the ban. Journalists, students, workers, or lecturers who have valid invitations or employment contracts in the United States would be exempt from the ban.\n\nThe exemption does not apply to those who seek a relationship with an American business or educational institution purely for the purpose of avoiding the rules.\n\nRefugees from any country will face similar requirements. But the United States has almost filled its quota of 50,000 refugees for the budget year ending in September and the new rules won’t apply to the few remaining slots. With the Supreme Court set to consider the overall ban in October, the rules could change again.\n\nThe travel ban may have the biggest impact on Iranians. In 2015, the most recently available data, nearly 26,000 Iranians were allowed into the United States on visitor or tourist visas. Iranians made up the lion’s share of the roughly 65,000 foreigners from the six countries who visited with temporary, or non-immigrant visas that year.\n\nThe new regulations are also affecting the wedding plans of Rama Issa-Ibrahim, executive director of the Arab American Association of New York.\n\nShe is Syrian-American and had planned to get married this fall. Although her father in Syria may be able to get a visa, her aunts and uncles may well be blocked.\n\n‘‘I would love for them to be at this wedding, and unfortunately, they aren’t going to be able to be here,’’ she said, adding that the ceremony would be postponed.", "authors": ["Matthew Lee", "Associated Press"], "publish_date": "2017-06-30", "source": "bostonglobe", "top_words": ["travel", "ban", "visas", "state", "fights", "rules", "court", "united", "countries", "expected", "states", "visa"], "summary": "WASHINGTON — A scaled-back version of President Trump’s travel ban is now in force, stripped of provisions that brought protests and chaos at airports worldwide in January yet still likely to generate a new round of court fights.\nZarif, who has persistently assailed the travel ban, wrote on his Twitter account that the ‘‘U.S.\nImmigration officials were instructed Thursday not to block anyone with valid travel documents and otherwise eligible to visit the United States.\nThey saw the ban as part of Trump’s campaign promise to bar Muslims from entering the United States.\nThe travel ban may have the biggest impact on Iranians."}