{"url": "https://www.bostonglobe.com/opinion/editorials/2017/04/25/days-trump-travel-ban-still-looks-like-bigotry/f83yhECwFLmzE45v5jbcQM/story.html", "id": "9", "title": "90 days in, Trump’s travel ban still looks like bigotry", "text": "Protesters carry rafts, signifying the struggle of refugees, during a protest in New York City in March against the Trump administration's proposed travel ban and refugee policie.\n\nThe hoopla surrounding the upcoming 100th day of President Trump’s administration obscures a much more damning milestone in the young presidency. On Thursday, it will have been 90 days since the president issued his first travel ban aimed at residents of seven predominantly Muslim countries.\n\nAnd that day, unlike the traditional 100-day mark, isn’t an arbitrary juncture to assess the president’s record. The executive order itself set 90 days as the initial time frame for the ban. When it was announced, Trump said the travel ban was intended to buy time, to figure out “what the hell is going on” and allow the administration to craft its new, double-secret, extreme vetting.\n\nThe administration didn’t get its ban. But it has had its 90 days. If the Trump administration really intended to toughen vetting standards, nothing about any of the court orders striking down the ban has stopped it from delivering on that promise.\n\nAdvertisement\n\nInstead, the administration’s failure to make any meaningful changes to entry procedures in that time merely confirms what was obvious when it first started causing chaos at airports in January: The ban was for show, a publicity stunt that accomplished nothing and was probably never intended to.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThe verdict on the rest of the Trump administration might still be forming, but the verdict on the travel ban is in: It was a cynical act of bigotry and pandering to Trump’s electoral base, rightly blocked by federal courts. Trump’s own words during the campaign, when he promised to ban Muslims from entering the country, helped opponents of the ban prove its illegally discriminatory intent.\n\nAnd the stunt came at a cost — measured in cancelled travel to the United States, lost business, disrupted lives. Most of all, it weakened whatever remained of America’s moral standing in the world.\n\nThis being Trump, though, we probably haven’t heard the last of the travel ban. If the president has proved anything, it’s that he always needs someone other than himself to blame if something goes wrong. In the event of a terrorist attack in the United States, it’s disturbingly easy to imagine the president blaming the federal courts who blocked his travel ban.\n\nIt will be up to his political opponents to make the case, as loudly as possible, that Trump has had all the time he wanted to figure out what the hell is going on and make any necessary changes. The fact the president and his administration now have so little to show for it not only reinforces doubts about the ban’s motives all along, but also removes any excuse Trump might try to offer for any failures that occur on his watch.", "authors": [], "publish_date": "2017-04-25", "source": "bostonglobe", "top_words": ["bigotry", "travel", "administration", "trump", "ban", "days", "intended", "verdict", "trumps", "president", "90", "looks"], "summary": "Protesters carry rafts, signifying the struggle of refugees, during a protest in New York City in March against the Trump administration's proposed travel ban and refugee policie.\nThe hoopla surrounding the upcoming 100th day of President Trump’s administration obscures a much more damning milestone in the young presidency.\nOn Thursday, it will have been 90 days since the president issued his first travel ban aimed at residents of seven predominantly Muslim countries.\nThe executive order itself set 90 days as the initial time frame for the ban.\nBut it has had its 90 days."}