{"url": "https://www.bostonglobe.com/opinion/editorials/2017/01/28/trump-shameful-ban-visas-for-iraqis/mfHYezpP9mIbfghCZWfr6K/story.html", "id": "98", "title": "Trump’s shameful ban on visas for Iraqis", "text": "Hib Al Ogaidi (left), who moved from Baghdad, spoke during an English class in Lincoln, Neb. Ogaidi’s family came to the United States on a visa after her husband worked for the US military in Iraq.\n\nTHOUSANDS OF IRAQIS put their lives in peril for the United States, and President Trump’s new ban on visas for Iraqis is a shameful way to repay them. If he is confirmed by the Senate, Secretary of State nominee Rex Tillerson must quickly find a way to undo Trump’s disastrous ban, and seek to contain the damage it’s already doing to America’s reputation.\n\nTrump said during the campaign that he would bar Muslims from entering the nation, an idea that turned into the visa ban. In his executive order, Trump ordered the State Department to temporarily stop granting visas to residents of seven predominantly Islamic countries — including Iraq. The announcement set off mass confusion at airports, an outcry from businesses whose foreign-born employees suddenly couldn’t travel safely, and a wave of protests including a large rally Sunday in Copley Square.\n\nThe entire policy is offensive, since it scapegoats all Muslims for the actions of a small number of extremists. Residents of Muslim countries are the main victims of terrorism. But extending the ban to Iraq, the country whose people and freedoms so many pro-war politicians claimed to care about when they needed a justification for the 2003 war, is especially appalling.\n\nAdvertisement\n\nThe truth is that no American has ever been killed by an Iraqi terrorist on American soil. Iraq and the United States are allies, bound by a strategic framework agreement. Many Iraqis worked for the United States during the postwar occupation, at great personal risk. And the US government — which now means you, Mr. Trump — is relying on Iraqi soldiers in the fight against ISIS.\n\nGet Truth and Consequences in your inbox: Michael A. Cohen takes on the absurdities and hypocrisies of the current political moment. Sign Up Thank you for signing up! Sign up for more newsletters here\n\nThat Trump’s policy covers Iraq, but not Saudi Arabia — a nation whose residents actually have killed thousands of Americans in terrorist attacks — underscores just how little rhyme or reason went into the policy.\n\nBut while it doesn’t protect Americans, Trump’s visa ban does hand a propaganda victory to ISIS, appearing to vindicate the claim that the United States is out to get Muslims. It undercuts the alliance with Iraq, where some legislators are now suggesting barring Americans in retaliation. (Wonder how that would go over with Tillerson’s former employer, Exxon, which has contracts in Iraq?) It risks chilling economic, political, and even military ties. How eager are Iraqi soldiers supposed to be about fighting with an ally whose actions blare a message that it doesn’t trust them?\n\nThe policy already appeared to be collapsing over the weekend, as federal judges blocked parts of it and the White House appeared to reverse itself on whether it applied to green card holders. But defenders of American values need to keep up the pressure. Tillerson, who said in his confirmation hearings that he opposed a travel ban on Muslims, has done business in the Arab world and surely understands why Trump’s ban is so counterproductive. It would be best to scrap the whole policy, but at the very least the State Department should make an immediate exception for the people of Iraq.", "authors": [], "publish_date": "2017-01-28", "source": "bostonglobe", "top_words": ["residents", "ban", "visas", "state", "iraq", "iraqis", "united", "trumps", "shameful", "states", "muslims", "policy", "visa"], "summary": "THOUSANDS OF IRAQIS put their lives in peril for the United States, and President Trump’s new ban on visas for Iraqis is a shameful way to repay them.\nTrump said during the campaign that he would bar Muslims from entering the nation, an idea that turned into the visa ban.\nMany Iraqis worked for the United States during the postwar occupation, at great personal risk.\nBut while it doesn’t protect Americans, Trump’s visa ban does hand a propaganda victory to ISIS, appearing to vindicate the claim that the United States is out to get Muslims.\nTillerson, who said in his confirmation hearings that he opposed a travel ban on Muslims, has done business in the Arab world and surely understands why Trump’s ban is so counterproductive."}