{"url": "http://www.latimes.com/newsletters/politics/bs-ed-travel-ban-20170306-story.html", "id": "122", "title": "Trump's new travel ban, just as damaging as the first", "text": "A federal judge from Washington State halted implementation of the ban pending further legal proceedings, and an appellate court agreed. The courts found clear evidence of discriminatory intent on the president's part — not just from campaign talk of a Muslim ban but also from his promises to expedite entry for Middle Eastern Christians — and no evidence that the policy was tailored to address any particular threat. Indeed, an internal Department of Homeland Security assessment, first reported by the Associated Press, undercut the national security rationale for the policy. It found \"country of citizenship is unlikely to be a reliable indicator of potential terrorist activity,\" that terrorist groups in most of the affected countries are focused regionally and not on the U.S., and that those who have carried out attacks against the U.S. come from a wide array of other countries with very little threat from those seven.", "authors": [], "publish_date": "2017-03-06", "source": "latimes", "top_words": ["wide", "travel", "ban", "security", "evidence", "unlikely", "terrorist", "trumps", "countries", "washington", "policy", "damaging", "threat"], "summary": "A federal judge from Washington State halted implementation of the ban pending further legal proceedings, and an appellate court agreed.\nThe courts found clear evidence of discriminatory intent on the president's part — not just from campaign talk of a Muslim ban but also from his promises to expedite entry for Middle Eastern Christians — and no evidence that the policy was tailored to address any particular threat.\nIndeed, an internal Department of Homeland Security assessment, first reported by the Associated Press, undercut the national security rationale for the policy.\nIt found \"country of citizenship is unlikely to be a reliable indicator of potential terrorist activity,\" that terrorist groups in most of the affected countries are focused regionally and not on the U.S., and that those who have carried out attacks against the U.S. come from a wide array of other countries with very little threat from those seven."}