{"url": "http://www.latimes.com/newsletters/la-me-todays-headlines-20170925-story.html", "id": "19", "title": "Today: Travel Ban 3.0: This Time It’s Indefinite", "text": "They knelt. They linked arms. They stayed in the locker room. Across the NFL, as the national anthem was sung on Sunday, players and some owners had a message for President Trump: You can’t tell us what to do. This unusual 1st Amendment discussion started Friday night at a political rally, when Trump said, “Wouldn’t you love to see one of these NFL owners, when somebody disrespects our flag, you’d say, ‘Get that son of a bitch off the field right now. Out! He’s fired.’ ” Then, on Twitter, the president took the ball and ran with it, including lashing out at NBA star Stephen Curry for saying he didn’t want to visit the White House. But just as many business leaders backed off Trump because of his response to a white-supremacist march in Charlottesville, Va., so too did many NFL owners this time, including two who donated $1 million each to his inauguration. In the parking lot of StubHub Center in Carson, fans had some things to say on both sides of the debate.", "authors": [], "publish_date": "2017-09-25", "source": "latimes", "top_words": ["travel", "nfl", "trump", "whitesupremacist", "ban", "including", "indefinite", "youd", "wouldnt", "white", "owners", "today", "president", "30", "say"], "summary": "Across the NFL, as the national anthem was sung on Sunday, players and some owners had a message for President Trump: You can’t tell us what to do.\nThis unusual 1st Amendment discussion started Friday night at a political rally, when Trump said, “Wouldn’t you love to see one of these NFL owners, when somebody disrespects our flag, you’d say, ‘Get that son of a bitch off the field right now.\nHe’s fired.’ ” Then, on Twitter, the president took the ball and ran with it, including lashing out at NBA star Stephen Curry for saying he didn’t want to visit the White House.\nBut just as many business leaders backed off Trump because of his response to a white-supremacist march in Charlottesville, Va., so too did many NFL owners this time, including two who donated $1 million each to his inauguration.\nIn the parking lot of StubHub Center in Carson, fans had some things to say on both sides of the debate."}