{"url": "http://www.latimes.com/opinion/editorials/la-ed-trump-immigration-visas-refugees-20170306-story.html", "id": "118", "title": "Trump's revised travel ban is no less misguided and self-defeating than his previous version", "text": "The new travel ban President Trump signed Monday is no less misguided and damaging to those trying to travel to the U.S., or to those seeking refuge from war-torn regions of the world, than the original. The two new executive orders implementing the ban also show that Trump learned little from the policy debacle of the first go-round. The courts will decide whether he has fixed all of the legal shortcomings with this new, narrower version (the original was put on hold by several federal judges), but it still will disrupt the lives of thousands of people while doing nothing to advance U.S. national security interests. In fact, it feeds into propaganda by Islamic extremists that the Western world is at war with Islam. None of that has changed with this scaled-back version.", "authors": ["The Times Editorial Board"], "publish_date": "2017-03-06", "source": "latimes", "top_words": ["original", "travel", "misguided", "previous", "revised", "world", "ban", "trump", "wartorn", "version", "trumps", "western", "war", "selfdefeating", "trying"], "summary": "The new travel ban President Trump signed Monday is no less misguided and damaging to those trying to travel to the U.S., or to those seeking refuge from war-torn regions of the world, than the original.\nThe two new executive orders implementing the ban also show that Trump learned little from the policy debacle of the first go-round.\nThe courts will decide whether he has fixed all of the legal shortcomings with this new, narrower version (the original was put on hold by several federal judges), but it still will disrupt the lives of thousands of people while doing nothing to advance U.S. national security interests.\nIn fact, it feeds into propaganda by Islamic extremists that the Western world is at war with Islam.\nNone of that has changed with this scaled-back version."}