{"url": "http://www.latimes.com/opinion/editorials/la-ed-trump-immigration-terror-ban-20170209-story.html", "id": "119", "title": "Appeals court blocks Trump’s travel ban. At least one part of the government is still functioning properly", "text": "But absent evidence that the nation faces heightened risk under the current system, it should continue letting people who qualify for visas receive them, and provide asylum for refugees who deserve it. That the nation has not suffered a fatal terror attack by an immigrant from those seven countries since the vetting processes were tightened after 9/11 puts the lie to Trump's panicky assertion that we face a great and imminent peril. Further, as the Cato Institute reported, only 20 of 154 people identified as foreign-born terrorists between 1975 and 2015 came from among the 3.3 million refugees settled here during that time. Those individuals caused the deaths of three victims; although any murder is to be decried, those statistics hardly support the level of alarm we see from our anguished president.", "authors": ["The Times Editorial Board"], "publish_date": "2017-02-09", "source": "latimes", "top_words": ["blocks", "travel", "functioning", "ban", "appeals", "visas", "vetting", "court", "nation", "victims", "tightened", "trumps", "system", "terrorists", "refugees", "terror", "properly"], "summary": "But absent evidence that the nation faces heightened risk under the current system, it should continue letting people who qualify for visas receive them, and provide asylum for refugees who deserve it.\nThat the nation has not suffered a fatal terror attack by an immigrant from those seven countries since the vetting processes were tightened after 9/11 puts the lie to Trump's panicky assertion that we face a great and imminent peril.\nFurther, as the Cato Institute reported, only 20 of 154 people identified as foreign-born terrorists between 1975 and 2015 came from among the 3.3 million refugees settled here during that time.\nThose individuals caused the deaths of three victims; although any murder is to be decried, those statistics hardly support the level of alarm we see from our anguished president."}