{"url": "http://www.latimes.com/nation/la-na-travel-ban-impact-20170630-htmlstory.html", "id": "15", "title": "Who is in and who is out under the revived travel ban", "text": "When the Supreme Court said this week that President Trump ’s travel ban could go into place, it opened the door to a flurry of arguments over exactly who could be blocked from entering the U.S.\n\nThe court’s decision to partially revive the ban — a compromise that allows exceptions for people with “bona fide” U.S. ties to enter before the justices hear arguments on the ban in the fall — has left immigrant groups wrangling over who can bypass the restrictions.\n\nThe revised ban now faces new legal challenges. The state of Hawaii has asked a judge who previously ruled against the ban to say whether the administration is violating the Supreme Court’s instructions. The judge could issue his decision next week.\n\nIn the meantime, the debate rages with the ban in place for the first time since a chaotic rollout in January.\n\nPresident Trump signs the original travel ban executive order on Jan. 27, 2017. (Susan Walsh / AP)\n\nRefugees, as well as nationals of six countries, are not welcome\n\nThe ban covers Iran, Libya, Somalia, Sudan, Syria and Yemen. The administration has said the nations have ties to terrorism, and that it needs 90 days to evaluate security vetting procedures to protect Americans.\n\nIn addition, refugees from any country are barred for four months.\n\nAn original version of the travel ban — signed by Trump on Jan. 27 and later struck down in federal courts — included Iraq on the list of countries. The order indefinitely barred Syrian refugees from entering the U.S. and gave preference to refugees who were religious minorities facing persecution.\n\nThe state of Hawaii and immigrant groups that won lower court injunctions against the travel ban have said the administration is violating the Constitution by targeting those six countries. Most residents of the nations are Muslims, and challengers to the ban say the president has focused on them as part of his campaign promise to suspend all Muslim immigration.\n\nTwo legal challenges to the ban, originating in Hawaii and Maryland, will be heard by the Supreme Court in the fall.\n\nImmigration attorneys set up a table at Los Angeles International Airport as the new travel ban went into effect on Thursday. (Stephen Carr / AP)\n\nPeople with close ties get into U.S. But what’s a close tie?\n\nWhen it allowed a limited version of the travel ban to proceed, Supreme Court justices said the government could not apply it to people who had well-established connections to the U.S.\n\nThe court listed employment, university admission and invitations to lecture — such as at a college — among those connections.\n\nOn Thursday, the departments of State and Homeland Security said people with green cards and visas that were valid before the ban went into effect won’t be affected.\n\nThe same goes for people granted asylum, and those who could claim dual nationality with another country not on the travel ban list. Diplomats, visitors to the United Nations, NATO officials and certain foreign government representatives are also among the exceptions.\n\nSeveral of those categories were added to Trump’s second executive order on travel that was signed in March after the first one saw court setbacks.\n\nA point of contention remains: How to define who has well-established ties to the U.S.\n\nThe administration is now facing criticism from immigrant advocates for its list, released late Thursday, detailing what kinds of family members are “close” enough to escape the travel ban.\n\nSpouses, parents, in-laws and siblings are considered close; grandparents and other relations are not.\n\nInitially, fiances were subject to the ban. After civil rights groups complained, Trump administration officials added fiances to the close-family list right before the ban went into effect.\n\nHow the Trump administration defines “close” family “Close” family that can go around the travel ban A parent, parents-in-law, spouse, child, adult son or daughter, fiancé(e), son-in-law, daughter-in-law, sibling and half-sibling\n\nStep relationships are included Family that cannot bypass the travel ban Grandparents, grandchildren, aunts, uncles, nieces, nephews, cousins, brothers- and sisters-in-law\n\nOther extended family members\n\nTravelers make their way up the arrival ramp at the Tom Bradley International Terminal at Los Angeles International Airport on Thursday. (Jae C. Hong / AP)\n\nThe situation for refugees is unclear\n\nWhile the Supreme Court said the exemptions that apply to travelers from the six countries also must apply to refugees, it didn’t provide clear details on how refugees could prove a “bona fide” connection to the U.S.\n\nResettlement organizations argue that the relationships these groups have with refugees they are assisting should count. The U.S. government disagrees.\n\n“That a resettlement agency in the United States has provided a formal assurance for refugees seeking admission is not sufficient, in and of itself,” a senior administration official said in a briefing before the ban went into effect.\n\nThe Department of State has said refugees who arrive in the country through July 6 will be admitted whether they can claim a connection to the U.S. or not. That’s the date that the department expects a 50,000 cap on refugees to be reached for the fiscal year, which ends Oct. 1. The cap is listed in Trump’s executive order on the ban.\n\nAs of Wednesday night, the department said 49,009 refugees had come to the country this fiscal year. Officials said they would give instructions later on what to do with refugees planning to arrive after July 6. The Supreme Court’s order said the cap can be exceeded for refugees who claim a legitimate U.S. relationship.\n\nhttps://twitter.com/realDonaldTrump/status/879527520957325314\n\nHow many people does this affect?\n\nLawyers who have sued the president said the travel ban, as it currently stands, will block significantly fewer people than previous attempts at a ban.\n\n“Most non-citizens who come to this country and are applying for a visa have a connection to the U.S.,” said Justin Cox, an attorney at the National Immigration Law Center who is part of a team representing refugee and immigrant groups fighting the ban in the Supreme Court.\n\n“On the other hand, there are more than 200 million people in the world who couldn’t get in because these six countries have a population of about 180 million and there are about 65 million refugees,” he said.\n\nCox said the government had too narrowly applied the court’s instructions on who should be exempted from the travel restrictions. He said government was “essentially shutting down” refugee resettlement.\n\nBut Josh Blackman, a constitutional law professor at the South Texas College of Law Houston, said the Trump administration was on solid ground.\n\n“I probably would have also included grandparents, for no other reason than they tug at sentimental heart strings. But when administering the immigration laws, the government often draws lines that are harsh and arbitrary,” he said.\n\nGovernment officials said they have no estimate of how many people the travel ban will block. The six nations represent a sliver of international travel to the country. The U.S. has no embassy or limited consular services in many of them.\n\nData from 2015 show that there were 49,412 tourist and business visits to the U.S. by citizens of the six countries. Employment and student visas that year accounted for 13,000 visits.\n\nGreen cards, which make someone a legal permanent resident, were given that year to 31,258 people from the nations. Not all those people would be new immigrants. Some people secure green cards after living in the U.S. a long time.\n\nAccording to Betsy Fisher, policy director of the International Refugee Assistance Project, there are about 26,000 refugees who have “gone through extensive vetting” and are approved by the U.S. government for relocation. The vast majority of those do not have tickets booked to travel before the July 6 deadline. A large portion have no family ties in the U.S.\n\nSupport our journalism Already a subscriber? Thank you for your support. If you are not, please consider subscribing today. Get full access to our signature journalism for just 99 cents for the first four weeks.\n\njaweed.kaleem@latimes.com\n\nJaweed Kaleem is The Times' national race and justice correspondent. Follow him on Twitter, Facebook and Instagram.", "authors": ["Jaweed Kaleem"], "publish_date": "2017-06-30", "source": "latimes", "top_words": ["travel", "trump", "ban", "supreme", "family", "court", "country", "countries", "refugees", "revived", "administration"], "summary": "President Trump signs the original travel ban executive order on Jan. 27, 2017.\nImmigration attorneys set up a table at Los Angeles International Airport as the new travel ban went into effect on Thursday.\nThe same goes for people granted asylum, and those who could claim dual nationality with another country not on the travel ban list.\nLawyers who have sued the president said the travel ban, as it currently stands, will block significantly fewer people than previous attempts at a ban.\nGovernment officials said they have no estimate of how many people the travel ban will block."}