{"url": "http://www.latimes.com/nation/la-na-trump-travel-ban-story-so-far-20170206-story.html", "id": "111", "title": "Dozens of suits have been filed against Trump's sweeping travel ban. Here are the most important ones", "text": "The Jan. 27 executive order included a 90-day ban on admission of nearly all citizens from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen. It also halted all refugee admissions for 120 days, indefinitely suspended admission of Syrian refugees and said the U.S. would give preference to refugees who are members of religious minorities. Immediately after that, hundreds of refugees, green card holders and visitors with valid visas were either detained at U.S. airports, deported upon landing or not allowed to board flights to the country. The Department of Justice later told a judge that Trump's move had resulted in 100,000 visas that were canceled around the world. The Department of State clarified the number to be less than 60,000.", "authors": ["Jaweed Kaleem"], "publish_date": "2017-02-06", "source": "latimes", "top_words": ["suits", "travel", "world", "visitors", "yemen", "sweeping", "ban", "visas", "told", "refugees", "trumps", "ones", "admission", "valid", "filed", "important", "department", "dozens"], "summary": "The Jan. 27 executive order included a 90-day ban on admission of nearly all citizens from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\nIt also halted all refugee admissions for 120 days, indefinitely suspended admission of Syrian refugees and said the U.S. would give preference to refugees who are members of religious minorities.\nImmediately after that, hundreds of refugees, green card holders and visitors with valid visas were either detained at U.S. airports, deported upon landing or not allowed to board flights to the country.\nThe Department of Justice later told a judge that Trump's move had resulted in 100,000 visas that were canceled around the world.\nThe Department of State clarified the number to be less than 60,000."}