{"url": "http://www.latimes.com/business/hiltzik/la-fi-hiltzik-ban-medical-20170201-story.html", "id": "231", "title": "Another casualty of Trump's Muslim ban: U.S. medical training and rural healthcare", "text": "Trump's travel ban, and especially its ham-fisted implementation last weekend, instantly snared at least two foreign physicians who were on their way back to their American jobs when the order came down and were prevented from entering and staying in the United States. As documented by Charles Ornstein of ProPublica, one was Kamal Fadlalla, a Sudanese second-year resident in internal medicine at Interfaith Medical Center in Brooklyn who was blocked from boarding his flight in Khartoum and returned to his family home in Wad Madani, Sudan, instead. Suha Abushamma, a Sudanese internal medicine resident at the Cleveland Clinic, was ordered to fly back to Saudi Arabia, where her flight originated, after she had already landed in the United States. Her plane back to the Mideast took off minutes before a federal judge in Brooklyn ordered such deportations halted.", "authors": ["Michael Hiltzik", "Masri", "Senussi", "New England Journal Of Medicine"], "publish_date": "2017-02-01", "source": "latimes", "top_words": ["training", "rural", "medical", "sudanese", "ban", "ordered", "weekend", "brooklyn", "casualty", "internal", "united", "resident", "trumps", "flight", "healthcare", "states", "muslim", "medicine"], "summary": "Trump's travel ban, and especially its ham-fisted implementation last weekend, instantly snared at least two foreign physicians who were on their way back to their American jobs when the order came down and were prevented from entering and staying in the United States.\nAs documented by Charles Ornstein of ProPublica, one was Kamal Fadlalla, a Sudanese second-year resident in internal medicine at Interfaith Medical Center in Brooklyn who was blocked from boarding his flight in Khartoum and returned to his family home in Wad Madani, Sudan, instead.\nSuha Abushamma, a Sudanese internal medicine resident at the Cleveland Clinic, was ordered to fly back to Saudi Arabia, where her flight originated, after she had already landed in the United States.\nHer plane back to the Mideast took off minutes before a federal judge in Brooklyn ordered such deportations halted."}