{"url": "http://www.latimes.com/newsletters/la-me-todays-headlines-20170509-story.html", "id": "285", "title": "Today: The Early Warnings to Trump About Flynn", "text": "The warnings were there, according to former government officials: In November, President Obama cautioned Donald Trump against picking Michael Flynn as national security advisor. In January, acting Atty. Gen. Sally Yates told White House lawyers that Flynn “could be blackmailed” by Moscow, may have violated criminal statutes and had misled Vice President Pence about his dealings with Russian officials. But the rest, as they say, is history. After the testimony of Yates and former Director of National Security James Clapper before the Senate on Monday, Trump responded with a tweet storm — and an update of his Twitter banner to drive home the point: “Director Clapper reiterated what everybody, including the fake media already knows — there is ‘no evidence’ of collusion w/ Russia and Trump.”", "authors": [], "publish_date": "2017-05-09", "source": "latimes", "top_words": ["trump", "early", "flynn", "national", "warnings", "security", "officials", "white", "director", "yates", "today", "president", "clapper"], "summary": "The warnings were there, according to former government officials: In November, President Obama cautioned Donald Trump against picking Michael Flynn as national security advisor.\nIn January, acting Atty.\nGen. Sally Yates told White House lawyers that Flynn “could be blackmailed” by Moscow, may have violated criminal statutes and had misled Vice President Pence about his dealings with Russian officials.\nBut the rest, as they say, is history.\nAfter the testimony of Yates and former Director of National Security James Clapper before the Senate on Monday, Trump responded with a tweet storm — and an update of his Twitter banner to drive home the point: “Director Clapper reiterated what everybody, including the fake media already knows — there is ‘no evidence’ of collusion w/ Russia and Trump.”"}