{"url": "http://www.latimes.com/politics/la-na-pol-trump-executive-order-20170306-story.html", "id": "366", "title": "Read President Trump's new executive order on travel and refugees", "text": "Sec. 6. Realignment of the U.S. Refugee Admissions Program for Fiscal Year 2017. (a) The Secretary of State shall suspend travel of refugees into the United States under the USRAP, and the Secretary of Homeland Security shall suspend decisions on applications for refugee status, for 120 days after the effective date of this order, subject to waivers pursuant to subsection (c) of this section. During the 120-day period, the Secretary of State, in conjunction with the Secretary of Homeland Security and in consultation with the Director of National Intelligence, shall review the USRAP application and adjudication processes to determine what additional procedures should be used to ensure that individuals seeking admission as refugees do not pose a threat to the security and welfare of the United States, and shall implement such additional procedures. The suspension described in this subsection shall not apply to refugee applicants who, before the effective date of this order, have been formally scheduled for transit by the Department of State. The Secretary of State shall resume travel of refugees into the United States under the USRAP 120 days after the effective date of this order, and the Secretary of Homeland Security shall resume making decisions on applications for refugee status only for stateless persons and nationals of countries for which the Secretary of State, the Secretary of Homeland Security, and the Director of National Intelligence have jointly determined that the additional procedures implemented pursuant to this subsection are adequate to ensure the security and welfare of the United States.", "authors": [], "publish_date": "2017-03-06", "source": "latimes", "top_words": ["executive", "travel", "subsection", "homeland", "shall", "security", "read", "state", "refugee", "order", "united", "secretary", "trumps", "states", "usrap", "refugees", "president"], "summary": "Realignment of the U.S.\nRefugee Admissions Program for Fiscal Year 2017.\n(a) The Secretary of State shall suspend travel of refugees into the United States under the USRAP, and the Secretary of Homeland Security shall suspend decisions on applications for refugee status, for 120 days after the effective date of this order, subject to waivers pursuant to subsection (c) of this section.\nDuring the 120-day period, the Secretary of State, in conjunction with the Secretary of Homeland Security and in consultation with the Director of National Intelligence, shall review the USRAP application and adjudication processes to determine what additional procedures should be used to ensure that individuals seeking admission as refugees do not pose a threat to the security and welfare of the United States, and shall implement such additional procedures.\nThe suspension described in this subsection shall not apply to refugee applicants who, before the effective date of this order, have been formally scheduled for transit by the Department of State."}