{"url": "http://www.latimes.com/local/california/la-me-visa-ban-20170206-htmlstory.html", "id": "356", "title": "For Iranian Americans, Trump has complicated an already tricky trip to motherland", "text": "Traveling back to Iran was never uncomplicated for Arian Edalat.\n\nEach visit after immigrating to the United States six years ago was a gantlet of frustrations — a reminder that the country he used to explore as a boy in the backseat of his father’s white 1976 Buick, with its turquoise blue interior, was in the grips of theocratic and severe rulers.\n\nBut trips to Iran, like the one he took in December, were the only way he could see his mother, now widowed, and help her secure a visa to the U.S.\n\n“I’ll see what I missed in the face of my mother and my grandmother. How old they’ve gotten, and how I missed those creases and the layers of skin over skin on their faces,” Edalat, 42, said. “It bombards you on a daily basis when you’re there.”\n\nFor many Iranian immigrants and their families, the 7,500-mile journey between Tehran and California is an emotionally fraught necessity. Most Iranians in the U.S. oppose the hard-line regime in Tehran. Many fled for political freedoms or opportunities for professional growth. Others moved here for a Western education and planned to go back, but found themselves tethered to America after the Islamic Revolution in 1979.\n\nThe Casablanca that is \"Tehrangeles\" has long been a hotbed of political intrigue, turning heavily Iranian neighborhoods such as Westwood and Beverly Hills into key locations for gathering intelligence on Tehran. Both the CIA and the FBI have spent decades recruiting informants and sources among Iranian expatriates and businessmen who travel to Iran.\n\nStill, the community’s roots, culture and family are in Iran, and the tug of the motherland, steeped in memories, pulls hard. Although it has never been easy or inexpensive to make the journey, until last week, it was manageable.\n\nNow, on the heels of President Trump ’s executive order, many Iranian immigrants are wondering how feasible it will be to continue the tradition. Trump’s action blocks citizens from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen from coming to the U.S. for at least 90 days. It also imposes a ban for 120 days on refugees from any country entering the U.S. and bars refugees from Syria indefinitely, in a move the president has said will better protect the country against terrorist attacks.\n\nA federal judge is­sued a tem­por­ary re­strain­ing or­der against Trump’s im­mig­ra­tion re­stric­tions on Fri­day, and signaled that the or­der ap­plies to cases across the coun­try. The Department of Homeland Security suspended \"any and all actions\" related to the ban in response, but the White House has said it will ask for an emergency stay of the judge's order.\n\nAlso Friday, Trump imposed sanctions on Iran, delivering on his promise to take a harder line with the volatile U.S. foe.\n\nThe sanctions, on 13 people and 12 companies, came a day after he put Iran “on notice” for testing a medium-range ballistic missile and for attacks by Iran-funded Houthi militants on a Saudi frigate.\n\nIran has instituted a tit-for-tat policy in response to Trump’s ban, barring Americans from receiving visas. Although dual nationals can still fly to Tehran, they wonder whether they will be caught in a political tug-of-war, harassed because they came from the U.S.\n\nEdalat worries he won’t see his family for months. His mother had planned to visit the family in West Hills this month. The chemical engineer doesn’t know whether he should tell her to stay in Iran, or ask her to try her luck and fly out next weekend.\n\n“She is devastated,” he said. “The damage is already done...you’re accusing a 65-year-old woman who hasn’t hurt an insect in her life of being a threat to the national security of this country.”\n\nThe ban is particularly dispiriting because it comes just one year after the implementation of the Iran nuclear deal, said Saman Djabbari, a first-generation American whose parents moved to Los Angeles from Iran.\n\n“There was such hope with that. It seems like there was one giant step forward and two giant steps backward,” Djabbari, 30, said. “There was all this progress made. That thaw, who knows what happens with it now? Is it just frozen over again?”\n\nHis uncle still lives in Iran, he said, and the only chance the family has of seeing him now is flying there. Even that has its difficulties, Djabbari said.\n\n“Last time I went there I was 15 years old and the Iranian government for some reason had this idea that I never left the country,” he said. “So that entire trip, my mom and her brother had to produce all this evidence that I was living in the States the whole time. I could have gotten stuck over there.”\n\nExperts note that existing vetting policies were already rigorous.\n\n“Could we do more? Yeah, we could send out FBI agents,” said Niels Frenzen, an expert in immigration and refugee law at USC. “When money isn’t an issue, one can always do more.”\n\nStill, the ban is “illogical” and “confusing,” Frenzen added.\n\n“It is stopping people who have been vetted,” he said. “The country selection process is a political decision and has nothing to do as far as I can tell with national security.”\n\nMahsa Pashaei left Iran about five years ago after her family won the green-card lottery. She admits the immigration process was easier for them because of that, but the ban ruined her family’s future plans.\n\nPashaei, a student at UCLA, said her mother planned to travel to Iran for Nowruz, the Persian New Year, in March.\n\n“All these decisions are on hold,” Pashaei said in Farsi. “My family is worried we will never see each other again.”\n\nThe 25-year-old said she feels caught between two countries.\n\n“Neither accepts you,” she said. “Each moment, you wonder ‘If something happens, which country would want to help me? Which way do I reach out?’ That’s its own horror.”\n\nIt took 14 months for Edalat’s mother to get through the vetting process, which included criminal background checks, flights to the U.S. Embassy in Armenia, presenting original copies of Iranian birth certificates and showing proof of income, among other steps.\n\nHis wife Samah’s aunt received a visa and planned to visit in March. The aunt, 70, traveled twice to the embassy in Austria for her visa.\n\n“I’ve been on the phone with my mother, and she says my aunt has been crying over this,” Samah Edalat said as she fed their daughter, Nava, in the kitchen.\n\n“You want to revoke this privilege -- and I agree it is a privilege for noncitizens -- at least be accountable,” her husband added. “People spent money, they invested their emotions and their time.”\n\nEdalat’s mother paid for the family’s plane tickets during their December visit. With two children, he and his wife couldn’t spare $5,000 to fly to Tehran. It was money they could use for preschool.\n\nWith the ban in place, he doesn’t know when he will see his loved ones, or visit a country where a song or bite of food can cause a flood of memories.\n\n“I met my nephew for the first time this trip. I’m not going to be there when he’s 10, or 5, or 6,” Edalat said. “Year after year, my mother’s birthday, my brother’s birthday, my nephew’s birthday. All of these things are missing.”\n\n“They come back haunting you, all of these sacrifices you’re making.”\n\nsarah.parvini@latimes.com\n\nFor more California news follow me on Twitter: @sarahparvini", "authors": ["Sarah Parvini"], "publish_date": "2017-02-06", "source": "latimes", "top_words": ["tehran", "iran", "motherland", "mother", "trump", "complicated", "ban", "family", "political", "visit", "iranian", "country", "tricky", "americans", "trip", "planned"], "summary": "Both the CIA and the FBI have spent decades recruiting informants and sources among Iranian expatriates and businessmen who travel to Iran.\nStill, the community’s roots, culture and family are in Iran, and the tug of the motherland, steeped in memories, pulls hard.\nNow, on the heels of President Trump ’s executive order, many Iranian immigrants are wondering how feasible it will be to continue the tradition.\nHis mother had planned to visit the family in West Hills this month.\nPashaei, a student at UCLA, said her mother planned to travel to Iran for Nowruz, the Persian New Year, in March."}