{"url": "http://www.latimes.com/opinion/opinion-la/la-ed-trump-immigration-airports-20170130-story.html", "id": "484", "title": "Trump can't blame Obama for his latest immigration fiasco", "text": "Nor, as the Journal piece points out, have those countries been the major sources of people who commit terrorist acts in the United States: \"Of 180 people charged with jihadist terrorism-related crimes or who died before being charged, 11 were identified as being from Syria, Iraq, Iran, Libya, Yemen, Sudan or Somalia, the countries specified in Mr. Trump's order, according to an analysis of data on the attacks by the Wall Street Journal. None of the 11 were identified as coming from either Syria, Libya or Sudan, and none of the 11 were involved in any major U.S. plot resulting in the deaths of Americans, including the attacks of Sept. 11, 2001.\" Instead, the largest source by far is the United States itself, followed by Saudi Arabia and Pakistan, the Journal reported.", "authors": ["Jon Healey"], "publish_date": "2017-01-30", "source": "latimes", "top_words": ["major", "trump", "journal", "blame", "immigration", "11", "libya", "united", "states", "obama", "syria", "identified", "countries", "fiasco", "latest", "cant", "sudan"], "summary": "Nor, as the Journal piece points out, have those countries been the major sources of people who commit terrorist acts in the United States: \"Of 180 people charged with jihadist terrorism-related crimes or who died before being charged, 11 were identified as being from Syria, Iraq, Iran, Libya, Yemen, Sudan or Somalia, the countries specified in Mr. Trump's order, according to an analysis of data on the attacks by the Wall Street Journal.\nNone of the 11 were identified as coming from either Syria, Libya or Sudan, and none of the 11 were involved in any major U.S. plot resulting in the deaths of Americans, including the attacks of Sept. 11, 2001.\"\nInstead, the largest source by far is the United States itself, followed by Saudi Arabia and Pakistan, the Journal reported."}