{"url": "http://www.latimes.com/world/mexico-americas/la-fg-central-american-refugees-20170131-story.html", "id": "435", "title": "Also barred by Trump's executive order: These heavily vetted kids from Central America", "text": "“This program was an important recognition of the very real violence in these countries,” said Maureen Meyer, who advocates for migrant rights with the nonprofit Washington Office on Latin America. “Clearly the suspension of this program puts these children at more risk. A lot of people that are in danger could be killed.”\n\nTrump characterized his immigration order, which also banned travel to the U.S. from seven predominantly Muslim countries, as a measure that would “make America safe again” by protecting the U.S. from foreign threats.\n\nBut advocates say the children who have applied for the Central America refugee program pose no danger to the U.S. and would be allowed in the country only after careful screening by the Department of Homeland Security.\n\n“The child has to go through a very extensive security vetting,” said Wendy Young, president of Kids in Need of Defense, a nonprofit organization that advocates for immigrant children. “Refugees are the most vetted immigrants in the country.”\n\nThe program came into being in 2014, a year that saw record numbers of Central Americans asking for asylum at the U.S. border. Many of them traveled without guardians, often in the company of human traffickers, and “unaccompanied minor” joined the lexicon of the immigration debate. Many of the children said they were fleeing violence and forced gang recruitment in El Salvador, Honduras and Guatemala.\n\nFaced with a mounting humanitarian crisis, Obama enacted several measures to slow the migration. He asked Congress to earmark money to help improve economic and security conditions in Central America, and he enlisted Mexico to dramatically step up deportations along its southern border.\n\nThe Central American Minors Program allowed young people to apply for refugee status from their home country. Those who faced the biggest threats were allowed to go to Costa Rica, a safer country, as they waited to find out whether their application would be approved.\n\nAt the time, some advocates argued the program didn’t go far enough because it provided protections only for children with a parent who had legal permission to be in the U.S., such as temporary protected status, which was granted in the wake of natural disasters in Honduras and El Salvador.\n\nIn 2016, the Obama administration expanded the program slightly to allow adult family members of the children to apply for refugee status as well.\n\nA spokesman for the Department of State, which administers the program, did not say how many people were affected by the executive order or whether any Central Americans have been granted exemptions and allowed to enter the U.S.\n\nJaime Rivas Castillo, a professor at Don Bosco University in El Salvador, said the suspension of the refugee program means some young migrants may look for other options to leave the country.\n\nSome may seek asylum in nearby countries such as Mexico or Panama, he said, and others may still risk the 2,000-mile journey to the U.S. border and try to enter illegally or ask for asylum there.\n\n“If you close an important valve, another one will open,” he said.\n\nTo read the article in Spanish, click here", "authors": ["Kate Linthicum"], "publish_date": "2017-01-31", "source": "latimes", "top_words": ["heavily", "executive", "america", "allowed", "central", "young", "kids", "refugee", "barred", "trumps", "children", "status", "program", "order", "advocates", "el", "vetted"], "summary": "But advocates say the children who have applied for the Central America refugee program pose no danger to the U.S. and would be allowed in the country only after careful screening by the Department of Homeland Security.\nMany of the children said they were fleeing violence and forced gang recruitment in El Salvador, Honduras and Guatemala.\nHe asked Congress to earmark money to help improve economic and security conditions in Central America, and he enlisted Mexico to dramatically step up deportations along its southern border.\nThe Central American Minors Program allowed young people to apply for refugee status from their home country.\nIn 2016, the Obama administration expanded the program slightly to allow adult family members of the children to apply for refugee status as well."}