{"url": "http://www.latimes.com/opinion/editorials/la-ed-trump-travel-ban-20170926-story.html", "id": "8", "title": "Trump's new travel ban fools no one. It's the same old bigotry masquerading as national security", "text": "The new iteration of the old ban still excludes people mostly from countries with Muslim majorities, while adding a few other countries — North Korea, for example — to throw critics off the scent of religious bigotry. But even if we accept (which we don't) that this isn't primarily motivated by a desire to keep Muslims out, it's still not a good policy. On principle, there's something fundamentally wrong with excluding entire nations of people simply because some people in those countries are radicalized and dangerous. Reverse the scenario: Given the homicide rate in the U.S., and the number of hate crimes committed by white supremacists, why wouldn't other nations seek to ban entry by Americans? From the outside, and statistically, we are a very violent people. But we would be outraged if other nations judged us all by the Dylann Roofs and Jared Lee Loughners among us.", "authors": ["The Times Editorial Board"], "publish_date": "2017-09-26", "source": "latimes", "top_words": ["bigotry", "theres", "travel", "national", "fools", "masquerading", "ban", "security", "throw", "wrong", "wouldnt", "trumps", "countries", "violent", "nations", "white", "old", "supremacists"], "summary": "The new iteration of the old ban still excludes people mostly from countries with Muslim majorities, while adding a few other countries — North Korea, for example — to throw critics off the scent of religious bigotry.\nBut even if we accept (which we don't) that this isn't primarily motivated by a desire to keep Muslims out, it's still not a good policy.\nOn principle, there's something fundamentally wrong with excluding entire nations of people simply because some people in those countries are radicalized and dangerous.\nReverse the scenario: Given the homicide rate in the U.S., and the number of hate crimes committed by white supremacists, why wouldn't other nations seek to ban entry by Americans?\nBut we would be outraged if other nations judged us all by the Dylann Roofs and Jared Lee Loughners among us."}