{"url": "http://www.foxnews.com/sports/2017/01/30/warriors-coach-derides-trump-administration-travel-ban.html", "id": "199", "title": "Warriors coach derides Trump administration's travel ban", "text": "PORTLAND, Ore. (AP) Warriors coach Steve Kerr expressed dismay over President Donald Trump's executive order that bans citizens of seven majority Muslim countries from entering the United States.\n\nKerr spoke about the administration's travel ban following a 113-111 victory over the Portland Trail Blazers on Sunday night, calling it a ''horrible idea.''\n\n''As someone whose family member was a victim of terrorism, having lost my father, if we're trying to combat terrorism by banishing people from coming to this country, by really going against the principals of what our country's about and creating fear, it's the wrong way to go about it,'' Kerr said. ''If anything, we could be breeding anger and terror.\n\n''I think it's shocking. I think it's a horrible idea. I feel for all the people who are affected. Families are being torn apart and I worry in the big picture what this means to the security of the world.''\n\nMalcolm Kerr was murdered while he was the American University president in Beirut when Steve Kerr was 18 and a freshman at the University of Arizona.\n\nKerr has been outspoken on matters including gun control. He also expressed his disappointment when Trump was elected, likening his campaign to The Jerry Springer Show.\n\nThe White House on Sunday defended Trump's immigration restrictions as protests spread throughout the country. The executive order also suspends refugee admissions for 120 days and indefinitely bars the processing of refugees from Syria.", "authors": [], "publish_date": "2017-01-30", "source": "foxnews", "top_words": ["travel", "warriors", "kerr", "trump", "steve", "ban", "university", "administrations", "portland", "order", "think", "trumps", "derides", "terrorism", "president", "coach", "horrible"], "summary": "PORTLAND, Ore. (AP) Warriors coach Steve Kerr expressed dismay over President Donald Trump's executive order that bans citizens of seven majority Muslim countries from entering the United States.\nKerr spoke about the administration's travel ban following a 113-111 victory over the Portland Trail Blazers on Sunday night, calling it a ''horrible idea.''\nMalcolm Kerr was murdered while he was the American University president in Beirut when Steve Kerr was 18 and a freshman at the University of Arizona.\nHe also expressed his disappointment when Trump was elected, likening his campaign to The Jerry Springer Show.\nThe executive order also suspends refugee admissions for 120 days and indefinitely bars the processing of refugees from Syria."}