{"url": "http://www.foxnews.com/politics/2017/05/08/trump-travel-ban-appeals-court-casts-skeptical-eye-at-revised-order.html", "id": "136", "title": "Trump travel ban: Appeals court casts skeptical eye at revised order", "text": "A federal appeals court expressed strong skepticism Monday toward President Trump's claims of authority in the first hearing on his revised travel ban, signaling in a lively oral argument the judges could strike down parts of the executive order that sought to suspend travel and refugee admissions from certain mostly Muslim countries.\n\nAt issue is whether the ban violates the Religion Clauses of the First Amendment, the Due Process Clause of the Fifth and 14th Amendments, and the ban on nationality discrimination in the issuance of immigrant visas contained in a 65-year-old congressional law.\n\nIt has become a major test of presidential power, especially in the area of immigration.\n\nThe case before the 4th Circuit U.S. Court of Appeals is the first of two public judicial hearings on the revised presidential order. A San Francisco-based federal appeals court will separately review the issue next week.\n\nThe White House frames the issue as a temporary move involving national security. A coalition of groups in opposition call the order blatant religious discrimination, since the six countries involved have mostly Muslim populations: Iran, Libya, Somalia, Sudan, Syria, and Yemen.\n\nBut a majority of judges on the court raised previous statements by then-candidate Donald Trump on \"preventing Muslim immigration\" to question his motivation for issuing this revised executive order.\n\n\"Would anything but willful blindness\" prevent the court from considering the president's campaign rhetoric, asked Judge Henry Floyd.\n\n\"He never repudiated what he said [on] the Muslim ban,\" said Judge Robert King. \"It's still on his [campaign] website.\"\n\nAnd national security consideration alone \"doesn't give him the right to violate the Establishment Clause,\" suggested Judge Diana Gribbon Motz.\n\nOther judges questioned whether some of the plaintiffs challenging the ban -- including relatives of those denied entry to the U.S. -- had \"standing,\" or a basis to bring lawsuits challenging multiple parts of the ban.\n\nAnd some on the bench grew frustrated with an ACLU lawyer's answers.\n\n\"Who makes the national security determination in this case, the risk I am addressing?\" asked Judge Dennis Shedd.\n\nWhen attorney Omar Jadwat demurred, Judge Paul Niemeyer jumped in: \"You have a problem?\" saying the president as commander-in-chief has power over keeping Americans safe.\n\nTen of the 13 judges hearing the case en banc were nominated by Democratic presidents. Two other full-time 4th Circuit judges recused, both of whom were named by Republican presidents.\n\nThis is the White House's second effort to impose a travel ban. An order issued a week after Trump took office also was quickly blocked from taking effect. Nationwide protests were held in many cities and airports.\n\nThe administration issued its revised order March 6, which included removing Iraq from the original list of banned countries. It also lifted the indefinite ban on Syrian refugees, many fleeing a years-long civil war there.\n\nOfficials say the new executive order only applied to foreign nationals outside the U.S. without a valid visa.\n\n\"Unregulated, unvetted travel is not a universal privilege, especially when national security is at stake,\" Homeland Security Secretary John Kelly said at the time.\n\nSenate Minority Leader Charles Schumer, D-N.Y., said the latest version was no better than the original, calling the order \"mean spirited and un-American.\"\n\nA major sticking point for the judicial panel will be navigating how much discretion the president really has over immigration. Courts have historically been deferential in this area, and recent presidents including Jimmy Carter, Ronald Reagan and Barack Obama have used it to deny entry to certain refugees and diplomats, including nations such as Iran, Cuba, and North Korea.\n\nA 1952 federal law -- the Immigration and Nationality Act, passed in the midst of a Cold War fear over Communist influence -- gives the chief executive broad authority.\n\n\"Whenever the president finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may, may by proclamation, and for such period as he shall deem necessary, \" says Section 212 (f) of the law, \"suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate.\"\n\nThe administration strongly denies this is a \"Muslim ban,\" but the statements the judges cited Monday included a December 2015 Trump campaign press release calling for \"a total and complete shutdown of Muslims entering the United States.\"\n\nAnd challengers to the law say Trump has taken this power to extremes by banning nearly entire populations from multiple countries.\n\nThe case is International Refugee Assistance Project v. Trump (17-1351). There was no timetable on how quickly the judges would issue a ruling, or when it could be appealed to the Supreme Court.", "authors": ["Bill Mears"], "publish_date": "2017-05-08", "source": "foxnews", "top_words": ["skeptical", "travel", "casts", "trump", "revised", "ban", "appeals", "judges", "security", "judge", "aliens", "court", "entry", "order", "muslim", "eye"], "summary": "The case before the 4th Circuit U.S. Court of Appeals is the first of two public judicial hearings on the revised presidential order.\nBut a majority of judges on the court raised previous statements by then-candidate Donald Trump on \"preventing Muslim immigration\" to question his motivation for issuing this revised executive order.\n\"He never repudiated what he said [on] the Muslim ban,\" said Judge Robert King.\nAn order issued a week after Trump took office also was quickly blocked from taking effect.\nThe administration issued its revised order March 6, which included removing Iraq from the original list of banned countries."}