{"url": "http://www.foxnews.com/politics/2017/03/06/trump-to-reportedly-sign-revised-travel-ban-order.html", "id": "105", "title": "Trump set to sign revised travel ban order", "text": "President Trump on Monday is set to sign a revised executive order that will halt America’s refugee program and temporarily ban the entry of people seeking to come to the United States from several countries in the Middle East and Africa, Counselor Kellyanne Conway confirmed to “Fox & Friends.”\n\nAmid confusion over the original measure, Conway said the new version includes \"six or seven\" points that will clarify those areas. Among other changes, she said the new order will clearly exclude legal permanent residents and leave Iraq off a list of countries whose residents would be subject to a temporary travel ban. She also indicated the new version would no longer indefinitely bar Syrian refugees.\n\nThe administration has repeatedly pushed back the signing of the new executive order as it has worked to better coordinate with agencies that it will need to implement the ban. The new order has been in the works since shortly after a federal court blocked Trump’s initial effort.\n\nTrump was elected in November in large part on a national security platform that included stronger U.S. borders and putting an end to ISIS and other radical Islamic terror groups.\n\nOne of his first official acts after taking office in late-January was to sign executive orders that temporarily halted the U.S. refugee program and travel from seven mostly-Muslim, Middle Eastern and African countries.\n\nThe orders have been held up in a federal appeals court since early-February, with Trump weighing his options but making clear as recently as last week that he fully intends to fulfill his campaign pledge.\n\n“The vast majority of individuals convicted of terrorism and terrorism-related offenses since 9/11 came here from outside of our country,” Trump said during his address to a joint session of Congress last week.\n\n“It is not compassionate, but reckless to allow uncontrolled entry from places where proper vetting cannot occur,” he said. “We cannot allow a beachhead of terrorism to form inside America. And we cannot allow our nation to become a sanctuary for extremists … That is why my administration has been working on improved vetting procedures, and we will shortly take new steps to keep our nation safe.”\n\nThe federal appeals court temporarily blocked parts of Trump’s executive orders and halted the travel ban, then denied the administration’s request to immediately lift the ban. Critics of the ban argue it was hastily crafted with parts lacking adequate constitutional authority.\n\nTo be sure, uncertainty about the status of green card holders caused confusion and sparked major protests at international airports across the country on the Saturday after Trump signed the executive order, which was followed by administration officials promptly issuing guidance on legal permanent U.S. residents, or green card holders, to exempt them from the ban.\n\nAccording to a draft version of the new order outlined to lawmakers late last week, citizens of Iran, Somalia, Sudan, Yemen, Syria and Libya will face a 90-day suspension of visa processing as the administration continues to analyze how to enhance vetting procedures.\n\nThe revised order is expected to remove Iraq from the list of countries that would be subject to a 90-day travel ban. That follows pressure from the Pentagon and State Department, which had urged the White House to reconsider, given Iraq's key role in fighting ISIS.\n\nOther changes are also expected, including making clear that all existing visas will be honored and no longer singling out Syrian refugees for an indefinite ban. Syrian refugees will now be treated like other refugees and be subjected to a 120-day suspension of the refugee program.\n\nThe new version is also expected to remove language that would give priority to religious minorities. Critics had accused the administration of adding such language to help Christians get into the United States while excluding Muslims.\n\nFox News’ Joseph Weber and Serafin Gomez contributed to this report. The Associated Press also contributed to this report.", "authors": [], "publish_date": "2017-03-06", "source": "foxnews", "top_words": ["executive", "syrian", "travel", "administration", "revised", "trump", "ban", "temporarily", "vetting", "version", "sign", "order", "set"], "summary": "Among other changes, she said the new order will clearly exclude legal permanent residents and leave Iraq off a list of countries whose residents would be subject to a temporary travel ban.\nThe administration has repeatedly pushed back the signing of the new executive order as it has worked to better coordinate with agencies that it will need to implement the ban.\nThe new order has been in the works since shortly after a federal court blocked Trump’s initial effort.\nThe revised order is expected to remove Iraq from the list of countries that would be subject to a 90-day travel ban.\nCritics had accused the administration of adding such language to help Christians get into the United States while excluding Muslims."}