{"url": "http://www.foxnews.com/politics/2017/06/27/courts-travel-ban-ruling-gives-trump-boost-changes-media-narrative.html", "id": "175", "title": "Court's travel ban ruling gives Trump a boost, changes media narrative", "text": "Nine justices delivered a reminder yesterday of why the Supreme Court was such an important campaign issue.\n\nIn allowing key parts of President Trump’s travel ban to take effect, the high court—with help from Trump’s man Neil Gorsuch—upended the conventional wisdom on the case. After all, in agreeing to hear the case in October, the justices could have left the temporary stay in place pending a final ruling.\n\nInstead, they sent a strong signal to the appellate courts that they had gone too far in blocking the executive order—and enabled the president to claim “a clear victory for our national security.”\n\nBut the court also obliterated the existing media narrative, which is that the travel ban was a badly botched, unconstitutional overreach by Trump.\n\nThat narrative took hold as the lower courts rejected two successive versions of the ban. And it was fueled by the visceral dislike that many news organizations and commentators have for the order, despite the fact that it was a central plank in Trump’s campaign.\n\nNow there’s little question that the first travel order was hastily drafted and rushed out in the administration’s first week. The current version was designed to fix some of the problems.\n\nThat measure, you may recall, greatly restricted travel from six predominantly Muslim countries for 90 days and froze the nation’s refugee admissions for 120 days. The purpose was to give the administration time to tighten vetting procedures.\n\nThe limited duration means that by the time the Supreme Court issues a final ruling, the bans may have run their course.\n\nThe court did carve out an exemption for foreign citizens with ties or relationships in America. But others applying for visas without such ties or business here could be barred. Three justices, including Gorsuch, wanted to let the entire travel ban take effect.\n\nI was live on Fox Business when the ruling came down, and immediately realized that the landscape had dramatically changed.\n\nWhat I didn’t know at that moment was that this was a 9-0 ruling, meaning that the administration’s chances of prevailing in the case are quite good.\n\nThe temporary ban isn’t necessarily popular. In an AP poll last week 57 percent said the courts acted correctly by blocking it, while 39 percent said the judges were wrongly interfering.\n\nI understand precisely why the Trump ban is controversial, given the perception that it targets Muslims. But what the justices did yesterday suggests that it may not be unconstitutional.\n\nHoward Kurtz is a Fox News analyst and the host of \"MediaBuzz\" (Sundays 11 a.m.). He is the author of five books and is based in Washington. Follow him at @HowardKurtz. Click here for more information on Howard Kurtz.", "authors": ["Howard Kurtz"], "publish_date": "2017-06-27", "source": "foxnews", "top_words": ["ruling", "travel", "case", "courts", "trump", "ban", "gives", "yesterday", "narrative", "court", "week", "trumps", "changes", "media", "justices", "boost"], "summary": "In allowing key parts of President Trump’s travel ban to take effect, the high court—with help from Trump’s man Neil Gorsuch—upended the conventional wisdom on the case.\nAfter all, in agreeing to hear the case in October, the justices could have left the temporary stay in place pending a final ruling.\nThat narrative took hold as the lower courts rejected two successive versions of the ban.\nNow there’s little question that the first travel order was hastily drafted and rushed out in the administration’s first week.\nThree justices, including Gorsuch, wanted to let the entire travel ban take effect."}