{"url": "http://www.foxnews.com/politics/2017/03/09/legal-challenges-to-trumps-travel-ban-mount-from-us-states.html", "id": "113", "title": "Legal challenges to Trump's travel ban mount from US states", "text": "Legal challenges against President Donald Trump's revised travel ban mounted Thursday as Washington state said it would renew its request to block the executive order.\n\nIt came a day after Hawaii launched its own lawsuit, and Washington state Attorney General Bob Ferguson said both Oregon and New York had asked to join his state's legal action.\n\nWashington was the first state to sue over the original ban, which resulted in Judge James Robert in Seattle halting its implementation around the country. Ferguson said the state would ask Robart to rule that his temporary restraining order against the first ban applies to Trump's revised action.\n\nTrump's revised ban bars new visas for people from six predominantly Muslim countries: Somalia, Iran, Syria, Sudan, Libya and Yemen. It also temporarily shuts down the U.S. refugee program.\n\nUnlike the initial order, the new one says current visa holders won't be affected, and removes language that would give priority to religious minorities.\n\nFerguson said it's not the government, but the court, that gets to decide whether the revised order is different enough that it would not be covered by previous temporary restraining order.\n\n\"It cannot be a game of whack-a-mole for the court,\" he said. \"That TRO we've already obtained remains in effect.\"\n\nIn filing a lawsuit Wednesday night, Hawaii said the revised order would harm its Muslim population, tourism and foreign students\n\nIn his initial lawsuit Ferguson said the original ban was unconstitutional and hurt the state's businesses and universities.\n\nA federal appellate court later upheld a temporary restraining order issued against the first travel ban.\n\nThe Trump administration says the old order will be revoked once the new one goes into effect on March 16.\n\nAttorneys for Hawaii filed the lawsuit against the U.S. government in federal court in Honolulu. The state had previously sued over Trump's initial travel ban, but that lawsuit was put on hold while other cases played out across the country.\n\nHawaii's complaint says it is suing to protect its residents, businesses and schools, as well as its \"sovereignty against illegal actions of President Donald J. Trump and the federal government.\"", "authors": [], "publish_date": "2017-03-09", "source": "foxnews", "top_words": ["travel", "challenges", "restraining", "revised", "ban", "state", "order", "mount", "court", "trumps", "lawsuit", "states", "temporary", "legal"], "summary": "Legal challenges against President Donald Trump's revised travel ban mounted Thursday as Washington state said it would renew its request to block the executive order.\nFerguson said the state would ask Robart to rule that his temporary restraining order against the first ban applies to Trump's revised action.\nTrump's revised ban bars new visas for people from six predominantly Muslim countries: Somalia, Iran, Syria, Sudan, Libya and Yemen.\nA federal appellate court later upheld a temporary restraining order issued against the first travel ban.\nThe state had previously sued over Trump's initial travel ban, but that lawsuit was put on hold while other cases played out across the country."}