{"url": "http://www.foxnews.com/politics/2017/03/30/trump-travel-ban-administration-appeals-hawaii-judges-new-ruling-blocking-ban.html", "id": "128", "title": "Trump travel ban: Administration appeals Hawaii judge's new ruling blocking ban", "text": "President Trump’s administration on Thursday appealed the latest court ruling against his revised travel ban to the same court that refused to reinstate the original version.\n\nA day earlier, U.S. District Judge Derrick Watson in Hawaii handed the government its latest defeat by issuing a longer-lasting hold on Trump’s executive order.\n\nThe Department of Justice filed the appeal with the Ninth U.S. Circuit Court of Appeals. The San Francisco Chronicle reported that the appeals court had rejected Trump’s previous order. The court upheld the decision in a 3-0 ruling on Feb. 9. The main argument from the Trump administration was that judges do not have the authority to second-guess executive decisions on items like immigration and national security, the report said.\n\nWatson’s decision came after the DOJ argued for a narrower ruling covering only the ban on new visas for people from six Muslim-majority countries. The department urged the judge to allow a freeze on the U.S. refugee program to go forward.\n\nGovernment attorney Chad Readler said halting the flow of refugees had no effect on Hawaii and the state has not shown how it is harmed by the ban. Watson disagreed.\n\nThe administration says the executive order falls within the president’s power to protect national security and will ultimately succeed, while Hawaii Attorney General Douglas Chin likened the revised ban to a neon sign flashing “Muslim ban” that the government hasn’t turned off.\n\nThe White House believes Trump’s executive order is legal, necessary for national security and will ultimately be allowed to move forward, spokesman Sean Spicer said Thursday.\n\nWatson’s indefinite hold is “just the latest step that will allow the administration to appeal,” Spicer said.", "authors": [], "publish_date": "2017-03-30", "source": "foxnews", "top_words": ["ruling", "executive", "travel", "judges", "trump", "hawaii", "ban", "appeals", "security", "national", "blocking", "court", "trumps", "order", "administration", "latest"], "summary": "President Trump’s administration on Thursday appealed the latest court ruling against his revised travel ban to the same court that refused to reinstate the original version.\nA day earlier, U.S. District Judge Derrick Watson in Hawaii handed the government its latest defeat by issuing a longer-lasting hold on Trump’s executive order.\nThe San Francisco Chronicle reported that the appeals court had rejected Trump’s previous order.\nThe main argument from the Trump administration was that judges do not have the authority to second-guess executive decisions on items like immigration and national security, the report said.\nThe White House believes Trump’s executive order is legal, necessary for national security and will ultimately be allowed to move forward, spokesman Sean Spicer said Thursday."}