{"url": "http://www.foxnews.com/politics/2017/03/08/hawaii-sues-to-block-trumps-revised-travel-ban.html", "id": "111", "title": "Hawaii sues to block Trump's revised travel ban", "text": "Lawyers for the State of Hawaii on Wednesday asked a federal judge to temporarily block President Trump’s revised executive order on immigration. The move could signal a wave of lawsuits expected to follow over the constitutionality of the proposal.\n\nHawaii’s Attorney General Doug Chin, a Democrat, filed the legal challenge in federal distict court in Hawaii. Lawyers for the state argued that “the new executive order is resulting in the establishment of religion in the State of Hawaii contrary to its state Constitution.”\n\nThe filing also says the revised ban will damage Hawaii’s “economy, educational institutions, and tourism industry; and it is subjecting a portion of the state’s citizens to second-class treatment and discrimination, while denying all Hawaii residents the benefits of an inclusive and pluralistic society.”\n\nLawyers for the state said they will move for a temporary restraining order on March 15, a day before the new executive order is supposed to take effect.\n\n\"This new executive order is nothing more than Muslim Ban 2.0,\" Chin said in a statement Monday. \"Under the pretense of national security, it still targets immigrants and refugees. It leaves the door open for even further restrictions.\"\n\nThe new order bars new visas for people from six predominantly Muslim nations and temporarily shuts down America's refugee program, affecting would-be visitors and immigrants from Iran, Syria, Somalia, Sudan, Yemen and Libya.\n\nHawaii was among several states that took the Trump administration to court over the first ban that was rolled out hastily by the White House.\n\nIn all, more than two dozen lawsuits were filed to the original travel ban. One suit, filed in Washington state, succeeded in having the order suspended by arguing that it violated constitutional protections against religious discrimination.\n\nAfter a federal appeals court upheld the Washington State Judge’s nationwide restraining order early last month, the Federal District Court in Hawaii hit the pause button on its initial lawsuit. The same federal appeals court, the 9th Circuit, has jurisdiction over Hawaii and would handle any appeal stemming from a ruling there.\n\nFox News' Lee Ross contributed to this report.", "authors": ["Barnini Chakraborty"], "publish_date": "2017-03-08", "source": "foxnews", "top_words": ["executive", "travel", "hawaii", "revised", "ban", "temporarily", "state", "block", "court", "sues", "trumps", "federal", "filed", "order", "washington"], "summary": "Lawyers for the State of Hawaii on Wednesday asked a federal judge to temporarily block President Trump’s revised executive order on immigration.\nHawaii’s Attorney General Doug Chin, a Democrat, filed the legal challenge in federal distict court in Hawaii.\n\"This new executive order is nothing more than Muslim Ban 2.0,\" Chin said in a statement Monday.\nOne suit, filed in Washington state, succeeded in having the order suspended by arguing that it violated constitutional protections against religious discrimination.\nThe same federal appeals court, the 9th Circuit, has jurisdiction over Hawaii and would handle any appeal stemming from a ruling there."}