{"url": "http://www.foxnews.com/politics/2017/03/08/hawaii-plans-to-fight-president-trumps-revised-travel-ban.html", "id": "110", "title": "Hawaii plans to fight President Trump's 'Muslim Ban 2.0'", "text": "Attorneys for Hawaii are planning to file paperwork Wednesday to challenge President Trump's revised travel ban, which goes into effect on March 16.\n\nLawyers for the state said they will move for a temporary restraining order on March 15, a day before the new executive order is supposed to take effect.\n\n\"This new executive order is nothing more than Muslim Ban 2.0,\" Hawaii Attorney General Doug Chin said in a statement Monday. \"Under the pretense of national security, it still targets immigrants and refugees. It leaves the door open for even further restrictions.\"\n\nThe new order bars new visas for people from six predominantly Muslim nations and temporarily shuts down America's refugee program, affecting would-be visitors and immigrants from Iran, Syria, Somalia, Sudan, Yemen and Libya.\n\nHawaii’s anticipated action does not prevent other states from challenging the revised travel ban.\n\nTuesday's filing informs the court that the state has been in touch with the Justice Department and that both sides are asking for an expedited briefing schedule to allow for a judicial ruling before March 16.\n\nLast month, U.S. District Court Judge Derrick Watson in Honolulu allowed the state to file an amended lawsuit adding the Muslim Association of Hawaii's imam as a plaintiff. The mother-in-law of Imam Ismail Elshikh is a Syrian national living in Syria, according to the lawsuit that details the effect the ban would have had on Elshikh's family and others in Hawaii.\n\nAccording to the motion, attorneys for the government had no position on the request to file another amended lawsuit.\n\nFox News’ Lee Ross and the Associated Press contributed to this report.", "authors": [], "publish_date": "2017-03-08", "source": "foxnews", "top_words": ["travel", "file", "hawaii", "revised", "national", "plans", "fight", "ban", "state", "trumps", "syria", "lawsuit", "order", "president", "muslim", "20"], "summary": "Attorneys for Hawaii are planning to file paperwork Wednesday to challenge President Trump's revised travel ban, which goes into effect on March 16.\n\"This new executive order is nothing more than Muslim Ban 2.0,\" Hawaii Attorney General Doug Chin said in a statement Monday.\nHawaii’s anticipated action does not prevent other states from challenging the revised travel ban.\nLast month, U.S. District Court Judge Derrick Watson in Honolulu allowed the state to file an amended lawsuit adding the Muslim Association of Hawaii's imam as a plaintiff.\nAccording to the motion, attorneys for the government had no position on the request to file another amended lawsuit."}