{"url": "http://www.foxnews.com/politics/2017/07/06/trump-travel-ban-exceptions-left-in-place-by-hawaii-judge.html", "id": "188", "title": "Trump travel ban exceptions left in place by Hawaii judge", "text": "A federal judge in Hawaii on Thursday denied a motion to expand the exceptions to President Donald Trump's executive order banning travel to the United States for citizens from six majority-Muslim countries.\n\nU.S. District Court Judge Derrick Watson denied an emergency motion filed by Hawaii asking him to clarify what the U.S. Supreme Court meant by a \"bona fide\" relationship in its ruling last month.\n\n\n\nThe Supreme Court ruled the administration could mostly enforce its travel ban, but said those \"with a credible claim of a bona fide relationship with a person or entity in the United States\" could enter.\n\n\n\nWatson said the relationship question would be better posed to the Supreme Court, not him.\n\n\n\nTRUMP TRAVEL BAN: SUPREME COURT REINSTATES KEY PARTS OF EXECUTIVE ORDER\n\n\"This court will not upset the Supreme Court's careful balancing and `equitable judgment,\"' Watson said in his order.\n\n\n\nHawaii attorney general Doug Chin objected to the administration's omission of grandparents, aunts and uncles from its list of people meeting the definition of a close relationship.\n\n\n\nThe Trump administration has said the exemption to the ban would apply to citizens of the six countries with a parent, spouse, child, adult son or daughter, son-in-law, daughter-in-law or sibling already in the U.S.\n\n\n\nThe U.S. Department of Justice said in an emailed statement that it was pleased with the decision.\n\n\n\n\"If the plaintiffs elect to proceed, we are confident that the U.S. Supreme Court will again vindicate the President and his constitutional duty to protect the national security of the United States,\" the department said.\n\n\n\nHakim Ouansafi, president of the Muslim Association of Hawaii, said he respects Watson's ruling but thinks there will be more opportunities to ensure the ban does not exclude grandparents and others close family members.\n\n\n\n\"We will have people directly affected by this, for sure,\" Ouansafi said. \"When you exclude that many people, the circle is much wider.\"\n\n\n\nIn March, Watson blocked the ban on travelers from Syria, Sudan, Somalia, Libya, Iran and Yemen in response to a lawsuit by the state of Hawaii that argued the policy discriminates against Muslims.\n\n\n\nWatson said there was \"significant and unrebutted evidence of religious animus\" behind the ban, which prevents new visas for people from the six countries and suspends the nation's refugee program. The administration appealed to the San Francisco-based 9th U.S. Circuit Court of Appeals, which largely upheld Watson's injunction.\n\n\n\nThe U.S. Supreme Court said the president's ban on visitors from the six countries can be enforced pending arguments scheduled for October, as long as those visitors lack a \"credible claim of a bona fide relationship with a person or entity in the United States.\" Likewise, the justices said, refugees can travel to the U.S. if they demonstrate those connections.\n\n\n\nThe high court's majority laid out the \"bona fide\" relationships it had in mind. For individuals, a close family relationship is required:\n\nA spouse or a mother-in-law would be permitted. So would a worker who accepted a job from an American company, a student enrolled at a U.S. university or a lecturer invited to address a U.S. audience.\n\n\n\nA relationship created for purposes of avoiding the travel ban would not be bona fide, the justices said.\n\n\n\nThe Associated Press contributed to this report.", "authors": [], "publish_date": "2017-07-06", "source": "foxnews", "top_words": ["fide", "travel", "relationship", "hawaii", "trump", "ban", "place", "supreme", "bona", "judge", "court", "united", "exceptions", "left", "states"], "summary": "A federal judge in Hawaii on Thursday denied a motion to expand the exceptions to President Donald Trump's executive order banning travel to the United States for citizens from six majority-Muslim countries.\nWatson said the relationship question would be better posed to the Supreme Court, not him.\nTRUMP TRAVEL BAN: SUPREME COURT REINSTATES KEY PARTS OF EXECUTIVE ORDER\"This court will not upset the Supreme Court's careful balancing and `equitable judgment,\"' Watson said in his order.\nThe high court's majority laid out the \"bona fide\" relationships it had in mind.\nA relationship created for purposes of avoiding the travel ban would not be bona fide, the justices said."}