{"url": "http://www.foxnews.com/politics/2017/06/06/trump-defends-twitter-use-blasts-msm-criticism.html", "id": "163", "title": "Trump defends Twitter use, blasts 'MSM' criticism", "text": "President Trump defended his unorthodox use of social media on Tuesday, responding to criticism over his recent Twitter tear regarding his “travel ban” by saying mainstream media outlets “hate that I can get the honest and unfiltered message out.”\n\nThe president a day earlier criticized his own Justice Department for issuing a “watered down” travel ban for people from six mostly Muslim countries, while also taking a shot at the judiciary system as the case hits the Supreme Court.\n\nCritics questioned whether Trump was undermining the DOJ’s argument, and also lashed out at the president for continuing a Twitter feud with London Mayor Sadiq Khan.\n\nBut Trump tweeted Tuesday, “The FAKE MSM is working so hard trying to get me not to use Social Media. They hate that I can get the honest and unfiltered message out.”\n\nHe added, “Sorry folks, but if I would have relied on the Fake News of CNN, NBC, ABC, CBS, washpost or nytimes, I would have had ZERO chance winning WH.”\n\nMeanwhile, Trump commented Tuesday on the decision of Saudi Arabia and other Middle Eastern countries to cut ties with Qatar over its alleged support for terrorism.\n\nTrump said he heard such concerns on his recent trip to the region.\n\n“During my recent trip to the Middle East I stated that there can no longer be funding of Radical Ideology. Leaders pointed to Qatar - look!” he wrote.", "authors": [], "publish_date": "2017-06-06", "source": "foxnews", "top_words": ["travel", "recent", "qatar", "trump", "msm", "twitter", "unfiltered", "media", "blasts", "social", "defends", "president", "criticism", "trip"], "summary": "Critics questioned whether Trump was undermining the DOJ’s argument, and also lashed out at the president for continuing a Twitter feud with London Mayor Sadiq Khan.\nBut Trump tweeted Tuesday, “The FAKE MSM is working so hard trying to get me not to use Social Media.\nTrump said he heard such concerns on his recent trip to the region.\n“During my recent trip to the Middle East I stated that there can no longer be funding of Radical Ideology.\nLeaders pointed to Qatar - look!” he wrote."}