{"url": "http://www.foxnews.com/politics/2017/05/15/trump-travel-ban-faces-skeptical-panel-in-9th-circuit-hearing.html", "id": "149", "title": "Trump travel ban faces skeptical panel in 9th Circuit hearing", "text": "The legal hold on President Trump’s so-called travel ban seems unlikely to be lifted anytime soon, based on the tenor of oral arguments before a federal appellate court in Seattle on Monday.\n\nThe Trump administration’s top courtroom lawyer faced a trio of judges who expressed varying degrees of skepticism about the presidential decree that critics argue violates the Constitution’s religious protections.\n\nActing Solicitor General Jeffrey Wall was repeatedly asked to explain how controversial statements made by Trump and administration officials can allow a reasonable observer to conclude the purpose of the executive order was something other than prejudice against Muslims.\n\n\"How is a court to know if [the executive order] is a Muslim ban in the guise of national security justification?\" Judge Ronald Gould asked.\n\nSoon after, Judge Michael Hawkins asked if Trump had ever disavowed controversial campaign rhetoric likening the policy to a ban on Muslims from entering the country.\n\n\"Has he ever stood up and said, 'I said before I wanted to ban all members of the Islamic faith from entering the United States of America. I was wrong. I've consulted with lawyers. I'm now addressing it simply to security needs.' Has he ever said anything approaching that?\" Hawkins asked.\n\n“Yes, Judge Hawkins, he has said several things approaching that,\" Wall replied. \"I think that’s detailed in various amicus briefs.”\n\nPlaintiffs' lawyer Neal Katyal attacked that response. \"I thought his answer was surprising because he couldn’t actually point to any disavowal. He just cited en masse amicus briefs because the truth is there is no such statement,” he said.\n\nJudge Richard Paez called the president's pre-inaugurations comments \"profound\" though necessary to view through the perspective of heated campaign rhetoric.\n\nKatyal conceded the point about campaign hyperbole, and then drew attention to comments Trump made since taking office.\n\nThe president’s order, revised from its original text, would suspend travel and immigration from six mostly Muslim countries.\n\nIn March, a federal judge in Hawaii enjoined the order from taking effect, not based on the language of the directive, but rather the “religious animus” of comments Trump and his advocates made about the policy.\n\nWall, however, argues the president’s policy is not a “Muslim ban,” but rather Trump’s good faith effort to protect rights while securing the homeland from foreign terrorists.\n\nThe order would temporarily halt refugees from Iran, Libya, Somalia, Sudan, Syria and Yemen from entering the country. It also freezes refugee admissions so intelligence and security officials can review existing admission procedures.\n\nMonday’s hearing marked the second time the 9th Circuit Court of Appeals has heard a government appeal on the matter. Earlier this year, a different panel of judges affirmed a lower court injunction against the president’s initial travel ban order, which he revoked in issuing his second version.\n\nSeveral weeks ago Trump blasted the 9th Circuit, saying his opponents are “judge shopping” in the court that covers the western United States.\n\nThe three judges hearing Monday’s case were randomly chosen from the circuit’s members--all three were appointed by former President Bill Clinton. While some other 9th Circuit judges have said the president’s order is on sound legal ground, they were not impaneled on either case.\n\nLast week in Richmond, Virginia, another federal appellate court heard similar arguments over the president’s order. Either case – or both – could end up before the Supreme Court.", "authors": ["Lee Ross"], "publish_date": "2017-05-15", "source": "foxnews", "top_words": ["skeptical", "travel", "judges", "trump", "ban", "circuit", "security", "judge", "9th", "court", "faces", "order", "muslim", "hearing", "presidents", "panel"], "summary": "\"How is a court to know if [the executive order] is a Muslim ban in the guise of national security justification?\"\nThe president’s order, revised from its original text, would suspend travel and immigration from six mostly Muslim countries.\nEarlier this year, a different panel of judges affirmed a lower court injunction against the president’s initial travel ban order, which he revoked in issuing his second version.\nWhile some other 9th Circuit judges have said the president’s order is on sound legal ground, they were not impaneled on either case.\nLast week in Richmond, Virginia, another federal appellate court heard similar arguments over the president’s order."}