{"url": "http://www.foxnews.com/politics/2017/07/14/travel-ban-who-does-trumps-executive-order-block-from-entering-us.html", "id": "189", "title": "Travel ban: Who does Trump's executive order block from entering the US?", "text": "A federal judge on Thursday expanded the scope of just who could enter the U.S. under President Donald Trump’s travel ban.\n\nU.S. District Judge Derrick Watson in Hawaii ruled that grandparents, grandchildren, brothers-in-law, sisters-in-law, aunts, uncles, nieces, nephews and cousins of people in the U.S. could be allowed to come into the country.\n\nThe Supreme Court in June partially restored Trump’s executive order — widely seen as a Muslim ban — and the administration set new criteria for visa applicants and refugees. The ban stipulates that visa applicants must establish a “bona fide relationship” with a person already in the U.S. in order to travel.\n\nParents, spouses, children, siblings, fiancés and sons- or daughters-in-law were the initial approved relationships.\n\n\"Common sense, for instance, dictates that close family members be defined to include grandparents,\" Watson said in his ruling. \"Indeed grandparents are the epitome of close family members.\"\n\nHere’s a look at who the travel ban affects.\n\nWhat countries are impacted?\n\nTrump’s travel ban blocks people from six Muslim-majority nations from entering the country. Those countries are: Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nNew guidelines stipulate that visa applicants from those six nations must be able to prove a “bona fide relationship” in the U.S. If an applicant cannot prove that relationship, then they will be barred from the U.S. for 90 days.\n\nHowever, there are exceptions. People who already secured visas will still be allowed. Those entering the U.S. for business purposes, students and journalists might also be allowed so long as that they have the proper documentation, a State Department official told Fox News.\n\nTRUMP ADMINISTRATION SETS NEW VISA RULES FOR TRAVEL BAN\n\nConsular officers may grant other exemptions to applicants from the six nations if they have \"previously established significant contacts with the United States;\" ''significant business or professional obligations\" in the U.S.; if they are an infant, adopted child or in need of urgent medical care; if they are traveling for business with a recognized international organization or the U.S. government or if they are a legal resident of Canada who applies for a visa in Canada, according to the cable sent to embassies.\n\nWho are these ‘bona fide’ relationships?\n\nDuring the time between the Supreme Court’s ruling and when the travel ban will actually take effect, the State and Justice Departments established definitions for who exactly could fall under the bona fide relationship category.\n\nParents, spouses, children, siblings, fiancés and sons- or daughters-in-law were initially the approved relationships.\n\nGrandparents, grandchildren, aunts, uncles, nieces, nephews, cousins, brothers-in-law, sisters-in-law and other extended family were not accepted as “close family.”\n\nUS JUDGE IN HAWAII LEAVES TRUMP'S TRAVEL BAN RULES IN PLACE\n\nBut a federal judge ruled on July 13 that grandparents, grandchildren, brothers-in-law, sisters-in-law, aunts, uncles, nieces, nephews and cousins of people in the U.S. could be considered a “bona fide” relationship.\n\nIn its ruling, the Supreme Court did not specify who exactly could count as a close relation to a person wishing to enter the U.S. – allowing Hawaii to challenge the interpretation.\n\nAttorney General Jeff Sessions said Friday that the administration \"will now reluctantly return directly to the Supreme Court to again vindicate the rule of law and the Executive Branch's duty to protect the nation.”\n\nThings such as a hotel reservation also do not count as a bona fide relationship.\n\nA legitimate relationship should be “formal, documented and formed in the ordinary course rather than for the purpose of evading” the executive order.\n\nWhat about refugees?\n\nThe same requirements of visa applicants apply to refugees who will be barred for at least 120 days.\n\nHowever, the State Department said it will continue with its resettlement of refugees who had already been accepted through July, an official told Fox News.\n\nTRUMP TRAVEL BAN: TIMELINE OF A LEGAL JOURNEY\n\nTrump set a 50,000-person cap on the number of refugees accepted into the country through the end of September. That cap was reached July 12.\n\nHow is the government’s diversity program affected?\n\nUnder the new rules, would-be immigrants from the six affected countries who won a coveted visa in the government's diversity lottery — a program that randomly awards 50,000 green cards annually to people from countries with low rates of immigration to the United States — will also have to prove they have a \"bona fide relationship\" with in the U.S. or are eligible for another waiver or face being banned for at least 90 days. That hurdle may be a difficult one for those immigrants to overcome, as many visa lottery winners don't have relatives in the U.S. or jobs in advance of arriving in the country.\n\nGenerally, winners in the diversity lottery only need prove they were born in an eligible country and have completed high school or have at least two years of work experience in an occupation that requires at least two other years of training or experience.\n\nThe Associated Press contributed to this report.", "authors": ["Kaitlyn Schallhorn"], "publish_date": "2017-07-14", "source": "foxnews", "top_words": ["executive", "does", "travel", "fide", "relationship", "applicants", "ban", "bona", "supreme", "block", "refugees", "entering", "trumps", "order", "visa", "prove"], "summary": "A federal judge on Thursday expanded the scope of just who could enter the U.S. under President Donald Trump’s travel ban.\nThe Supreme Court in June partially restored Trump’s executive order — widely seen as a Muslim ban — and the administration set new criteria for visa applicants and refugees.\nThe ban stipulates that visa applicants must establish a “bona fide relationship” with a person already in the U.S. in order to travel.\nHere’s a look at who the travel ban affects.\nTrump’s travel ban blocks people from six Muslim-majority nations from entering the country."}