{"url": "http://www.foxnews.com/politics/2017/03/06/gop-lawmakers-get-behind-trump-immigration-order-reboot-amid-new-legal-threats.html", "id": "100", "title": "GOP lawmakers get behind Trump immigration order reboot amid new legal threats", "text": "Republican lawmakers largely endorsed President Trump’s revised immigration executive order on Monday and suggested it addressed concerns they had about the original measure, even as a coalition of Democratic attorneys general and civil rights groups prepared for a new round of legal action.\n\nHouse Speaker Paul Ryan, who had voiced reservations about the original travel ban rollout, said the new version advances “our shared goal” of protecting the United States.\n\nAnother Republican critical of the original version, South Carolina Sen. Lindsey Graham, said he believes the revised order will “pass legal muster.”\n\n“I congratulate the administration for modifying the original order to ensure that it is prospective in application, protective of those with valid visas and legal status, and exempts Iraqis, as five thousand Americans are currently fighting alongside them against ISIL,” Graham said in a statement.\n\nTrump’s revised executive order, signed Monday, suspends the refugee program and entry to the U.S. for travelers from six mostly Muslim countries, curtailing what was a broadly worded directive in a bid to withstand court scrutiny.\n\nAs before, the order will suspend refugee entries for 120 days. But it no longer will suspend Syrian refugee admissions indefinitely.\n\nThe new order also will ban travelers from six countries who did not obtain a visa before Jan. 27 from entering the United States for 90 days. The directive no longer includes Iraq, as the original order did, but covers travelers from Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nIraq, a key U.S. ally in the fight against terror group ISIS, was removed from the travel ban list after Secretary of State Rex Tillerson said he spoke with the Iraqi government about its vetting process and felt that the screening system was thorough enough to stand on its own.\n\nAs Republican lawmakers threw their political weight behind the revised version, Democratic officials in Washington, Virginia and Massachusetts said they were considering their next legal steps.\n\nWashington Attorney General Bob Ferguson, who took the Trump administration to court over the constitutionality of the original order, said Monday he still has legal concerns about the updated language.\n\nAt a news conference, he said he and his office will review the policy and will decide on a course of action later this week.\n\n“I do not take lightly suing the president of the United States,” he said.\n\nMassachusetts Attorney General Maura Healey said she’s also considering legal options in response to the reworked travel ban. Healy called the newest language misguided and said it is “a clear attempt to resurrect a discredited order and fulfill a discriminatory and unconstitutional campaign promise.”\n\nVirginia Attorney General Mark Herring, who also led a legal challenge to Trump’s first ban, said the new directive still “sends a horrible message to the world.”\n\n\"Our goal has always been to protect the commonwealth of Virginia and our residents who were harmed by President Trump's ill-conceived, poorly-implemented, and un-American ban, particularly green card holders and those at our businesses and colleges with valid work and student visas,” he said. “It is significant that after we won the nation's first preliminary injunction against the ban, President Trump has now revoked his original order and apparently exempted all those persons from his revised order.\"\n\nChicago Mayor Rahm Emanuel calling the revision a betrayal of the country’s core values.\n\n“The legal grounds of the first travel ban were questionable at best, and today’s iteration is nothing more than a wolf in sheep’s clothing – different packaging intended to achieve the same result,” Emanuel said in a statement, adding that the order would “slam the door” on refugees fleeing war-torn countries.\n\nUnlike the first rocky rollout of the executive order, Trump privately signed the new directive while Tillerson, Attorney General Jeff Sessions and Homeland Security Secretary John Kelly formally unveiled it. The Trump-free event was in contrast to the first version of the order that the president signed in a high-profile ceremony at the Pentagon’s Hall of Heroes.\n\nTillerson defended the new order on Monday, saying Trump is using “his rightful authority” to keep people safe with the new directive.\n\n“This order is part of our ongoing efforts to eliminate vulnerabilities that radical Islamic terrorists can and will exploit,” he added.\n\nKelly said the new executive order “will make America more secure.”\n\n“Unvetted travel isn’t a privilege especially when national security is at stake,” he said.\n\nAmong other things, the revised order also makes clear that green card holders are not affected.\n\n“If you have travel documents, if you actually have a visa, if you are a legal permanent resident, you are not covered under this particular executive action,” White House Counselor Kellyanne Conway told Fox News on Monday. “I think people will see six or seven major points about this executive order that do clarify who is covered.”\n\nThe Trump administration also plans to cap the number of refugees it accepts to 50,000 a year – down sharply from the 110,000 accepted by the Obama administration.\n\nAccording to the new executive order, the U.S. Department of Homeland Security will have 20 days to perform a “global, country-by-country review of the identity and security information that each country provides to the U.S. government to support U.S. visa and other immigration benefit determinations.”\n\nCountries will then have 50 days to comply with requests to update or improve the “quality” of the information they provide to U.S. officials.\n\nFor countries that don’t comply, the State Department, DHS and intelligence agencies can make additional recommendations on what, if any, restrictions should be imposed.\n\nThe new order also details categories of people eligible to enter the United States for business or medical travel purposes.\n\nAlmost immediately, there was pushback from Democratic lawmakers and human rights groups.\n\n“A watered down ban is still a ban,” Sen. Charles Schumer, D-N.Y., said. “Despite the administration’s changes, this dangerous executive order makes us less safe, not more, it is mean-spirited, and un-American. It must be repealed.”\n\nOmar Jadwat, director of the ACLU’s Immigrants’ Rights Project, agreed.\n\n“President Trump has recommitted himself to religious discrimination, and he can expect continued disapproval from both the courts and the people,” he said in a statement.\n\nMore than two dozen lawsuits were filed in response to the original travel ban. The suit filed in Washington state succeeded in having the order suspended by arguing that it violated constitutional protections against religious discrimination.\n\nThe White House was criticized the first time around for its rocky rollout of the travel ban. Trump has expressed frustration both in person and on social media over the stalled ban, at times targeting the courts and federal judges who he claimed put the country at risk by holding up the order.\n\nLast week, Trump told reporters at the White House that “the new order is going to be very much tailored to what I consider to be a very bad decision.”\n\nDespite widespread belief the first order was done in haste, Trump and other White House officials have repeatedly called it a success.", "authors": ["Barnini Chakraborty"], "publish_date": "2017-03-06", "source": "foxnews", "top_words": ["executive", "original", "travel", "reboot", "amid", "trump", "revised", "gop", "ban", "immigration", "threats", "general", "lawmakers", "order", "president", "legal"], "summary": "The directive no longer includes Iraq, as the original order did, but covers travelers from Iran, Libya, Somalia, Sudan, Syria and Yemen.\nAmong other things, the revised order also makes clear that green card holders are not affected.\n“Despite the administration’s changes, this dangerous executive order makes us less safe, not more, it is mean-spirited, and un-American.\nMore than two dozen lawsuits were filed in response to the original travel ban.\nThe White House was criticized the first time around for its rocky rollout of the travel ban."}