{"url": "http://www.foxnews.com/politics/2017/07/14/trump-travel-ban-hawaii-judge-expands-list-relatives-exempted-from-order.html", "id": "191", "title": "Trump travel ban: Hawaii judge expands list of relatives exempted from order", "text": "A federal judge in Hawaii on Thursday expanded the list of “bona fide” family relationships needed by people seeking new visas from six majority Muslim countries to avoid President Trump’s travel ban.\n\nU.S. District Judge Derrick Watson ordered the U.S. not to enforce the travel ban on grandparents, grandchildren, brothers-in-law, sisters-in-law, aunts, uncles, nieces, nephews and cousins of people in the U.S.\n\n\"Common sense, for instance, dictates that close family members be defined to include grandparents,\" Watson said in his ruling. \"Indeed grandparents are the epitome of close family members.\"\n\nThe travel ban affects those trying to enter the U.S. from Syria, Sudan, Somalia, Libya, Iran and Yemen.\n\nHawaii Attorney General Douglas S. Chin applauded the ruling late Thursday, saying the court makes it clear that the administration “may not ignore the scope of the partial travel ban as it sees fit.”\n\n\"Family members have been separated and real people have suffered enough,” he said.\n\nLast month, the Supreme Court exempted visa applicants from the ban if they could prove a “bona fide” relationship with a U.S. citizen or entity. The White House had previously said the ban would not apply to citizens of six countries with a parent, spouse, fiancé, son, daughter, son-in-law, daughter-in-law, or sibling already in the U.S.\n\nHawaii said grandparents, uncles and aunts and other close relatives should also be exempted. The state asked Watson, who blocked the president's revised travel ban in March, to clarify that those family members are also exempt from the ban.\n\nWatson rejected Hawaii's request, saying the state should go to the U.S. Supreme Court since it was seeking to clarify that court's requirement of a \"bona fide relationship.\"\n\nHawaii appealed Watson's ruling to the 9th U.S. Circuit Court of Appeals, but the court said Watson's ruling was not appealable under federal judicial laws. The 9th Circuit, however, said Watson had the authority to interpret the Supreme Court's order and block any violation of it. Hawaii then renewed its last week request with Watson in a different form.\n\n\"Because plaintiffs now seek such injunctive relief, the court reaches the merits of their request, consistent with the Ninth Circuit's guidance,\" Watson wrote.\n\nThe Associated Press contributed to this report.", "authors": [], "publish_date": "2017-07-14", "source": "foxnews", "top_words": ["list", "exempted", "travel", "ruling", "hawaii", "trump", "ban", "expands", "family", "supreme", "judge", "court", "members", "relatives", "order", "request", "watson", "grandparents"], "summary": "A federal judge in Hawaii on Thursday expanded the list of “bona fide” family relationships needed by people seeking new visas from six majority Muslim countries to avoid President Trump’s travel ban.\n\"Indeed grandparents are the epitome of close family members.\"\nThe travel ban affects those trying to enter the U.S. from Syria, Sudan, Somalia, Libya, Iran and Yemen.\nLast month, the Supreme Court exempted visa applicants from the ban if they could prove a “bona fide” relationship with a U.S. citizen or entity.\nThe state asked Watson, who blocked the president's revised travel ban in March, to clarify that those family members are also exempt from the ban."}