{"url": "http://www.foxnews.com/politics/2017/05/09/muslim-ban-language-scrubbed-from-trump-campaign-website.html", "id": "142", "title": "'Muslim ban' language scrubbed from Trump campaign website", "text": "A 2016 press release calling for a ban on Muslim immigration was scrubbed from the Trump campaign website Monday -- just as the White House press secretary was quizzed on the existence of the page amid a court battle over the president’s controversial travel ban.\n\nThe website’s URL was still valid Tuesday and goes to a Trump campaign page, but the text once under the heading of “DONALD J. TRUMP STATEMENT ON PREVENTING MUSLIM IMMIGRATION” had disappeared by Monday afternoon.\n\nDuring the campaign, Trump called for a temporary ban on Muslim immigration “until we can figure out what is going on” in the wake of the San Bernardino terror attack in December 2015. But his words caused problems after he took office, when he signed an order restricting travel from several terror-prone countries.\n\nWhile the order was not itself a Muslim ban, and only restricted travel from countries flagged by the Obama administration -- including Libya, Iraq, Syria and Somalia – opponents noted the countries were majority-Muslim and invoked Trump campaign statements to bolster their case.\n\nA federal appeals court blocked the initial order, ruling that the language used by Trump during the campaign gave a window into the administration’s thinking, and that therefore the order was unconstitutional as it discriminated based on religion. The administration revised the ban but opponents still point to Trump’s calls for a Muslim ban on the campaign trail as proof the order is discriminatory.\n\nWhite House Press Secretary Sean Spicer was quizzed Monday by ABC News as to why the language calling for a “total and complete shutdown” of Muslims entering the U.S. was still on the campaign website.\n\n“I’m not aware of what’s on the campaign website, you’d have to ask them,” Spicer responded.\n\nThe page, though, reportedly was scrubbed just before attorneys opposing the revised order in a hearing at the 4th Circuit Court of Appeals Monday cited the continued presence of the remarks on the campaign website as a sign the administration was motivated by anti-Muslim prejudice.\n\nActing Solicitor General Jeffrey B. Wall, representing President Trump, argued that the court should not second-guess the president's national security decisions because of comments made on the campaign trail.\n\nJudge Robert B. King said the case appears to hinge on whether the court considers Trump's statements or focuses solely on the text of the order, which is religiously neutral.\n\nThe case comes as former acting Attorney General Sally Yates doubled down on her refusal to defend the order in January -- a move which led to her being fired by the administration.\n\n“I made a determination that I believed that it was unlawful. I also thought that it was inconsistent with the principles of the Department of Justice,” Yates said at a Senate hearing Monday. “And I said no.”\n\nThe Associated Press contributed to this report.\n\nAdam Shaw is a Politics Reporter and occasional Opinion writer for FoxNews.com. He can be reached here or on Twitter: @AdamShawNY.", "authors": ["Adam Shaw"], "publish_date": "2017-05-09", "source": "foxnews", "top_words": ["campaign", "travel", "trump", "ban", "scrubbed", "court", "press", "order", "muslim", "page", "website", "language"], "summary": "A 2016 press release calling for a ban on Muslim immigration was scrubbed from the Trump campaign website Monday -- just as the White House press secretary was quizzed on the existence of the page amid a court battle over the president’s controversial travel ban.\nThe website’s URL was still valid Tuesday and goes to a Trump campaign page, but the text once under the heading of “DONALD J. TRUMP STATEMENT ON PREVENTING MUSLIM IMMIGRATION” had disappeared by Monday afternoon.\nDuring the campaign, Trump called for a temporary ban on Muslim immigration “until we can figure out what is going on” in the wake of the San Bernardino terror attack in December 2015.\nThe administration revised the ban but opponents still point to Trump’s calls for a Muslim ban on the campaign trail as proof the order is discriminatory.\n“I’m not aware of what’s on the campaign website, you’d have to ask them,” Spicer responded."}