{"url": "http://www.foxnews.com/opinion/2017/01/30/trumps-travel-ban-and-democrats-big-con.html", "id": "15", "title": "Trump's travel ban and the Democrats' big con", "text": "If you are trying to understand what all the hoopla regarding President Trump’s so-called refugee ban is about—and what the Democrats’ overall strategy is in dealing with Trump--you’d better go watch \"The Sting.\"\n\nThat 1973 classic directed by George Roy Hill is about two “grifters” or con men played by Robert Redford and Paul Newman who assemble a “mob” of accomplices and fellow cons to convince a rich sucker or “mark” to bet half a million dollars in a horse race he thinks is fixed. In fact the racing parlor (in con man lingo the “store,” which looks like a legitimate business but is in fact a complete sham) where he places the bet is a phony set-up, and Redford and Newman get away with his money scot free.\n\nThis is exactly what the Democratic Party has done for decades. The grifters in this case are Democrat leaders like Nancy Pelosi and Chuck Schumer. The store is the mainstream media from NY Times to NBC and CNN and the mob are the rent-a-crowd demonstrators who turn up to make a fuss in front the store’s cameras, whether it’s in the Women’s March last weekend or at the San Francisco Airport this weekend.\n\nWho are the marks? They’re gullible Republicans whom the Democrat grifters and the media con into believing the American public wants them to stand behind a Democratic initiative in a show of bipartisanship, or to oppose a Republican one on the grounds that’s it’s too extreme. The promised score is popularity among moderates and independents, as well as mention in the New York Times as a principled conservative or maverick for breaking with their party—when in fact it’s the Democrats who actually win and the Republican mark who loses with his own base thanks to the sting.\n\nThat’s what happening with the media hysteria over Trump’s “Muslim ban”(in fact it’s a temporary ban that effects exactly seven countries, ones on which the Obama administration already placed travel limits as “countries of concern”) and it’s what going to erupt when Trump announces his Supreme Court pick on Tuesday night.\n\nIt’s a well-worn con by this time. Democrats used it to convince GOP moderates we were losing the Vietnam War and that Americans wanted us to pull out (in fact poll after poll showed the public supported the war until the very end). They’ve used it to claim the public wants stricter gun control laws, and opposes any federal spending cuts or government shutdown. More recently they’ve used it to convince GOP marks that if they were going to win over Hispanics they have to support amnesty for illegal immigrants; and that waterboarding is “tantamount to torture.”\n\nBut their biggest score was in 1974 when the Democrat/media con game was able to peel off enough Republicans to impeach Richard Nixon and force him to resign—a score they later tried and failed with Ronald Reagan over Iran-Contra, but now hope to see repeated with President Trump.\n\nIn addition, they know some GOP marks keep coming back for more, even when they’ve been taken. There’s John McCain, for example, whom they stung in the 2008 presidential race, but is still willing to act as “maverick” on issues like waterboarding and Trump’s relations with Vladimir Putin. There was Marco Rubio on comprehensive immigration “reform,” until he wised up and saw that Chuck Schumer and others were just playing him as a sucker.\n\nBecause Republicans slowly are wising up, just as the public has. They are realizing what CNN and the New York Times present as the burning issues of our time—police violence against blacks or the “hacked election” a couple weeks ago or this weekend’s “Muslim ban”--are really all part of the sting. That’s going to make the Democrat grifters’ job harder this time. It will also make it easier to blow the whistle on the scammers, as Trump advisor Steve Bannon did when he branded the mainstream media “the opposition party”—although the opposition’s phony “store” would be more accurate.\n\nIn the movie \"The Sting\" one of the grifters says about the mark, “He’s not as tough as he looks.” The other replies sheepishly, “Neither are we.” Neither are the Democrats, once you catch on to their big con.\n\nHistorian Arthur Herman is a senior fellow at the Hudson Institute in Washington, D.C. He is author of several books. His latest \"Douglas MacArthur: American Warrior\", was published by Random House on June 14, 2016. Follow him on Twitter @ArthurLHerman.", "authors": ["Arthur Herman"], "publish_date": "2017-01-30", "source": "foxnews", "top_words": ["travel", "store", "ban", "public", "democrats", "big", "theyve", "trumps", "times", "fact", "media", "grifters", "used"], "summary": "If you are trying to understand what all the hoopla regarding President Trump’s so-called refugee ban is about—and what the Democrats’ overall strategy is in dealing with Trump--you’d better go watch \"The Sting.\"\nThe grifters in this case are Democrat leaders like Nancy Pelosi and Chuck Schumer.\nDemocrats used it to convince GOP moderates we were losing the Vietnam War and that Americans wanted us to pull out (in fact poll after poll showed the public supported the war until the very end).\nThey’ve used it to claim the public wants stricter gun control laws, and opposes any federal spending cuts or government shutdown.\nIn addition, they know some GOP marks keep coming back for more, even when they’ve been taken."}