{"url": "http://www.foxnews.com/politics/2017/05/09/ninth-circuit-critics-want-to-split-up-nutty-court-that-will-hear-trumps-travel-ban.html", "id": "144", "title": "Ninth Circuit: Critics want to split up 'nutty' court that will hear Trump's travel ban", "text": "President Trump’s revised travel ban is headed back to familiar—and definitely not friendly—territory next week. A three-judge panel of the Ninth Circuit Court of Appeals will hear oral arguments in the appeal of a federal judge’s ruling in Hawaii, which struck down Trump’s re-written travel ban as unconstitutional.\n\nThe Ninth Circuit Court, based in San Francisco, blocked his first travel ban following a restraining order issued by a U.S. District Court judge in Seattle. The Ninth Circuit will also hear the appeal of a California judge’s ruling to halt Trump’s executive order withholding federal funds from sanctuary cities.\n\nTrump recently took to his Twitter account to blast the legal strategy employed against his policies.\n\nJOHN YOO: DITCH THE NINTH CIRCUIT? WHAT TRUMP GETS RIGHT (AND WRONG)\n\n“Out of our very big country, with many choices, does everyone notice that both the “ban” case and now the “sanctuary” case is brought in the Ninth Circuit, which has a terrible record of being overturned (close to 80%). They used to call this ‘judge shopping!’ Messy system.” Trump tweeted.\n\nTroy Slaten, an attorney in Los Angeles, thinks Trump has a point. But, he said, his strategy is risky.\n\n“It’s not unusual for presidents to criticize judges,” Slaten tells Fox News, “It is unusual, in this age of social media, to have direct attacks at specific judges and specific courts.”\n\nOne of the most infamous rulings by the Ninth Circuit was in 2002 when the court ruled that the Pledge of Allegiance was unconstitutional because of the phrase ‘under God’. The U.S. Supreme Court overturned the ruling. For conservatives, it cemented the Ninth Circuit’s derisive nickname—“The Ninth Circus.”\n\nTRUMP EYES BID TO SPLIT UP 9TH CIRCUIT COURT AMID SANCTUARY CITY, TRAVEL BAN DISPUTES\n\nSen. Jeff Flake, R-Arizona, has introduced a bill that would split up the Ninth Circuit, which covers nine western states. It creates a new 12th Circuit for Alaska, Washington, Idaho, Montana and Arizona.\n\n“The current Ninth Circuit represents 40 percent of all the landmass in the U.S., 20 percent of the population,” Flake said, “And the reason for the split, you can put ideology aside, and just realize that the court is just overworked and overburdened.”\n\nHearing the travel ban 2.0 case in Seattle will be judges Michael Hawkins, Ronald Gould and Richard Paez. All were appointed by Democratic President Bill Clinton.\n\nMike Subit has argued several cases in front of the Ninth Circuit Court and before that he clerked for one of its most liberal judges, Roy Reinhardt. He says both parties file appeals where they think they have the best chance to win. He opposes Flake’s bill arguing the Ninth Circuit that would be left would only be more fertile ground for liberals.\n\n“If this plan is intended to avoid the problem of judge shopping,” Subit said, “It’s actually going to make it worse, because every plan I’ve ever seen is involved with putting California with one or two other states.”\n\nDan Springer joined Fox News Channel (FNC) in August 2001 as a Seattle-based correspondent.", "authors": ["Dan Springer"], "publish_date": "2017-05-09", "source": "foxnews", "top_words": ["ninth", "travel", "hear", "judges", "trump", "nutty", "ban", "circuit", "court", "sanctuary", "trumps", "split", "critics"], "summary": "President Trump’s revised travel ban is headed back to familiar—and definitely not friendly—territory next week.\nA three-judge panel of the Ninth Circuit Court of Appeals will hear oral arguments in the appeal of a federal judge’s ruling in Hawaii, which struck down Trump’s re-written travel ban as unconstitutional.\nThe Ninth Circuit Court, based in San Francisco, blocked his first travel ban following a restraining order issued by a U.S. District Court judge in Seattle.\nFor conservatives, it cemented the Ninth Circuit’s derisive nickname—“The Ninth Circus.”TRUMP EYES BID TO SPLIT UP 9TH CIRCUIT COURT AMID SANCTUARY CITY, TRAVEL BAN DISPUTESSen. Jeff Flake, R-Arizona, has introduced a bill that would split up the Ninth Circuit, which covers nine western states.\nHe opposes Flake’s bill arguing the Ninth Circuit that would be left would only be more fertile ground for liberals."}