{"url": "http://www.foxnews.com/politics/2017/03/06/trump-signs-new-immigration-order-narrows-scope-travel-ban.html", "id": "103", "title": "Trump signs new immigration order, narrows scope of travel ban", "text": "President Trump on Monday signed a revised executive order suspending the refugee program as well as entry to the U.S. for travelers from six mostly Muslim countries, curtailing what was a broadly worded directive in a bid to withstand court scrutiny.\n\nAs before, the order will suspend refugee entries for 120 days. But it no longer will suspend Syrian refugee admissions indefinitely.\n\nThe new order also will ban travelers from six countries who did not obtain a visa before Jan. 27 from entering the United States for 90 days. The directive no longer includes Iraq, as the original order did, but covers immigration and travel from Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nIraq, a key U.S. ally in the fight against ISIS, was removed from the travel ban list after Secretary of State Rex Tillerson said he spoke with the Iraqi government about its vetting process and felt that the screening system was thorough enough to stand on its own.\n\nTrump privately signed the new order Monday while Tillerson, Attorney General Jeff Sessions and Homeland Security Secretary John Kelly formally unveiled the new order in an event with reporters. They took no questions. The first version of the order, by contrast, was unveiled during a presidential signing ceremony at the Pentagon’s Hall of Heroes.\n\nTillerson defended the new order on Monday, saying Trump is using “his rightful authority” to keep people safe.\n\n“This order is part of our ongoing efforts to eliminate vulnerabilities that radical Islamic terrorists can and will exploit,” he added.\n\nKelly said the new executive order “will make America more secure.”\n\n“Unvetted travel isn’t a privilege especially when national security is at stake,” he said.\n\nAmong other things, the revised order also makes clear that green card holders are not affected.\n\n“If you have travel documents, if you actually have a visa, if you are a legal permanent resident, you are not covered under this particular executive action,” White House Counselor Kellyanne Conway told Fox News earlier Monday. “I think people will see six or seven major points about this executive order that do clarify who is covered.”\n\nThe Trump administration also plans to cap the number of refugees it accepts to 50,000 a year – down sharply from the 110,000 accepted by the Obama administration.\n\nAccording to the new executive order, the U.S. Department of Homeland Security will have 20 days to perform a “global, country-by-country review of the identity and security information that each country provides to the U.S. government to support U.S. visa and other immigration benefit determinations.”\n\nCountries will then have 50 days to comply with requests to update or improve the “quality” of the information they provide to U.S. officials.\n\nFor countries that don’t comply, the State Department, DHS and intelligence agencies can make additional recommendations on what, if any, restrictions should be imposed.\n\nThe new order also details categories of people eligible to enter the United States for business or medical travel purposes.\n\nAlmost immediately, there was pushback from Democratic lawmakers and human rights groups.\n\n“A watered down ban is still a ban,” Sen. Charles Schumer, D-N.Y., said in a written statement. “Despite the administration’s changes, this dangerous executive order makes us less safe, not more, it is mean-spirited, and un-American. It must be repealed.”\n\nDespite the changes, it’s unclear whether the new version can withstand judicial challenges.\n\n“I fully expect this executive order to have the same uphill climb in the courts that the previous version had,” Schumer said.\n\nOmar Jadwat, director of the ACLU’s Immigrants’ Rights Project, agreed.\n\n“President Trump has recommitted himself to religious discrimination, and he can expect continued disapproval from both the courts and the people,” he said in a statement.\n\nMore than two dozen lawsuits were filed in response to the original travel ban. One suit filed in Washington state succeeded in having the order suspended by arguing that it violated constitutional protections against religious discrimination.\n\nTrump’s original order prohibited travelers from seven nations including Iraq from entering the U.S. for 90 days and all refugees for 120 days. Refugees from Syria were banned indefinitely, but under the new order they are not given separate treatment.\n\nThe White House was criticized the first time around for its rocky rollout of the travel ban. Trump has expressed frustration both in person and on social media over the stalled ban, at times targeting the courts and federal judges who he claimed put the country at risk by holding up the order.\n\nLast week, Trump told reporters at the White House that “the new order is going to be very much tailored to what I consider to be a very bad decision.”\n\nDespite widespread belief the first order was done in haste, Trump and other White House officials have repeatedly called it a success.\n\nUnder the new order, the original order is revoked.", "authors": ["Barnini Chakraborty"], "publish_date": "2017-03-06", "source": "foxnews", "top_words": ["executive", "original", "travel", "narrows", "trump", "ban", "immigration", "days", "security", "scope", "order", "signs", "house", "white"], "summary": "The directive no longer includes Iraq, as the original order did, but covers immigration and travel from Iran, Libya, Somalia, Sudan, Syria and Yemen.\n“Despite the administration’s changes, this dangerous executive order makes us less safe, not more, it is mean-spirited, and un-American.\nMore than two dozen lawsuits were filed in response to the original travel ban.\nThe White House was criticized the first time around for its rocky rollout of the travel ban.\nUnder the new order, the original order is revoked."}