{"url": "http://www.foxnews.com/politics/2017/03/21/gorsuch-rebuffs-leahy-on-trump-travel-ban-questions.html", "id": "126", "title": "Gorsuch rebuffs Leahy on Trump travel ban questions", "text": "Democratic Sen. Patrick Leahy struggled to pin down Judge Neil Gorsuch Tuesday on President Trump's controversial travel ban, as the Supreme Court nominee smoothly sidestepped questions relating to the policy currently on hold by the courts.\n\nGorsuch instead directed the contentious cross-examination into more general terrain where Gorsuch could advocate for religious liberty, without commenting on the specifics of the case.\n\n“I will apply the law,” Gorsuch vowed, during the second day of his Senate confirmation hearing.\n\nLeahy initially had tried to get the 10th Circuit Court judge to comment on the notion of a “religious litmus test for entry into the United States,” in apparent reference to Trump's attempt to suspend immigration and travel from six mostly Muslim countries and the refugee program.\n\nGorsuch parried, refusing to discuss issues that could come before a court he sits on.\n\n“Would the president have the authority to ban all Jews from America? Or all people that come from Israel? Would that be an easy question?” Leahy asked.\n\n“Senator, we have a Constitution, and it does guarantee free exercise. It also guarantees equal protection of the laws. And a whole lot else besides,” Gorsuch said. “… I will apply the law faithfully and fearlessly and without regard to persons.”\n\nLeahy countered: “How about in regards to religion?”\n\n“Anyone, any law is gonna get a fair and square deal with me,” Gorsuch said.\n\nAsked about a hypothetical religious test to serve in the military, Gorsuch finally yielded, calling such a proposed rule “inappropriate” and “against the law.”\n\nLeahy then posed the question a different way, using the language of then-candidate Trump to ask about a hypothetical ban on Muslims entering the United States. Trump has since ditched the incendiary rhetoric when speaking about travel bans, though a reference remains on his campaign website. Leahy also cited an unnamed Republican congressman who allegedly said “the best thing the president could do for his Muslim ban is to make sure he has Gorsuch on the Supreme Court before appeals get to that point.”\n\nThe typically genial Gorsuch turned serious.\n\n“Senator, he has no idea how I’d rule in that case and, senator, I’m not going to say anything here that’s going to give anybody any idea how I’d rule in any case like that that could come before the Supreme Court or my court on the 10th Circuit,” Gorsuch said, tapping a pointed finger on his desk to emphasize his words. “It would be grossly improper of a judge to do that. It would be a violation of the separation of powers and judicial independence if someone sitting at this table, in order to get confirmed, had to make promises or commitments about how they’d rule in a case that’s currently pending and likely to make its way to the Supreme Court.”\n\nLeahy took one last shot at driving a wedge between Gorsuch and the president who nominated him, asking if “a president’s national security determinations” are reviewable.\n\nGorsuch replied: “Senator, no man is above the law.”", "authors": ["Cody Derespina"], "publish_date": "2017-03-21", "source": "foxnews", "top_words": ["leahy", "questions", "travel", "trump", "ban", "supreme", "court", "gorsuch", "rule", "religious", "rebuffs", "president", "law"], "summary": "Democratic Sen. Patrick Leahy struggled to pin down Judge Neil Gorsuch Tuesday on President Trump's controversial travel ban, as the Supreme Court nominee smoothly sidestepped questions relating to the policy currently on hold by the courts.\nGorsuch instead directed the contentious cross-examination into more general terrain where Gorsuch could advocate for religious liberty, without commenting on the specifics of the case.\n“I will apply the law,” Gorsuch vowed, during the second day of his Senate confirmation hearing.\nGorsuch parried, refusing to discuss issues that could come before a court he sits on.\nTrump has since ditched the incendiary rhetoric when speaking about travel bans, though a reference remains on his campaign website."}