{"url": "http://www.foxnews.com/politics/2017/07/04/trump-travel-ban-white-house-defends-interpretation-ruling.html", "id": "185", "title": "Trump travel ban: White House defends interpretation of ruling", "text": "The Trump administration on Monday said it was opposed to opening the door to grandparents from six Muslim-majority nations who have grandchildren that are U.S. citizens, saying that the government’s interpretation of the scaled-down travel ban is based on longstanding immigration law.\n\nThe Supreme Court ruled last week that parts of Trump’s executive order that banned people from Iran, Libya, Somalia, Sudan, Syria and Yemen for 90 days can go into effect despite blocks from the lower courts. The Supreme Court said the ban cannot apply to anyone with a “bona fide relationship with a U.S. citizen or U.S. entity.\"\n\nThe White House clarified the Supreme Court’s wording of “bona fide relationship,” saying it means close family members only: parents, spouses, siblings and children. Grandparents, grandchildren, aunts, uncles, nieces, nephews and cousins would still be banned from entering the U.S.\n\nThe Justice Department argued in a court filing Monday that the government’s definition “hews closely to the categorical determinations articulated by Congress in the Immigration and Nationality Act,\" Reuters reported.\n\nRefugee organizations had argued in Hawaii federal court that their work to resettle refugees qualified as a “bona fide relationship” between a person of the six banned nations and a U.S. entity.\n\nHowever, the U.S. said workers with offers of employment from American companies and international students were different from refuges getting help from resettlement organizations, according to Reuters.\n\n\"A refugee's relationship with the agency flows from the government, not from an independent relationship between the refugee and the resettlement agency,\" the government said. \"Indeed, resettlement agencies typically do not have any direct contact with the refugees they assure before their arrival in the United States.\"\n\nThe \"bona fide relationship” restriction also applies to refugees, regardless of their country of origin, unless they are able to obtain a so-called “national interest waiver” from the State Department or U.S. Customs and Border Protection. However, the U.S. has almost filled its quota of 50,000 refugees for the budget year ending in September and the new rules won't apply to the few remaining slots. With the Supreme Court set to consider the overall ban in October, the rules could change again.\n\nConsular officers may grant other exemptions to applicants from the six nations if they have \"previously established significant contacts with the United States;\" \"significant business or professional obligations\" in the U.S.; if they are an infant, adopted child or in need of urgent medical care; if they are traveling for business with a recognized international organization or the U.S. government or if they are a legal resident of Canada who applies for a visa in Canada,” according to the State Department guidance.\n\nThe Associated Press contributed to this report.\n\nClick for more from Reuters.", "authors": [], "publish_date": "2017-07-04", "source": "foxnews", "top_words": ["ruling", "fide", "travel", "relationship", "interpretation", "trump", "ban", "supreme", "bona", "refugees", "court", "nations", "resettlement", "department", "banned", "defends", "house", "white"], "summary": "The Supreme Court said the ban cannot apply to anyone with a “bona fide relationship with a U.S. citizen or U.S.\nThe White House clarified the Supreme Court’s wording of “bona fide relationship,” saying it means close family members only: parents, spouses, siblings and children.\nRefugee organizations had argued in Hawaii federal court that their work to resettle refugees qualified as a “bona fide relationship” between a person of the six banned nations and a U.S. entity.\n\"A refugee's relationship with the agency flows from the government, not from an independent relationship between the refugee and the resettlement agency,\" the government said.\nWith the Supreme Court set to consider the overall ban in October, the rules could change again."}