{"url": "http://www.foxnews.com/opinion/2017/01/31/sean-hannity-dems-gamble-with-american-lives-with-lies-about-trump-order.html", "id": "19", "title": "Sean Hannity: Dems gamble with American lives with lies about Trump order", "text": "Liberals spent the weekend freaking out and completely misrepresenting President Trump's extreme vetting temporary travel ban for countries that have ties to radical Islamic terror, so let’s separate fact from fiction and truth from hysteria.\n\nWe all saw Senate Minority Leader Chuck Schumer well up in crocodile tears as he derided the president's perfectly legal and highly prudent executive order. Trump rightly called him out on the Oscar-worthy performance.\n\n“I noticed Chuck Schumer yesterday with fake tears,” Trump said. “I'm going to ask him who is his acting coach because I know him very well. I don't see him as a crier. If he is, he's a different man. There's about a five percent chance that it was real, but I think they were fake tears.”\n\nWhat Chucky Schumer didn't explain through his sobs was that he himself supported a refugee pause back in 2015. And I don't recall Schumer crying after the terror attacks in San Bernardino or the Chattanooga shootings, in which foreign-born terrorists killed nearly 20 Americans and wounded dozens of others. Likewise, no tears were shed for these American victims by the Hollywood elites who lashed out against President Trump at the Screen Actors Guild awards.\n\nAnd then, of course, there's the media. They're ignoring the facts of Trump's executive order and pushing more fake news onto you to try and distort what is really happening. Members of the Trump administration are trying to set the record straight, but the media won't listen.\n\nWhite House Chief of Staff Reince Priebus told Chuck Todd on NBC’s “Meet the Press” that the seven countries affected by the order – Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen – had been previously identified by the Obama administration as harboring terrorists. Priebus even pointed out that the order simply singles out travelers from those countries for the kind of “extreme vetting” Trump promised the American people during his campaign.\n\n“It's a 90-day ban to ensure that we have further vetting restrictions so that we know who's coming in this country,” Spicer said on ABC’s “This Week.” The safety of the American citizens, the safety our country, has got to be paramount.”\n\nAnd finally, counselor to the president Kellyanne Conway dispensed with the alt-radical left claims that Trump’s extreme vetting is anti-Muslim, noting that it only affects a small portion of the global Muslim population.\n\n“Let me make very clear these seven countries -- what about the 46 majority-Muslim countries that are not included?” she said. “Right there, it totally undercuts this nonsense that this is a Muslim ban. This is a ban on travel.”\n\nThe truth is, the order does not mention the words “Muslim” or “Islam.” The seven countries impacted come from a list agreed upon by the Obama administration and Congress. In 2015, the Terrorist Travel Prevention Act, which Chuck Schumer voted for as part of a larger bill, placed U.S. travel restrictions on some citizens from Iran, Iraq, Sudan and Syria, and on other foreigners who previously traveled to those countries. Then last year, President Obama's Department of Homeland Security added Libya, Somalia and Yemen to the list.\n\nThe countries included in President Trump’s order were not randomly chosen by the Trump administration. Most of the measures in the order are temporary. Citizens from the seven countries may in some cases be banned from entering the U.S. for up to 90 days, and the U.S. refugee program will resume after 120 days. It is true that the president did suspend the refugee Syrian program, but only until extreme vetting measures can be put in place.\n\nJust like he pledged during his campaign. Just like the American people demanded. As President Obama once said, elections have consequences.\n\nThe fact is, Trump’s order is not even a new thing. Back in 2011, after it was discovered that two Iraqi refugees living in Bowling Green, Ky., were trying to assist Al Qaeda, then-President Obama reacted by suspending travel for some people from Iraq for six months.\n\nAfter Iran took over the American embassy in Tehran in 1979, Democratic President Jimmy Carter imposed travel restrictions on all Iranians, including Iranian students that were studying in America. Carter even had a few hundred of those students deported.\n\nDespite the misinformation being peddled by liberals, President Trump will still be accepting refugees. His executive order will allow for more than 50,000 – which, aside from 2016, is in line with previous amounts from past administrations.\n\nBut Trump only wants refugees who can be properly screened to ensure the safety of Americans. After all, the U.S. intelligence community overwhelmingly agrees that the refugee program is vulnerable to infiltration by terrorists.\n\n“It's clearly a population of concern,” National Counter-Terrorism Center Director Nicholas Rasmussen said when asked if Syrian refugees posed a threat back on Feb. 11, 2015.\n\nAssistant Director of the FBI Michael Steinbach agreed, noting there is simply no reliable means of vetting refugees from Syria.\n\n“The concern is in Syria, the lack of our footprint on the ground in Syria that the databases won't have the information we need,” he said. “So it's not that we have a lack of process. It's there's a lack of information.”\n\nEven Obama’s director of national intelligence, James Clapper, acknowledged that ISIS could use the refugee program to sneak into the U.S.\n\n“I don't obviously put it past the likes of ISIL to infiltrate operatives among these refugees,” he said.\n\nFBI Director James Comey said last October that we could “query our database until the cows come home” but if Syrian terrorists have never been on the law enforcement radar, it won’t do any good. Even Obama’s partisan, anti-Trump CIA Director John Brennan said last June the refugee program was ripe for terrorist exploitation.\n\n“The group is probably exploring a variety of means for infiltrating operatives into the West, including in refugee clothes,” he told lawmakers.\n\nAmerica's top intelligence officials under President Obama all saying ISIS can infiltrate the refugee population. And by the way, we can add Hillary Clinton to that list. WikiLeaks exposed that in a private, 2013 speech, Clinton said it was nearly impossible to properly vet refugees coming from Syria.\n\nYet, the alt-radical left is coming unhinged over Trump’s executive order, mischaracterizing it in order to paint the president as an extremist, or bigot. What it comes down to is very simple: Democrats, overpaid celebrities and the mainstream media are willing to endanger our lives to score cheap political points.\n\nThe next time a radical Islamist from abroad yells Allahu Akbar and kills innocent Americans, these people will have blood on their hands. And yes, Chuck Schumer, I'm talking to you.\n\nAdapted from Sean Hannity's monologue on \"Hannity,\" Jan. 30, 2017\n\nSean Hannity currently serves as host of FOX News Channel’s (FNC) Hannity (weekdays 9-10PM/ET). He joined the network in 1996 and is based in New York. Click here for more information on Sean Hannity.", "authors": ["Sean Hannity"], "publish_date": "2017-01-31", "source": "foxnews", "top_words": ["lives", "hannity", "schumer", "trump", "gamble", "travel", "dems", "lies", "sean", "refugee", "refugees", "vetting", "trumps", "countries", "order", "president", "american"], "summary": "Likewise, no tears were shed for these American victims by the Hollywood elites who lashed out against President Trump at the Screen Actors Guild awards.\nPriebus even pointed out that the order simply singles out travelers from those countries for the kind of “extreme vetting” Trump promised the American people during his campaign.\nThe countries included in President Trump’s order were not randomly chosen by the Trump administration.\nThe fact is, Trump’s order is not even a new thing.\nAssistant Director of the FBI Michael Steinbach agreed, noting there is simply no reliable means of vetting refugees from Syria."}