{"url": "http://www.foxnews.com/politics/2017/08/31/trump-needs-wall-more-than-tax-cuts.html", "id": "198", "title": "Trump needs the wall more than tax cuts", "text": "**Want FOX News Halftime Report in your inbox every day? Sign up here.**\n\nOn the roster: Trump needs the wall more than tax cuts - I’ll Tell You What: ‘Big D’ phones it in - Trump faces tough decision on Dreamers - Mueller team met with Russian lobbyist - Biden to test the 2020 waters with a new book - Oh, heyyyyyyyyy guys…\n\nTRUMP NEEDS THE WALL MORE THAN TAX CUTS\n\nOther than the absolute direness of his opponent, it was probably the issue of a wall on the Mexican border more than anything else that made Donald Trump president.\n\nAnd it will probably be that wall (or the lack of it), not taxes or ObamaCare or North Korea, that probably decides whether he can get re-elected.\n\nFirst, understand that the wall is not in any way popular in the traditional sense – in fact, the wall is just about exactly as popular as Trump with the broad electorate, i.e. not very.\n\nThis week’s brand-new Fox News poll finds just 39 percent of voters favor the border barricade, just 2 points less than Trump’s new job-approval rating. But if we peel those numbers back just a bit, we see more than just an unpopular president pushing an unpopular initiative.\n\nAlmost half of the people who support the wall would also back Trump’s call for a government shutdown unless Congress provides adequate funds to start construction in earnest.\n\nThink about that. That’s nearly one in five American voters who would rather the government go off the fiscal cliff at the end of next month than not start construction on Trump’s great wall.\n\nThese are quite likely the same voters who have stood by Trump through all of the tempests, both genuine and manufactured, that have beset him since he declared for office last summer. They may love the smackdown showmanship and the other parts of Trump’s personality-driven presidency, but it’s the wall that represents his first, most important contract with them.\n\nJust as it was an, ahem, concrete version of Trump’s MAGA message for these voters, it remains the concrete proof that, despite all of the missteps, Trump is still delivering. They didn’t chant “Drop corporate taxes!” at the rallies.\n\nDemocrats are, of course, thrilled. This gives them the possibility of either a) running against a party next year that shut the government on itself or b) running against vulnerable Republicans with ads that say “Congresswoman Susie Creamcheese voted to take money away from drowning puppies to fund Donald Trump’s border wall…”\n\nBut as Trump’s 2016 victory demonstrated perfectly, the power of an intensely engaged minority is enormous in our political era.\n\nTrump looks unlikely to ever be a popular politician in the sense of some of his predecessors. He is the most divisive national political figure in memory and the antipathy against him among nearly half the electorate seems fairly well set.\n\nMoreover, he will certainly have significant primary opposition in his own party. The fact that his own vice president is significantly more popular than Trump – not just in general but among Republicans – is a good refection of the discontentment among conservatives.\n\nFor Trump to survive the primaries and stand a fighting chance in the fall of 2020 he will need his noisy minority not just with him, but ready to fight again. And if the builder they elected doesn’t build a wall, they won’t be ready to rumble.\n\nTrump seems to understand that enough to have made the shutdown treat over the wall. But that puts him at odds with many, if not most, of his fellow Republicans in Congress. Once again, Trump and his party’s interests diverge.\n\nAnd that’s why there’s a real chance of a shutdown, a shutdown, by the way, that would jeopardize other GOP priorities like tax cuts and patching ObamaCare for next year.\n\nTHE RULEBOOK: BESTIES\n\n“Commercial republics, like ours, will never be disposed to waste themselves in ruinous contentions with each other. They will be governed by mutual interest, and will cultivate a spirit of mutual amity and concord.” – Alexander Hamilton, Federalist No. 6\n\n\n\nTIME OUT: REVOLUTIONARY ROGUE\n\nHistory: “Samuel Mason, a Patriot captain in command of Fort Henry on the Ohio frontier [in present-day Wheeling, W.Va.], survives a devastating Indian attack on this day in 1777. ... They ambushed the party, killing all but Mason. … Following the end of the war, though, he fell on hard times. … By the early 1800s, Mason had become one of the most notorious desperados on the American frontier, a precursor to Jesse James… Determined to apprehend Mason, the Americans upped the reward for his capture, dead or alive. The reward money soon proved too tempting for two members of Mason’s gang; in July 1803 they killed Mason, cut off his head and brought it into the Mississippi territorial offices to prove that they had earned the reward. The men were soon identified as members of Mason’s gang, however, and they were arrested and hanged.”\n\nFlag on the play? - Email us at\n\nHALFTIMEREPORT@FOXNEWS.COM with\n\nyour tips, comments or questions.\n\nSCOREBOARD\n\nTrump net job-approval rating: -18.4 points\n\nChange from one week ago: up 0.2 points\n\n[President Trump’s score is determined by subtracting his average job disapproval rating in the five most recent, methodologically sound public polls from his average approval rating, calculated in the same fashion.]\n\nI’LL TELL YOU WHAT: ‘BIG D’ PHONES IT IN\n\nThis week Dana Perino and Chris Stirewalt discuss the historic devastation in Texas, Trump’s new tax plan and another North Korean missile. Plus, live from the shore, Dana shares about her vacation culinary experience and Chris shares his experiences of back to school shopping. LISTEN AND SUBSCRIBE HERE\n\nTRUMP FACES TOUGH DECISION ON DREAMERS\n\nAP: “With a deadline looming, President Donald Trump remains torn over the fate of hundreds of thousands of young immigrants who were brought into the country illegally as children — a decision that will draw fury no matter what he decides. Trump railed against the Deferred Action for Childhood Arrivals program during his campaign, slamming it as illegal ‘amnesty.’ But he changed his tune after the election, calling DACA one of the most difficult issues he’s grappled with. The program has given nearly 800,000 people a reprieve from deportations. It has also provided the ability to work legally in the U.S. in the form of two-year, renewable work permits — permits the Trump administration has continued to grant as the president has mulled the issue. On Wednesday, White House press secretary Sarah Huckabee Sanders said DACA was still the subject of ‘a very lengthy review’ process. ‘It’s something that’s still being discussed and a final decision hasn’t been made,’ she said.”\n\nHe could face major backlash from staff, CEOs if he ends it - Axios: “President Trump could trigger a furious response from corporations and some members of his own staff if he green-lights a plan under consideration at the White House to end DACA…some top CEOs, including leaders in tech and retail, plan to be tough and vocal if Trump ends the policy. But they're keeping quiet for now because they fear antagonizing him on a question that could have massive implications for their workforces. … Trump has faced an escalating revolt from CEOs — starting with the Muslim ban, increasing with his climate-change decision, and peaking with his handling of Charlottesville. Scores of high profile CEOs would pummel him publicly if he clears the way for mass deportation of kids.”\n\n\n\nHouse GOP looks at disaster funds to finance wall - AP:\n\n“President Donald Trump is promising billions to help Texas rebuild from Harvey-caused epic flooding, but his Republican allies in the House are looking at cutting almost $1 billion from disaster accounts to help finance the president’s border wall. The pending reduction to the Federal Emergency Management Agency’s disaster relief account is part of a massive spending bill that the House is scheduled to consider next week when lawmakers return from their August recess. The $876 million cut, which is included in the 1,305-page measure’s homeland security section, pays for roughly half the cost of Trump’s down payment on the U.S.-Mexico border wall that the president repeatedly promised Mexico would finance. … There’s only $2.3 billion remaining in federal disaster coffers. The disaster relief cut was proposed well before Harvey and the politically bad optics are sure to lead lawmakers to do an about face, though that would create a money crunch in homeland security accounts.”\n\n\n\nMeanwhile, a Federal judge blocked Texas sanctuary city ban - Politico: “A federal judge in Texas blocked the bulk of the state’s immigration law targeting sanctuary cities on Wednesday, a victory for civil rights groups and Democratic-led city governments that oppose the measure. The order came two days before a Sept. 1 deadline to implement the new law, which seeks to ensure local police cooperate with federal immigration enforcement. U.S. District Court Judge Orlando Garcia issued a preliminary injunction against most provisions of the measure, known as SB 4. The law authorizes local police to ask about immigration status during routine stops, and threatens police chiefs with misdemeanor charges and fines if they fail to enforce federal immigration laws.”\n\nMUELLER TEAM MET WITH RUSSIAN LOBBYIST\n\nAP: “A grand jury used by Special Counsel Robert Mueller has heard secret testimony from a Russian-American lobbyist who attended a June 2016 meeting with President Donald Trump’s eldest son, The Associated Press has learned. A person familiar with the matter confirmed to the AP that Rinat Akhmetshin had appeared before Mueller’s grand jury in recent weeks. The person spoke on condition of anonymity to discuss the secret proceedings. The revelation is the clearest indication yet that Mueller and his team of investigators view the meeting, which came weeks after Trump had secured the Republican presidential nomination, as a relevant inquiry point in their broader probe into Russian interference in the 2016 election. The meeting included Donald Trump Jr.; the president’s son-in-law, Jared Kushner; and his former campaign chairman, Paul Manafort. Emails released by Trump Jr. show he took the meeting expecting that he would be receiving damaging information about Hillary Clinton as part of what was described to him as a Russian government effort to aid the Trump campaign.”\n\n\n\nMueller working with New York A.G. to investigate Manafort - Politico: “Special counsel Robert Mueller’s team is working with New York Attorney General Eric Schneiderman on its investigation into Paul Manafort and his financial transactions, according to several people familiar with the matter. The cooperation is the latest indication that the federal probe into President Donald Trump’s former campaign chairman is intensifying. It also could potentially provide Mueller with additional leverage to get Manafort to cooperate in the larger investigation into Trump’s campaign, as Trump does not have pardon power over state crimes.”\n\nTrump offered Grassley ethanol subsidy promise ahead of hearing - WaPo: “President Trump called the head of the Senate Judiciary Committee to talk about one of his most important parochial issues — ethanol — shortly before the committee is slated to interview his son in its ongoing Russia probe. Senate Judiciary Committee Chairman Charles E. Grassley’s panel will be hosting Trump’s son next month for an interview behind closed doors in its ongoing Russia probe… On Wednesday morning, Grassley announced via Twitter that the president had called him to discuss not Russia, but ethanol, proudly announcing that ‘he assured me he’s pro ethanol’ and that Grassley was free to tell the people of Iowa ‘he’s standing by his campaign PROMISE.’”\n\nBIDEN TO TEST THE 2020 WATERS WITH A NEW BOOK\n\nThe Hill: “Former Vice President Joe Biden will release a new book this fall that could also serve as a test for whether the country is interested in seeing him run for president. Longtime advisers to Biden see his memoir, ‘Promise Me, Dad: A Year of Hope, Hardship and Purpose,’ as the ultimate test for whether he’ll wade into a potentially crowded 2020 field. ‘It's a chance to step out on his own terms with a character reinforcing narrative that reintroduces himself to America as more than a vice president,’ said one former senior aide. His book tour will be a vital test. Can he generate enthusiasm and crowds and subtly market his character, conviction, values and vision to a national audience? ‘It's a great soft launch for a potential campaign,’ the confidant said. Biden’s book is due to be published on Nov. 14, just more than a year after Hillary Clinton lost the 2016 presidential election to Donald Trump.”\n\nHarris, Sanders make new tag team - Politico: “California’s junior senator, Kamala Harris, on Wednesday departed from the position held by the state’s senior senator, Dianne Feinstein, and announced her intention to co-sponsor Senator Bernie Sanders’ ‘Medicare for All’ bill. To the delight of a hometown crowd at a packed town hall meeting Wednesday in Oakland — where she was raised — Harris announced for the first time that she intended to co-sponsor ‘Medicare for All,’ the single-payer health care bill which has the strong support of progressives and groups including National Nurses United, saying it was ‘the right thing to do.’”\n\n\n\nPLAY-BY-PLAY\n\nPentagon announces Afghanistan troop number at approximately 11,000 - Politico\n\nRepublicans postpone internet regulations hearing - Axios\n\nAUDIBLE: THAT’S ALMOST A COMPLIMENT!\n\n“The question is whether he can learn and change. If so, I believe he can be a good president.” – Sen. Dianne Feinstein, D-Calif., said during a town hall Tuesday evening.\n\n\n\nTHE JUDGE’S RULING: HARD POWER\n\nFox News Senior Judicial Analyst Judge Andrew Napolitano looks at the restoration of the federal government providing military hardware to local police: “Moreover, the strings attached to this federal hardware giveaway do not require congressional or even local government approval. They require only acceptance by the police and regular local use of the military equipment.” More here.\n\n\n\nFROM THE BLEACHERS\n\n“Sir, One factor you seem to have overlooked in the defeat of Bush 1 and Clinton losing Congress was their actions on gun control. Bush 1 ran on a strict promise there would be no new gun laws during his administration, and then imposed the first ‘assault weapons ban’ by executive order. We won’t get into his theatrics with the investigation into ATF actions. A lot of us who worked for his election washed our hands of him after he proved to be a spineless liar. As for Clinton, his ‘Crime Bill’ ended the careers of a lot of very senior ‘untouchable’ democrats. The legislation passed afterwards to stop such citizen action from happening again (professional political protection act) speaks strongly to that. Do you think the defeat of Speaker [Tom Foley was over taxes? People get angry over taxes, but they go psycho when rights they see as fundamental are trampled.” – Michael North, Bryan, Ohio\n\n\n\n[Ed. note: Goodness, Mr. North! I said the tax increase “helped deliver” Bush’s 1992 loss. Gun control was certainly part of it, as was his support for the Clean Air Act, among other things. And the assault weapons ban was certainly a major factor in Clinton’s 1994 midterm shellacking. But I would submit that nothing hurt Foley in his own loss more than his opposition to term limits. Voters of Washington had approved a state constitutional amendment imposing them and Foley sued to overturn the restriction. It’s never good to be running for re-election when you’re the lead plaintiff in the case of “the people of the state of Washington.”]\n\n\n\n“Just read your essay about tax reform. Very educational and it had me thinking. According to the Constitution, all tax legislation is required to start in the House. The House has relegated taxes to the Ways and Means Committee. What committee, some may ask? Yes, the Ways and Means Committee. One of the quietist committees on Capitol Hill. Just what have they been doing? I rarely, if ever, here from them. Back in the ‘80s they were heard from a lot. Even in the ‘90s. Since the beginning of this century, not so much. Just what has that committee been doing when everyone from both parties know that the country needs serious tax reform.” – Onnie Duvall, Cambridge, Md.\n\n\n\n[Ed. note: It would seem to me to be a tautology: less big tax legislation means that we will hear less from the tax writing legislation. But I would submit that it was still potent enough to serve as a stepping stone for current House Speaker Paul Ryan.]\n\n\n\nShare your color commentary: Email us at\n\nHALFTIMEREPORT@FOXNEWS.COM and please\n\nmake sure to include your name and hometown.\n\n\n\nOH, HEYYYYYYYYY GUYS…\n\nWBAL: “Two men who police said robbed a pub in Woodlawn [Md.] may not have expected it to be full of police officers. Baltimore County police have two suspects in custody who they said robbed a pub Tuesday night at gunpoint. The armed suspects walked in to Monaghan’s Pub a little before 5:30 p.m. Tuesday. It turns out that the pub was hosting a police officer’s retirement party with dozens of off-duty officers in attendance. … Investigators said two men entered the take-out portion of the restaurant and held an employee up at gunpoint. ‘At that time, the person who had been behind the counter knew that there was a retirement party for a police officer happening, so they went into the other portion and alerted the officers to the fact that they had just been involved in an armed robbery,’ [Baltimore County police Officer Jennifer Peach] said.”\n\nChris Stirewalt is the politics editor for Fox News. Brianna McClelland contributed to this report. Want FOX News Halftime Report in your inbox every day? Sign up here.", "authors": ["Chris Stirewalt"], "publish_date": "2017-08-31", "source": "foxnews", "top_words": ["trump", "cuts", "wall", "donald", "trumps", "committee", "federal", "needs", "president", "house", "tax", "campaign"], "summary": "**On the roster: Trump needs the wall more than tax cuts - I’ll Tell You What: ‘Big D’ phones it in - Trump faces tough decision on Dreamers - Mueller team met with Russian lobbyist - Biden to test the 2020 waters with a new book - Oh, heyyyyyyyyy guys…TRUMP NEEDS THE WALL MORE THAN TAX CUTSOther than the absolute direness of his opponent, it was probably the issue of a wall on the Mexican border more than anything else that made Donald Trump president.\nFirst, understand that the wall is not in any way popular in the traditional sense – in fact, the wall is just about exactly as popular as Trump with the broad electorate, i.e.\nTrump seems to understand that enough to have made the shutdown treat over the wall.\nThe meeting included Donald Trump Jr.; the president’s son-in-law, Jared Kushner; and his former campaign chairman, Paul Manafort.\nThe cooperation is the latest indication that the federal probe into President Donald Trump’s former campaign chairman is intensifying."}