{"url": "http://www.foxnews.com/politics/2017/05/08/yates-takes-heat-over-refusal-to-defend-trump-travel-ban.html", "id": "140", "title": "Yates takes heat over refusal to defend Trump travel ban", "text": "Former acting Attorney General Sally Yates took heat from Senate Republicans Monday as she stood by her decision not to defend President Trump’s executive order restricting travel from certain countries – with one Republican asking: “Who appointed you to the United States Supreme Court?”\n\nYates spoke at a Senate Judiciary subcommittee hearing, and defended her stance on Trump’s controversial order restricting immigrants and refugees from several terror hot spots, including Iraq, Syria and Yemen. Yates was fired in January after telling her staff at the Department of Justice not to implement the order.\n\n“I did my job the best way I knew how,” Yates told senators during the hearing.\n\nYates noted that a federal appeals court blocked the order, forcing the Trump administration to revisit and re-work the order. But Republican senators attacked Yates for refusing to defend the order.\n\nSen. Ted Cruz, R-Texas, cited a statute in the U.S. Code granting presidents the right to impose restrictions on those seeking to enter the country if he believes there to be a security risk, but Yates countered by arguing that it is also prohibited to restrict immigrants based on race or religion.\n\nWhile the Trump administration has said the order is not a “Muslim ban,” Yates and judges ruling against the order have pointed to rhetoric during the presidential campaign in which Trump promised an outright ban on Muslims into the country.\n\nSen. John Cornyn, R-Texas, also pushed back against Yates’ decision, saying he was “extremely disappointed” in her refusal to defend the order. He noted that the Office of Legal Counsel had concluded the law was lawful and properly drafted.\n\n\"I find it enormously disappointing that you somehow vetoed the decision of the Office of Legal Counsel...and decided instead that you would countermand the executive order of [President Trump] because you happened to disagree with it as a policy matter,\" Cornyn said.\n\n“I made a determination that I believed that it was unlawful. I also thought that it was inconsistent with the principles of the Department of Justice,” Yates responded. “And I said no.”\n\nSen. John Kennedy, R-La., was more aggressive in his approach, questioning whether Yates had the authority to declare the order unconstitutional.\n\n“Who appointed you to the Supreme Court of the United States?” he asked her.\n\nAdam Shaw is a Politics Reporter and occasional Opinion writer for FoxNews.com. He can be reached here or on Twitter: @AdamShawNY.", "authors": ["Adam Shaw"], "publish_date": "2017-05-08", "source": "foxnews", "top_words": ["travel", "trump", "ban", "supreme", "heat", "united", "trumps", "refusal", "takes", "states", "senators", "yates", "order", "defend", "decision"], "summary": "“I did my job the best way I knew how,” Yates told senators during the hearing.\nYates noted that a federal appeals court blocked the order, forcing the Trump administration to revisit and re-work the order.\nBut Republican senators attacked Yates for refusing to defend the order.\nSen. John Cornyn, R-Texas, also pushed back against Yates’ decision, saying he was “extremely disappointed” in her refusal to defend the order.\n“Who appointed you to the Supreme Court of the United States?” he asked her."}