{"url": "http://www.foxnews.com/politics/2017/03/18/trump-admin-challenges-hawaii-judge-s-halt-on-new-travel-ban.html", "id": "122", "title": "Trump admin challenges Hawaii judge’s halt on new travel ban", "text": "The Justice Department is asking the federal judge in Hawaii who temporarily halted President Trump’s new travel ban to limit the scope of his ruling so that the United States can immediately stop taking in refugees worldwide.\n\nJustice Department attorneys argued in a motion Friday that U.S. District Judge Derrick Watson's temporary restraining order was essentially based on the argument that the ban appears to unconstitutionally target Muslims.\n\nSo his ruling should be limited to the part of Trump’s March 6 executive order that temporarily bans visas to travel from six mostly-Muslim countries into the U.S., not the temporary refugees ban, they say.\n\nThe attorneys essentially want Watson’s ruling to be in line with a federal judge's ruling in Maryland on Thursday that temporarily halts the travel ban.\n\nU.S. District Judge Theodore Chuang cited earlier Trump statements and said the purpose of the new executive order \"remains the realization of the long-envisioned Muslim ban.\" However, he declined to issue an injunction blocking the entire executive order.\n\nSince Watson’s federal ruling went further than the Maryland judge’s, his ruling has the most impact on the president's intended actions. However, the Justice Department also on Friday stated its intention to appeal the Maryland decision to the Fourth Circuit Court.\n\nA formal reply from Hawaii is expected soon.\n\nTrump says the temporary bans are matters of national security.\n\nTrump’ new travel ban, which does not include Iraq, is an attempt to avoid the legal roadblocks to the executive orders he issued in January that created confusion at U.S. airports and were temporarily halted by a federal judge in Washington state.\n\nA final ruling in that judge's Ninth Circuit Court also is expected soon.\n\nThis story is based in part on wire service reports.", "authors": [], "publish_date": "2017-03-18", "source": "foxnews", "top_words": ["ruling", "executive", "travel", "challenges", "hawaii", "judges", "trump", "ban", "temporarily", "watsons", "judge", "temporary", "federal", "order", "halt", "admin"], "summary": "The Justice Department is asking the federal judge in Hawaii who temporarily halted President Trump’s new travel ban to limit the scope of his ruling so that the United States can immediately stop taking in refugees worldwide.\nThe attorneys essentially want Watson’s ruling to be in line with a federal judge's ruling in Maryland on Thursday that temporarily halts the travel ban.\nU.S. District Judge Theodore Chuang cited earlier Trump statements and said the purpose of the new executive order \"remains the realization of the long-envisioned Muslim ban.\"\nHowever, he declined to issue an injunction blocking the entire executive order.\nSince Watson’s federal ruling went further than the Maryland judge’s, his ruling has the most impact on the president's intended actions."}