{"url": "http://www.foxnews.com/politics/2017/07/05/terror-related-acts-committed-by-refugees-widespread-according-to-new-report.html", "id": "186", "title": "Terror-related acts committed by refugees widespread, according to new report", "text": "At least 61 people who came to the United States as refugees engaged in terrorist activities between 2002 and 2016, according to an explosive new report coming on the heels of the Supreme Court’s reinstatement of much of President Trump’s travel ban.\n\nThe alarming report by the Heritage Foundation identified scores of refugees, including many who came prior to 2002, as having taken part in activities ranging from lying to investigators about terror plots, to actually taking part in them. The report, aimed at reforming the U.S. Refugee Admissions Program, or USRAP, calls for stricter limits and restrictions on refugees.\n\n“There is no universal right to migrate, resettlement is not the solution to mass displacement, and U.S. policymakers have a responsibility to ensure that the United States takes in only as many refugees as it can safely vet and assimilate,” the report states. “The United States operates the program not because it is obligated to resettle refugees, but because the U.S. is a humane country and USRAP serves its national interests.”\n\nThe report, written by policy analyst David Inserra, could lend weight to the Trump administration's effort to curtail the number of refugees who come to the U.S. every year. But perhaps most worrisome, the report warns that no amount of refugee vetting can account for the \"1.5 generation\" -- those who come to the U.S. with peaceful intentions and then become radicalized while living in America.\n\nISIS GUNNED DOWN PREGNANT WOMEN, BABIES, FORMER NAVY SEAL RECALLS\n\n“Given the threat that we found in the 1.5 generation, more needs to be done in the U.S. assimilation process,” said John Cooper, spokesman for the Heritage Foundation. “We can’t vet an 8-year-old to see if he will become a terrorist when he turns 18 or 28. Instead, we as a country need to rethink the way we assimilate refugees, and immigrants as a whole for that matter.\n\n“In the past few decades, the United States has drifted from its strong assimilation ethos, and the terrorism in Europe paints a disturbing picture of where non-assimilation leads,” he added.\n\nThe Trump administration has taken measures to both limit and more tightly screen refugees. Earlier this year, the administration reduced the number of refugees that it would accept this fiscal year from the Obama administration’s intended 110,000 to 50,000 – and that cap has almost been reached.\n\nRelated Image Expand / Collapse\n\n“A review is especially critical following the Obama administration’s rapid, and largely unprecedented, expansion of the program in the final year of his administration,” Cooper added. “Any administration has a responsibility to ensure all existing refugee and immigration programs, including the USRAP, best serve U.S. interests.”\n\nA U.S. State Department official told Fox News the administration will soon provide guidance regarding those already scheduled for travel before last week’s Supreme Court decision lifting an injunction against Trump’s executive order banning travel from six mostly Muslim countries plagued by terror.\n\nEUROPEANS VOW MORE HELP TO STEM LIBYA-ITALY MIGRANT FLOW\n\nBut the report leaves little doubt that the perpetrators of future terror attacks are already here, including some who may not yet be radicalized. It recommends a long-term focus be placed on migrants “embracing an American creed, learning English and gaining an education” which will in turn help them to develop and sustain “an American identity and sense of belonging.”\n\nThe report also supported the widely reported claim that refugees coming to the U.S undergo more vetting than any other immigrants coming to the country under other types of programs and visa categories. The vetting process for refugees typically takes 18 to 24 months from the time of the initial referral by the U.N. refugee agency, but “in the waning months of the Obama administration the U.S. reduced the time to as little as three months for Syrians by surging resources to the region.”\n\nIt also mandated that a “foolproof vetting system” is impossible, with obvious limitations, such as lack of identification or forged documents especially when fleeing war.\n\n“To be as cost-effective as possible – which saves the most lives – the U.S. should focus the majority of its refugee efforts on helping front-line states care for the refugees they shelter,” the report states.\n\nSpecifically, the report suggests that the U.S. can do more to urge Middle Eastern countries – most notably the oil-wealthy Gulf States – to resettle Syrian and Iraqi refugees.\n\nRelated Image Expand / Collapse\n\n“Many Syrian and Iraqi refugees share similar cultural and religious values with the people of the Gulf States, which have the financial capacity for resettlement,” the report found. “Saudi Arabia, Qatar and the United Arab Emirates have donated hundreds of millions of dollars each for relief efforts, but the U.S. should urge the Gulf States to increase their aid for their Arab Muslim neighbors by resettling Syrians with all the rights and protections due to refugees.”\n\nAs it stands, the Gulf States are not signatories to the U.N. Refugee Protocol and thus do not offer refugee status. They will admit some primarily as migrant workers or to reunify families.\n\nFraud is also a cause for concern, according to the report. It cites as an example the Dadaab refugee camp in northern Kenya, which was exposed several years ago for developing an entire industry centered on “coaching applicants” and selling resettlement slots for as much as $10,000.\n\nThe report goes on to outline ways in which the U.S. could minimize fiscal costs and improve economic outcomes by establishing private resettlement programs on a trial basis rather than relying solely on government. But above all, the report emphasizes the need to ensure the program first and foremost puts America first.\n\nIt argues that refugee resettlement can indeed advance national interests by enabling the U.S. to “assert American leadership in foreign crisis,” providing “the U.S. with a way to respond positively to intractable crisis” and assisting allies and partners in crisis. But reviews by the Trump team to the program to achieve this objective are crucial.\n\nHollie McKay has been a FoxNews.com staff reporter since 2007. She has reported extensively from the Middle East on the rise and fall of terrorist groups such as ISIS in Iraq. Follow her on twitter at @holliesmckay", "authors": ["Hollie Mckay"], "publish_date": "2017-07-05", "source": "foxnews", "top_words": ["acts", "terrorrelated", "gulf", "report", "refugee", "vetting", "committed", "states", "united", "resettlement", "according", "widespread", "refugees", "administration", "program"], "summary": "Refugee Admissions Program, or USRAP, calls for stricter limits and restrictions on refugees.\n“In the past few decades, the United States has drifted from its strong assimilation ethos, and the terrorism in Europe paints a disturbing picture of where non-assimilation leads,” he added.\n“To be as cost-effective as possible – which saves the most lives – the U.S. should focus the majority of its refugee efforts on helping front-line states care for the refugees they shelter,” the report states.\nSpecifically, the report suggests that the U.S. can do more to urge Middle Eastern countries – most notably the oil-wealthy Gulf States – to resettle Syrian and Iraqi refugees.\nRelated Image Expand / Collapse“Many Syrian and Iraqi refugees share similar cultural and religious values with the people of the Gulf States, which have the financial capacity for resettlement,” the report found."}