{"url": "http://www.foxnews.com/politics/2017/06/06/travel-ban-foes-threaten-to-use-trump-tweets-against-him-in-court.html", "id": "161", "title": "'Travel ban' foes threaten to use Trump tweets against him in court", "text": "President Trump’s recent tweets about his controversial travel ban -- now before the U.S. Supreme Court -- could hurt his own case, with the administration's legal opponents already threatening to use the statements to their advantage.\n\n\"Here at the ACLU, we think you should keep using social media,\" the American Civil Liberties Union tweeted Tuesday, after saying a day earlier they might use Trump's tweets in court.\n\n\"Yes, we may incorporate @realDonaldTrump's tweets about the ban into our Supreme Court argument,\" the ACLU said Monday.\n\nThe Trump tweets give courtroom foes an opportunity to seize on mixed messages out of the administration regarding the evolving set of executive orders.\n\nTrump unleashed a series of tweets starting Sunday night that took direct aim at DOJ attorneys, chiding them for not pursuing his original executive order and instead throwing their legal weight behind a “watered down” version.\n\n“The Justice Dept. should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C.,” Trump tweeted on Monday.\n\nTrump’s tweets came just a few days after the Justice Department asked the Supreme Court to lift lower court rulings that blocked the executive order suspending travel from six mostly Muslim countries.\n\nSome experts say Trump’s comments give an opening for the other side to argue the order is a full-blown ban and that it discriminates based on religion.\n\nMultiple Trump aides including Kellyanne Conway and White House Press Secretary Sean Spicer have repeatedly defended the executive order as a temporary pause in travel and not a ban. However, Trump’s tweets in all capital letters refer to the executive order as “a TRAVEL BAN” on “certain DANGEROUS countries” and said anything short of a ban would jeopardize the safety and security of Americans.\n\nEven the husband of Kellyanne Conway argued Monday that the tweets could handicap the department’s ability to do its job.\n\nGeorge Conway wrote on Twitter that Trump’s tweets “may make some ppl feel better, but they certainly won’t help OSG (Office of Solicitor General) get 5 votes in SCOTUS (Supreme Court of the United States), which is what actually matters. Sad.”\n\nThe White House pushed back. Asked Monday whether the Trump team was concerned about the tweets tainting the case, Deputy Press Secretary Sarah Huckabee Sanders said “not at all.”\n\nBut Doug Schoen, former adviser to President Bill Clinton, told Fox News that Trump’s tweets slamming his own lawyers could create problems.\n\n“To second guess your own side in the context of an ongoing fight, using language that is not helpful … it doesn’t make any sense,” Schoen, a Fox News contributor, said.\n\nTrump's tweets came after the government filed briefs with the high court last week urging justices to ignore polarizing and fiery comments Trump made multiple times during the campaign about the need for a “Muslim ban.“\n\nThey argued “taking that oath marks a profound transition from private life to the nation’s highest public office, and manifests the singular responsibility and independent authority to protect the welfare of the nation that the Constitution reposes in the president.”\n\nCecilia Wang, deputy legal director at the American Civil Liberties Union, which is representing challengers to the ban from Maryland, argued Trump’s tweets undermine the government’s claims that both executive orders are not bans but merely temporary travel restrictions on a small group of nations.\n\n“With his four tweets this morning, the president is basically reaffirming whatever his intent was in the beginning,” Wang told USA Today.\n\nNeal Katyal, a former acting U.S. solicitor general and the lead attorney representing challengers in a case from Hawaii, weighed in on Twitter that Trump’s actions were working in favor of Katyal’s case.\n\n“We don’t need the help but will take it!” he tweeted.\n\nFormer U.S. Attorney General Alberto Gonzales, who served under President George W. Bush, told the Huffington Post that Trump’s actions “presents a challenge that the Department of Justice will have to deal with.”\n\nTrump’s initial executive order, rolled out seven days after taking office in January, banned travel from seven mostly Muslim countries. The order sparked protests at airports around the country and brief detentions of hundreds of travelers. It was met with immediate resistance from the courts, with several federal district judges issuing orders blocking aspects of it.\n\nOn March 6, Trump issued a revised order that temporarily suspended travel of from six mostly Muslim countries: Yemen, Syria, Sudan, Somalia, Iran and Libya. The original ban included Iraq. The revised order also cleared up who the ban applies to, when it would go into effect and did not single out refugees from Syria by barring them indefinitely as the original version had.\n\nRegardless of changes, both orders were challenged in court on claims they were discriminatory on the basis of religion.", "authors": ["Barnini Chakraborty"], "publish_date": "2017-06-06", "source": "foxnews", "top_words": ["executive", "travel", "trump", "tweets", "foes", "ban", "supreme", "court", "trumps", "order", "president", "threaten"], "summary": "President Trump’s recent tweets about his controversial travel ban -- now before the U.S. Supreme Court -- could hurt his own case, with the administration's legal opponents already threatening to use the statements to their advantage.\n\"Yes, we may incorporate @realDonaldTrump's tweets about the ban into our Supreme Court argument,\" the ACLU said Monday.\nThe Trump tweets give courtroom foes an opportunity to seize on mixed messages out of the administration regarding the evolving set of executive orders.\nshould have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C.,” Trump tweeted on Monday.\nTrump’s tweets came just a few days after the Justice Department asked the Supreme Court to lift lower court rulings that blocked the executive order suspending travel from six mostly Muslim countries."}