{"url": "http://www.foxnews.com/politics/2017/07/19/trump-travel-ban-timeline-legal-journey.html", "id": "195", "title": "Trump travel ban: Timeline of a legal journey", "text": "The U.S. Supreme Court on Friday announced it would decide the legality of the latest version of President Trump's controversial travel ban that affects residents of six majority-Muslim countries. The ban applies to people from Syria, Chad, Iran, Libya, Somalia and Yemen.\n\nThe news comes after the Supreme Court ruled in favor of the ban in December 2017. At the time, the justices said the policy can take full effect despite multiple legal challenges against it that haven’t yet made their way through the judicial system.\n\nSince the president signed an executive order in January establishing a ban on travel of people from Muslim-majority nations, it has been a point of contention and challenged in court. Here’s a look at the ban’s journey through the legal system.\n\nJan. 19 – Supreme Court announces it will rule on the travel ban\n\nThe Supreme Court announced on Jan. 19 that it will rule on Trump's controversial travel ban. The justices plan to hear arguments in April and issue a final ruling by late June.\n\nDec. 4 – Supreme Court OKs full enforcement of Trump travel ban\n\nHanding the White House a huge judicial victory, the U.S. Supreme Court ruled in favor of Trump’s travel ban affecting residents of six majority-Muslim countries.\n\nLower courts had said people from those countries with a \"bona fide\" relationship with someone in the United States could not be prevented from entry.\n\nGrandparents and cousins were among the relatives courts said could not be excluded.\n\nJustices Ruth Bader Ginsburg and Sonia Sotomayor said they would have left the lower court orders in place.\n\nOct. 17 – Federal judge temporarily blocks travel ban\n\nU.S. District Judge Derrick Watson granted a request from Hawaii to temporarily block a version of Trump's travel ban, which was supposed to take effect at midnight ET on Oct. 18.\n\nHawaii argued that the revised ban – which included citizens from Chad, Iran, Libya, North Korea, Somalia, Syria and Yemen, and some Venezuelan government officials and their families – was a continuation of Trump's \"promise to exclude Muslims from the United States.\"\n\n\"Today’s dangerously flawed district court order undercuts the President’s efforts to keep the American people safe and enforce minimum security standards for entry into the United States,\" the White House said in a statement. \"The Department of Justice will vigorously defend the President’s lawful action.\"\n\nOct. 10 – Supreme Court dismisses one case\n\nThe Supreme Court didn’t take action on a case that originated in Hawaii pertaining to Trump’s travel ban and a ban on refugees.\n\nHowever, it did dismiss another case that originated in Maryland. That case involved a ban that has since expired and been replaced with a new one by the administration.\n\nOct. 5 – Justice Department asks Supreme Court to drop travel ban case\n\nThe Department of Justice asked the nation’s highest court to dismiss the case challenging the administration’s travel ban. The administration argued the case should be dismissed because it was regarding a previous travel ban that is now moot.\n\nSept. 24 – Trump signs new travel ban\n\nAs Trump’s original ban was set to expire, the president unveiled new restrictions on travel to the U.S. from certain countries’ citizens.\n\nThe revised ban included citizens from Chad, Iran, Libya, North Korea, Somalia, Syria and Yemen. It also included some government officials from Venezuela.\n\nSept. 12 – Supreme Court lifts restrictions\n\nThe Supreme Court blocked a lower court’s decision that would have allowed refugees to enter the country under certain conditions, blocking a ruling that said a resettlement agency counts as a “bona fide relationship.”\n\nSept. 7 – Appeals court limits travel ban\n\nThe U.S. Court of Appeals for the Ninth Circuit upheld a lower court ruling that would allow for more refugees to enter the country despite the ban. The federal court ruled that refugees working with a resettlement agency would be considered to have established an approved “bona fide relationship” with a contact in the U.S.\n\nWHO DOES TRUMP’S TRAVEL BAN BLOCK FROM ENTERING THE US?\n\nIt also expanded the scope of a “bona fide relationship” to include other family members, such as grandparents and other relatives.\n\nJuly 19 – Supreme Court allows for strict enforcement of refugee ban\n\nThe Supreme Court, temporarily, allowed for the administration’s travel ban to keep a strict enforcement on its ban of refugees. It did, however, leave in place the court order that made it easier for travelers from the six Muslim-majority countries to enter the U.S. and allowed a previous expansion of “bona fide relationships” to stay.\n\nJuly 13 – Federal judge expands scope of travel ban\n\nU.S. District Judge Derrick Watson, in Hawaii, ruled that a “bona fide relationship” certain travelers need before entering the U.S. could be expanded to include grandparents and other relatives.\n\nThe Justice Department filed an emergency request with the Supreme Court for clarification.\n\nJune 29 – Travel ban goes into effect\n\nAfter the Supreme Court’s ruling, the Trump administration issued guidance on who would be allowed into the country and who would be barred.\n\nJune 26 – Supreme Court allows for travel ban to continue\n\nThe Supreme Court announced it would allow Trump to forge ahead with a limited version of his travel ban. Trump hailed the decision as a “victory for national security.”\n\nHAWAII GETS CHANCE TO MAKE CASE FOR FIGHTING 3RD TRAVEL BAN\n\nThe court said it would hear arguments in October, but until then, the ban on travelers from Iran, Libya, Somalia, Sudan, Syria and Yemen could be enforced if the visitors lacked a “credible claim of a bona fide relationship with a person or entity in the United States.”\n\nMay 25 – Travel ban blocked by federal court\n\nThe Fourth Circuit Court of Appeals in Virginia blocked the travel ban from being implemented. It had begun to hear the case earlier in May.\n\n“We remain unconvinced [the ban] has more to do with national security than it does with effectuating the President’s promised Muslim ban,\" the court said at the time.\n\nMarch 30 – Trump administration appeals ruling\n\nThe Department of Justice filed an appeal with the Ninth U.S. Circuit Court of Appeals to challenge the ruling against the travel ban.\n\nMarch 29 – Federal judge continues to block travel ban\n\nU.S. District Judge Derrick Watson granted a request to continue to halt the travel ban.\n\nMarch 16 – Another federal judge temporarily blocks the order\n\nSitting in Maryland, U.S. District Judge Theodore Chuang temporarily halted the executive order. The injunction was not as comprehensive as the one issued earlier in Hawaii, but it did contend that the ban was discriminatory toward Muslims.\n\nMEGA-COMPANIES DISTANCE THEMSELVES FROM CHARITIES FOUND DONATING TO ANTI-TRUMP GROUP\n\nThe order did not change the previous injunction in Hawaii, but rather just reinforced it.\n\nMarch 15 – Federal judge blocks travel ban\n\nU.S. District Judge Derrick Watson prevented the travel ban from being implemented just before it was set to take effect. Watson granted the state of Hawaii’s request for a temporary restraining order.\n\nTrump called the decision an “unprecedented judicial overreach.”\n\nMarch 8 – Hawaii sues to block the travel ban\n\nThe state of Hawaii sued in an attempt to halt the Trump administration’s travel ban from going into effect. Lawyers said the “new executive order is resulting in the establishment of religion in the State of Hawaii contrary to its state Constitution.”\n\nLawyers also argued that the ban would damage Hawaii’s “economy, educational institutions and tourism industry; and it is subjecting a portion of the state’s citizens to second-class treatment and discrimination, while denying all Hawaii residents the benefits of an inclusive and pluralistic society.”\n\nMarch 6 – Trump unveils new travel ban\n\nTrump signed a new executive order which barred travel from six predominantly Muslim countries for 90 days – removing Iraq from the new ban.\n\nThe new order also exempted permanent residents and current visa holders from the travel ban. Syrian refugees were still included in the new order but only for 120 instead of indefinitely.\n\nFeb. 15 – Trump’s travel ban gets a defender\n\nTexas Attorney Ken Paxton split with other states and defended the travel ban as he filed documents with the U.S. Court of Appeals for the Ninth Circuit asking to reconsider a decision blocking the ban.\n\nPaxton argued that the order is a legal exercise of presidential authority.\n\nFeb. 13 – Federal judge grants injunction against ban\n\nA federal judge in Virginia granted an injunction to prevent the administration from implementing the ban.\n\nU.S. District Judge Leonie Brinkema said the ban was unconstitutional as it had a religious bias.\n\nFeb. 9 – Travel ban is again blocked\n\nThe travel ban’s suspension was upheld by the U.S. Court of Appeals for the Ninth Circuit in a unanimous decision.\n\nMUSLIM ADVOCATES, LEGAL ORG FILES SUITS OVER TRAVEL BAN\n\nThose judges were Michelle Friedland, appointed by former President Barack Obama; Richard Clifton, appointed by former President George W. Bush; and William Canby, appointed by former President Jimmy Carter.\n\nThe court began to hear arguments from the Justice Department and lawyers from the states of Washington and Maryland – in opposition to the ban – on Feb. 7.\n\nFeb. 6 – Justice Department asks federal court to intervene\n\nThe Justice Department filed with the U.S. Court of Appeals for the Ninth Circuit asking it to intervene and reverse a previous judge’s decision to halt the travel ban.\n\nSixteen attorneys general filed an amicus brief in support of the lawsuit against the travel ban. Those included: California, Connecticut, Delaware, Illinois, Iowa, Maine, Maryland, Massachusetts, New Mexico, New York, Oregon, Pennsylvania, Rhode Island, Vermont, Virginia and Washington, D.C.\n\nFeb. 3 – Judge declines to extend injunction against travel ban\n\nU.S. District Judge Nathaniel Gorton did not extend a temporary injunction against the administration’s travel ban.\n\nBut U.S. District Judge James Robart in Seattle did issue a temporary block of the ban on the same day.\n\n“The state has met its burden in demonstrating immediate and irreparable injury,” Robart said as he ruled in favor of lawyers from the states of Washington and Minnesota.\n\nFeb. 1 – Administration tweaks travel ban\n\nThe Trump administration tweaked its travel ban to exempt legal permanent residents of the U.S.\n\nAFGHAN GIRLS ROBOTICS TEAM ARRIVES IN US JUST IN TIME\n\n“They no longer need a waiver because if they are a legal permanent resident, they won’t need it anymore,” then-White House press secretary Sean Spicer said of green card holders.\n\nJan. 30 – Senate Republicans save travel ban from Democrats\n\nSenate Republicans squashed an effort by Democrats to overturn the executive order. When Minority Leader Chuck Schumer, D-N.Y. sought a vote on legislation to reverse the ban, Sen. Tom Cotton, R-Ark., objected.\n\nTrump also fired acting Attorney Gen. Sally Yates on this day when she refused to defend the travel ban.\n\nJan. 29 – Temporary stay issued on travel ban\n\nA Boston federal court temporarily put Trump’s travel ban on hold for one week.\n\nThe ruling stipulated that previously approved refugees, valid visa holders and lawful permanent residents or travelers from the seven countries included in Trump’s order could not be detained or removed from the U.S. because of the executive order.\n\nJan. 28 – Federal judge issues emergency injunction against ban\n\nA federal judge in New York issued an emergency order blocking, in part, the executive order. U.S. District Judge Ann Donnelly’s ruling temporarily barred the U.S. from deporting people who arrived with a valid visa or who had already completed a refugee application.\n\nAs dozens of people were detained after their planes landed in the U.S., massive protests erupted at airports nationwide.\n\nJan. 27 – Trump signs executive order barring travel from seven Muslim-majority nations\n\nTrump signed an executive order which immediately barred entry into the U.S. for the citizens of Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\n\nThe order, dubbed “Protection the Nation From Foreign Terrorist Entry into the United States,” also halted the U.S. refugee program for 120 days, but indefinitely barred all Syrian refugees from entering the country.\n\nFox News' Barnini Chakraborty and The Associated Press contributed to this report.", "authors": ["Kaitlyn Schallhorn"], "publish_date": "2017-07-19", "source": "foxnews", "top_words": ["travel", "district", "trump", "timeline", "ban", "supreme", "judge", "court", "journey", "trumps", "federal", "order", "legal"], "summary": "Oct. 10 – Supreme Court dismisses one caseThe Supreme Court didn’t take action on a case that originated in Hawaii pertaining to Trump’s travel ban and a ban on refugees.\nOct. 5 – Justice Department asks Supreme Court to drop travel ban caseThe Department of Justice asked the nation’s highest court to dismiss the case challenging the administration’s travel ban.\nJune 26 – Supreme Court allows for travel ban to continueThe Supreme Court announced it would allow Trump to forge ahead with a limited version of his travel ban.\nMarch 29 – Federal judge continues to block travel banU.S. District Judge Derrick Watson granted a request to continue to halt the travel ban.\nJan. 29 – Temporary stay issued on travel banA Boston federal court temporarily put Trump’s travel ban on hold for one week."}