{"url": "http://www.foxbusiness.com/politics/2017/07/15/us-top-court-gives-hawaii-until-tuesday-to-answer-trump-travel-ban-motion.html", "id": "10", "title": "US top court gives Hawaii until Tuesday to answer Trump travel ban motion", "text": "The U.S. Supreme Court has asked the State of Hawaii to respond by Tuesday at noon to President Donald Trump's motion to block a judge's ruling that prevented his travel ban from being applied to grandparents of U.S. citizens and refugees already being processed by resettlement agencies, the court's public information office said on Saturday.\n\nContinue Reading Below\n\nIn a court filing on Friday, the administration asked the justices to overturn Thursday's decision by a U.S. district judge in Hawaii, which limited the scope of the administration's temporary ban on refugees and travelers from six Muslim-majority countries.\n\nThe latest round in the fight over Trump's March 6 executive order, which he says is needed to prevent terrorism attacks, began when the Supreme Court intervened last month to partially revive the two bans, which had been blocked by lower courts.\n\nThe Supreme Court said then that the ban could take effect, but that people with a \"bona fide relationship\" to a U.S. person or entity could not be barred. The administration had narrowly interpreted that language, saying the ban would apply to grandparents and other family members, prompting the state of Hawaii to ask Hawaii-based U.S. District Judge Derrick Watson to expand the definition of who could be admitted.\n\nTrump banned travelers from Iran, Libya, Somalia, Sudan, Syria and Yemen for 90 days, and refugees for 120 days.\n\nThe Supreme Court has agreed to hear oral arguments in the fall over whether the ban violates the U.S. Constitution.\n\nContinue Reading Below ADVERTISEMENT\n\n(Reporting by Julia Edwards Ainsley and Lawrence Hurley; editing by Grant McCool)", "authors": [], "publish_date": "2017-07-15", "source": "foxnews", "top_words": ["travel", "hawaii", "trump", "ban", "supreme", "state", "gives", "travelers", "answer", "court", "judge", "trumps", "reading", "refugees", "motion"], "summary": "Continue Reading BelowIn a court filing on Friday, the administration asked the justices to overturn Thursday's decision by a U.S. district judge in Hawaii, which limited the scope of the administration's temporary ban on refugees and travelers from six Muslim-majority countries.\nThe Supreme Court said then that the ban could take effect, but that people with a \"bona fide relationship\" to a U.S. person or entity could not be barred.\nTrump banned travelers from Iran, Libya, Somalia, Sudan, Syria and Yemen for 90 days, and refugees for 120 days.\nThe Supreme Court has agreed to hear oral arguments in the fall over whether the ban violates the U.S. Constitution.\nContinue Reading Below ADVERTISEMENT(Reporting by Julia Edwards Ainsley and Lawrence Hurley; editing by Grant McCool)"}