{"url": "http://www.foxnews.com/politics/2017/06/26/supreme-court-to-hear-trump-appeal-travel-ban-block.html", "id": "171", "title": "Trump travel ban: Supreme Court reinstates key parts of executive order", "text": "In a victory for the Trump administration, the Supreme Court on Monday lifted key components of an injunction against President Trump's proposed ban on travel from six majority-Muslim nations, reinstating much of the policy and promising to hear full arguments as early as this fall.\n\nThe court's decision means the justices will now wade into the biggest legal controversy of the Trump administration -- the president's order temporarily restricting travel, which even Trump has termed a \"travel ban.\"\n\nRelated Image Expand / Collapse\n\n\"Today's unanimous Supreme Court decision is a clear victory for our national security,\" Trump said in a statement. \"...As President, I cannot allow people into our country who want to do us harm. I want people who can love the United States and all of its citizens, and who will be hardworking and productive.\"\n\nHe added: \"My No. 1 responsibility as commander in chief is to keep the American people safe. Today's ruling allows me to use an important tool for protecting our Nation's homeland.\"\n\nThe court made clear that a limited version of the policy can be enforced immediately with a full hearing to come in the Fall.\n\n\"An American individual or entity that has a bona fide relationship with a particular person seeking to enter the country as a refugee can legitimately claim concrete hardship if that person is excluded,” the court wrote. “As to these individuals and entities, we do not disturb the injunction. But when it comes to refugees who lack any such connection to the United States, for the reasons we have set out, the balance tips in favor of the government’s compelling need to provide for the Nation’s security.”\n\nRelated Image Expand / Collapse\n\nThe justices decided to review the broader constitutional issues over executive authority on immigration with oral arguments to be held in the fall.\n\nTrump has been incensed since his original executive order, signed on Jan. 27, was partially blocked by a federal court.\n\n\"What is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.?\" Trump tweeted on Feb. 4.\n\nHe added on Feb. 11: \"Our legal system is broken!\"\n\nRelated Image Expand / Collapse\n\nIn early March, Trump issued a revised executive order -- which also had key provisions blocked by federal courts.\n\nTrump has been spoiling for the Supreme Court to take up the case and eager to get it out of the hands of what he sees as more liberal appellate judges.\n\nFour days after signing the original ban, Trump nominated Neil Gorsuch to fill the Supreme Court seat vacated when Antonin Scalia died. Gorsuch, who has since been confirmed, is largely seen as a conservative, originalist justice in the Scalia mold and could help Trump claim an even more definitive victory after arguments.\n\n“The government has made a strong showing that it is likely to succeed on the merits – that is, that the judgments below will be reversed,” wrote Justice Thomas, supported by Alito and Gorsuch. “The Government has also established that failure to stay the injunctions will cause irreparable harm by interfering with its ‘compelling need to provide for the Nation’s security.’”\n\nAt issue is whether the temporary ban violates the Religion Clauses of the First Amendment, the Due Process Clause of the Fifth and 14th Amendments, and the ban on nationality discrimination in the issuance of immigrant visas contained in a 65-year-old congressional law.\n\n\n\nRelated Image Expand / Collapse\n\nFederal appeals courts in Virginia and California in recent weeks have ruled against the administration. A majority of the 4th Circuit appeals court cited then-candidate Donald Trump's campaign statements proposing a ban \"preventing Muslim immigration.\"\n\n\n\nThe White House, on the other hand, frames the issue as a temporary move involving national security. A coalition of groups in opposition call the order blatant religious discrimination, since the six countries involved have mostly-Muslim populations: Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nA major sticking point for the justices will be navigating how much discretion the president really has over immigration. Courts have historically been deferential in this area, and recent presidents dating back to Jimmy Carter have used their discretion to deny entry to certain refugees and diplomats -- including those from nations such as Iran, Cuba and North Korea.\n\n\n\nA 1952 federal law -- the Immigration and Nationality Act, passed in the midst of a Cold War fear over Communist influence -- historically gives the chief executive broad authority.\n\n\n\n\"Whenever the president finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may, by proclamation, and for such period as he shall deem necessary,\" Section 212 (f) of the law states, \"suspend the entry of all aliens or any class of aliens as immigrants or non-immigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate.\"\n\nIn his opinion, Thomas criticized the majority for the compromise nature of Monday's ruling, indicating he would have allowed the order to be enforced in full. Thomas said he feared \"the Court's remedy\" would inspire a flood of new litigation.\n\n\"Today’s compromise will burden executive officials with the task of deciding -- on peril of contempt -- whether individuals from the six affected nations who wish to enter the United States have a sufficient connection to a person or entity in this country,\" Thomas wrote. \"The compromise also will invite a flood of litigation until this case is finally resolved on the merits, as parties and courts struggle to determine what exactly constitutes a 'bona fide relationship,' who precisely has a 'credible claim' to that relationship, and whether the claimed relationship was formed 'simply to avoid §2(c)' of Executive Order No. 13780.”\n\nFox News' Bill Mears contributed to this report.", "authors": [], "publish_date": "2017-06-26", "source": "foxnews", "top_words": ["parts", "executive", "travel", "aliens", "courts", "trump", "ban", "supreme", "order", "court", "nations", "states", "united", "key", "reinstates"], "summary": "Related Image Expand / Collapse\"Today's unanimous Supreme Court decision is a clear victory for our national security,\" Trump said in a statement.\nI want people who can love the United States and all of its citizens, and who will be hardworking and productive.\"\nTrump has been incensed since his original executive order, signed on Jan. 27, was partially blocked by a federal court.\nRelated Image Expand / CollapseIn early March, Trump issued a revised executive order -- which also had key provisions blocked by federal courts.\nFour days after signing the original ban, Trump nominated Neil Gorsuch to fill the Supreme Court seat vacated when Antonin Scalia died."}