{"url": "http://www.foxnews.com/politics/2017/04/10/trump-travel-ban-defended-by-15-state-coalition-led-by-texas-ag.html", "id": "131", "title": "Trump travel ban defended by 15-state coalition led by Texas AG", "text": "The Texas attorney general led a 15-state coalition Monday defending President Trump’s revised immigration order, amid lawsuits opposing the plan to halt immigration from six countries.\n\nIn a friend-of-the-court amicus brief to the 9th U.S. Circuit Court of Appeals, Texas Attorney General Ken Paxton, 13 other state attorneys general and Republican Mississippi Gov. Phil Bryant, laid out constitutional and federal statutory provisions defending Trump’s authority. The attorneys general also defended Trump’s “lawful actions” to revise the executive order, which was blocked last month by a three-judge panel of the 9th Circuit.\n\n“The president’s revised immigration order is constitutional, lawful, addresses the 9th Circuit’s concerns and is a vital step in securing our borders,” Paxton said in a statement. “A temporary pause in the national refugee program will give the government time to review and determine how we can improve the screening process for foreign nationals seeking to enter the U.S. from six countries designated as ‘countries of concern’.”\n\nTexas is joined in the amicus brief by Alabama, Arizona, Arkansas, Florida, Kansas, Louisiana, Montana, North Dakota, Oklahoma, South Carolina, South Dakota, Tennessee, West Virginia and Mississippi.\n\nThe revised executive order still imposes a 90-day suspension of entry to the United States for nationals of several mostly Muslim countries: Sudan, Syria, Libya, Somalia, Yemen and Iran. Iraq was on the list in the original order but was removed after the Iraqi government agreed to increase cooperation with Washington on vetting travelers to the U.S.\n\nThe revised order also dropped language calling for an “indefinite suspension” of Syrian refugees; they are no longer singled out, which addresses an issue raised by the courts.\n\nThe new order also clarifies that foreign nationals from the six countries listed who already had valid visas as of Jan. 27 would not be affected. Further, the new order exempts green card holders and makes clear that legal permanent residents are not affected.\n\n“President Trump’s revised immigration order is necessary to protect the homeland from those who wish us harm,” Paxton said.\n\nFox News' Casey Stegall contributed to this report.\n\nBrooke Singman is a Politics Reporter for Fox News. Follow her on Twitter at @brookefoxnews.\n\n", "authors": ["Brooke Singman"], "publish_date": "2017-04-10", "source": "foxnews", "top_words": ["travel", "led", "nationals", "trump", "revised", "ban", "defended", "immigration", "paxton", "9th", "ag", "15state", "trumps", "texas", "general", "countries", "order", "coalition"], "summary": "The Texas attorney general led a 15-state coalition Monday defending President Trump’s revised immigration order, amid lawsuits opposing the plan to halt immigration from six countries.\nCircuit Court of Appeals, Texas Attorney General Ken Paxton, 13 other state attorneys general and Republican Mississippi Gov.\n“The president’s revised immigration order is constitutional, lawful, addresses the 9th Circuit’s concerns and is a vital step in securing our borders,” Paxton said in a statement.\nThe revised order also dropped language calling for an “indefinite suspension” of Syrian refugees; they are no longer singled out, which addresses an issue raised by the courts.\n“President Trump’s revised immigration order is necessary to protect the homeland from those who wish us harm,” Paxton said."}