{"url": "http://www.foxnews.com/politics/2017/08/18/trump-slams-obstructionist-democrats-as-danger-to-national-security.html", "id": "197", "title": "Trump slams ‘Obstructionist Democrats’ as danger to national security", "text": "President Trump accused “Obstructionist Democrats” on Friday of hurting national security by waging court fights against his policies, in an apparent reference to the battle over his travel ban and other measures that could get renewed attention following the terror attacks in Spain.\n\n“The Obstructionist Democrats make Security for our country very difficult. They use the courts and associated delay at all times. Must stop!” Trump tweeted, later adding: “Radical Islamic Terrorism must be stopped by whatever means necessary! The courts must give us back our protective rights. Have to be tough!”\n\nMoments earlier, Trump had said U.S. security officials are on the lookout for any signs of trouble, while assuring that America’s borders “are far tougher than ever before.”\n\nThe president issued the message as Spanish officials make arrests and hunt for more suspects in Thursday’s attacks that killed at least 14 in central Barcelona and the resort of Cambrils.\n\n“Homeland Security and law enforcement are on alert & closely watching for any sign of trouble. Our borders are far tougher than ever before!” Trump tweeted.\n\nDespite his assurance on the border, his administration remains locked in a court battle with opponents of his travel ban.\n\nThe Supreme Court plans to take up the case in the fall, while allowing portions of it to go into effect.\n\nIn June, the Supreme Court partially lifted lower court injunctions against Trump’s executive order that had temporarily banned visas for citizens of six countries. The justices’ ruling exempted applicants from the ban if they could prove a “bona fide relationship” with a U.S. person or entity, but the court offered only broad guidelines as to how that should be defined.\n\nThe Trump administration then set new criteria for new visa applicants from Syria, Sudan, Somalia, Libya, Iran and Yemen saying they must prove a relationship with a parent, spouse, child, adult son or daughter, son-in-law, daughter-in-law or sibling already in the United States to be eligible. The same requirement, with some exceptions, holds for would-be refugees from all nations who are still awaiting approval for admission to the U.S.\n\nIn Spain, a fourth person was arrested on Friday in connection with the terror attacks.\n\nThe death toll rose to 14 after a woman died following an injury when a car plowed into pedestrians in Cambrils, about 80 miles south of Barcelona. She is the first fatality of the attack in the popular seaside town.\n\nPolice shot and killed five suspects who were equipped with bomb belts in Cambrils. The belts were found later to be fake. It was not immediately clear if the Barcelona van driver was among the arrested or dead suspects.\n\nLocal government confirmed the incident in Cambrils was linked to the attack in central Barcelona, which wounded more than 100.\n\nThe Associated Press contributed to this report.", "authors": [], "publish_date": "2017-08-18", "source": "foxnews", "top_words": ["travel", "suspects", "national", "trump", "cambrils", "security", "democrats", "court", "slams", "obstructionist", "trouble", "danger", "tougher", "terror", "barcelona"], "summary": "President Trump accused “Obstructionist Democrats” on Friday of hurting national security by waging court fights against his policies, in an apparent reference to the battle over his travel ban and other measures that could get renewed attention following the terror attacks in Spain.\n“The Obstructionist Democrats make Security for our country very difficult.\nMust stop!” Trump tweeted, later adding: “Radical Islamic Terrorism must be stopped by whatever means necessary!\n“Homeland Security and law enforcement are on alert & closely watching for any sign of trouble.\nLocal government confirmed the incident in Cambrils was linked to the attack in central Barcelona, which wounded more than 100."}