{"url": "http://www.foxnews.com/politics/2017/05/25/trump-travel-ban-blocked-by-va-based-federal-appeals-court.html", "id": "151", "title": "Trump travel ban blocked by Va.-based federal appeals court", "text": "A Virginia-based federal appeals court blocked the Trump administration's controversial travel ban, becoming the second circuit court to uphold lower court rulings against the policy.\n\nThe Fourth Circuit Court of Appeals in Richmond issued the ruling Thursday, following arguments May 8.\n\nThe ruling means the Trump administration still cannot enforce its travel ban which affects six Muslim-majority countries: Iran, Syria, Yemen, Somalia, Libya and Sudan.\n\n“We remain unconvinced [the ban] has more to do with national security than it does with effectuating the President’s promised Muslim ban,\" the court said.\n\nThe ruling was issued by the full, or en banc, court, in a 10-3 ruling with two abstentions.\n\n\"Congress granted the president broad power to deny entry to aliens, but that power is not absolute. It cannot go unchecked when, as here, the president wields it through an executive edict that stands to cause irreparable harm to individuals across this nation,\" the chief judge of the circuit, Roger L. Gregory wrote.\n\nJudge Paul Niemeyer sharply dissented from the decision, saying it will make the U.S. more dangerous.\n\n“Regrettably, at the end of the day, the real losers in this case are the millions of individual Americans whose security is threatened on a daily basis by those who seek to do us harm,\" Judge Dennis Shedd wrote in a separate dissent.\n\nTrump issued his first executive order creating a travel ban on Jan. 27. That order, which included Iraq, sparked protests at airports around the country and brief detentions of hundreds of travelers. It was met with immediate resistance from the courts, with several federal district judges issuing orders blocking aspects of the order.\n\nOn March 6, Trump issued a revised travel ban striking Iraq and excluding existing visa and green card holders.\n\nAnother federal appeals court is considering a similar appeal of a Hawaii-based judge’s ruling blocking the visa ban. The San Francisco-based 9th Circuit Court of Appeals heard arguments in that case May 15.\n\nBoth cases are likely headed to the U.S. Supreme court, according to legal experts.\n\nThe first travel ban in January triggered chaos and protests across the country as travelers were stopped from boarding international flights and detained at airports for hours. Trump tweaked the order after the 9th U.S. Circuit Court of Appeals refused to reinstate the ban.\n\nThe new version made it clear the 90-day ban covering those six countries doesn't apply to those who already have valid visas. It got rid of language that would give priority to religious minorities and removed Iraq from the list of banned countries.\n\nCritics said the changes don't erase the legal problems with the ban.\n\nThe Maryland case was brought by the American Civil Liberties Union and the National Immigration Law Center on behalf of organizations as well as people who live in the U.S. and fear the executive order will prevent them from being reunited with family members from the banned countries.\n\n\"President Trump's Muslim ban violates the Constitution, as this decision strongly reaffirms,\" said Omar Jadwat, director of the ACLU's Immigrants' Rights Project, who argued the case. \"The Constitution's prohibition on actions disfavoring or condemning any religion is a fundamental protection for all of us, and we can all be glad that the court today rejected the government's request to set that principle aside.\"\n\nFox News' Bill Mears and The Associated Press contributed to this report.", "authors": ["Barnini Chakraborty"], "publish_date": "2017-05-25", "source": "foxnews", "top_words": ["ruling", "travel", "case", "trump", "vabased", "ban", "appeals", "circuit", "court", "issued", "federal", "blocked", "order"], "summary": "A Virginia-based federal appeals court blocked the Trump administration's controversial travel ban, becoming the second circuit court to uphold lower court rulings against the policy.\nThe ruling means the Trump administration still cannot enforce its travel ban which affects six Muslim-majority countries: Iran, Syria, Yemen, Somalia, Libya and Sudan.\nTrump issued his first executive order creating a travel ban on Jan. 27.\nOn March 6, Trump issued a revised travel ban striking Iraq and excluding existing visa and green card holders.\nAnother federal appeals court is considering a similar appeal of a Hawaii-based judge’s ruling blocking the visa ban."}