{"url": "http://www.foxnews.com/politics/2017/03/30/trump-travel-ban-hawaii-judge-extends-hold-on-implementing-executive-order.html", "id": "130", "title": "Trump travel ban: Hawaii judge extends hold on implementing executive order", "text": "A federal judge in Hawaii issued an extension on his order blocking President Trump’s travel ban hours after hearing arguments Wednesday.\n\nHawaii contends the travel ban discriminates against Muslims and hurts the state’s tourist-dependent economy. State Attorney General Douglas Chin argued that the ban’s implied message is like a “neon sign flashing ‘Muslim ban, Muslim ban” that the government did not bother to turn off.\n\nExtending the temporary order until the state's lawsuit was resolved would ensure the constitutional rights of Muslim citizens across the U.S. are vindicated after \"repeated stops and starts of the last two months,\" the state has said.\n\nThe Trump administration had asked Judge Derrick Watson, a federal judge in Hawaii, to narrow his ruling to cover only the part of the president’s executive order that suspends new visas for people from six Muslim-majority nations.\n\nJustice Department told Watson the freeze on the U.S. refugee program had no effect on Hawaii. Watson rejected that argument, preventing the administration from halting the flow of refugees.\n\nEarlier this month, Watson prevented the federal government from suspending new visas for people from Somalia, Iran, Syria, Sudan, Libya and Yemen and freezing the nation's refugee program. His ruling came just hours before the federal government planned to start enforcing Trump's executive order.\n\nTrump called Watson's previous ruling an example of \"unprecedented judicial overreach.\"\n\nThe Associated Press contributed to this report.", "authors": [], "publish_date": "2017-03-30", "source": "foxnews", "top_words": ["executive", "ruling", "travel", "extends", "hawaii", "trump", "implementing", "ban", "visas", "judge", "trumps", "federal", "hold", "order", "muslim", "watson"], "summary": "A federal judge in Hawaii issued an extension on his order blocking President Trump’s travel ban hours after hearing arguments Wednesday.\nHawaii contends the travel ban discriminates against Muslims and hurts the state’s tourist-dependent economy.\nState Attorney General Douglas Chin argued that the ban’s implied message is like a “neon sign flashing ‘Muslim ban, Muslim ban” that the government did not bother to turn off.\nThe Trump administration had asked Judge Derrick Watson, a federal judge in Hawaii, to narrow his ruling to cover only the part of the president’s executive order that suspends new visas for people from six Muslim-majority nations.\nHis ruling came just hours before the federal government planned to start enforcing Trump's executive order."}