{"url": "http://www.foxnews.com/politics/2017/06/30/trump-administration-says-do-to-adding-fiances-to-travel-ban-exemptions.html", "id": "182", "title": "Trump administration says ‘I do’ to adding fiances to travel ban exemptions", "text": "The Trump administration has apparently altered its definition of a \"bona fide\" relationship, adding fiancés of people in the U.S. to its list of people who are exempt from its travel ban from six mainly Muslim nations.\n\nThe administration had set criteria for visa applicants from the six nations and all refugees that require a \"close\" family or business tie to the United States.\n\nThe guidelines sent to U.S. embassies and consulates on Wednesday said applicants from the six countries must prove a relationship with a parent, spouse, child, adult son or daughter, son-in-law, daughter-in-law or sibling in the U.S.\n\nThe travel ban temporarily barring some citizens of six majority-Muslim countries from coming into the United States went into effect Thursday. The new rules stop people from Syria, Sudan, Somalia, Yemen, Iran and Libya from getting a visa to the U.S. unless they have a \"bona fide\" relationship with a close relative, school or business in the U.S.\n\nThe new version is considered a scaled-down version of Trump’s initial plan.\n\nHawaii Attorney General Doug Chin says he's concerned the Trump administration may be violating the U.S. Supreme Court's travel ban ruling. Chin says many of the people that the federal government decided to exclude are considered \"close family\" in Hawaii.\n\nHawaii has filed a court challenge to the Trump administration's limitations on the family relationships\n\nGuidance released Thursday by the State Department and the Homeland Security Department adds \"fiancé\" to that definition of \"close familial relationship.\"\n\nThe Associated Press contributed to this report", "authors": [], "publish_date": "2017-06-30", "source": "foxnews", "top_words": ["travel", "administration", "adding", "trump", "relationship", "ban", "family", "usthe", "version", "close", "exemptions", "fiances", "visa"], "summary": "The Trump administration has apparently altered its definition of a \"bona fide\" relationship, adding fiancés of people in the U.S. to its list of people who are exempt from its travel ban from six mainly Muslim nations.\nThe administration had set criteria for visa applicants from the six nations and all refugees that require a \"close\" family or business tie to the United States.\nThe travel ban temporarily barring some citizens of six majority-Muslim countries from coming into the United States went into effect Thursday.\nHawaii Attorney General Doug Chin says he's concerned the Trump administration may be violating the U.S. Supreme Court's travel ban ruling.\nChin says many of the people that the federal government decided to exclude are considered \"close family\" in Hawaii."}