{"url": "http://www.foxnews.com/us/2017/02/08/look-at-judges-who-will-rule-on-trump-travel-ban.html", "id": "281", "title": "A look at the judges who will rule on Trump's travel ban", "text": "Three judges on the San Francisco-based 9th Circuit Court of Appeals will decide as soon as Thursday whether to immediately reinstate President Donald Trump's travel ban, which temporarily suspended the nation's refugee program and immigration from seven mostly Muslim countries that have raised terrorism concerns. Here's a look at their backgrounds, judicial decisions and questioning during arguments in the case this week:\n\nWILLIAM CANBY\n\nCanby rarely hears cases anymore. Now 85, he told The Associated Press two years ago that he felt sharp and healthy, but didn't want to risk a job hazard that federal judges with lifetime appointments face: age-related mental decline. So it was unusual for the judge to hear oral arguments over the Trump travel ban.\n\nCanby — a former U.S. Air Force lieutenant and Peace Corps worker in Africa who was appointed to the 9th Circuit by President Jimmy Carter in 1980 — is known to have a polite and respectful courtroom demeanor. He encourages attorneys to have interests outside the law and told a reporter in 2005 he was running two to three miles before starting his day. He has written extensively about Native American law. Among his more high-profile decisions was a 1988 ruling declaring the U.S. Army's ban on gay soldiers unconstitutional and a 2000 decision that said the PGA Tour is covered by federal disability law and must provide a cart to golfer Casey Martin.\n\nDuring oral arguments, he challenged the administration's justification for the ban. Later, Canby appeared to come to the rescue of the attorney challenging the ban when another judge was grilling him about what evidence he had that the travel ban was motivated by anti-Muslim sentiment. Canby asked the attorney who had the legal burden of showing the likelihood of succeeding on their arguments in the case. The attorney responded that that burden was on the administration.\n\n___\n\nRICHARD CLIFTON\n\nClifton, nominated to the 9th Circuit by George W. Bush in 2001, is the second judge from Hawaii to serve on the 9th Circuit. He grew up in the Midwest, but moved to Hawaii to clerk for another 9th Circuit judge after graduating from Yale Law School in 1975. He is still based there.\n\nClifton, 66, was a lawyer for the Hawaii Republican Party, but has described himself as not having a pronounced political philosophy. He handled business and commercial litigation for a prominent Hawaii law firm and had never served as a judge before joining the 9th Circuit. He received nearly unanimous support for his nomination in the U.S. Senate. At his confirmation hearing, California Rep. Christopher Cox described Clifton as a lifelong Chicago Cubs fan, Cub Scout den leader, and dedicated husband and father who had some important credentials for being an appeals court judge: He refereed youth soccer. Since joining the court, Clifton has ruled in favor of a Los Angeles ordinance that required hotel operators to open their guest registries at the demand of police and called for a harsher prison sentence for a terrorist who plotted to blow up Los Angeles International Airport.\n\nOf the three judges who heard arguments over the travel ban, Clifton had the toughest questions for the attorney representing the two states — Washington and Minnesota — challenging it. He asked what evidence the attorney had that the president's travel ban was motivated by religious prejudice. At one point, Clifton pressed him, \"Do I have to believe everything you allege and say, 'Well, that must be right.\" But Clifton also grilled the administration's attorney, asking him whether he denied statements by Trump about banning Muslims. The attorney said he didn't.\n\n___\n\nMICHELLE FRIEDLAND\n\nAt 44, Friedland is one of the two youngest federal appeals judges in the country. President Barack Obama appointed her in 2014, and during her confirmation hearing she received support from both parties.\n\nFriedland was born in California and attended school in New Jersey, where her father worked as the president of a clothing company and her mother was a writing instructor and freelancer, according to Friedland's 2000 wedding announcement in The New York Times.\n\nShe graduated with honors from Stanford University, studied at Oxford University on a Fulbright Scholarship and then got her law degree at Stanford University. She later clerked for U.S. Supreme Court Justice Sandra Day O'Connor.\n\nIn private practice, she represented major clients, including Berkshire Hathaway, Boeing and the University of California. She was recognized along with a handful of other members of her firm by the California Bar Association for pro-bono work defending the constitutionality of California's ban on sexual orientation \"conversion therapy.\" She also represented same-sex couples challenging California's gay-marriage ban.\n\nWith less than three years on the appeals court, a full picture of Friedland's judicial philosophy has yet to emerge, some legal scholars say.\n\nOf the three judges at Tuesday's hearing, she appeared to be the most sympathetic to Washington state's case, repeatedly questioning the Justice Department's lawyer over the basis for the travel ban: \"Have you offered any evidence to support this need you're describing for the executive order, or are you really arguing that we can't even ask about whether there's evidence because this decision is non-reviewable?\"\n\n___\n\nJohnson reported from Seattle.", "authors": [], "publish_date": "2017-02-08", "source": "foxnews", "top_words": ["travel", "judges", "ban", "circuit", "judge", "9th", "court", "clifton", "trumps", "rule", "attorney", "law", "look"], "summary": "So it was unusual for the judge to hear oral arguments over the Trump travel ban.\nLater, Canby appeared to come to the rescue of the attorney challenging the ban when another judge was grilling him about what evidence he had that the travel ban was motivated by anti-Muslim sentiment.\n___RICHARD CLIFTONClifton, nominated to the 9th Circuit by George W. Bush in 2001, is the second judge from Hawaii to serve on the 9th Circuit.\nOf the three judges who heard arguments over the travel ban, Clifton had the toughest questions for the attorney representing the two states — Washington and Minnesota — challenging it.\nHe asked what evidence the attorney had that the president's travel ban was motivated by religious prejudice."}