{"url": "http://www.foxnews.com/us/2017/02/07/federal-judges-express-skepticism-about-trump-travel-ban.html", "id": "276", "title": "Federal judges express skepticism about Trump travel ban", "text": "A panel of federal judges expressed skepticism Tuesday over the need for President Donald Trump's travel ban, which has upended travel to the U.S. for more than a week and tested the new administration's use of executive power.\n\nThe government asked the appeals court to restore Trump's order, contending that the president alone has the power to decide who can enter or stay in the United States. But several states have challenged the ban on travelers from seven predominantly Muslim nations and insisted that it is unconstitutional.\n\nCircuit Judge Michelle T. Friedland, who was appointed by President Barack Obama, asked whether the government has any evidence connecting the seven predominantly Muslim nations covered by the ban to terrorism.\n\nAugust Flentje, special counsel to the assistant attorney general, said the government is aware of some foreign nationals who have been arrested in the U.S. since Sept. 11, but he did not give details of the evidence.\n\nHe also said president has broad power to enforce national security.\n\nTuesday's hearing unfolded before a randomly selected panel of judges from the San Francisco-based 9th U.S. Circuit Court of Appeals. It was unlikely the court would issue a ruling Tuesday, with a decision expected later this week, court spokesman David Madden said.\n\nWhatever the court eventually decides, either side could ask the Supreme Court to intervene.\n\nU.S. District Judge James Robart in Seattle, who on Friday temporarily blocked Trump's order, has said a judge's job is to ensure that an action taken by the government \"comports with our country's laws.\"\n\nTrump said Tuesday that he can't believe his administration has to fight in the courts to uphold his refugee and immigration ban, a policy he says will protect the country.\n\n\"And a lot of people agree with us, believe me,\" Trump said at a roundtable discussion with members of the National Sheriff's Association. \"If those people ever protested, you'd see a real protest. But they want to see our borders secure and our country secure.\"\n\nThe same day, Homeland Security Secretary John Kelly told lawmakers that the order likely should have been delayed at least long enough to brief Congress about it.\n\nThe Justice Department filed a new defense of the ban Monday. Lawyers said it was a \"lawful exercise\" of the president's authority to protect national security and said Robart's order should be overruled.\n\nThe filing with the appeals court was the latest salvo in a high-stakes legal fight surrounding Trump's order, which temporarily suspends the country's refugee program and immigration from seven countries with terrorism concerns.\n\nWashington state, Minnesota and other states say the appellate court should allow a temporary restraining order blocking the travel ban to stand as their lawsuit moves through the legal system.\n\nThe panel hearing the arguments includes two Democrat-appointed judges and one Republican appointee.\n\nThe appeals court over the weekend refused to immediately reinstate the ban, and lawyers for Washington and Minnesota argued anew on Monday that any resumption would \"unleash chaos again,\" separating families and stranding university students.\n\nThe Justice Department responded that the president has clear authority to \"suspend the entry of any class of aliens\" to the U.S. in the name of national security. It said the travel ban was intended \"to permit an orderly review and revision of screening procedures to ensure that adequate standards are in place to protect against terrorist attacks.\"\n\nThe challengers of the ban were asking \"courts to take the extraordinary step of second-guessing a formal national security judgment made by the president himself,\" the Justice Department wrote.\n\nIt's possible that the panel could make a ruling on a technical point, rather than the larger merits of the case. Under 9th Circuit case law, temporary restraining orders cannot be appealed, a point noted by the states.\n\nAn analysis on that point would include examining whether the lower court's order is properly classified as a temporary restraining order rather than as another type of order, a preliminary injunction, noted Arthur Hellman, a federal courts scholar at University of Pittsburgh Law School.\n\nIf the case does end up before the Supreme Court, it could prove difficult to find the necessary five votes to undo a lower court order. The Supreme Court has been at less than full strength since Justice Antonin Scalia's death a year ago. The last immigration case that reached the justices ended in a 4-4 tie.\n\nHow and when a case might get to the Supreme Court is unclear. The travel ban itself is to expire in 90 days, meaning it could run its course before a higher court takes up the issue. Or the administration could change it in any number of ways that would keep the issue alive.\n\nAfter Robart's ruling, the State Department quickly said people from the seven countries — Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen — with valid visas could travel to the U.S.\n\n___\n\nTucker reported from Washington. Associated Press writers Martha Bellisle and Gene Johnson in Seattle, Matthew Barakat in Chantilly, Virginia, Michael Rubinkam in Allentown, Pennsylvania, Colleen Slevin in Denver and Mark Sherman in Washington contributed to this report.", "authors": [], "publish_date": "2017-02-07", "source": "foxnews", "top_words": ["seven", "travel", "express", "judges", "trump", "national", "ban", "case", "supreme", "court", "trumps", "skepticism", "federal", "order", "president"], "summary": "A panel of federal judges expressed skepticism Tuesday over the need for President Donald Trump's travel ban, which has upended travel to the U.S. for more than a week and tested the new administration's use of executive power.\nWhatever the court eventually decides, either side could ask the Supreme Court to intervene.\nIt said the travel ban was intended \"to permit an orderly review and revision of screening procedures to ensure that adequate standards are in place to protect against terrorist attacks.\"\nThe Supreme Court has been at less than full strength since Justice Antonin Scalia's death a year ago.\nThe travel ban itself is to expire in 90 days, meaning it could run its course before a higher court takes up the issue."}