{"url": "http://www.foxnews.com/us/2017/02/02/jordanian-teen-caught-up-in-extra-scrutiny-after-travel-ban.html", "id": "254", "title": "Jordanian teen caught up in extra scrutiny after travel ban", "text": "Attorneys say a Jordanian teenager who was detained after flying to Houston might have been netted due to heightened scrutiny following President Donald Trump's executive order to curb immigration from seven Muslim-majority countries.\n\nThe Houston Chronicle reports (http://bit.ly/2jBona2 ) that Mohammad Abu Khadra remains in custody Thursday at a Chicago detention center. The 16-year-old was detained Saturday.\n\nMohammad is among dozens of U.S. visa holders who have been detained at airports since Trump signed the order prohibiting citizens from seven Muslim-majority countries from entering the United States for 90 days. Jordan is not one of the countries listed in the order.\n\nBut Ali Zakaria, an attorney representing Mohammad's family, says the teenager might have revealed he was enrolled at a Houston-area high school, in violation of his tourist visa.", "authors": [], "publish_date": "2017-02-02", "source": "foxnews", "top_words": ["teenager", "seven", "travel", "muslimmajority", "jordanian", "ban", "visa", "order", "zakaria", "teen", "countries", "violation", "scrutiny", "caught", "houston", "detained", "extra"], "summary": "Attorneys say a Jordanian teenager who was detained after flying to Houston might have been netted due to heightened scrutiny following President Donald Trump's executive order to curb immigration from seven Muslim-majority countries.\nThe Houston Chronicle reports (http://bit.ly/2jBona2 ) that Mohammad Abu Khadra remains in custody Thursday at a Chicago detention center.\nMohammad is among dozens of U.S. visa holders who have been detained at airports since Trump signed the order prohibiting citizens from seven Muslim-majority countries from entering the United States for 90 days.\nJordan is not one of the countries listed in the order.\nBut Ali Zakaria, an attorney representing Mohammad's family, says the teenager might have revealed he was enrolled at a Houston-area high school, in violation of his tourist visa."}