{"url": "http://www.foxnews.com/us/2017/02/13/latest-trump-travel-ban-case-can-proceed-in-lower-court.html", "id": "298", "title": "The Latest: Trump travel ban case can proceed in lower court", "text": "The Latest on a lawsuit filed by Washington state and Minnesota challenging President Donald Trump's travel ban (all times local):\n\n3:41 p.m.\n\nA federal judge in Seattle says a lawsuit by Washington state and Minnesota challenging President Donald Trump's travel ban will proceed as an appellate court considers a preliminary injunction in the case.\n\nU.S. District Judge James Robart, who previously issued a temporary restraining order halting the ban, ruled Monday the lawsuit can go forward.\n\nThe Justice Department had wanted to put the case on hold while the 9th U.S. Circuit Court of Appeals decides whether a larger, 11-judge panel will review a government request to allow the ban.\n\nA three-judge federal appeals court panel last week refused to toss out the injunction and reinstate the travel ban. The panel unanimously rejected the administration's claim of presidential authority in the matter.\n\nTrump's ban involves travelers from seven predominantly Muslim nations.\n\n_____\n\n1:09 p.m.\n\nLawyers for Washington state and Minnesota have told a federal judge their lawsuit against President Donald Trump's ban on travelers from seven predominantly Muslim nations should move forward in the lower court.\n\nBut the Justice Department, in its own court filing, wants the case put on hold while the 9th U.S. Circuit Court of Appeals decides whether the full court will review the government's request to allow Trump's order.\n\nLawyers for both sides will argue their positions later Monday before U.S. District Judge James Robart, who previously issued a restraining order that halted the ban until it can be more fully examined.\n\nA three-judge federal appeals court panel last week refused to toss out the injunction and reinstate the travel ban. The panel unanimously rejected the administration's claim of presidential authority in the matter.\n\nThe Trump administration has not filed an official appeal of the panel's ruling with the U.S. Supreme Court or an appellate panel.", "authors": [], "publish_date": "2017-02-13", "source": "foxnews", "top_words": ["travel", "case", "lower", "trump", "proceed", "ban", "appeals", "judge", "court", "trumps", "federal", "lawsuit", "latest", "washington", "panel"], "summary": "The Latest on a lawsuit filed by Washington state and Minnesota challenging President Donald Trump's travel ban (all times local):3:41 p.m.A federal judge in Seattle says a lawsuit by Washington state and Minnesota challenging President Donald Trump's travel ban will proceed as an appellate court considers a preliminary injunction in the case.\nCircuit Court of Appeals decides whether a larger, 11-judge panel will review a government request to allow the ban.\nA three-judge federal appeals court panel last week refused to toss out the injunction and reinstate the travel ban.\nTrump's ban involves travelers from seven predominantly Muslim nations.\nA three-judge federal appeals court panel last week refused to toss out the injunction and reinstate the travel ban."}