{"url": "http://www.foxnews.com/opinion/2017/02/07/need-extreme-vetting-in-judicial-system-too.html", "id": "21", "title": "We need extreme vetting in the judicial system, too", "text": "The federal court judge who blocked President Trump’s temporary travel ban is the poster child for everything that’s wrong with America’s legal system.\n\nU.S. District Judge James Robart is the man who blocked President Trump's temporary immigration ban. The president’s decision to stop refugees from seven countries that are known breeding grounds for jihadists was prudent.\n\nClick here to get Todd’s latest book – described by liberals as the most deplorable book in America.\n\nIn my estimation, we do not have a moral or constitutional obligation to let people into the country who want to blow us up or chop off our heads.\n\nJudge Robart's restraining order puts Americans in harm's way and, as the Associated Press reports, contained erroneous information.\n\nThe judge said not a single person from any of the seven banned countries has been arrested for extremism. It turns out that was not true.\n\nThe Associated Press reports that an Iraqi refugee living in Texas pleaded guilty to attempting to provide support to the Islamic State. And in November, a Somali refugee used a car and knife to wage an attack at Ohio State University.\n\nSo President Trump was absolutely within his rights to call out Judge Robart’s actions.\n\nFolks, our federal court houses are infested with judicial activists. And the only way to root out the infestation is for President Trump to name conservative judges to the appellate courts.\n\nBut Republican presidents have had a bad habit of putting closet liberals on the bench. Democrats nominate liberals who stay liberal. But once GOP nominees get confirmed, their gavels go wobbly.\n\nJudge Robart, for example, was appointed by President George W. Bush.\n\nSo not only do we need extreme vetting at the border, we also need extreme vetting in the court house.\n\nTodd Starnes is host of Fox News & Commentary. His latest book is “The Deplorables’ Guide to Making America Great Again.” Follow him on Twitter @ToddStarnes and find him on Facebook.", "authors": ["Todd Starnes"], "publish_date": "2017-02-07", "source": "foxnews", "top_words": ["book", "extreme", "trump", "judicial", "liberals", "vetting", "judge", "court", "trumps", "need", "temporary", "system", "president", "way"], "summary": "The federal court judge who blocked President Trump’s temporary travel ban is the poster child for everything that’s wrong with America’s legal system.\nU.S. District Judge James Robart is the man who blocked President Trump's temporary immigration ban.\nSo President Trump was absolutely within his rights to call out Judge Robart’s actions.\nAnd the only way to root out the infestation is for President Trump to name conservative judges to the appellate courts.\nSo not only do we need extreme vetting at the border, we also need extreme vetting in the court house."}