{"url": "http://www.foxnews.com/opinion/2017/02/07/sean-hannity-alt-left-judges-lawmakers-play-games-with-president-trumps-travel-ban.html", "id": "22", "title": "Sean Hannity: Alt-left judges, lawmakers play games with President Trump's travel ban", "text": "A fierce legal battle is brewing over President Donald Trump's extreme vetting executive order as the radical alt-left continues its willingness to gamble with the lives of Americans.\n\nThe legal back and forth is complete nonsense, and here's why. It is a classic example of activist judges ruling based on their own personal opinions and not on what the law actually says.\n\n\"Whenever the president finds that the entry of any aliens or any class of aliens into the U.S. would be detrimental to the interests of the United States, he may by proclamation and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants, non-immigrants or impose on the entry of aliens any restrictions that he may deem to be appropriate,\" reads the relevant federal law.\n\nPresident Trump’s executive order imposes a 120-day moratorium on immigration from six countries that have shown little ability to control terrorism, and an indefinite pause on immigration from Syria, which is ISIS’ headquarters, has no functioning government and is mired in a grinding, five-year civil war. President Trump believes the order is necessary to ensure we don’t bring in any terrorists masquerading as refugees.\n\nTrump is acting to protect Americans, but judges seem to believe they can impose their will over his.\n\nIn an article entitled \"Rogue judges undermining our sovereignty, and here's how Congress can stop them,\" David Horowitz of Conservative Review argued that the judicial branch of our government, especially on the lower levels, has been utterly polluted by progressive judges whose decisions are based on personal or political opinions, not on the law.\n\nIn other words, plaintiffs can “shop” for a liberal judge and obtain a favorable – and overreaching – ruling that can have a national impact. Horowitz wants Congress to take power back from these activist courts in order to the American people, our sovereignty and the rule of law.\n\nThe U.S. Ninth Circuit Court of Appeals, where this legal battle is now playing out, is known by all to be the most liberal federal appeals court in the country. That three-judge panel is set to review a ruling by Seattle-based federal District Judge James Robart, who put a temporary halt to the president's extreme vetting executive order on Friday.\n\nRobart himself has shown his liberal leanings from the bench, declaring last year during a hearing on police reform that \"Black lives matter.\" A fair-minded, even-handed judge might believe, as I do, that all lives matter.\n\nIt isn’t just judges. The out-of-control hypocrisy of lawmakers is on full display, too. For example, Sen. Chuck Schumer, D-N.Y., is crying foul over the president's executive order, but what the senator is not telling you is that back in 2015, he actually said a pause on admitting refugees into the country could be necessary.\n\nAnd take a guess who said this:\n\n“We are a nation of immigrants, but we are also a nation of laws. It is wrong and ultimately self-defeating for a nation of immigrants to permit the kind of abuse of our immigration laws we have seen in recent years, and we must do more to stop it.”\n\nThat was President Clinton, in his 1995 State of the Union address.\n\nDoesn't that sound a lot like President Trump now? Yet, back when President Clinton said it, there was no outrage from the left.\n\nNor was there any outrage three years ago when President Obama said this:\n\n“Today, our immigration system is broken and everybody knows it,” Obama said. “Even as we are a nation of immigrants, we're also a nation of laws. Undocumented workers broke our immigration laws, and I believe that they must be held accountable.”\n\nThere you have it. The only reason liberals are resisting President Trump's action on extreme vetting is that they're trying to score cheap political points. It doesn't matter that President Obama and Congress were the ones that came up the list of seven countries that President Trump referred to in his executive order, Libya, Iran, Iraq, Somalia, Sudan, Syria and Yemen.\n\nAmid the legal confusion, visa holders from these seven terror-plagued countries are now rushing into the U.S. country while they can, according to the New York Post.\n\nPresident Trump's policy is very straightforward. Instead of twisting and misrepresenting it, the radical alt-left should listen very closely to the president’s words.\n\n“We need strong programs so that people that love us and want to love our country and will end up loving our country are allowed in, not people that want to destroy us and destroy our country,” Trump said.\n\nIf those on the left want to keep playing games, it should bear in mind that If one American loses his or her life as a result of letting dangerous, unvetted people into this country, they will have blood on their hands. And they will have a tough time explaining to the American people why they put politics ahead of our safety.\n\nAdapted from Sean Hannity's monologue on \"Hannity,\" Feb. 6, 2017\n\nSean Hannity currently serves as host of FOX News Channel’s (FNC) Hannity (weekdays 9-10PM/ET). He joined the network in 1996 and is based in New York. Click here for more information on Sean Hannity.", "authors": ["Sean Hannity"], "publish_date": "2017-02-07", "source": "foxnews", "top_words": ["executive", "travel", "hannity", "play", "judges", "aliens", "ban", "trump", "immigration", "sean", "nation", "trumps", "country", "games", "lawmakers", "order", "president"], "summary": "A fierce legal battle is brewing over President Donald Trump's extreme vetting executive order as the radical alt-left continues its willingness to gamble with the lives of Americans.\nPresident Trump believes the order is necessary to ensure we don’t bring in any terrorists masquerading as refugees.\nDoesn't that sound a lot like President Trump now?\nThe only reason liberals are resisting President Trump's action on extreme vetting is that they're trying to score cheap political points.\nPresident Trump's policy is very straightforward."}