{"url": "http://www.foxnews.com/us/2017/02/06/apple-google-uber-join-fight-against-trump-travel-ban.html", "id": "270", "title": "Apple, Google, Uber join fight against Trump travel ban", "text": "Dozens of tech companies, including behemoths like Apple, Google, and Facebook, are siding with Washington state and Minnesota as they fight President Donald Trump's ban on refugees and travelers from seven predominantly Muslim countries from entering the United States.\n\nThe companies filed briefs late Sunday with a federal appellate court saying the Trump executive order hurts their businesses.\n\nIn their court filing with the San Francisco-based 9th U.S. Circuit Court of Appeals, a total of 97 companies said Trump's travel ban \"hinders the ability of American companies to attract great talent; increases costs imposed on business; makes it more difficult for American firms to compete in the international marketplace.\"\n\nThe travel ban would prompt businesses to build operations outside the United States, said the companies. The long list of enterprises looking to join the fight against Trump are among the country's biggest, most high-profile businesses like Uber, eBay and Netflix.\n\nThe businesses are looking to help Washington and Minnesota as they sue Trump. The states have said the ban harmed residents and effectively mandated discrimination. The 9th U.S. Circuit Court of Appeals this weekend denied the administration's request to immediately set aside a Seattle judge's ruling that put a hold on the ban nationwide.\n\nTrump's order applied to Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen — countries the administration said raise terrorism concerns. The order sparked nationwide airport protests and caused confusion for many foreigners trying to reach the United States.\n\nTrump has said he's trying to protect Americans. The government says the president has the authority to decide who can enter the country.\n\nHowever the companies, in their court filing, said Trump's executive order would destroy the entrepreneurial spirit that fuels American businesses.\n\nImmigrants make many of the nation's greatest discoveries, and create some of the country's most innovative and iconic companies,\" the court filing said. \"The experience and energy of people who come to our country to seek a better life for themselves and their children_to pursue the 'American Dream'_are woven throughout the social, political, and economic fabric of the nation.\"", "authors": [], "publish_date": "2017-02-06", "source": "foxnews", "top_words": ["travel", "companies", "trump", "fight", "ban", "join", "filing", "google", "businesses", "court", "order", "united", "uber", "trumps", "apple", "american"], "summary": "The companies filed briefs late Sunday with a federal appellate court saying the Trump executive order hurts their businesses.\nIn their court filing with the San Francisco-based 9th U.S.\nTrump's order applied to Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen — countries the administration said raise terrorism concerns.\nHowever the companies, in their court filing, said Trump's executive order would destroy the entrepreneurial spirit that fuels American businesses.\nImmigrants make many of the nation's greatest discoveries, and create some of the country's most innovative and iconic companies,\" the court filing said."}