{"url": "http://www.foxnews.com/tech/2017/02/07/tesla-and-spacex-join-legal-fight-against-trump-travel-ban.html", "id": "202", "title": "Tesla and SpaceX join legal fight against Trump's travel ban", "text": "It's been a hectic start for President Donald Trump's presidency, and things aren't getting any better. Trump's executive order that instated a so-called Muslim ban is probably the most controversial move in his first two weeks in office, albeit not the only one. No less than 97 companies filed a joint amicus brief late on Sunday to express their opposition to Trump's travel ban. Among them, there are many notable tech companies including Airbnb, Apple, Facebook, Google, Intel, Microsoft, Netflix, Snap, Spotify, Twitter, Uber and many others.\n\nNotably absent from the list were Elon Musk's companies, Tesla and SpaceX. That might not have seemed like a big deal, were it not for the fact that Musk is on Trump's economic advisory board and he recently agreed to serve on Trump's Manufacturing Jobs Initiative.\n\nBut both Tesla and SpaceX on Monday insisted on being added to the brief that's opposing Trump's executive order. \"As soon as we saw the brief this morning, we insisted on being added,\" a Tesla spokesperson said, according to The Verge.\n\nMusk did criticize the Muslim ban on Twitter joining the many CEOs in the tech sector that voiced their concern with the hastily prepared immigration policy as soon as it became official.\n\nRegarding the meeting at the White House: pic.twitter.com/8b1XH4oW6h -- Elon Musk (@elonmusk) February 3, 2017\n\nAfter Uber CEO Travis Kalanick had stepped down from Trump's Strategic and Policy Forum last week, Musk issued a statement (above) defending his decision to continue to attend Trump's meetings. He believed that \"engaging on critical issues will on balance serve the greater good.\" He also said that he will \"express objections to the recent executive order on immigration.\"\n\nA US District judge has lifted the immigration late on Friday night, but Trump's administration will fight it -- in fact, Trump already directed a Twitterstorm at the judge for defying his order.", "authors": [], "publish_date": "2017-02-07", "source": "foxnews", "top_words": ["executive", "travel", "companies", "fight", "ban", "join", "brief", "tesla", "twitter", "uber", "trumps", "spacex", "order", "musk", "legal"], "summary": "Trump's executive order that instated a so-called Muslim ban is probably the most controversial move in his first two weeks in office, albeit not the only one.\nNo less than 97 companies filed a joint amicus brief late on Sunday to express their opposition to Trump's travel ban.\nNotably absent from the list were Elon Musk's companies, Tesla and SpaceX.\nBut both Tesla and SpaceX on Monday insisted on being added to the brief that's opposing Trump's executive order.\nHe also said that he will \"express objections to the recent executive order on immigration.\""}