{"url": "http://www.foxnews.com/us/2017/02/02/yemenis-close-nyc-shops-in-protest-trump-travel-ban.html", "id": "256", "title": "Yemenis close NYC shops in protest of Trump travel ban", "text": "Hundreds of ethnic Yemeni business owners who operate New York City corner bodegas and neighborhood delis closed shop Thursday in protest of President Donald Trump's travel ban on people from seven Muslim-majority countries.\n\nThe shops were locked at noon and were to remain shuttered until 8 p.m., according to organizers of a late afternoon rally in downtown Brooklyn. At least 1,000 Yemeni-run small businesses are a part of many New Yorkers' daily lives, said Brooklyn Borough President Eric Adams, who planned to attend the rally.\n\nHaron Zokari closed his Manhattan deli at noon, as well. He said his wife and baby are stuck in Yemen after almost completing a four-year, green-card process.\n\n\"We are trying to stay strong,\" he said. \"There's people there who are refugees and who are starving and running for their lives, so thank God we don't have it as bad as they do.\"\n\nJUDGE ORDERS HALT TO TRUMP'S BAN FOR IMMIGRANT HOLDERS\n\nTrump's executive order barred people from Yemen, Iraq, Iran, Libya, Somalia, Sudan, and Syria from entering the U.S. for 90 days. Under the order, travelers have been detained, sent back from the United States or stranded in other countries.\n\nExpand / Contract Zamood Zokari, left, and Ali Elazab, right, post a sign on a window of their family's deli in Manhattan. (AP)\n\nZaid Nagi, who owns three delis in the Bronx, said the ban disrupted plans to bring his mother to the United States, where he has lived for more than 20 years. The 36-year-old married father of four said the point of the protest was to say, \"We are part of this community. We are not who this order is trying to say we are.\"\n\nHe said most of his customers had expressed solidarity with the shutdown.\n\n\"They know who we are. They know we are human beings just like them,\" he said. \"I believe in the good people of America.\"", "authors": [], "publish_date": "2017-02-02", "source": "foxnews", "top_words": ["travel", "yemenis", "trump", "yemen", "ban", "zokari", "nyc", "united", "close", "protest", "trumps", "shops", "states", "order", "trying", "say"], "summary": "Hundreds of ethnic Yemeni business owners who operate New York City corner bodegas and neighborhood delis closed shop Thursday in protest of President Donald Trump's travel ban on people from seven Muslim-majority countries.\nJUDGE ORDERS HALT TO TRUMP'S BAN FOR IMMIGRANT HOLDERSTrump's executive order barred people from Yemen, Iraq, Iran, Libya, Somalia, Sudan, and Syria from entering the U.S. for 90 days.\nUnder the order, travelers have been detained, sent back from the United States or stranded in other countries.\n(AP)Zaid Nagi, who owns three delis in the Bronx, said the ban disrupted plans to bring his mother to the United States, where he has lived for more than 20 years.\nThe 36-year-old married father of four said the point of the protest was to say, \"We are part of this community."}