{"url": "http://www.foxnews.com/travel/2017/02/17/wellesley-museum-shrouds-removes-immigrant-artworks-in-protest-trump-travel-ban.html", "id": "228", "title": "College museum shrouds, removes immigrant artworks in protest of Trump travel ban", "text": "Two high-profile museums are weighing in on the debate surrounding President Trump’s temporary travel ban, barring immigrants from seven Muslim-majority nations.\n\nIn reaction to the executive order, Davis Museum at Wellesley College in Boston announced Wednesday they would be removing paintings and shroud objects in black fabric that were either created by immigrant artists or donated to the museum by immigrants to highlight foreign-made contributions.\n\nThe Davis Museum describes the de-installation as “Art-Less\" -- a “protest” that began on Feb. 16 and will end on Tuesday, Feb. 21.\n\nDISNEY RAISES TICKET PRICES AGAIN\n\nIn all, the museum says it will remove 120 works of art, including paintings, bronze and wood sculptures, ceremonial masks from Europe, the Americas, and Africa, plus contemporary and modern pieces-– about 20 percent of the art on display in the museum’s permanent galleries.\n\n“We’re hoping to articulate the contributions of immigrants here at Davis in response to the anxiety this executive order has raised and continues to raise,” Davis Museum director Lisa Fischman told the Boston Globe. “We thought a lot about works that we have, and how they came to be here.”\n\nThe impact of “Art-Less” on the African galleries will be the most noticeable as nearly 80 percent of the galleries’ objects were donated by the Klejman family, who immigrated to the U.S. from Poland after World War II.\n\nClaire Whitner, the museum’s assistant director of curatorial affairs who is overseeing the project, told the Globe the initiative will affect “every permanent collections gallery.”\n\nThe impacted works will be identified with labels stating either that the work was “made by an immigrant” or “given by an immigrant.” The museum is inviting other institutions to join the project, offering labels for public download on its website.\n\nOne painting scheduled to be removed over Presidents' Day weekend is a portrait of George Washington, painted by Swedish-born artist Adolf Ulrik Wertmüller. The painting was donated to the museum by the Munn family, also immigrants from Sweden.\n\nIn New York City, however, the Museum of Modern Art (MoMA) is using a different tactic to highlight immigrants' artistic contributions.\n\nMoMA has redesigned its fifth-floor permanent-collection galleries to feature contemporary art from Iran, Iraq, and Sudan, three of the seven countries whose citizens have been subject to the ban.\n\nFOR THE LATEST TRAVEL FEATURES FOLLOW FOX LIFESTYLE ON FACEBOOK\n\nAccording to Architectural Digest, works by Iraqi-born Zaha Hadid and Iranian artist Charles Hossein Zenderoudi have replaced pieces from renknowned artists like Picasso and Matisse. The works will be on display at the Manhattan museum for several months.\n\nAccompanying the newly installed pieces is a statement from the museum that reads:\n\n“This work is by an artist from a nation whose citizens are being denied entry into the United States, according to a presidential executive order issued on January 27, 2017. This is one of several such artworks from the Museum’s collection installed throughout the fifth-floor galleries to affirm the ideals of welcome and freedom as vital to this Museum, as they are to the United States.\"", "authors": [], "publish_date": "2017-02-17", "source": "foxnews", "top_words": ["artworks", "travel", "immigrant", "college", "shrouds", "trump", "ban", "works", "immigrants", "galleries", "davis", "pieces", "order", "removes", "protest", "museum", "art", "museums"], "summary": "Two high-profile museums are weighing in on the debate surrounding President Trump’s temporary travel ban, barring immigrants from seven Muslim-majority nations.\nIn reaction to the executive order, Davis Museum at Wellesley College in Boston announced Wednesday they would be removing paintings and shroud objects in black fabric that were either created by immigrant artists or donated to the museum by immigrants to highlight foreign-made contributions.\nThe Davis Museum describes the de-installation as “Art-Less\" -- a “protest” that began on Feb. 16 and will end on Tuesday, Feb. 21.\nThe painting was donated to the museum by the Munn family, also immigrants from Sweden.\nIn New York City, however, the Museum of Modern Art (MoMA) is using a different tactic to highlight immigrants' artistic contributions."}