{"url": "http://www.foxnews.com/us/2017/02/08/court-mulls-travel-ban-to-compound-whiplash-or-calm-it.html", "id": "280", "title": "Court mulls travel ban: To compound whiplash, or calm it?", "text": "President Donald Trump's surprise executive order on immigration and a Seattle judge's stunning decision to temporarily block it a week later have induced a national whiplash, riveting attention first on protests that filled airports around the country and then on Trump's Twitter rants questioning the judge's legitimacy.\n\nWhether the travel ban gets immediately reinstated is now up to the 9th U.S. Circuit Court of Appeals, where three judges heard arguments Tuesday .\n\nIf they keep U.S. District Judge James Robart's order in place, the case could return to Robart, who would have more time to make a ruling on the merits of the case, based on fuller arguments and evidence.\n\nIf they let the President go forward with his executive order, it could compound the whiplash: The travel ban would take effect once again pending a legal challenge by Washington state and Minnesota, even though the courts might wind up striking it down later.\n\nA decision has been promised within days.\n\n___\n\nWHAT WAS THE UPSHOT OF TUESDAY'S HEARING?\n\nTrying to divine how a court might rule from the questioning can be a fool's errand, but some legal scholars who were willing to try anyway said Washington state appeared to make enough of a case to keep Trump's travel ban on ice, at least for now.\n\nTuesday's arguments between Justice Department attorney August Flentje and Washington state Solicitor General Noah Purcell were conducted by phone, due to the emergent nature of the hastily arranged hearing. The record audience that tuned in for the live-stream on the court's website heard each lawyer getting grilled.\n\nThe judges repeatedly asked Flentje whether the government had any evidence that the travel ban was necessary, or that keeping it on hold would harm national security. They expressed skepticism over his argument that the states don't have standing to sue, and over his assertion that the courts have little to no role in reviewing the president's determinations concerning national security.\n\nPurcell faced tough questioning from Judge Richard Clifton, who said he wasn't necessarily buying the states' argument that the ban was motivated by religious discrimination, given that the vast majority of Muslims live in countries that aren't targeted by the ban.\n\n\"I certainly thought the government's case came across as weaker,\" Stephen Vladeck, a professor at the University of Texas School of Law, wrote in an email, citing \"the government's seeming inability to provide concrete evidence of why immigration from those countries threatens national security.\"\n\n___\n\nDISCRIMINATION OR NOT?\n\nAfter being repeatedly asked, Flentje acknowledged that individuals could have standing to sue if the president tried to enforce an all-out ban on Muslims entering the U.S. But, he said, that's not all what's happening here. Basing the order on travel from certain countries that have been linked to terrorism — whatever their religion — is a perfectly legitimate exercise of the president's authority over national security, he argued.\n\nPurcell argued that it's remarkable to have this much evidence of discriminatory intent this early in the case — including Trump's campaign statements about a Muslim ban and adviser Rudy Giuliani's interview comments that he was asked to help devise a legal version of the Muslim ban.\n\n\"There are statements that we've quoted in our complaint that are rather shocking evidence of intent to discriminate against Muslims, given that we haven't even had any discovery yet to find out what else might have been said in private,\" Purcell said.\n\nEven if Trump's executive order itself doesn't single out Muslims, the order is unconstitutionally discriminatory if it was adopted with such intent, Purcell said.\n\nJudge Michelle Friedland asked Flentje persistent questions about such evidence.\n\n\"It is extraordinary for the court to enjoin the president's national security determination based on some newspaper articles, and that's what has happened here,\" Flentje responded.\n\nThat drew an incredulous response from Clifton: \"Do you deny those statements were made?\" Flentje conceded they were, and Clifton said in that case it was appropriate to consider them.\n\n___\n\nWHAT ARE THE COURT'S OPTIONS?\n\nIn addition to simply leaving Robart's temporary restraining order in place or striking it down, the DOJ said the appeals court could narrow its scope, which it called over-broad.\n\nFlentje suggested it could be limited to allow the president to ban travelers who don't already have relationships with the United States, while allowing legal permanent residents, for example, to return to the U.S. from the seven countries. In questioning Purcell, Clifton followed up on that.\n\n\"Why shouldn't we limit the order, the temporary restraining order's reach to those people who you've got a strong case for, like the LPRs?\" he asked.\n\nPurcell said that wouldn't work. The government hasn't shown that it could engineer a way to apply the ban so selectively, and even if it could, the rights of U.S. citizens who want to have family members come visit them from the listed countries would still be harmed, he said.\n\nJudge William Canby noted that Washington's state universities might want to invite some foreign scholars to visit — and that those scholars might have no current connection to the U.S. In that case, the rights of the schools might be compromised.\n\nFurther, the travel ban would still violate the separation of church and state, because it's grounded in religious discrimination, and that's something that affects all residents of the states, Purcell said.\n\nHowever the judges rule, the case is likely to wind up at the Supreme Court. Its route there is the main question.\n\n___\n\nAssociated Press writer Brian Melley contributed from Los Angeles.", "authors": [], "publish_date": "2017-02-08", "source": "foxnews", "top_words": ["travel", "mulls", "case", "national", "judges", "ban", "state", "court", "order", "purcell", "trumps", "flentje", "calm", "whiplash", "compound"], "summary": "Whether the travel ban gets immediately reinstated is now up to the 9th U.S.\nIf they let the President go forward with his executive order, it could compound the whiplash: The travel ban would take effect once again pending a legal challenge by Washington state and Minnesota, even though the courts might wind up striking it down later.\nThe judges repeatedly asked Flentje whether the government had any evidence that the travel ban was necessary, or that keeping it on hold would harm national security.\nFurther, the travel ban would still violate the separation of church and state, because it's grounded in religious discrimination, and that's something that affects all residents of the states, Purcell said.\nHowever the judges rule, the case is likely to wind up at the Supreme Court."}