{"url": "http://www.foxnews.com/us/2017/01/31/correction-trump-travel-ban-supporters-story.html", "id": "244", "title": "Correction: Trump-Travel Ban-Supporters story", "text": "In a story Jan. 30 about the reaction of Trump supporters to his travel order, The Associated Press misspelled the name of a Maryland woman. The woman's name is Judith Wilkenloh, not Wilkenroh.\n\nA corrected version of the story is below:\n\nTrump supporters say they are happy with immigration order\n\nSupporters of President Donald Trump say they are happy with his executive order temporarily banning refugees and immigrants from some Muslim countries\n\nBy JAY REEVES\n\nAssociated Press\n\nBIRMINGHAM, Ala. (AP) — Don't talk about airport protests in Trump Country. In the places that propelled Donald Trump to the White House, the president's fans couldn't be much happier with his executive order temporarily banning refugees and immigrants from seven mostly Muslim countries.\n\nTrump promised to put America first during the campaign, his supporters say, and he's doing it. That includes securing the nation's borders and doing everything possible to prevent terrorists from entering the U.S.\n\nIn their view, Democrats and liberal snowflakes and soft-hearted do-gooders just need to calm down. Trump is being Trump.\n\n\"He's going to do what he says and says what he does,\" said Barbara Van Syckel, 66, of Sterling Heights, Michigan. \"That's a little frightening for some people.\"\n\nTwo of Barbara Wood's three sons served in the military after Sept. 11, and she's all for Trump and his immigration order.\n\nThe president \"is fulfilling his campaign promises to the best of his ability. I applaud him for that,\" said Wood, who lives in suburban Birmingham.\n\nThousands of people have demonstrated at U.S. airports since Trump issued an order Friday blocking people from seven countries in the Middle East and Africa from entering the United States and suspending refugee immigration for four months. The protests included a gathering of several hundred people in Birmingham, the largest airport in a Southern state that Trump carried with ease.\n\nWashington's state attorney general filed a lawsuit over the order, and a federal judge in New York issued an emergency order temporarily banning deportations of people from the seven nations. Some Republican lawmakers have questioned the order, with Sens. John McCain of Arizona and Lindsey Graham of South Carolina saying they fear it will become \"a self-inflicted wound in the fight against terrorism.\"\n\nYet none of that criticism matters much in Trump Country, those states and counties where Trump claimed the votes to win the Electoral College despite losing the popular vote to Democrat Hillary Clinton.\n\nRetired social-service worker Judith Wilkenloh says the order shows Trump \"means what he says.\"\n\n\"He's just unafraid. He's just going ahead like a locomotive, and I like him more and more every time he does something,\" said Wilkenloh, 72, of Fredrick, Maryland.\n\nTrump supporters said they are happy with the immigration order and the ideas behind it. Some Trump backers said they might do things a little differently than the president, but their overall reaction is positive.\n\n\"We're not the world's Social Security office. We're not here to take care of people,\" said Jim Buterbaugh, the head of custodial work and maintenance at a public school in the western Montana town of White Hall. \"I understand that people need help, but there are other ways besides bringing them here.\"\n\nButerbaugh, who has actively fought the re-settlement of Syrians in Montana, was frustrated that Trump's moratorium did not include countries such as Saudi Arabia, where most of the Sept. 11 hijackers were from. The executive order also did not include the creation of safe zones for refugees, which he favors.\n\nMike Honaker has some misgivings, too. A Trump supporter in a struggling West Virginia coal town, he didn't think \"blitzing everybody\" with an order that spread chaos around the world was the right way to go.\n\nBut Honaker worries about terrorism and does not have a problem with Trump's plan to screen refugees more thoroughly. Overall, Honaker likes 85 percent of what the president has done so far.\n\n\"I think he's shaking it up, the whole of Washington, D.C., and half the country, like he said he would,\" he said.\n\nAttorney Terri King, 56, said Trump's order has widespread support in her Rust Belt city of Middletown, Ohio.\n\nThe only people who don't support it are \"those who are paid to protest on the left ... and some Democrats,\" said King, an also-ran in a GOP congressional race last year.\n\nRepublican Scott Presler of Virginia Beach, Virginia, likes Trump's order so much he thought about staging an airport protest of his own in support of the president.\n\nPresler, who is gay, said he wanted to go to Virginia's Dulles International Airport to support the president's immigration ban while carrying a sign that said \"Radical Islam Murders Gays.\" But he said he stopped short of making the trip out of fear for his safety.\n\n\"I'm a compassionate human being,\" said Presler, 28. \"I'm a humanitarian. But I'm also compassionate toward the health and well-being of the American people. We have 50,000 homeless veterans in this country. We have our own poor and suffering.\"\n\n___\n\nAssociated Press writers Dave Dishneau in Hagerstown, Maryland; Claire Galofaro in Louisville, Kentucky; Ben Finley in Norfolk, Virginia; Dan Sewell in Cincinnati; Mike Householder in Sterling Heights, Michigan; Jacob Jordan in Atlanta; and Alanna Durkin Richer in Richmond, Virginia, contributed to this report.", "authors": [], "publish_date": "2017-01-31", "source": "foxnews", "top_words": ["trump", "immigration", "trumptravel", "support", "correction", "supporters", "refugees", "trumps", "country", "order", "president", "virginia", "bansupporters"], "summary": "In a story Jan. 30 about the reaction of Trump supporters to his travel order, The Associated Press misspelled the name of a Maryland woman.\nTwo of Barbara Wood's three sons served in the military after Sept. 11, and she's all for Trump and his immigration order.\nYet none of that criticism matters much in Trump Country, those states and counties where Trump claimed the votes to win the Electoral College despite losing the popular vote to Democrat Hillary Clinton.\nTrump supporters said they are happy with the immigration order and the ideas behind it.\nAttorney Terri King, 56, said Trump's order has widespread support in her Rust Belt city of Middletown, Ohio."}