{"url": "http://www.foxnews.com/transcript/2017/02/07/aclu-attorney-analyzes-travel-ban-case-sen-cotton-legislation-focuses-on.html", "id": "206", "title": "ACLU attorney analyzes the travel ban case; Sen. Cotton: Legislation focuses on American workers first", "text": "Watch the latest video at video.foxnews.com\n\nThis is a rush transcript from \"First 100 Days,\" February 7, 2017. This copy may not be in its final form and may be updated.\n\nMARTHA MACCALLUM, FOX NEWS HOST: Breaking tonight, as we speak, the first head-to-head court battle for the Trump White House is underway right now and it is explosive.\n\nThe president's lawyers swinging hard. They are getting lots of pushback from the San Francisco Ninth Circuit court after the White House was extremely confident about how this was going to go earlier in the day. I'm Martha MacCallum and this is quite a day 19 that we are witnessing.\n\nThree judges right now deciding what happens next with the president's controversial January 27th order that temporarily banned people from seven countries from entering the United States.\n\nNow, last week, a Washington State judge put that order on hold and it was effective across the country. It was dramatic move. And it allowed thousands of travelers from these countries to come back into this country.\n\nThe visas were honored and they were allowed back in. So how, the white house wants to put the brakes on that process and reinstate the temporary ban. The final part of the court's arguments are still underway. Fascinating.\n\nLet's listen.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: Let's not suggest that we look behind the national security determination made by the president, where that determination, the four corners of that determination, are explicitly based on the congressional determination that the countries at issue are of concern and does not go beyond that.\n\nCIRCUIT JUDGE MICHELLE FRIEDLAND: I thought you were using Dinan Mandel (ph) as your main authority for the unreviewability. And so, now you are saying those at is distinguishable? I'm a little confused whether you are relying on those cases or not.\n\nAUGUST E. FLENTJE, SPECIAL COUNSEL TO THE ASSISTANT U.S. ATTORNEY GENERAL: We are definitely relying on them for the limits that courts review these things -- these types of issues. I'm adding that when you have the document itself, and that is the best evidence of the intent of the president, it relies exclusively on the calls made by Congress and the administration in 2016 about the safety concerns presented by the specific countries at issue. That is the end of the inquiry and should be.\n\nIn fact, I -- you know, the counsel for the other side started -- cited this court's recent Pardanas (ph) decision and there in describing the state of the law, the court very clearly said that Congress could have enacted a blanket prohibition on -- I think it was describing Mandel on communist aliens.\n\nAnd that is -- in here, we have the president making a categorical determination based on the identification of countries of concern. And there is nothing strange --\n\nFRIEDLAND: That is not the answer to the question that was asked earlier about what is the order said, no Muslims. You've been analogizing two cases that were about people who were communists, who advocated overthrow of the U.S. government. And are you saying that the external evidence here, that is alleged, that the intent here was to ban Muslims is equivalent to that?\n\nFLENTJE: If there were an executive order that prevented the entry of Muslims, that there would be people withstanding to challenge that. And I think that would raise establishment cause, First Amendment issues. But that's not the order we have here. This order is limited to the countries defined by Congress.\n\nAnd let me -- on the refugee --\n\nFRIEDLAND: How sure you are that that was the motivation and plaintiffs have submitted evidence that they suggest shows that that was the motivation. So, why shouldn't the case proceed, perhaps to discovery to see if that really was the motivation or not?\n\nFLENTJE: We are not saying the case shouldn't proceed, but it is extraordinary for a court to enjoin the president's national security determination based on some newspaper articles. And that's what has happened here. That is not a -- that is a very troubling, second-guessing of the national security decision made by the president. And the notion that we are going to go back --\n\n(CROSSTALK)\n\nSENIOR CIRCUIT JUDGE RICHARD R. CLIFTON: Stop, stop. This is Judge Clifton. You deny that in fact the statements attributed to then candidate Trump and to his political advisors, most recently, Mr. Giuliani, you deny those statements were made?\n\nFLENTJE: Judge Clifton, I know -- I would note that Judge Robart himself said that he wasn't going to look at campaign statements. I do -- and I think that what we --\n\nCLIFTON: That's a different point. I mean, I understand the argument they shouldn't be given much weight. But when you say, we shouldn't be looking at newspaper article, that's -- we are all on the fast track here. Both sides have told us this is moving too fast.\n\nEither, those kinds of statements were made or they were not. Now if they were made, but they were made not to be a serious policy principle, I can understand that. But if they were made, it is potential evidence; it is a basis for an argument. So I just want to make sure I know what's on the table.\n\nFLENTJE: Well, those are in the record, but I think my point is a little narrower that in the expedited procedure of a TRO, taking this extraordinary action of halting this order, that the president determined was in the national security interest of the United States is an unwise course and it should be stated.\n\nFRIEDLAND: If we thought there was a problem that this was too preliminary, if we let this go forward to preliminary injunction hearing, do you have evidence that you would present?\n\nFLENTJE: I think we definitely would like the opportunity to present evidence back in the district court. And we also think that the scope of this lawsuit really needs to be --\n\nFRIEDLAND: Can you tell us anything about the type of evidence you would present so that we can consider whether further proceedings are needed?\n\nFLENTJE: Not yet. But I do -- another point is the scope of the suit and the injunction would really need to be narrowed as the parties focused in on the actual harms.\n\nThe harms that Washington has cited focus on residents of Washington. But the order goes way beyond that, to the areas of the most concern of the president, people who have never been to this country yet and have no connection to Washington, no connection to the United States, and no claim of constitutional rights. Either on their own or through Washington.\n\nCLIFTON: If I could ask my colleagues to indulge me for a moment that does raise a serious concern on my part. And the scope of the order, most obviously having to do with the lawful permanent residents, which the government's position now is they're not included within the scope of the order.\n\nI have to say, is there any legal authority for the counsel to the president to have power to instruct the other departments or to instruct us to as to what the order means?\n\nI mean, the president can amend the order, but I'm not sure that the counsel to the president has that authority. So why is it that we should be looking at this reconceived order and why is it we should rather than try narrowly carve out the injunction you're asking for -- those are practical problems, I don't know how I'd write such an order?\n\nWhy shouldn't we look to the executive branch to more clearly define what the order means, rather than have to look through the lens of these subsequent interpretations?\n\nFLENTJE: Let me make two points here. One, the guidance from the White House counsel is the definitive interpretation of the order. And the White House counsel speaks for the president in this context.\n\nSecond, in our reply brief, at the very end on page 11, we had our kind of suggestion for the kind of order that would actually address the harms identified by Washington.\n\nAnd I'm going to read that. \"At most, the injunction should be limited to the class of individuals on whom the states claim rest. Previously admitted aliens who are temporarily abroad now or who wish to travel and return to the United States in the future.\"\n\nThat is the core of the harm they have identified. When we are talking about an injunction entered on such a preliminary basis, it should be limited to the claims that the state is making and not issued more broadly. If there are no further questions, I encourage the court to stay the injunction or to limit it to the presentation of the state of Washington.\n\nThank you.\n\nFRIEDLAND: Thank you, counsel, for your very helpful arguments. This matter is submitted. We appreciate the importance in the time sensitive nature of this matter and we will endeavor to issue our decision as soon as possible.\n\nThank you again for appearing on such short notice. We are adjourned.\n\nUNIDENTIFIED FEMALE: This court for this session stands adjourned.\n\n(END VIDEO CLIP)\n\nMACCALLUM: A lot there and a lot to chew over. In moments, we will be joined by Fox News senior judicial analyst Judge Andrew Napolitano, who I can assure you has plenty of thoughts on what we have just heard.\n\nBut, first, we have two experienced attorneys who were listening to these arguments live throughout the course of this whole thing as they unfolded. They were furiously taking notes and getting their thoughts down.\n\nMichael Wildes is an immigration attorney and Chris Gober is a U.S. government affairs and public policy lawyer.\n\nGentlemen, welcome. Good to have you with us today.\n\nChris Gober, let me start with you. Your thoughts on how the Trump attorney in this case handled himself.\n\nCHRIS GOBER, U.S. GOVERNMENT AFFAIRS AND PUBLIC POLICY LAWYER: I thought he actually started slow, but what we heard they are, really, in the last 5 minutes of the argument, I thought his points got stronger. I mean, the fact that you've got the state of Washington suing on behalf of their citizens and also corporations is compared to the scope of the order that applies to Syrian refugees that may be trying to escape religious persecution, that have no connection to Washington whatsoever.\n\nMACCALLUM: Yes.\n\nGOBER: And I think they finally made a good point. I think he kind of stumbled on that in the first part of his argument, but I believe he came back and kind of redeemed himself at the last part.\n\nMACCALLUM: Yes. Sticking with that point, Michael Wildes, you know, the main contention here is that Washington State has suffered irreparable harm as a result of President Trump's executive order against these seven countries and prohibiting people temporarily from coming in who are not citizens to the country.\n\nSo they are saying, our universities and our hospitals, our institutions, had some people who couldn't make it back. And therefore, we have suffered irreparable harm, which seems on the face of it a pretty difficult argument.\n\nHow do you think that went over tonight?\n\nMICHAEL WILDES, IMMIGRATION ATTORNEY: I thought they did a wonderful job under the circumstance. You know, if you follow the politics behind which president appointed which judge, what questions, what responses they were, the issue cuts down to it, Martha, and judge on a measure of standing.\n\nCan a court, then, entertain a state's interest in protecting its citizens or its green card holders, its dual nationals that are visiting sick relatives abroad, people who are working for Amazon or Microsoft in Washington State, foreign students that are there, do they have a greater right of redress?\n\nWe all know -- I'm an immigration lawyer. I can't go into the American embassy to represent a client abroad because the right to counsel in the constitution, equal protections stops our waters. There is an argument that that is proper or not.\n\nHere, the states are acting within the confines of America and the president's admirable lawyers, then, argue that we are focused more on trying to create a vetting system to make sure that we are not going to be put in harm's way. They are citing cases. My father who is an immigration professor retired has seen the practice, the Kleindienst, the Mandel cases, these are Marxists and communists, they are going back to hallmark cases.\n\nFundamentally, they were constitutional and they were statutory arguments made today. And the question is, will they hold muster and we are all curious about what happens with this. They both did a good job.\n\nMACCALLUM: Let's open this up and bring in Judge Napolitano and get your thoughts on this.\n\nOne of the argument that was made at the end is that because the Trump administration, President Trump himself and others, they mention Rudy Giuliani, because in another references, they made reference to a Muslim ban along the way, that that sort of supersedes what is actually in the executive order, in the document that they are supposed to be discussing.\n\nHow does that hold up?\n\nANDREW NAPOLITANO, FOX NEWS SENIOR JUDICIAL ANALYST: You know, judges get to ask whatever questions they want. But the questions were highly, highly out of place to ascribe to an executive order, statements that the president made when he was a candidate or statement that one of his advisors, Rudy Giuliani, made either when he was a candidate or after he had been elected.\n\nWhat was lost sight of here is that the only thing the court can examine is the four corners of that order. And because the order goes to foreign policy and because under our system, the president is primary and foreign policy, every benefit of every doubt goes to the president and his wording in the order.\n\nFor them to ask on what did he base the conclusions in the order makes the same mistake that Judge Robart did and tries to substitute the judicial mind for the presidential mind, which is an inappropriate thing for judges to do. And I wish that the president's lawyer had hammered harder on that. He did at the very end, but he should have done in the first 30 minutes as well.\n\nMACCALLUM: In terms of this notion of irreparable harm -- I mean, in most of these cases, people have been delayed, they have been detained. That is not comfortable. That is unsatisfactory. That is inconvenient.\n\nNAPOLITANO: But it is not irreparable.\n\nMACCALLUM: But they were then release and they were brought back in.\n\nNAPOLITANO: Correct.\n\nMACCALLUM: You know, people have delays for all kinds of reasons, in travel or in immigration or in getting visas over the course of history.\n\nWhy would that be considered irreparable harm to these technology companies and these institutions?\n\nNAPOLITANO: There is no case in which I am aware that can hold that kind of -- that can characterize that kind of inconvenience as irreparable harm. Irreparable harm is harm that cannot be remedied by ordinary means.\n\nMACCALLUM: It's a pretty high standard.\n\n(CROSSTALK)\n\nNAPOLITANO: A child is coming into the country with her parents. She needs a heart transplant operation. The heart that they are going to put into her body is no longer there. She can't have the surgery. That's irreparable. It cannot be addressed by ordinary means.\n\nMACCALLUM: Yes.\n\nNAPOLITANO: But because students or academics were delayed, because of a presidential decision on foreign policy and national security can hardly be characterized as irreparable.\n\nMACCALLUM: So one of the other things, and I want to bring in our panel to discuss this as well, Michael, let me go to you on this. You know, in terms of determining whether or not the list of countries that was first put forth by Congress under President Obama, these seven countries were considered to be countries that presented a threat to the United States of America, so, why would it be given such different purview under this president, when that list has existed for some time?\n\nWILDES: I happen to agree and disagree first, Martha, with the judge. Irreparable injury would be stated in the term if the establishment clause was proven to have been breached. Whether we argue one side or the other --\n\nMACCALLUM: Explain that to everybody at home in terms of the establishment.\n\nWILDES: In other words, the establishment clause is saying that by default, the Jewish and Christian refugees would be given a leg up over Muslims as an exception to the vague order. Article III says any alien from those countries, with the exception of, I believe, Article V or seven, minority or religion.\n\nSo the state is advocating that irreparable harm would be, per se, would be perceived. In fact, if there was a breach of the establishment clause.\n\nOn your question, Martha, and again, President Obama's national security team identified these seven countries as hot spots.\n\nMACCALLUM: That's right.\n\nWILDES: No American, no immigration lawyer, no father, or mother, child, wants to have any one soul admitted by accident because a vetting system is done improperly.\n\nThe real question is with Indonesia, with Saudi Arabia, 16 of the 19 hijackers hailed from Saudi Arabia. It's as if the president targeted seven countries said to heck with the 11 million people that are in our backyard, let's do this, and then we will get to everything at a later time.\n\nMACCALLUM: All right.\n\nWILDES: Selective prosecution is prohibited by the 1965 Immigration Amendment to the act, because you are not allowed to discriminate against national origin.\n\nMACCALLUM: All right. Michael, let me go to, Mr. Gober. Your take on that, too.\n\nGOBER: I think that what you have here are two conflicting statutes, where one says that you can't discriminate on the basis of nationality. Another that gives the president broad presidential authority to determine who can come into the country.\n\nI don't think when President Obama was limiting refugees from Syria that we heard the state of Washington making that argument. That's something we are hearing new today.\n\nMACCALLUM: All right. So here with a very different viewpoint on the president's executive order, Lee Gelernt has been an ACLU attorney for more than two decades and is an adjunct professor at Columbia Law School.\n\nLee, welcome.\n\nLEE GELERNT, ACLU ATTORNEY: Thank you.\n\nMACCALLUM: Your thoughts on what we heard tonight.\n\nGELERNT: It was a vigorous argument. I think both lawyers did well. You know, on tough circumstances, but I think that the judges got it right in pushing back on the U.S. government and saying, we can't meaningfully review what the president has done. We can't look behind the four corners.\n\nI disagree with the judge, his prior statements, that sort of standard law that a government agency or entity or even the president can't get away with discrimination by simply at the last minute taking out some words.\n\nAnd so the Supreme Court has made clear you always need to figure out what the intent is. But even beyond the intent, even on the face of the order, talks about minority religions and majority religions, that kind of picking and choosing between religions, whether it's, you know, your name or your denomination or not, has always been considered violation.\n\n(CROSSTALK)\n\nMACCALLUM: Let me jump in.\n\nGELERNT: Yes.\n\nMACCALLUM: The White House is arguing that the president has the authority to protect the national security of the country. So, this president used a list that was generated by the prior president, in terms of seven countries that they believe proposed threats.\n\nThere is no mention of banning Muslims in the executive order. It was put forth. I mean, you could, you know, talk about a million different elements of something, but then, you put together your document, and you present it. You say, this is our order. So why would anything else be relevant other than the order that has been presented before the court to determine whether or not the president has authority to make that order?\n\nGELERNT: Well, I think for the very reason the Supreme Court has explained is that you don't want the government, you know, doing something like that or taking out words at the final moment if you know the clear intent.\n\nAnd it's not just a couple of statements. It was repeated statements over and over. And even after he signed the order saying, well, the minority Christians, the minority religious provision is to benefit Christians.\n\nI mean, but I think one of the points that was made today, which is important is it takes time to make your case. And I think Washington will make its case and the ACLU will make its case about that this was ultimately discrimination.\n\nAll that was at issue here is something fairly narrow. Who is going to suffer more irreparable harm in the interim? And it's not -- it was not just mere inconvenience. It was people being held for a day and a half. But it's also refugees stuck overseas who are in real danger, who have been extensively vetted for months, who are ready to come, who helped our U.S. military, and now, they are stuck.\n\nMACCALLUM: They are not stuck any more. Lee Gelernt, thank you very much. Good to have you with us tonight.\n\nGELERNT: Thank you.\n\nMACCALLUM: So joining me now with the very first reaction from the White House, Sarah Huckabee Sanders. She is deputy assistant to the president and principal deputy press secretary.\n\nSarah, good to have you here tonight.\n\nSARAH HUCKABEE SANDERS, DEPUTY ASSISTANT TO PRES. DONALD TRUMP: Great to be here.\n\nMACCALLUM: Your reaction and what was it like inside the White House? No doubt, you were all watching this and listening to every word that just transpired? What do you think?\n\nSANDERS: Look, we are still watching this really closely. The bottom line here is we think at the end of the day, that we are going to prevail in this case when it's base on the merits.\n\nLook, what the president did was completely legal, constitutional, and frankly, necessary to keep Americans safe. That's the number one job of the president of the United States is to keep the people of our country safe. And he is taking action to do that, just as he promised to do, and just as the people elected him to do.\n\nHe was overwhelmingly sent here to do a job and he is frankly doing exactly what he was elected to do.\n\nMACCALLUM: So you heard the questions from the lawyers. How do you think the attorney for the White House did tonight?\n\nSANDERS: Look, I think they are doing a great job up against a tough battle. But, again, I think the biggest thing that we have on our side isn't which attorneys or which judges, but it's the constitution.\n\nThe president has every right to do what is necessary to protect Americans. He is doing that by making this executive order and that's his --\n\n(CROSSTALK)\n\nMACCALLUM: You heard, let me just get in for a second -- you heard the argument. And they went back and presented as evidence, essentially, statements by the president saying, you know, that we needed to have a Muslim ban that he was going to enact a Muslim ban. Then you have the Rudy Giuliani statement where he said that the president asked him to figure out a legal way to enact a Muslim ban.\n\nThese statements are coming back to haunt this situation. What is your reaction to that?\n\nSANDERS: I think it's real simple. Look at the executive order that was signed by the president. I don't think that you can take outside statements to be what was in this executive order.\n\nI think you can only judge it based on what was in the executive order that was signed by the president and that executive order is completely legal and constitutional. And, frankly, his job, I think he is doing exactly what he needs to do as president, and that's to protect the American people.\n\nWe are at war against ISIS. We simply cannot allow our borders to be open for anybody to come in here and cause harm and hurt the citizens of America. And he is standing up for those people and doing exactly what he said he would do.\n\nMACCALLUM: So, Sarah, let me ask you this. If the White House loses at this level, and the ban cannot be reinstated, and you know, that border is open to those seven countries for some time, there is the potential for this to go to the Supreme Court.\n\nAre you concerned about what that means for the nomination process for Judge Gorsuch?\n\nSANDERS: I'm not, because I think Neil Gorsuch stands on his own merits as very qualified. I think we've had quite a few Democrats that have even come out and said that very thing. I think he is on very good standing. Anybody that fights him over something like this, I think, is at their own risk because it would I think show the politics that are being played. It's simply too important to play politics with.\n\n(CROSSTALK)\n\nMACCALLUM: Regardless of his qualifications, which I think, you know, both sides have acknowledged, as you say, by putting him on that court, it is going to most likely, based on his history and based on the belief that he is an Antonin Scalia replacement, that he is an appropriate replacement for him in terms of his judicial thinking, this is likely to go your way.\n\nAnd so that would mean, that politically, it's on their side to delay, delay, delay, to the greatest extent that they can.\n\nSANDERS: Look, I think one of the reasons that Neil Gorsuch is universally respected, it's because he respects the constitution. He knows his job isn't to create law, but it's to interpret it. And that's exactly what he would do.\n\nThe president has followed the law. Everything -- again, I hate to sound like a broken record, but everything he has done is legal and constitutional And Neil Gorsuch understands that and that's one of the reasons that he is so well respected it's because he follows the constitution.\n\nMACCALLUM: So, politically, for the White House, some are saying, gee, this is a battle that maybe you should have picked down the road. Maybe you should have waited until you got your guy in on the Supreme Court before you went into this extreme vetting mode. Perhaps, there were other things that should have happen first. Is this bad timing on your part?\n\nSANDERS: I don't think protecting the American people is ever bad timing. I think that the president made an executive and decisive decision to do what he thought was best to protect Americans. And I don't think that can ever be bad timing.\n\nIn fact, I think it just may not have been done soon enough because everything you can do to protect the citizens of this country as president is one of your top priorities and frankly the biggest job that you have.\n\nMACCALLUM: There is a new poll that shows that this issue, at least in this one pole, is moving in a not so great direction for the White House. It says suspending immigration from some regions, even if it means turning away refugees, do you support or oppose? 50 percent say they oppose that.\n\nNow, back before the inauguration, that number was reversed. People felt that they were supportive of that action.\n\nWhat does that say about how the messaging has gone on this whole thing?\n\nSANDERS: Look, I think there has been other polling also that shows that there is a lot and widespread support for this. And again, I don't think that you can base decisions of national security on polls.\n\nFrankly, it's far too important to look at defending the people of this country, protecting the citizens, and basing that on a poll. The president is doing what is right in protecting our country, protecting our borders, and making sure that the people that come in here, want to be here for the right reasons and not to do us harm.\n\nWhen you are at war with radical Islam, you can't look at polling. You have to look at what's right and what's protecting our country.\n\nMACCALLUM: Today, General Kelly testified and he basically took the blame for the rollout of this whole program. He said, look, I should have postponed my trip. I should have talked to Congress about this first. This is my fault. Does that line up with your experience on all of this?\n\nSANDERS: Look, I have so much respect for General Kelly. And I think that there were some things from his angle that he feels like he could have done better.\n\nBut, again, I think that this has been a necessary measure and I think it was done as properly as possible in terms of letting all of the parties that needed to know, aware of the situation ahead of time.\n\nAnd, again, I think it's actually gone relatively well, considering how well it worked up until we had a judge in Washington going against the constitution and makes some radical decisions.\n\nMACCALLUM: You know, I have to say, of all of the tweets that we get here, one of the biggest questions that is always asked is \"When is the president's cabinet's going to be in place?\n\n(CROSSTALK)\n\nSANDERS: I think that's a cry. I think that's a question for Senate Democrats.\n\nMACCALLUM: It is.\n\nSANDERS: Are they going to get out of the way and quit playing politics with our country's future. I mean, I think it is absolutely ridiculous that they have blocked so many of the president's extremely qualified cabinet members for the sake of politics.\n\nThey need to get on board and support the president, support these very qualified people, or at least allow the vote to take place so that we can start moving forward and let Donald Trump do what the people overwhelmingly elected him to do.\n\nMACCALLUM: So Rex Tillerson had -- got through as secretary of state and he has his work cut out for him. He's got a lot of people to hire at the State Department. But he got the largest number of votes against him in history of the secretary of state nominations.\n\nBetsy DeVos, required Vice President Pence to go to Capitol Hill today to cast the deciding vote for her because two Republicans decided that they would not get in line with the president's nomination.\n\nI mean, how tough has this process been for you all? And how damaging is this process? And the anger that, you know, the frustration, I guess, clearly, that you have on all of this, to your relationship with Democrats and trying to get stuff done going forward?\n\nSANDERS: Look, again, I think Democrats need to stop obstructing this process. Betsy DeVos was confirmed. We are really excited about the type of reform and progress she is going to bring to the Department of Education. I think it was a big victory for kids all across America today and their parents.\n\nAs a parent myself, I'm extremely excited to know that we've got somebody that actually really cares about education in that place that's going to bring a lot of reform.\n\nI think Secretary Tillerson is an incredible pick. He has been confirmed. We are excited about the things that he is going to be able to do. And we just hope that everybody else, hopefully, we can move through this process over the next couple of weeks and really start to focus on a lot of the big reforms and the big changes that Donald Trump has been talking about, that the president is going to bring to Washington.\n\nAnd, frankly, what the American people are begging for. There is a reason he won. They believed in his message. They believed in him. And now, they need to allow his team to take their spots in the cabinet, so that we can start to focus on those policies and those reforms instead of the politics that the Democrats are playing.\n\nMACCALLUM: We've got to go. But, quickly, any reaction from the president to what we all listen to happening out on the West Coast tonight?\n\nSANDERS: I haven't had a chance to talk with him directly. So, I'll leave that to him to let us know over the coming hours and in the morning.\n\nMACCALLUM: All right. Sarah Huckabee Sanders, thank you so much for being here tonight. We appreciate it. Good to see you.\n\nSANDERS: Thank you, Martha.\n\nMACCALLUM: So there is another battle that we are tracking on the immigration front, not from the White House, but from the Senate.\n\nSenator Tom Cotton offering a new bill that prompted this headline from Politico. \"Cotton and Trump plot crackdown on legal immigration.\"\n\nThe senator wants to cut in half the number of people who come in here legally. It also eliminates the outdated diversity visa lottery and puts what he calls a, quote, \"Responsible limit on refugees.\"\n\nThe bill slashes overall immigration by 41 percent in its first year and the goal is 50 percent, which would be 500,000 people coming in per year in year ten.\n\nHere with me now, Senator Tom Cotton.\n\nSenator, good to have you with us tonight. Thank you for being here.\n\nSEN. TOM COTTON, R-ARIZONA: Good evening, Martha.\n\nMACCALLUM: So this is seen as draconian by some. Is it?\n\nCOTTON: No, Martha. In fact our president would still allow 500,000 immigrants with new green cards every single year. That is keeping with historic norms and it is very generous if you look at other countries around the world. I simply think we need to do is get a legal immigration system that works for American workers. Over the last several decades, we have seen wages stagnate for blue collared workers. At the same time we have record high numbers of unskilled and low skilled immigration. I think those two things are directly connected. But my legislation, we are going to focus on American workers first.\n\nMACCALLUM: All right so, you want to lower the number of people coming and in order to improve the opportunities for citizens of the country in low-to-mid wage jobs, right?\n\nCOTTON: That is right, Martha. Only about one in 15 immigrants coming in today are coming in because they have demonstrated skills or because they have demonstrated economic need. Most of the people coming into our country come in because they are a distant relative of a current citizen or a recent immigrant, coming in under the outdated lottery or as a refugee. Obviously they don't have the kind of high skills our economy needs. Otherwise, they would come in through a high skilled program. That means that they directly compete with high school graduates or people who don't have high school degree. Of course that means that there are going to be fewer jobs for those American citizens and lower wages.\n\nMACCALLUM: You know, we have become so divided in this country left and right on this issue, that everything that you are talking about, although, some may say it makes practical sense, most likely conservatives who would agree with you on this. Democrats and liberals would say that it is mean, essentially, that you are shutting people out. That is not just who we are as a nation. I want to take you back to the state of the union address by a former president in 1995 and get your thoughts. Watch.\n\n(BEGIN VIDEO CLIP)\n\nBILL CLINTON, FORMER UNITED STATES PRESIDENT: We are a nation of immigrants, but we are also a nation of laws. It is wrong and ultimately self-defeating for a nation of immigrants to permit the kind of abuse of our immigration laws we have seen in recent years and we must do more to stop it.\n\n(APPLAUSE)\n\n(END VIDEO CLIP)\n\nMACCALLUM: That is Dick Durbin and the glasses, sitting down, back in his seat, from a standing ovation. As he can see come across the entire room, Democrats, Republicans, on their feet, in what used to be a somewhat common sense notion about letting people enter the country, your thoughts?\n\nCOTTON: I know, Martha, it sounds like more common sense from another Arkansas politician when I heard Bill Clinton speaking there. I think both parties should be focused on what is best for American citizens. That is our job as elected officials, to look at the best interest of American citizens. As President Clinton says and those are marks 20 years ago, our immigration system right now does not serve the interests of American citizens, especially people who work with their hands.\n\nMACCALLUM: Senator. Let me ask this, so what has changed? Cynics would say it is about votes, it is about bringing in more Democrats into the country eventually, what has changed so dramatically since '95?\n\nCOTTON: In 1995, 1996, that was the last time there was a concerted effort to get a hold of our legal immigration system. I think this is an issue where elites in both parties, outside of politics as well, business, media, culture, the academy are simply out of touch with working people, and places like Arkansas. This is something that unites both party leaders in some ways, regrettably. I think it is time that we pay heed to the results of last November's election in which Donald Trump, for many different reasons, was able to be too many qualified Republican candidates and Hillary Clinton. But this single issue on which he campaigned above all others sets himself apart was immigration and re-focusing our immigration system on working Americans.\n\nMACCALLUM: I hope senators, as they see themselves on that tape, will ask themselves what they feel so differently on that issue that you have now brought up, Senator Tom Cotton, very good to see you tonight, sir. Many thanks.\n\nCOTTON: Thanks, Martha.\n\nMACCALLUM: Breaking tonight, if you are just joining us, the court hearing has just wrapped up over the president's executive order restricting travel from seven countries. Since the arguments ended about a half-hour ago, reaction has been pouring in from all over. Let's go quickly back to Michael Wildes. He is an immigration attorney, who previously represented the Trump organization, but now opposes the president immigration order. And Chris Gober is an attorney and former deputy counsel to the RNC and counsel in the office of legal policy of the Justice Department. Gentlemen, welcome back. Good to have both of you with us tonight. Chris let me start back with you. You know everybody was listening (BAD AUDIO) -- this Judges are leaning. But you really can't, necessarily, can you?\n\nCHRIS GOBER, U.S GOV'T AFFAIRS & PUBLIC POLICY LAWYER: A lot of times, you can gather where a judge is coming from based on their questions. One thing that struck me was the Judge's (inaudible) insistence of how this executive order potentially violated the establishment clause. What struck me about that, that actually goes far beyond really the scope of the plaintiff's complaint overall.\n\nMACCALLUM: Just for everybody at home, by saying that you mean, she is suggesting that it is discriminatory on the basis?\n\nGOBER: Right. She is getting into questions of whether this violates the establishment clause. If you look at the complaint, actually filed by the plaintiffs, even they don't spend that much time on the establishment clause. They were really seeking a different relief until you saw her focus on that aspect of the case. That signaled a lot to me.\n\nMACCALLUM: So, how do you, sort of separate that? How do you not to look at that, Michael, as are coming into this with sort of a predisposition to believe that this order was discriminatory?\n\nMICHAEL WILDES, IMMIGRATION ATTORNEY: This is perhaps the most disappointing of all, the president, a patriot, as the presidents before him, acted quickly and decisively to protect Americans. This really belongs in the chambers of congress, not in the judicial chambers or halls with robes. Policy and national security is something that should have a bit of quiet and a bit of pause to it and not be in the courts. I'm completely disappointed in our emasculated congress in this respect. It's a sad day when this cannot be done properly, because we see these beautiful, golden doors of America, not only being a heritage to our founding fathers, who established lawful means of coming to this country, but a great entrepreneurship, a great, rich, robust, vibrancy that we see --\n\nMACCALLUM: But this order in and out of it by itself is not stopping anyone ultimately from getting here. It is slowing the process down and reviewing the --\n\n(BAD AUDIO)\n\nWILDES: To have better vetting process. -- This was not done constitutionally or judiciously. I am not saying that it shouldn't be done. Of course, it has to be done. There are 100 different ways to do it.\n\nMACCALLUM: Chris Gober, is this is unconstitutional order by the president?\n\nGOBER: Whether you agree or disagree with this order, the fact of the matter is, here in this litigation, the state of Washington has not proved that they have been harmed by the fact that a Syrian refugee cannot get over to the United States. So whether you disagree or agree with this order, the fact of the matter is, this is not the litigation or the case to determine whether it violates the establishment clause. And frankly, the ninth circuit should issue a ruling that is far more narrow than that.\n\nWILDES: I don't believe, Martha, I disagree, Chris. I don't believe the case is standing on the potential of a Syrian national, but the rights of those permanent residence and those visa holders that are working in America.\n\nMACCALLUM: This order was placed on Friday, January 27th. By the weekend, by Sunday, green card holders and permanent residents were relieved. That was a 48 hour problem that they admitted was a mistake in the way that it rolled out. It was fixed in two days. How is that irreparable harm to anyone?\n\nWILDES: It is not just the rollout. It is not just the damage control or the interpretation. The document itself, article three of the executive order, says anyone from. It has to be either recanted, retooled. In other words, doesn't talk about doing nationals and green card holders. It really doesn't reflect well on the golden doors of America. Sweep down\n\nMACCALLUM: that is how you reconcile in 48 hours. You know you are talking about the golden doors of America, but I am talking about the facts that matter in the executive order and who is actually affected. Gentlemen, thank you. It is a fascinating argument. Thank you for keeping a close eye on it with us tonight. What does all this mean for President Trump's Supreme Court nominee Neil Gorsuch? If this travel ban does go all the way to the Supreme Court, they would most likely be split 4-4, with Judge Gorsuch being the potential tiebreaker. This makes senate Democrats even more incentives to drag their feet on this nomination. Joining me now is former Arkansas Governor Mike Huckabee -- Joining us tonight, Governor, good to have you here tonight.\n\nMIKE HUCKABEE, FOX NEWS CONTRIBUTOR: Well, thank you, Martha.\n\nMACCALLUM: What is the impact on Judge Gorsuch from all of this?\n\nHUCKABEE: Let me first of all just say, you have had the smarter Huckabee on. I will do my best to try to keep up here.\n\n(LAUGHTER)\n\nLook, I think the Supreme Court, if they get this case, I think there is a good likelihood that they will, because the ninth circuit is just notoriously left-wing and biased and I don't think they will give Donald Trump a fair shake. But let's assume it will go to the Supreme Court. I think the court has a real challenge ahead of it if it decides to block the president authority to be the president. You know the court really has no business getting into the policy issue. It's not about whether they like it. It's about whether the president has the legal authority. And throughout the Obama administration, they consistently made sure that the president had the authority to make sure such decisions. Then, they suddenly say, new president, new law, can't do that.\n\nThere are a couple of congressmen, Ted Poe, Louie Gohmerth both Texans, they once were judges. They left the bench, and they became legislators. I would say to these judges in the ninth circuit, anyone in the Supreme Court, if you want to start legislating, take off your robe, stepped down from the bench, run for congress. Then, you can legislate. But you can't do that while you are wearing a black robe. And what the president did was not put a stop sign to immigrants, he put a speed bump. He did that to protect the rest of us. I think a lot of Americans are saying, \"thank god he did it.\"\n\nMACCALLUM: In terms of the politics for Judge Gorsuch, I mean clearly, this puts up a roadblock. I mean Democrats are not going to want anything that hurries them along into this process at this point, knowing that this may lead to the Supreme Court decision.\n\nHUCKABEE: I think what it does it gives the Republicans even more of an incentive and justification for bringing Judge Gorsuch on the court with a simple majority vote. In other words, invoke the nuclear option on the Supreme Court nominee. Harry Reid virtually paves that highway with gold in advance. Just to say, we can't have an obstructionist government, we have to have a full court. And so we are going to do it. I think a lot of people are going recognize that the attempt to block the president from being the president that he was elected to be by an overwhelming majority of electoral votes, which is how we select the president, I think, he is going to be able to justify that. I think the senate can justify it.\n\nMACCALLUM: Let me ask you this. We are 19 days then. What we have witnessed in a bigger way today is that the Trump administration has already had its first run-in with the federal court system. After only 19 days of being in office. Do you think they are going about this the right way? Or are these clashes, that they are welcoming? You know, \"bring it on\"?\n\nHUCKABEE: I'm going to be the contrary in, because I think a lot of Republicans are saying that he doesn't want to get into a fight with the court. Look, I am kind of glad that somebody from the executive branch finally understands that when they passed ninth grade civics they remember that there are three equal branches. The Supreme Court is any part of the judiciary is not a supreme branch. It just isn't. It is an equal branch. And it doesn't have the right to completely overturn both the legislative, which passed these laws all the way back to the '50s, and the executive, which is duly elected by the people. You have one judge in Washington State. Think about the fact that he was appointed by a president, but for a district. He makes a national decision that affects the entire country and goes against the entire congress and the entire executive branch. Does anybody think that makes sense? I mean, based on the most rudimentary understanding of what the balance of power is and checks and balances and equal branches should be, no, not in the world. Unless you want to say, let's play politics with the court. And frankly, we have been doing that since the '40s. I am thrilled we have a president that is recognizing that he does have some power.\n\nMACCALLUM: So bring it on, is the answer to the question. Governor Mike Huckabee, thank you so much. I was good to have you here, sir.\n\nHUCKABEE: Thanks Martha.\n\nMACCALLUM: Coming up next, could be already contentious relationship between President Trump and the media, could it be reaching a new law? Charles Hurt, Mercedes Schlapp, and Matt Bennett, here to weigh in on how the president is reacting to one particularly nasty, nasty charge, when we come back.\n\n(BEGIN VIDEO CLIP)\n\nDONALD TRUMP, THE 45TH PRESIDENT OF THE UNITED STATES: It has gotten to a point where it is not even being reported. In many cases, the very, very dishonest press doesn't want to report on it.\n\n(END VIDEO CLIP)\n\n(COMMERCIAL BREAK)\n\nMACCALLUM: You have seen a judicial battle that the trump Administration is going through tonight. They are also waging a bit of a new war with the media. Largely brought in by the tax, but it was one charge in particular from MSNBC's Katie Couric yesterday that has raised quite a few eyebrows. Listen to this at home.\n\n(BEGIN VIDEO CLIP)\n\nKATIE COURIC, MSNBC HOST: As we know, there have been a couple dozen so suspicious deaths of journalists in Russia who came out against the government there. Donald Trump has made no secret about going after journalists and made his distaste for any news that doesn't agree with him here. Do you find that this is a dangerous path he is heading down?\n\n(END VIDEO CLIP)\n\nMACCALLUM: What is being suggested here? Charles Hurt, Political Columnist for the Russian Times, Mercedes Schlapp, former Spokesperson for President Georg W. Bush and Matt Bennett a former Deputy Assistant to President Clinton. Why don't you take that on first? It is a jaw dropper.\n\nMATT BENNETT, THIRD WAY: I am not sure what Katie meant by that. I will say this. What, both the president and his staff have done over the course of the last couple of months, since before the inauguration, is actually quite dangerous. They have denigrated the media over and over again. They have said that if there is news that they don't agree with, it is fake. That is a real problem. We don't want, in this country, to have the president telling people they can't trust what they see in any media. And that the only thing they can trust is coming straight out of his mouth, because as we know, the thing coming out of his mouth often isn't true. He routinely stretches the truth are out outright lies about things. We have to have the media trusted as a check on him just as we would in any other president.\n\nMACCALLUM: Let's go back to the first thing first. Then, we will go back to the second part of your arguments. Charlie, the comments suggesting that there is a slippery slope that could be gone down and that Vladimir Putin, who has, by most reporting, had henchmen take out journalists and poison other world leaders at moments or leaders of revolutionary activities and satellite countries, but somehow, because President Trump has run into the media -- you better watch out, you might be on this same road.\n\nCHARLIE HURT, WASHINGTON TIMES: It is the definition of fake news. And this is why the media has a terrible reputation. She absolutely was comparing Donald Trump and his rough but often entertaining treatment of the press, comparing that to poisoning journalists? It is absolutely insane. And that is why mostly people don't have any faith in the media. It is not Donald Trump's responsibility to prop up the media and try to rescue their reputation, which is rightfully in tatters. It is the media's responsibility to do that. The perfect example is watching what Katie Couric said right there.\n\nMACCALLUM: Mercedes, obviously there is a lot of sort of wounded egos around on both sides. You know the press feeling that they are not getting a fair shake, the president is pushing back on them too hard. He feels he is not fairly covered. I think you can justify the claim that anything that is even slightly questioning how the administration is doing is perceived as sort of a threat. It works on both sides.\n\nMERCEDES SCHLAPP, WASHINGTON TIMES: I think, you know, first of all, Matt, I'm happy to send you the list of fake news items that have come out from so many of the mainstream media news outlets. I think what you are looking at here is the fact that the media itself has not yet recovered from this election, win from Donald Trump. They really don't know how to handle this new political order. So, they spend their time continuing to make this comparison, for example, to Donald Trump and Putin or Donald Trump and Hitler. And it is just an unfair comparison. I think that the media should be there, instead of trying to be telling people what they should think or what they should believe, just basically be able to be that check and balances on the government and on Donald Trump. But I think what we have found with the media is that they have gone too far. And for Katie Couric to go that far, it is just out of balance. There is no -- if you cannot make that comparison.\n\nMACCALLUM: If someone had suggested that President Obama, you know might eventually want to take out a reporter in a serious question to a member of congress, Matt, can you imagine what the ramifications of that would've been like?\n\nBENNETT: Look, I'm not defending what Katie said. I think it Mercedes quite, that is just isn't right. The president himself was defending Putin, as he has on multiple occasions, for reasons no one can quite explain.\n\nSCHLAPP: I can tell you. I can explain it to you!\n\nBENNETT: I let you talk. He compared Putin to the United States, when it was pointed out by somebody on this network that Putin had murdered journalists --\n\nSCHLAPP: I don't think you could have the president of United States calling a foreign leader or demonizing a foreign leader, calling him a killer. It would not be an appropriate step for the president of United States to do that. I think what President Trump is trying to accomplish there is the fact that, he wants a better outcome, a better relationship with Putin. This is not the first time that a president has wanted a better relationship with Russia. Obviously we have seen that a poison well under President Obama where he called Putin a schoolyard bully. That doesn't work if you are trying to build relations of a foreign country.\n\nBENNETT: This president has attacked plenty of people as killers. He has talked about the leaders of Iran. Rightly, they are plenty of killers who run countries, including Vladimir Putin. When Obama was trying to reach out to Putin early in the administration, he was attacked by the right for that. What comes around goes around. My point, though, is that he was saying that Putin is equivalent to the United States and the fact that he kills journalists and that is outrageous.\n\nMACCALLUM: All right. We have to leave it there. Thank you very much to, all three of you. Good to have you here tonight. Matt, Mercedes, and Charlie, we will see you soon. We will take a quick break and be right back with more.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: Determined that the best course was a temporary halt and entry for 90 days while these procedures are looked at. That is understandable. The president comes into office with an obligation to protect the national security of our country.\n\n(END VIDEO CLIP)\n\nMACCALLUM: That was just one of the contentions exchanges from earlier tonight between Judge Michelle Friedland of the ninth circuit court in the government, represented today by August (inaudible). The court ended the hearing over President Trump travel ban without announcing a ruling, but they did say they will issue that decision as soon as possible. From that tense exchange to this joyous moment, in being town today, just one more time, I promise. Patriot's fans turned out in droves of despite the fact that it was pouring rain in Boston. Congratulations to them. For the quote of the date, what else could we do tonight, but Bill Belichick? Quote, \"mental toughness is doing the right thing for the team when it is not the right thing for you.\" On that, have a good night, everybody. We will see you back here tomorrow.\n\nEND\n\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "authors": [], "publish_date": "2017-02-07", "source": "foxnews", "top_words": ["travel", "case", "analyzes", "cotton", "right", "ban", "trump", "know", "judge", "workers", "think", "court", "president", "sen", "going", "focuses", "attorney", "order", "legislation", "look"], "summary": "FLENTJE: Judge Clifton, I know -- I would note that Judge Robart himself said that he wasn't going to look at campaign statements.\nAnd I think Washington will make its case and the ACLU will make its case about that this was ultimately discrimination.\nMACCALLUM: Coming up next, could be already contentious relationship between President Trump and the media, could it be reaching a new law?\nI think what President Trump is trying to accomplish there is the fact that, he wants a better outcome, a better relationship with Putin.\nThe court ended the hearing over President Trump travel ban without announcing a ruling, but they did say they will issue that decision as soon as possible."}