{"url": "http://www.foxnews.com/us/2017/01/31/diplomats-defy-white-house-warning-criticize-travel-ban.html", "id": "245", "title": "Diplomats defy White House warning, criticize travel ban", "text": "Hundreds of American diplomats defied a White House warning on Tuesday, sending a memo to the State Department's leadership that criticizes President Donald Trump's temporary travel ban on citizens from seven Muslim-majority countries. It is believed to be one of the most popularly supported statements of dissent in the department's history.\n\nA State Department official said the cable was received just a day after White House spokesman Sean Spicer suggested those disagreeing with Trump's new policy should resign. The official did not have an exact number of signatories, but said more than 800 indicated they would sign after drafts of the cable circulated over the weekend. The official wasn't authorized to discuss the matter publicly and demanded anonymity.\n\nThe document argues that the executive order Trump signed last week runs counter to American values and will fuel anti-American sentiment around the world.\n\n\"A policy which closes our doors to over 200 million legitimate travelers in the hopes of preventing a small number of travelers who intend to harm Americans from using the visa system to enter the United States will not achieve its aim of making our country safer,\" the diplomats wrote in the so-called \"dissent cable.\"\n\n\"This ban stands in opposition to the core American and constitutional values that we, as federal employees, took an oath to uphold,\" a draft of the cable said. The final version wasn't immediately available.\n\nDissent channel cables are a mechanism for U.S. diplomats to register disagreement internally about U.S. policies. It was established during the Vietnam War and was most recently used by diplomats to criticize the Obama administration's approach to Syria. In that case, former Secretary of State John Kerry met with signers of the cable to discuss their concerns.\n\nTrump's secretary of state nominee Rex Tillerson is still awaiting Senate confirmation and it was unclear how we would respond to the memo.\n\nIn response to reports of the cable Monday, Spicer said of the diplomats: \"They should either get with the program or they can go.\"\n\nHe dismissed the criticism from what he called \"career bureaucrats.\" While he later said Trump appreciates the work of public servants, Spicer said they should respect the desires of the American people and the importance Trump places on protecting the country.\n\n\"If somebody has a problem with that agenda, that does call into question whether they should continue in that post or not,\" Spicer said. \"This is about the safety of America.\"\n\nSigners of dissent cables are supposed to be protected from retribution from superiors.\n\nThe department, along with other agencies entrusted with implementing Trump's order, has been confused about the details, offering several contradictory instructions to embassies and consulates on how it plans to do so.\n\nAs word of the executive order began to circulate last week, diplomats at some embassies began to prioritize visa applications from citizens of countries they suspected might be affected, according to officials.\n\nOn Friday, before the order was signed, workers at one embassy dumped bins of hundreds of approved passports on the floor to pull those from the affected countries and affix visas in them, officials said. That effort stopped when the order was signed, they said.\n\n___\n\nEllen Knickmeyer contributed to this report.", "authors": [], "publish_date": "2017-01-31", "source": "foxnews", "top_words": ["travel", "official", "cable", "warning", "spicer", "ban", "trump", "state", "criticize", "defy", "trumps", "signed", "diplomats", "order", "house", "white", "american"], "summary": "Hundreds of American diplomats defied a White House warning on Tuesday, sending a memo to the State Department's leadership that criticizes President Donald Trump's temporary travel ban on citizens from seven Muslim-majority countries.\nA State Department official said the cable was received just a day after White House spokesman Sean Spicer suggested those disagreeing with Trump's new policy should resign.\nThe document argues that the executive order Trump signed last week runs counter to American values and will fuel anti-American sentiment around the world.\nIt was established during the Vietnam War and was most recently used by diplomats to criticize the Obama administration's approach to Syria.\nThe department, along with other agencies entrusted with implementing Trump's order, has been confused about the details, offering several contradictory instructions to embassies and consulates on how it plans to do so."}