{"url": "http://www.foxnews.com/us/2017/02/09/latest-us-court-refuses-to-reinstate-trump-travel-ban.html", "id": "286", "title": "The Latest: US court refuses to reinstate Trump's travel ban", "text": "The Latest on the travel ban imposed by President Donald Trump (all times local):\n\n3:15 p.m.\n\nA federal appeals court in San Francisco has refused to reinstate President Donald Trump's ban on travelers from seven predominantly Muslim nations.\n\nThe 9th U.S. Circuit Court of Appeals on Thursday wouldn't block a lower-court ruling that suspended the ban and allowed previously barred travelers to enter the U.S. An appeal to the U.S. Supreme Court is possible.\n\nU.S. District Judge James Robart in Seattle issued a temporary restraining order halting the ban last week after Washington state and Minnesota sued. The Justice Department appealed to the 9th Circuit.\n\nGovernment lawyers argued that the ban was a \"lawful exercise\" of the president's authority and that the seven countries have raised terrorism concerns.\n\nThe states said Trump's executive order unconstitutionally blocked entry based on religion.\n\n___\n\n2:10 p.m.\n\nA federal appeals court in San Francisco is set to issue its ruling in the legal fight over whether to reinstate President Donald Trump's ban on travelers from seven predominantly Muslim nations.\n\nThe 9th U.S. Circuit Court of Appeals announced that it will release its decision before the end of the business day Thursday in California.\n\nThe court is deciding whether to block a lower-court ruling that suspended the ban and allowed previously barred travelers to enter the U.S. An appeal to the U.S. Supreme Court is possible.\n\nU.S. District Judge James Robart in Seattle issued a temporary restraining order halting the ban last week after Washington state and Minnesota sued.\n\nThe administration said the seven nations — Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen — have raised terrorism concerns. The states argued that the ban targets Muslims.", "authors": [], "publish_date": "2017-02-09", "source": "foxnews", "top_words": ["ruling", "seven", "travel", "ban", "appeals", "refuses", "travelers", "court", "order", "donald", "trumps", "reinstate", "latest", "president"], "summary": "The Latest on the travel ban imposed by President Donald Trump (all times local):3:15 p.m.A federal appeals court in San Francisco has refused to reinstate President Donald Trump's ban on travelers from seven predominantly Muslim nations.\nCircuit Court of Appeals on Thursday wouldn't block a lower-court ruling that suspended the ban and allowed previously barred travelers to enter the U.S. An appeal to the U.S. Supreme Court is possible.\nU.S. District Judge James Robart in Seattle issued a temporary restraining order halting the ban last week after Washington state and Minnesota sued.\n___2:10 p.m.A federal appeals court in San Francisco is set to issue its ruling in the legal fight over whether to reinstate President Donald Trump's ban on travelers from seven predominantly Muslim nations.\nCircuit Court of Appeals announced that it will release its decision before the end of the business day Thursday in California."}