{"url": "http://www.foxnews.com/us/2017/02/13/states-want-trump-travel-ban-case-to-proceed-in-lower-court.html", "id": "299", "title": "States want Trump travel ban case to proceed in lower court", "text": "Lawyers for Washington state and Minnesota have told a federal judge their lawsuit against President Donald Trump's ban on travelers from seven predominantly Muslim nations should move forward in the lower court.\n\nBut the Justice Department, in its own court filing, wants the case put on hold while the 9th U.S. Circuit Court of Appeals decides whether the full court will review the government's request to allow Trump's order.\n\nLawyers for both sides will argue their positions later Monday before U.S. District Judge James Robarts, who previously issued a restraining order that halted the ban until it can be more fully examined.\n\nA three-judge federal appeals court panel last week refused to toss out the injunction and reinstate the travel ban. The panel unanimously rejected the administration's claim of presidential authority in the matter.\n\nThe Trump administration has not filed an official appeal of the panel's ruling with the U.S. Supreme Court or an appellate panel.", "authors": [], "publish_date": "2017-02-13", "source": "foxnews", "top_words": ["travel", "case", "lower", "trump", "wants", "proceed", "ban", "appeals", "judge", "court", "week", "trumps", "federal", "states", "washington", "panel"], "summary": "Lawyers for Washington state and Minnesota have told a federal judge their lawsuit against President Donald Trump's ban on travelers from seven predominantly Muslim nations should move forward in the lower court.\nBut the Justice Department, in its own court filing, wants the case put on hold while the 9th U.S.\nCircuit Court of Appeals decides whether the full court will review the government's request to allow Trump's order.\nA three-judge federal appeals court panel last week refused to toss out the injunction and reinstate the travel ban.\nThe Trump administration has not filed an official appeal of the panel's ruling with the U.S. Supreme Court or an appellate panel."}