{"url": "http://www.foxnews.com/us/2017/02/03/record-numbers-for-race-to-benefit-refugees-after-travel-ban.html", "id": "262", "title": "Record numbers for race to benefit refugees after travel ban", "text": "Organizers of a road race that benefits a Connecticut refugee resettlement group are crediting President Donald Trump for a record enrollment — and record donations — in this year's event.\n\nRegistration for the 10th annual Run for Refugees in New Haven on Sunday more than doubled to the maximum 2,500 in the days after the Republican president signed an executive order Jan. 27 temporarily banning refugees and immigrants from seven predominantly Muslim countries. Donations have reached $152,000, more than what was raised in the nine previous races.\n\nThe 5K race benefits the New Haven-based Integrated Refugee & Immigrant Services, or IRIS, which helped resettle 530 refugees in Connecticut last year. About 70 percent of the families were from Syria.\n\n\"It's just been amazing and it's a real boost for morale,\" said Chris George, executive director of IRIS. \"These are people who were so infuriated by the executive order ... that they wanted to demonstrate their support for refugees. It's just terrific.\"\n\nSince the 2,500-person limit was reached, about another 1,000 people were turned away, George said.\n\nThe nonprofit group, founded in 1982, has an annual budget of about $2 million, with about 60 percent coming from the federal government and 40 percent from private donations. It works to find homes for refugees and immigrants who have been vetted by the federal government, and connects them with health care, jobs and other services in their new communities.\n\nThe group has called the travel ban \"un-American\" and in \"direct opposition to the core American value of welcoming persecuted people to the United States to start their lives again in safety and peace.\" Those who support the ban cite the need to prevent terrorists from entering the country.\n\nThis year's road race has become so popular that a march to the New Haven Green has been added after the race. Scheduled speakers at the march include Connecticut Democratic Sen. Richard Blumenthal and refugee families from Syria and Iraq.\n\nAmy Boratko signed up a couple weeks ago to run the race.\n\n\"It allows us to physically get out there and show our support for more families being resettled here,\" she told WVIT-TV. \"Since the election, I've wanted to get more involved in activism, but specifically in New Haven. And I've long been an admirer of IRIS' work.\"", "authors": [], "publish_date": "2017-02-03", "source": "foxnews", "top_words": ["executive", "numbers", "travel", "ban", "refugee", "support", "families", "race", "benefit", "group", "donations", "haven", "refugees", "record", "iris"], "summary": "Organizers of a road race that benefits a Connecticut refugee resettlement group are crediting President Donald Trump for a record enrollment — and record donations — in this year's event.\nThe 5K race benefits the New Haven-based Integrated Refugee & Immigrant Services, or IRIS, which helped resettle 530 refugees in Connecticut last year.\n\"These are people who were so infuriated by the executive order ... that they wanted to demonstrate their support for refugees.\nThis year's road race has become so popular that a march to the New Haven Green has been added after the race.\nScheduled speakers at the march include Connecticut Democratic Sen. Richard Blumenthal and refugee families from Syria and Iraq."}