{"url": "http://www.foxnews.com/us/2017/02/02/agreement-reached-between-government-brothers-on-travel-ban.html", "id": "251", "title": "Agreement reached between government, brothers on travel ban", "text": "Lawyers for two brothers denied entry to the U.S. under President Donald Trump's travel ban have reached an agreement with the government, according to court papers filed Thursday.\n\nA lawsuit filed in federal court in Alexandria says the 19- and 21-year-old brothers, Ammar Aqel Mohammed Aziz and Tareq Aqel Mohammed Aziz, are Yemeni citizens who held status as lawful permanent U.S. residents, commonly known as green-card holders. They were traveling through Dulles International Airport on Saturday on their way to Flint, Michigan, to meet their father, a U.S. citizen.\n\nThe suit alleges the brothers were coerced into signing away their status and sent to Ethiopia.\n\nOn Thursday, the brothers' lawyers and the government filed papers indicating they reached an agreement ahead of a hearing scheduled for Friday.\n\nDetails of the agreement were not disclosed. But Simon Sandoval-Moshenberg, the brothers' attorney, said it applies only to the brothers' case. No agreement has been reached on the lawsuit's broader claims, which seek relief for other green-card holders affected by the travel ban.\n\nSince the Aziz brothers were turned away, government officials have said that green-card holders will routinely receive exemptions to the travel ban. But it is not clear how that might apply to people who signed papers relinquishing their status as lawful permanent residents, as the brothers allege in their lawsuit.\n\nThe executive order signed by Trump suspends immigration from seven Muslim-majority countries for 90 days and all refugee resettlement for 120 days. It provides exceptions for refugees who practice a religion that makes them a minority in their home country; Trump has said he wanted to give persecuted Christians priority treatment in the refugee program.\n\nIf the government has agreed to allow the Aziz brothers into the U.S. without ceding the legality of the travel ban, it would follow a strategy it pursued on various challenges to the government's no-fly list, which also has been accused of targeting Muslims unfairly.\n\nIn those cases, the government would accommodate individual plaintiffs who filed lawsuits, and then seek to have the lawsuits tossed out as moot.\n\nGadeir Abbas, a lawyer in the midst of a yearslong challenge to the no-fly list who also filed a separate lawsuit challenging the constitutionality of the travel ban this week on behalf of the Council on American-Islamic Relations, said the government's strategy can be effective if the judge hearing the case is looking for a way to avoid a ruling on difficult constitutional issues.\n\nHe said the government is willing to cede individual cases \"because it wants to preserve the ability to inflict that injustice on those without the ability to file a lawsuit.\"\n\nVirginia Attorney General Mark Herring, a Democrat, has asked a judge to allow the state to join the lawsuit challenging the travel ban. A judge will hear arguments Friday on Herring's request.\n\nWhile the original lawsuit focused primarily on seeking relief for lawful permanent residents, Herring's motion incorporates a broader challenge to the ban, raising objections to the ban's effect on those residing in Virginia on student visas, work visas and those with refugee status.\n\nMichael Kelly, a spokesman for Herring, said Thursday that he did not expect the Yemeni brothers' agreement with the government to affect Virginia's ability to join the lawsuit.\n\nAlso on Friday, a judge will hear a request to join the lawsuit from a Sudanese woman, Sahar Kamal Ahmed Fadul, who says she was turned away at Dulles under circumstances very similar to those described by the Aziz brothers. Fadul was traveling to the U.S. on a visa to join her fiance in Colorado.\n\nThe judge, Leonie Brinkema, has already issued a temporary restraining order protecting lawful permanent residents traveling through Dulles. She is one of at least five judges across the country who have issued orders barring implementation of various parts of the travel ban.", "authors": [], "publish_date": "2017-02-02", "source": "foxnews", "top_words": ["travel", "aziz", "residents", "brothers", "permanent", "ban", "judge", "reached", "agreement", "filed", "lawsuit"], "summary": "Lawyers for two brothers denied entry to the U.S. under President Donald Trump's travel ban have reached an agreement with the government, according to court papers filed Thursday.\nOn Thursday, the brothers' lawyers and the government filed papers indicating they reached an agreement ahead of a hearing scheduled for Friday.\nNo agreement has been reached on the lawsuit's broader claims, which seek relief for other green-card holders affected by the travel ban.\nSince the Aziz brothers were turned away, government officials have said that green-card holders will routinely receive exemptions to the travel ban.\nShe is one of at least five judges across the country who have issued orders barring implementation of various parts of the travel ban."}