{"url": "http://www.foxnews.com/travel/2017/03/01/travel-industry-experts-warn-us-tourism-could-take-major-hit-under-trump.html", "id": "229", "title": "Travel industry experts warn US tourism could take major hit under Trump", "text": "President Trump’s proposed travel ban of citizens from seven majority-Muslim countries is weighing heavily on the tourism industry. Whether it’s individuals who want to see the U.S. or companies planning travel for corporate events, many in the industry are expecting fewer people to visit America in the foreseeable future.\n\nAlly Bolour, a Los Angeles-based attorney who immigrated to the U.S. from Iran as a child in the 1970s, said he has friends overseas who now say they won’t come for a visit.\n\n“They want me to come to them,” he told Fox News. “The uncertainty of everything, and keeping people in suspense, keeps people from traveling. There's a chilling effect.”\n\nHe added that he is advising his clients who are not U.S. citizens to avoid traveling to America unless they absolutely must.\n\nNYC & Company, which promotes tourism in New York City, announced Tuesday that it expects 300,000 fewer international travelers will visit New York this year, based on data from Tourism Economics. The report cited changing attitudes about traveling to the U.S. and Trump’s stance on immigration to be responsible for the decline.\n\nFOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWS\n\nBut Jason Clampet, CEO and co-founder of travel research site Skift, said Trump isn’t solely to blame. He pointed his finger at the strong U.S. dollar.\n\n“People make travel decisions with their wallets,” Clampet told Fox News. “The dollar is very strong right now. Then you add the emotional feelings around choosing a place to travel… If you think you’re going to be hassled, you think maybe we’ll go someplace where we won’t be hassled.\n\n“Even with the business traveler, there’s an emotional element,” Clampet continued.\n\n“Leadership in the U.S. has been doing things on a whim, and it leaves people making decisions for their companies… They’re being overly cautious even in business, and we might see this for years to come as travel is planned so far ahead of time.”\n\nCompared to the same dates in 2016, searches for international flights to the U.S. dropped 6.5 percent in the eight days after Trump signed the travel ban, according to ForwardKeys, which monitors travel patterns.\n\n“The data forces a compelling conclusion that Donald Trump’s travel ban immediately caused a significant drop in bookings… and an immediate impact on future travel,” ForwardKeys CEO Olivier Jager told the Boston Globe.\n\nJonathan Grella, senior vice president of public affairs for the U.S. Travel Association, said he hopes Trump will be more deliberate in revising the ban, which was halted in federal court.\n\n“He’s the first CEO president, a hotelier and branding guru,” Grella said. “He, among all presidents, should understand instinctively putting our best foot forward and understanding that people have choices where they vacation and go on business.\n\n“We hope that our industry has the chance to make the case to the president that we’d be leaving money on the table turning people away. If we put all our chips toward security, we’ll have other problems to deal with in the aftermath.”\n\nBut not everyone is so hopeful – especially when it comes to business travel.\n\nDENTIST CLAIMS HE WAS REMOVED FROM FLIGHT AFTER MAKING ANTI-TRUMP REMARK\n\nAdam Sacks, president of Tourism Economics, told The New York Times that the number of annual visitors to the U.S. could fall by 6.3 million from 2016 to 2018, due to Trump’s words and actions (even before taking office), such as his pledges to pull out of international trade agreements.\n\n“We’re going to be looking at a very challenging year for U.S. travel,” Sacks told The New York Times.\n\nIn 2015, the latest year for which official figures have been calculated by the Department of Commerce, the U.S. saw a record 77.5 million international visitors.\n\nAbout half of European travel buyers who participated in a Global Business Travel Association survey said they expect their companies to cut business travel to the U.S. as a result of the ban.\n\n“They see the protests,” Bolour said. “They see Trump not making sense to any reasonable person and a Congress that gives him a green light. They see Muhammad Ali’s son getting stopped at the airport. It all has an effect.”\n\nNYC & Company told The Times it plans to change its overseas advertising. As a start, it will replace its billboards with new ones that proclaim New York City is “Welcoming the World.”\n\nRebekah Sager is a writer and editor for FoxNews.com. She can be reached at rebekah.sager@foxnews.com. Follow her on Twitter @rebekah_sager.", "authors": ["Rebekah Sager"], "publish_date": "2017-03-01", "source": "foxnews", "top_words": ["travel", "major", "industry", "trump", "international", "ban", "told", "hit", "trumps", "experts", "warn", "president", "york", "tourism", "business"], "summary": "President Trump’s proposed travel ban of citizens from seven majority-Muslim countries is weighing heavily on the tourism industry.\n“The data forces a compelling conclusion that Donald Trump’s travel ban immediately caused a significant drop in bookings… and an immediate impact on future travel,” ForwardKeys CEO Olivier Jager told the Boston Globe.\nIf we put all our chips toward security, we’ll have other problems to deal with in the aftermath.”But not everyone is so hopeful – especially when it comes to business travel.\n“We’re going to be looking at a very challenging year for U.S. travel,” Sacks told The New York Times.\nAbout half of European travel buyers who participated in a Global Business Travel Association survey said they expect their companies to cut business travel to the U.S. as a result of the ban."}