{"url": "http://www.foxnews.com/us/2017/02/08/trump-travel-ban-in-hands-federal-appeals-court.html", "id": "283", "title": "Trump travel ban in hands of federal appeals court", "text": "A federal appeals court will decide whether to reinstate President Donald Trump's travel ban after a contentious hearing in which the judges hammered away at the administration's motivations for the ban, but also directed pointed questions to an attorney for two states trying to overturn it.\n\nIt was unclear which way the three judges of the San Francisco-based 9th Circuit Court of Appeals would rule, though legal experts said the states appeared to have the edge.\n\n\"I'm not sure if either side presented a compelling case, but I certainly thought the government's case came across as weaker,\" said Stephen Vladeck, a professor at the University of Texas School of Law.\n\nA ruling could come as early as Wednesday and could be appealed to the U.S. Supreme Court.\n\nThe appeals court challenged the administration's claim that the ban was motivated by terrorism fears, but it also questioned the argument of an attorney challenging the executive order on grounds that it unconstitutionally targeted Muslims.\n\nThe contentious hearing before three judges on the San Francisco-based 9th Circuit Court of Appeals focused narrowly on whether a restraining order issued by a lower court should remain in effect while a challenge to the ban proceeds. But the judges jumped into the larger constitutional questions surrounding Trump's order, which temporarily suspended the nation's refugee program and immigration from seven mostly Muslim countries that have raised terrorism concerns.\n\nThe hearing Tuesday was conducted by phone — an unusual step — and broadcast live on cable networks, newspaper websites and various social media outlets. It attracted a huge audience, with more than 130,000 alone tuned in to the court's YouTube site to hear audio.\n\nJudge Richard Clifton, a George W. Bush nominee, asked an attorney representing Washington state and Minnesota what evidence he had that the ban was motivated by religion. The two states are suing to invalidate the ban.\n\n\"I have trouble understanding why we're supposed to infer religious animus when in fact the vast majority of Muslims would not be affected.\"\n\nOnly 15 percent of the world's Muslims are affected, the judge said, citing his own calculations. He added that the \"concern for terrorism from those connected to radical Islamic sects is hard to deny.\"\n\nNoah Purcell, Washington state's solicitor general, cited public statements by Trump calling for a ban on the entry of Muslims to the U.S. He said the states did not have to show every Muslim is harmed, only that the ban was motivated by religious discrimination.\n\nClifton also went after the government's attorney, asking whether he denied statements by Trump and former New York City Mayor Rudolph Giuliani, who said recently that Trump asked him to create a plan for a Muslim ban. Judge Michelle T. Friedland, who was appointed by President Barack Obama, asked why the case should not move forward to determine what motivated the ban.\n\n\"We're not saying the case shouldn't proceed, but we are saying that it is extraordinary for a court to enjoin the president's national security decision based on some newspaper articles,\" said August Flentje, who argued the case for the Justice Department.\n\nUnder questioning from Clifton, Flentje did not dispute that Trump and Giuliani made the statements.\n\nClifton said he understood if the government argued that statements by Trump and his advisers should not be given much weight, but he said they are potentially evidence in the case.\n\nFriedland also asked whether the government has any evidence connecting the seven nations to terrorism.\n\nFlentje told the judges that the case was moving fast and the government had not yet included evidence to support the ban. Flentje cited a number of Somalis in the U.S. who, he said, had been connected to the al-Shabab terrorist group.\n\nThe ban has upended travel to the U.S. for more than a week and tested the new administration's use of executive power.\n\nWhatever the court eventually decides, either side could ask the Supreme Court to intervene.\n\nThe government asked the appeals court to restore Trump's order, saying that the president alone has the power to decide who can enter or stay in the United States. Several states insist that it is unconstitutional.\n\nFlentje offered the 9th Circuit a third option, saying the court could exempt from the ban people who have previously been admitted to the U.S., but keep it in place for people who have never been to the country.\n\nThe judges repeatedly questioned Flentje on why the states should not be able to sue on behalf of their residents or on behalf of their universities, which have complained about students and faculty getting stranded overseas.\n\nPurcell said that restraining order has not harmed the U.S. government. Instead, he told the panel, Trump's order had harmed Washington state residents by splitting up families, holding up students trying to travel for their studies and preventing people from visiting family abroad.\n\nA decision by the 9th Circuit was likely to come later this week, Madden said.\n\nIf the case does end up before the Supreme Court, it could prove difficult to find the necessary five votes to undo a lower court order. The Supreme Court has been at less than full strength since Justice Antonin Scalia's death a year ago. The last immigration case that reached the justices ended in a 4-4 tie.\n\nHow and when a case might get to the Supreme Court is unclear. The travel ban itself is to expire in 90 days, meaning it could run its course before a higher court takes up the issue. Or the administration could change it in any number of ways that would keep the issue alive.\n\n___\n\nAssociated Press writers Brian Melley in Los Angeles and Eugene Johnson in Seattle contributed to this report.", "authors": [], "publish_date": "2017-02-08", "source": "foxnews", "top_words": ["travel", "case", "judges", "trump", "ban", "appeals", "supreme", "court", "order", "federal", "hands", "asked", "states"], "summary": "A ruling could come as early as Wednesday and could be appealed to the U.S. Supreme Court.\nWhatever the court eventually decides, either side could ask the Supreme Court to intervene.\nIf the case does end up before the Supreme Court, it could prove difficult to find the necessary five votes to undo a lower court order.\nThe Supreme Court has been at less than full strength since Justice Antonin Scalia's death a year ago.\nHow and when a case might get to the Supreme Court is unclear."}