{"url": "http://www.foxnews.com/transcript/2017/03/17/ann-coulter-speaks-out-against-accepting-refugees-reps-blackburn-and-scalise.html", "id": "220", "title": "Ann Coulter speaks out against accepting refugees; Reps. Blackburn and Scalise talk health care bill changes", "text": "This is a rush transcript from \"Hannity,\" March 17, 2017. This copy may not be in its final form and may be updated.\n\nSEAN HANNITY, HOST: And welcome to \"Hannity.\" President Trump -- he met with German chancellor Angela Merkel today at the White House. Tonight, Ann Coulter, Sheriff David Clarke, Geraldo Rivera, Circa News investigative reporter Sara Carter will be here.\n\nBut first, today's meeting highlighted major differences between Trump and Merkel's approach to key issues. And America can learn from Europe's many failures. And that is tonight's \"Opening Monologue.\"\n\nNow, President Trump and Chancellor Merkel -- they capped off their first visit earlier today by holding a joint press conference. And President Trump made very clear where we stand on protecting this country. Watch this.\n\n(BEGIN VIDEO CLIP)\n\nDONALD TRUMP, PRESIDENT OF THE UNITED STATES: Our two countries must continue to work together to protect our people from radical Islamic terrorism and to defeat ISIS. I applaud Chancellor Merkel for Germany's contributions, both civilian and military, as a counter-ISIS coalition member.\n\nWe also recognize that immigration security is national security. We must protect our citizens from those who seek to spread terrorism, extremism and violence inside our borders. Immigration is a privilege, not a right, and the safety of our citizens must always come first.\n\n(END VIDEO CLIP)\n\nHANNITY: Now, we have been covering in depth on this show how President Trump has promised to do everything within his power to stop radical Islamic terrorists from entering this country and putting you, the American people, in danger. Now, he plans on doing that in part by enacting extreme vetting of refugees.\n\nHowever, as we told you last night, the alt radical obstructionist left here in America is trying to stop the president. And by doing so, they are showing that they are perfectly willing to gamble with your lives, the lives of the American people.\n\nAt this point, in my opinion, the left here at home -- they want to copy Germany and Europe's practice of letting waves of unchecked refugees pour into their countries. But tonight, the alt radical left -- they may want to think twice about this. And we'll show you exactly why.\n\nNow, here at home, we've seen an increase in radical Islamist attacks. Top officials have repeatedly warned that ISIS can, in fact, infiltrate the refugee population. And according to the FBI, there are 1,000 active ISIS- related cases right now in all 50 states.\n\nAnd earlier this month, the attorney general, Jeff Sessions, revealed this shocking statistic about these ongoing investigations. Take a look.\n\n(BEGIN VIDEO CLIP)\n\nJEFF SESSIONS, ATTORNEY GENERAL: Today, more than 300 people, according to the FBI, who came here as refugees are under an FBI investigation today for potential terrorism-related activities.\n\n(END VIDEO CLIP)\n\nHANNITY: And in Europe, it's become far worse and more violent. Now, the continent has become the epicenter of terrorist attacks against the West. Now, since 2014, Europe has taken in over 3 million refugees and asylum- seekers. Germany has led the way in Western Europe by accepting nearly 900,000 refugees in 2015 alone.\n\nLast month, Germany's domestic security and intelligence agency, the BFV, said the number of radical Islamists in the country has grown considerably, rising from just 100 in 2013 to almost 1,600 this year. And what we've seen is devastating and brutally violent attacks.\n\nNow, in November 2015, radical Islamists -- they launched a series of attacks in Paris targeting a stadium, a cafe, a concert hall where they slaughtered 130 people and wounded hundreds of others. And then in March of 2016, explosions at the airport and a metro station rocked the city of Brussels. On that case, 34 killed, and that's 34 innocent travelers, including Americans, 150 injured.\n\nAnd a few months later in the city of Nice in France, during a French national day, a truck attack killed 84 people, including 10 children. More than 200 others are injured. And days before Christmas in 2016 in Berlin, Germany, an Islamist plowed a truck into a crowded Christmas market, 12 dead and 50 more injured.\n\nHere's the bottom line here. Liberals in this country can continue to be naive, have a pre-9/11 mindset with the hopes that another major attack is not going to happen. They can hope, they can pray, or we should be smart and vigilant and fully aware of all these dangers we face and allow President Trump to harden the policies and procedures so we can keep all of you and all of America and all of our children safe.\n\nHere now with reaction, the author of the best-selling book \"In Trump We Trust: E Pluribus Awesome,\" Ann Coulter. Ann to me, this comes down to a very simple, basic fundamental choice, the inconvenience of a few guests that want the privilege to be here, the inconvenience, or the gambling with the lives of the American people. Why is that such a hard decision for people?\n\nANN COULTER, CONSERVATIVE COLUMNIST: No, and you're right in your monologue. Why can't we learn from Western Europe? Just a few weeks ago, German intelligence reports that 1,000 German residents have gone to fight with ISIS. Hundreds of them have come back to Germany. And what does Merkel do? She's setting them up with welfare because, you know, if they don't have a lot of welfare, that could radicalize them.\n\nWhat don't we believe what -- that these migrants say? They come into countries. They rape women. They're having a very difficult time learning not to rape women, even if they're infidel whores and have short skirts. What other immigrant group could not stop itself from raping masses of women?\n\nThey march around saying, No, you're going to live under sharia law. They commit terrorist acts. It's right in front of our eyes. And can you imagine, I mean, what Angela Merkel has done is spreading throughout Western Europe. But just in Germany alone, combining German military discipline with Islamic ideology? It's terrifying what we're up against. Why would you do that in this country?\n\nHANNITY: You know...\n\nCOULTER: And meanwhile, they keep trying to distract us with Russia, Russia, Russia. Russia is probably one of our better allies in the fight against Islam. They've been dealing with these Islamic terrorists for centuries now. And you remember, they're the ones who warned America about the Tsarnaev family that blew up the Boston Marathon. But no, our government officials wouldn't -- wouldn't listen. Let's just -- let's just worry about Russia now that -- how long ago did Reagan win the cold war? It's over!\n\nHANNITY: It's six months of a conspiracy lie. I mean, it's been nonstop. Here's -- here's a really tough question. I know you'll touch it, but so many are afraid to touch it. If you grow up under sharia and you're a man and you think you have the right to tell women they can't drive, travel, they've got to dress a certain way, they can't be seen in public without a male relative, if you think you can throw gays and lesbians off of big buildings and kill them or hang them, if you persecute Christians and Jews, how do we know -- how do you ever vet somebody's mind and heart if your culture -- you grew up -- that's what you learned, which that directly contradicts our constitutional values! How do we vet that? Is that possible, even?\n\nCOULTER: No, you're absolutely right, in addition to the fact that there is no, you know, Syrian FBI. They don't have a computer database. And there was testimony before the Senate last year saying there's nothing to vet. There's nothing we can look at.\n\nI also think it's worth mentioning -- maybe you've shown these, and if you haven't, you should. I tweeted it out a few weeks ago -- photos of women going to college in Afghanistan not that long ago. It was in the '70s. And they look- it looks like an American college campus. They're wearing, you know, skirts, and button-down shirts and carrying their book bags.\n\nThings can turn overnight. When you're bringing in these masses of people from very, very different cultures and make it a hate crime to ask them to assimilate, you know, for the cherry on top, and -- and they have no intent of assimilating.\n\nPlus which, what are we getting out of this? It's one thing if we're bringing in nuclear scientists or engineers. I don't think we're getting a lot of those. But the vast majority of refugees are just instantly coming in, sucking up welfare that's meant for our people!\n\nHANNITY: Yes. Let me ask you a political question. One of my favorite clips of the snowflake left is -- you were on your buddy, Bill Maher's, show. And it's, like, June or July of 2015, and you say, yes, Donald Trump has the best chance of winning, and the crowd just is laughing at you. I don't think they're laughing now.\n\nSo you've been a very strong supporter. I'm pretty angry with the Republican Party. They seem ill prepared, especially on repeal and replace, and it seems like the president is trying to clean it up. Hopefully, they get there. Hopefully, we get consensus. Are you happy with how things are going so far?\n\nCOULTER: On most things, I'm disappointed with the Republican Congress. First of all, they ought to be impeaching those two travel ban judges immediately. It is totally outrageous. It is against the Constitution. The president -- and by the way, every member of Congress took an oath to uphold the Constitution. The commander-in-chief has authority over immigration. He has full authority not only through the Constitution and (INAUDIBLE) duties as commander-in-chief, but through a federal law passed by Congress that's been on the books and reaffirmed in hundreds of Supreme Court cases -- or rather court cases, at least a dozen Supreme Court cases. This is 100 percent the prerogative of the commander-in-chief.\n\nAnd to have a district court judge stepping in and saying, Oh, no, the commander-in-chief doesn't have that duty -- what else -- could a district court just say, Oh, no, we're overruling your decision to go to war because, you know, someone in Hawaii could be affected.\n\nThis is what we need Congress doing. I was hoping for a better repeal of ObamaCare. Sean, they've had seven years to work on it. And no one in Washington seems to understand...\n\nHANNITY: Eight. Who's counting.\n\nCOULTER: ... the (INAUDIBLE) market...\n\nHANNITY: Yes, they've had eight years.\n\nCOULTER: And the whole -- you know, the...\n\nHANNITY: Eight.\n\nCOULTER: I'll hold our emperor god Trump harmless on ObamaCare. That really isn't his job. He supposed to be building the wall, deporting illegals, imposing the refugee ban. But looking at the massive resistance-- a pro-American president -- we finally have. Looking at the resistance he's getting, he could use an assist from Republicans in Congress, and other than a handful of them, he's not getting it.\n\nHANNITY: All right. Ann Coulter, I owe you an e-mail, by the way, and I'll get that to you right away. Thank you, as always. Appreciate you being with us.\n\nCOULTER: Thank you.\n\nHANNITY: And up next tonight right here on \"Hannity\"...\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: ObamaCare is dead. It's a dead health care plan. It's not even a health care plan, frankly.\n\n(END VIDEO CLIP)\n\nHANNITY: All right, the president says ObamaCare is dead and that he's gathering support for the Republican health care bill. Two lawmakers, Republicans, who were in the room with the president, Congresswoman Marsha Blackburn, Congressman Steve Scalise -- they'll join us next with reaction.\n\nAnd then later tonight...\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED FEMALE: I know it's, like, two girls fighting in the ocean, and then one girl got carried away in a stretcher.\n\nUNIDENTIFIED MALE: (INAUDIBLE)\n\nUNIDENTIFIED FEMALE: It was.\n\n(END VIDEO CLIP)\n\nHANNITY: It's out of control at the beach. Partying's back. Spring break is down (ph). And we've sent a producer down to South Padre Island, Texas. Want to see what your kids are doing, what they're really doing on spring break? Are you ready for this? Our series begins next week. We'll give you a preview tonight.\n\n(COMMERCIAL BREAK)\n\nHANNITY: Welcome back to \"Hannity.\" So earlier today, President Trump met with members of the Republican Study Committee, where he said some changes were made to the GOP ObamaCare replacement plan and that all representatives at the meeting said they were now planning to support the legislation. Watch this.\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: All of these nos, or potential nos, are all yeses. Every single person sitting in this room is now a yes. And we made certain changes. And very -- frankly little, although the block grant is very important because I want the states to get the money and to run their program, if they want to run it because they can do it better than the federal government. They're better equipped than the federal government.\n\nI also want people to know that ObamaCare is dead. It's a dead health care plan. It's not even a health care plan, frankly, only because everyone knows it's on its last dying feet.\n\nThe fake news is trying to say good things about it, OK, fake media. And there is no good news about ObamaCare. ObamaCare is dead.\n\n(END VIDEO CLIP)\n\nHANNITY: All right, joining us now with reaction, two representatives who were in that meeting today, Tennessee congresswoman Marsha Blackburn, and majority whip, Louisiana Congressman Steve Scalise is with us.\n\nCongresswoman, I'll start with you and...\n\nREP. MARSHA BLACKBURN, R-TENNESSEE: Sure.\n\nHANNITY: ... I -- look, the Republican Study Group is a conservative group within the Congress and -- but it's not as conservative as, say, the Freedom Caucus. Their members tell me today they're still not on board, although they are -- some of the changes that I saw today that, you know, they're pretty happy with.\n\nYou know, in addition to the Medicaid agreement with the Study Group, et cetera, that they're going to impose -- the states -- the option to impose work requirements, and also that -- you know, other new wording. These are all things that I know that the Freedom Caucus wanted.\n\nHow close do you think we are to getting them on board, too?\n\nBLACKBURN: I think we're very close, Sean. This is a bill that's moving the right direction. And today, the vice president and president asked us to work with them, which, you know, we've been working with whip Scalise. We have been working with the White House. And they've asked for our support on this.\n\nAnd I think it's important for Republicans to have a win. As you've said, this has taken longer than it should have taken. We need to continue to work on the Medicaid expansion, address those issues, and make certain that this is a bill that Republicans can support and send to the Senate for them to take up the House bill.\n\nHANNITY: Yes. Steve, where are you with the Freedom Caucus guys because they've been the ones that have communicated with me the most, that they kind of -- they say the president, A-plus-plus. He's been reaching out to them, talking to them. They appreciate it. The president's listening.\n\nSome changes they wanted are in the bill, but they feel the leadership has not reached out as much to them. Why?\n\nREP STEVE SCALISE, R-LOUISIANA: I've been talking to Freedom Caucus members directly, Sean. In fact, today at the meeting with the RSC chairman, Mark Walker, and other RC members, there were two freedom caucus members there who said they're going to vote for the bill, which included one member, Gary Palmer, who had voted against the bill in the Budget Committee yesterday.\n\nSo with these changes, both -- you talk about something revolutionary, block-granting Medicaid, giving governors complete ability to block grant the Medicaid program -- that's a revolutionary reform conservatives have been wanting for decades. That's now agreed to by the president, and that'll be in the bill and the work requirements...\n\n(CROSSTALK)\n\nHANNITY: Those are two things that they told me -- those are two things specifically that Mark Meadows and Jim Jordan told me that they wanted in the bill. Can we -- is there any...\n\nSCALISE: Right. Those are big wins, and that's what brought some of the Freedom Caucus members that were in the room today to say they're now for the bill. So this -- like Marsha, said, this bill's moving in the right direction and members are engaged. But what's most important, Sean, the president is directly engaged. President Trump said, I am behind this bill 100 percent. He wants this bill on his desk to repeal and replace ObamaCare and put patients back in charge of their health care, so...\n\nHANNITY: The end of next week.\n\nSCALISE: ... his help is a lot. Yes, his help has been tremendous...\n\nHANNITY: Now, Marsha...\n\nSCALISE: ... and he's rolled up his sleeves and gotten to work on this directly.\n\nBLACKBURN: Yes?\n\nHANNITY: Is there anything to learn from this? In other words, should consensus have been built before the bill instead of this public fight that-- and intramural squabbling civil war because from my perspective, you cannot not do this. We're at the point -- this is a -- the president's first major signature legislation here. And it seems that it was maybe -- you wrote the contract before the deal points were made. It seemed like the cart ahead of the horse a little bit. Do you think it could have been handled differently and better?\n\nBLACKBURN: Well, yes, I do. You know, one of the things Republicans don't take the time to do is establish the predicate. And Republicans should have started talking about why we have to repeal and what we're doing to put patient-centered health care in place. We should have done that coming (ph) November 9th.\n\nHANNITY: Right.\n\nBLACKBURN: And then leading up to this, building our, that big picture, and then working more closely -- conservatives, us House conservatives, with the leadership, and of course, with the White House. The president and vice president have been terrific. They've said, tell us what we need to do. We're working on...\n\nHANNITY: All right, let me ask this last question.\n\nBLACKBURN: ... this. Let's solve it. Yes.\n\nHANNITY: So Congressman, you think you're going to have the requisite number. Are you working hand in hand with the Senate? Is the Senate bill going to be much different? And when you get the House and Senate together in conference, are you confident that this is all going to get done?\n\nSCALISE: Yes, I think...\n\n(CROSSTALK)\n\nHANNITY: ... losing is not an option here.\n\nSCALISE: Yes.\n\nBLACKBURN: That's right.\n\nSCALISE: Failure is not an option. But look at this, Sean, something else that just got included that today brought National Right to Life to write a letter of strong support of this bill. This will probably be one of the most pro-life pieces of legislation...\n\n(CROSSTALK)\n\nHANNITY: Absolutely.\n\nSCALISE: ... and defunding Planned Parenthood. That's a big win, too, for conservatives.\n\nHANNITY: That's a big win.\n\n(CROSSTALK)\n\nBLACKBURN: They are enormous wins. They think those are things that we have wanted to see happen. And I think the Senate is going to be...\n\nHANNITY: There are a lot of good things in there, I agree.\n\nBLACKBURN: ... ready to take our bill up. Yes. They're going to be...\n\nHANNITY: All right, guys...\n\nBLACKBURN: ... ready to take it up. Thanks.\n\nHANNITY: All right. We're going to see you both next week, hopefully. And maybe we can get this thing finished.\n\nBLACKBURN: Sue.\n\nHANNITY: And up next tonight right here on \"Hannity\"...\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: Don't even think about it! We will build the wall! Don't even think about it!\n\n(CHEERS AND APPLAUSE)\n\n(END VIDEO CLIP)\n\nHANNITY: The president promising the border wall will, in fact, be built. This as his new budget proposal slashes funding to sanctuary cities. Geraldo Rivera, Sheriff David Clarke join the debate.\n\nAnd also later tonight...\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: When time did you all start drinking today?\n\nUNIDENTIFIED MALE: We didn't stop from last night!\n\n(LAUGHTER)\n\nUNIDENTIFIED MALE: On a roll! On a roll all day and night!\n\n(END VIDEO CLIP)\n\nHANNITY: Tonight, another sneak peek from our spring break special that begins next week. We're exposing what really happens there. By the way, it's not all fun in the sun. And this is your kids at risk. We start that next week.\n\nWe'll continue.\n\n(COMMERCIAL BREAK)\n\n(NEWSBREAK)\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: Don't even think about it! We will build the wall! Don't even think about it!\n\n(CHEERS AND APPLAUSE)\n\nTRUMP: Our southern border will be protected always! It will have the wall! Drugs will stop pouring in and poisoning our youth! And that will happen very, very soon!\n\n(END VIDEO CLIP)\n\nHANNITY: All right, that was President Trump in Nashville earlier this week promising to secure the southern border and finally build the wall.\n\nMeanwhile, President Trump's proposed budget takes aim at sanctuary cities. The LA Times described this budgetary proposal. They wrote, quote, \"Trump wants to slash $210 million in federal reimbursements to state and local jails that hold illegal immigrants convicted of crimes while in the country illegally.\"\n\nJoining us now with reaction, author of, \"Cop Under Fire: Moving Beyond Hashtags of Race, Crime and Politics for a Better America,\" Milwaukee County Sheriff David Clarke, Fox News correspondent at large Geraldo Rivera.\n\nGeraldo, you and I go back and forth on this. And you know, every time I point out to you -- I sat there with all these local law enforcement guys in Texas, and there were 642,000 crimes in a seven-year period committed against Texans alone, including murder, including murder, including drugs, including kidnapping.\n\nI mean, to me, this is now common sense! I really -- you like to say you're a common sense guy. Isn't that common sense?\n\nGERALDO RIVERA, FOX CORRESPONDENT: First of all, let's start on a happier note. I wore this green tie in honor of you, my Irish brother from another mother.\n\n(LAUGHTER)\n\nHANNITY: Yes.\n\nRIVERA: And Sheriff Clarke, nice to see you.\n\nI think that -- and you and I have discussed this, the issue of sanctuary cities, funding, defunding, and so forth, will be where the rubber hits the road, the fight between red and blue, the fight between left and right. I think that this -- once the ObamaCare stuff is sorted out, the Russian stuff is sorted out, this will be the issue I think that preoccupies the conflict between the two sides in...\n\nHANNITY: All right, let me ask you as a lawyer -- you're a lawyer.\n\nRIVERA: Right.\n\nHANNITY: We have a rule of law. So if cities are defying the rule of law, shouldn't there be some consequences for that? Isn't that called aiding and embedding?\n\nRIVERA: That's an excellent point. Just yesterday, though, the chief justice of the California courts wrote to Attorney General Sessions and DHS Secretary General Kelly and told them to keep the ICE agents out of the California courts. California does not appreciate -- I foresee not only legal conflict, Sean, but I foresee conflict between -- imagine a state or local cop facing an ICE agent, and the cop saying to the ICE agent, You shouldn't be in here. You know, this is a courtroom. We don't want you. I see the potential for conflict. I think everyone's got to cool it down...\n\nHANNITY: You may be very well right. You probably actually are. And Sheriff Clarke, that is a problem, though, because this is a breakdown in civil society. And it becomes lawlessness when you have states and municipalities deciding which laws they want to obey and which laws they refuse to disobey, and they're willing to aid and abet criminals.\n\nSHERIFF DAVID CLARKE, MILWAUKEE COUNTY: First of all, Happy St. Patrick's Day, Sean.\n\nHANNITY: We are all Irish today.\n\nCLARKE: Is a lot of posturing going on right now, but I think in the end cooler heads will prevail.\n\nIs there any buddy who thinks Donald Trump is not serious about building this wall, sealing that border for real, to stop the flow of illegal immigrants into this country, the drugs, the weapons, so on and so far, the criminal gangs, the cartels. He is going to get this done. I know he is. And I'm going to help him do it as it relates to Milwaukee which is why I sent a letter of intent last week to the acting director of ICE asking to be certified to participate in the 287-G program which will give after training and some other certification will give my deputies, the corrections officers in the jail, the authority after he deputizes U.S. marshals says, to enforce immigration.\n\nWhat we are talking about here, and I want to make this clear, and it sounds like my good friend Geraldo is starting to soften a little bit on this, and that's a good thing. We are talking about, in my case, criminal illegal aliens. We are not talking about doing home raids and business raids to look for people in the country illegally. We are going to identify people who have been convicted of serious crimes in this country and schedule them for deportation. That is not extreme. That is reasonable. And anybody who is not for that is advocating for criminal behavior, because sanctuary cities provide a safe haven for criminal activity and criminal illegal aliens.\n\nRIVERA: I totally disagree with that, because nothing prevents cops from enforcing the law. If someone commits a crime, they get arrested. What this is all about is whether that top vows to hold the person after the arrest after their sentence is served or they have been acquitted, just hold them for a federal immigration hold. Over 350 municipalities and states have said no, we're not going to do this. We are not immigration officials. We refuse to cooperate. This is not about law enforcement. This is only about whether county or municipal cops are also federal deputies in that sense enforcing immigration laws. That's apart from the criminal which of course they have to enforce.\n\nHANNITY: All right, last word, sheriff.\n\nCLARKE: They can't make local jails and sheriffs and chiefs hold these individuals. They are asking for some cooperation in assisting them in doing that, and I don't think that's a big thing to do. Had the San Francisco jail area kept or held onto the guy that killed Kate Steinle, she would be alive today. What Donald Trump, President Trump has made clear, the catch and release days are over. That's what we're talking about. You're right, Geraldo. They can't force the jails to do it. But there will be some penalties. You talk about the type of dollars we are talking about, that is going to leave some huge gaps in some of these local funding and eventually they are going to start to do the right thing. They will, trust me on this.\n\nHANNITY: To my two good friends and Irish brothers, Happy St. Patrick's Day to both of you.\n\nAnd coming up, Sara Carter from Circa News, she has been breaking stories all week long. They are debunking the leftwing talking point narrative that President Trump in fact colluded with the Russians. Sara will join us next.\n\nAnd then later tonight --\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED FEMALE: I just love the people and I love the island. And I want everyone to see my booty.\n\n(LAUGHTER)\n\n(END VIDEO CLIP)\n\nHANNITY: Ever wonder what happens when your kids go on spring break? We sent a \"Hannity\" producer down to South Padre Island in Texas. You want to send your kids there? Wait until you see what we caught on camera. That and more on this busy Friday news night on \"Hannity.\"\n\n(COMMERCIAL BREAK)\n\nHANNITY: Welcome back to \"Hannity.\" Now journalists Sara Carter and John Solomon of Circa News, they have been breaking many big stories this week. According to their first bombshell report, a computer scientist who is a Hillary Clinton donor pushed the Trump-Russia server narrative which eventually of course led to an investigation by the FBI. They found no wrongdoing.\n\nAnd just yesterday Sara and John reported that sources told them that Russian Alpha Bank which allegedly had this computer connection to the Trump Organization, asked the Department of Justice for help to identify a computer in the U.S. that they believe is being hacked to make it look like communication exists between the president and Moscow.\n\nSara Carter joins us now. I said this to you last night. This is now becoming more like a new addition of \"Homeland\" every single day with these new developments. But what they are saying on the Russian side of things it is they've able to trace back -- there is someone they think within the United States that is faking a relationship -- a computer relationship between that bank and at the Trump. Do we know if this was the same thing going on and investigated in October?\n\nSARA CARTER, CIRCA NEWS: They suspect that it was. That's very interesting because even back in October, they were very concerned about this. Although there was no data going between the two servers, there were still concerns that it happened.\n\nSo what they did was they basically intercepted -- they put something inside their computer server and order to track and trace if it happened again. And it did. It happened again in February and then it happened again March 11th and March 13th. And that point, Alpha Bank, their cyber experts, their specialists were able to trace it, and that's where they collected all the data and the information which we were able to view as well, Sean. So we were able to see that for ourselves.\n\nHANNITY: So all of you are reporting on discoveries, you were able to confirm that in fact, Trump's servers were surveilled. You were able to confirm that law enforcement found no collusion whatsoever even though it keeps getting reported, this conspiracy by almost everybody else in the media.\n\nWhere is this going next, because if that is the case, is it possible the whole thing could have been set up by people connected to the Democratic Party? Can it get that deep?\n\nCARTER: It could. We don't know yet, right. We're still looking, we're still investigating. I know one of the things that I am most concerned about is something as well that the House chairman of the intelligence committee is most concerned about is the leaks, right, because that's going to answer a lot of our questions. Why was General Glynn, Lieutenant General Flynn's name exposed in those phone calls? Did they have a backdoor through surveillance?\n\nOne of the questions, Sean, that nobody is really asking is -- and I think Chairman Nunes will ask these questions of FBI Director Comey as well as others in the NSA and the CIS, was there an increase of viewership of this raw data during December? Were people going into these skiffs and looking at raw data that had names of persons associated to Trump or President Trump himself? I think that's something they are going to be asking.\n\nHANNITY: I had Pete Hoekstra on my radio show today, and he's a former chair of the intelligence committee, and he wrote a column in the \"Wall Street Journal,\" can Americans trust their intelligence community? I would argue probably 99.9 percent, yes, we can. I have a lot of faith and a lot of -- I just believe that these are people serving their country. But you only need one bad apple. Is it possible based on the WikiLeaks revelation that the malware exists that they could literally hack into something from any country and pin it on another country? In other words --\n\nCARTER: Sure. They said they can. That's what we saw. If those documents are true, then yes, they can. I suspect that we have some very, very smart people in our intelligence community. What I think is most concerning is they don't even have to go that far. If you have FISA records on foreign surveillance, so you're looking at foreigners, any telephone calls then candidate Trump, now President Trump, made it back then, would have been picked up, right? Could someone have viewed those? Anyone else and his team, could those have been viewed? How many Americans are being surveilled that make phone calls overseas? These are the questions that we have to ask.\n\nAnd why weren't those names protected? Why was the raw data so exposed that it leaked to the press and revealed the name of an American speaking to a Russian ambassador on what is a very classified document, Sean? I don't know how much I can stress this -- every intelligent source that I speak with says that this is such highly classified document. And is there an investigation?\n\nHANNITY: That means it has to be high up. These leaks then have to be coming from a very high level, is that true?\n\nCARTER: I would say based on my reporting, based on the sources that I've spoken with, not any GS-9 would be able to go in there and see these particular types of documents. These documents would have to be signed off. They would literally have to be signed off by that director of the FBI or the head of the CIA. Nobody can just walk in there and just look at these despite the expansion of the 12333.\n\nHANNITY: And that, to who advanced the narrative, there's a political component. And this is why getting to the bottom of the deep state, the lifetime bureaucrats, the Obama holdovers, something is going to break here, and I think you are probably going to be the one to do it. Thank you for updating us all week. We will have you back next week. Thanks, again, Sara, appreciate it.\n\nCARTER: Thanks, Sean.\n\nHANNITY: Coming up next, tonight, right here on \"Hannity \"--\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: Millions of hard-working U.S. citizens have been left behind by international commerce. And together we can shape a future where all of our citizens have a path to financial security.\n\n(END VIDEO CLIP)\n\nHANNITY: Today during his joint presser with Angela Merkel, President Trump spoke about putting America first. Up next we will get reaction from Lisa Boothe, Ric Grenell. And then later tonight --\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: It was the best, cocaine, cocaine.\n\n(END VIDEO CLIP)\n\nHANNITY: We will have another preview of our spring break series which begins next week. Do you really want to send your kids and see what they are doing down there? It will shock you, I am sure, straight ahead.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: We must work together towards fair and reciprocal trade policies that benefit both of our peoples. Millions of hardworking U.S. citizens have been left behind by international commerce. And together we can shape a future where all of our citizens have a path to financial security. The United States will respect historic institutions, and we will also recognize the right of free people to manage their own destiny.\n\n(END VIDEO CLIP)\n\nHANNITY: That was President Trump earlier today during a joint press conference with German Chancellor Angela Merkel talking about the need for fair trade policies between the U.S. and our trading partners.\n\nJoining us now with reaction, former U.N. spokesperson Ric Grenell and Fox News contributor Lisa Boothe. Ric, I want to start with you. The most amazing thing, a lot of conservatives like him on the Supreme Court, vetting, the wall, his economic plan that will be upcoming, reforming the tax code, energy independence. But a sticking issue, Ric, is the issue of trade. One of my best friends, Mark Levin, that's the thing he worries about the most. What's your reaction? I think he is negotiating all the time. That is my take, my interpretation.\n\nRIC GRENELL, FORMER SPOKESMAN FOR U.S. AMBASSADOR TO U.N.: Yes, that's the art of the deal. He's a great negotiator. But we also have to remember, Sean, that we have tried to win the presidency before. We haven't won. And we won because we had so many Reagan Democrats, so many union guys in the Midwest come over to Donald Trump. I think that he's onto something here, that we haven't been able to be very successful when it comes to trade deals because we have always put American businesses at a disadvantage when they are trying to go up against other companies from around the world.\n\nSo Donald Trump is onto something. He is a businessman. He's recognizing the fact that our workers have not been at the forefront and he is putting them there.\n\nHANNITY: Lisa, if we can ever get Congress to finish this health care bill-- it's pathetically slow. Arguing in public like this is idiotic to me. I think it should have been a consensus bill from the get-go. Not easy, but putting that aside for just a second, I think Ric is onto something because I call this the forgotten man and woman election.\n\nBut it's really going to be the economic plan to me, allowing trillions of multinational corporate money to be repatriated at a low tax rate, dropping the corporate tax rate from the highest in the industrialized world to the lowest, and of course energy, that's going to be a big component of economic growth, that's going to bring back a lot of the jobs that I think everyone is hoping for. If it comes down to it, is it dangerous to have a trade war? It is wrong to demand free and fair trade?\n\nLISA BOOTHE, COLUMNIST, WASHINGTON EXAMINER: Let's see what President Trump proposes in some of these negotiations. We haven't seen any of that yet. So I think a lot of people jump to conclusions about what we're going to see from President Trump before actually seeing what he are going to do.\n\nTake foreign policy for. President Trump said today, look, I am not an isolationist. And what have we seen since he took office? He said that he was going to take fight to our adversaries, that he was going to stand up for the United States, and he's done just that. He's put sanctions against Iran. The Department of Justice announced on Wednesday that they are indicting Russian officials for the first time for the Yahoo! hacking that happened I think it was in 2014. Rex Tillerson is going to be in China tomorrow to try to put pressure on them, and North Korea is saying that nothing is off the table. This is a guy who is very much engaged on the world stage, very much engaged in protecting America.\n\nHANNITY: Let me get a response from Ric. Ric?\n\nGRENELL: I have spent a lot of time in the Midwest during the campaign, specifically in Cuyahoga County. And I just saw from the beginning in early September, Sean, where you had voters, men and women who were part of unions who have said I just haven't been able to vote for a Republican lately, and I'm really excited. I'm not only voting for Donald Trump but I'm really excited to vote for Donald Trump.\n\nHe is on to something in terms of being able to bring back corporate money back to the United States while at the same time fixing some of these policies that have not benefited our men and women who are working in unions. I was told by one guy in Cuyahoga County that he was a Democrat, a union guy. He didn't want to hear any more about climate change because what he heard when Democrats talked about climate change was that he was not going to be able to build anything anymore. He was an electrical union guy. He wanted to produce, he wanted to go forward, and the Democrats were losing him.\n\nHANNITY: Guys, thank you both. By the way, Ric, your tweets are hilarious. You remind me of me on Twitter.\n\n(LAUGHTER)\n\nHANNITY: Coming up, another sneak preview of our spring break special we begin airing next week. Parents, want to see how out of control the behavior is going on down there, what our cameras captured? That's coming up next.\n\nAnd we need your help, our \"Question of the Day,\" and, yes, some mean messages some of you may have left for me on the \"Hannity\" hotline straight ahead.\n\n(COMMERCIAL BREAK)\n\nHANNITY: Welcome back to \"Hannity.\" It is that time of year again. Your kids are headed off to spring break destinations all around the country.\n\nSo we sent a \"Hannity\" producer once again this time to South Padre Island in Texas to see what's really going on. Parents, you should tune in next week. Here is a sneak peek of what your little kiddies are doing.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED FEMALE: I'm really sorry I got arrested last night.\n\nUNIDENTIFIED MALE: What did you get arrested for?\n\nUNIDENTIFIED MALE: Smoking that dope, bro.\n\nUNIDENTIFIED MALE: When did you start drinking today?\n\nUNIDENTIFIED MALE: At 12:00 p.m.\n\nUNIDENTIFIED FEMALE: Get ready to drink water. You are about to be hung over as --\n\nUNIDENTIFIED FEMALE: You are going to die. You are going to die.\n\nUNIDENTIFIED MALE: We started drinking at, like, 7:00 in the morning.\n\nUNIDENTIFIED FEMALE: Have fun, get -- up. It is hard being an alcoholic 24/7, but I know you guys can do it.\n\n(END VIDEO CLIP)\n\nHANNITY: Our own Ainsley Earhardt will be joining us Monday for our special series, Exposing Spring Break.\" We had a big impact on Panama City Beach in Florida. Now it's time for a \"Question of the Day.\" Very simply, what do you think of President Trump's press conference with Angela Merkel earlier today? Just go to Facebook.com/SeanHannity, @SeanHannity on Twitter, let us know what you think.\n\nNow it is time to play some of the lovely messages you have been leaving for me on the \"Hannity\" hotline. Let's hit it.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: How do you spell \"Hannity\"? H-honest, A-answers, N- nightly, N-news, I-integrity, T-trustworthy, Y-yearns for truth and justice. Job well done. Keep up the good news, Sean. Myself and my wife are deplorables who love you. How about Hannity for president in 2024?\n\nUNIDENTIFIED MALE: Hannity, you say \"I, I, I, I,\" about as often as Obama did. You guys must be brothers.\n\n(END VIDEO CLIP)\n\nHANNITY: Wow. I like the first one. It doesn't matter, nice, mean, whatever you want to say, call the number on your screen right now, 877- 225-8587.\n\nThat's all the time we have left this evening. We hope you had a great St. Patrick's Day. Have a great weekend. We'll see you back here on Monday.\n\nEND\n\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "authors": [], "publish_date": "2017-03-17", "source": "foxnews", "top_words": ["thats", "today", "right", "trump", "reps", "know", "refugees", "think", "going", "scalise", "president", "changes", "talk", "speaks", "blackburn", "health", "coulter", "bill", "video", "care"], "summary": "Now, President Trump and Chancellor Merkel -- they capped off their first visit earlier today by holding a joint press conference.\nBLACKBURN: That's right.\nThey are asking for some cooperation in assisting them in doing that, and I don't think that's a big thing to do.\nWhat Donald Trump, President Trump has made clear, the catch and release days are over.\nThey are debunking the leftwing talking point narrative that President Trump in fact colluded with the Russians."}