{"url": "http://www.foxnews.com/opinion/2017/02/08/trump-s-travel-ban-why-9th-circuit-could-flip-and-unexpectedly-grant-stay.html", "id": "24", "title": "Trump’s travel ban: Why the 9th Circuit could flip and unexpectedly grant a stay", "text": "The U.S. Court of Appeals, 9th Circuit, undertook an extraordinary review Tuesday evening, hearing arguments for and against a stay of district court action that blocked President Trump’s Executive Order on immigration. From the outset, it was a pitched battle before a notoriously liberal Circuit. That said, the Justice Department acquitted itself well – and may have won an upset. If not the Super Bowl, there were surprises.\n\nKick off was simple. Justice briefed a three-judge panel on the need for a temporary pause in migration from seven countries identified by Congress and the prior Administration as terrorist risks. They laid out the President’s constitutional authority, equities against the temporary restraining order, and law that supported a swift stay.\n\nSeconds in, the Carter appointee Judge William Canby interrupted proceedings, demanding “evidence of the need for this executive order.” Findings were patiently offered, including the need to review refugee screening and visa process, as well as recent events.\n\nBefore Counsel for the United States could continue, Canby threw a second block: “Can you point to any evidence connecting these countries to terror?” Justice methodically noted that such evidence has existed for years. Moreover, it was acknowledged by Congress and the prior Administration, which is why the seven countries faced visa restrictions. They present a “significant risk,” making them “countries of concern.”\n\nCanby then assumed the role of a one-man National Security Council. “Isn’t the concept of risk too abstract? Is there any reason to believe there is a real risk? What changes to support significant risk?” Justice kept to the playbook, kept the drive going. “The President determined there is a real risk, “came into office to protect the national security of the country,” and believes “visa screening procedures are crucial.” The Executive Order is grounded and limited.\n\nThe next hit was for terrorism examples. Where had there been terrorist events in the United States traced to these countries? Of course, the answer was that the Executive Order aims to prevent such incidents. Justice began, “people from Somalia have been connected to Al-Shabaab, a terrorist –“\n\nObama’s nominee, Judge Michelle Friedland, interrupted and flew at Justice: “You appealed before you developed the record?” No, said Justice, we “sought immediate relief because a lower court tried to override a presidential decision on level of tolerable national security risk” and “the President is the official charged with making that judgement.”\n\nA tactical switch. “Is the decision reviewable?” pressed Friedland. Yes, was Justice’s answer, but deciding what is “detrimental” to “fundamental sovereignty” is a president’s chore. Judicial review is limited to whether the presidential determination of risk is “bona fides” and “legitimate.”\n\nFriedlander quickly slid into “bad faith.” Referring to the President, she asked: “Are there not allegations of bad faith? Don’t we need to look at that?” Justice got firm. “Review needs to be confined to the four corners of the document,” and “standing.”\n\nJudge Canby now pressed his luck. He now argued that a third party – a State – might bring an action for anyone, as they might for clean air. The analogy flopped. The United States observed, in the immigration context, a third party cannot challenge visa denials. That is case law. Canby cited a case where a wife sued for a husband. The United States spun out of the tackle, noting both had constitutional rights.\n\nNow the field got muddy. These Democrat-appointed judges wanted to reach the merits, but were stiff armed. They wanted to argue the Executive Order offended religious freedom, based on favoring one faith over another and violating the “no establishment” clause, or through “equal protection.” They got little traction.\n\nFinally, Friedland asked: “Could the President simply say he would not let Muslims in?” Justice did not fall for the juke. They ran a tight pattern. “That is not what the Executive Order does.” Later they were blunt, “no.”\n\nNearing halftime, “standing” got discussed, the United States explaining that only citizens have standing in an immigration case. If States could sue on behalf of anyone at any time, the concept of standing would have no meaning. The restraining order was overbroad, president within his rights, stay required. The Democrat-appointed judges had still made yardage.\n\nNext came the States, Washington and Minnesota. They took the field with enthusiasm, first arguing procedure then the constitution. Some quips were simple, others Hail Mary passes – all tinged with recrimination toward the President.\n\nArguing that freedom of religion affected everyone, entitling States to standing, they claimed “irreparable harm” to religious liberty. When they fumbled, they were up fast. But now came another player.\n\nAt last, George W. Bush’s nominee Judge Richard Clifton stepped up. He began throwing pinpoint passes. Where was violation of an American’s religious liberty? Where in the “four corners of the document?” Suddenly, the rejoinder was more “bad faith.”\n\nWhere “bad faith?” The States said, although narrow implementation now preserved rights for visa holders and permanent residents, the order was prejudicial. The text left vulnerable “half a million in the United States.” Judge Clifton was having none of that. He began a new drive.\n\nWhere was nefarious intent, “discriminatory animus?” Where was the constitutional violation, absent text or intent to support the claim? On very weak footing, how did the States claim “likelihood of success” on the merits? Without that likelihood, how could a temporary restraining order stand? The States retreated to remarks about implementation, claims of anti-Muslim.\n\nClifton had them. “A bit of quick pencil math shows that the order only covers 15 percent of worldwide Muslims, how can that produce religious discrimination on either ‘no establishment’ or ‘equal protection’ grounds? How can you infer religious animus from that, if the vast majority around the world are not affected?” Bingo! Touchdown!\n\nWhen the States cited campaign headlines, Clifton noted the lower court held those not relevant. Clifton turned to hard facts. Wasn’t terrorism identified with these seven countries? Weren’t they “countries of concern” based on “significant risk” – as assessed by the prior administration? Was the prior administration “religiously motivated” in making that determination? Another surprise touchdown!\n\nIf the underlying restraining order and arguments against the stay required “likelihood of success” on “religious animus,” and there was none, why not grant the stay? The issue was not about the stay – but about the underlying temporary order. He said the States “misunderstood the standard.” More points, maybe conversions.\n\nFriedland jumped in. They were fumbling. “Weren’t you going to supplement the record with added exhibits” on religious animus? Oh yes, yes, that’s right. The States said they just had not had enough time to prepare. Wrong argument.\n\nClifton threw for final points. “Don’t tell us that you did not have the time to prove likelihood of success – that allegation will not cut it at this stage.” The air was thick with possible reversal, now. Friedland jumped again. “You want a reasoned opinion, right? One that will address your concerns, right?” Yes, yes.\n\nMaybe the winning points – came last. From Clifton. Arguments of national origin, as a basis for discrimination, flew in the face of past lawful orders. Cuba for example? This is the prerogative of a president, right? Isn’t North Korea different from France? Touche!\n\nSo, could the unlikely happen? Could a Ninth Circuit panel, split two-to-one activist judges, actually issue a stay – permitting the President’s Order to stand, at least for now? Might Clifton’s questions convert someone, one of the two? Not likely, but stranger things have happened. This has been an unlikely season start to finish, November through last Sunday. Maybe the unlikely is now likely – or maybe we will meet at the U.S. Supreme Court. We shall all know soon.\n\nRobert Charles is a former assistant secretary of state for President George W. Bush, former naval intelligence officer and litigator. He served in the Reagan and Bush 41 White Houses.", "authors": ["Robert Charles"], "publish_date": "2017-02-08", "source": "foxnews", "top_words": ["stay", "executive", "travel", "risk", "flip", "circuit", "ban", "unexpectedly", "9th", "order", "united", "trumps", "religious", "grant", "countries", "justice", "states", "president"], "summary": "The U.S. Court of Appeals, 9th Circuit, undertook an extraordinary review Tuesday evening, hearing arguments for and against a stay of district court action that blocked President Trump’s Executive Order on immigration.\nWhat changes to support significant risk?” Justice kept to the playbook, kept the drive going.\nOf course, the answer was that the Executive Order aims to prevent such incidents.\nThe United States observed, in the immigration context, a third party cannot challenge visa denials.\nThe text left vulnerable “half a million in the United States.” Judge Clifton was having none of that."}