{"url": "http://www.foxnews.com/us/2017/01/30/trump-travel-ban-jolts-globe-leads-to-legal-fight.html", "id": "241", "title": "Trump's travel ban jolts globe, leads to legal fight", "text": "President Donald Trump's decision to suspend the U.S. Refugee Admissions Program for 120 days and institute a 90-day ban on all entry to the United States from citizens of seven predominantly Muslim countries has sent ripples across the globe, provoked a political reaction at home and led to high-stakes legal maneuvering.\n\nIn signing the order Friday, Trump was fulfilling a campaign pledge to put in place \"extreme vetting\" procedures to keep potential terrorists out of the U.S.\n\nThe temporary ban on admissions applies to citizens of Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen. The order also halts entry to the U.S. by Syrian refugees indefinitely.\n\nHere's a look at the travel ban:\n\n___\n\nWHAT DID IT DO?\n\nThe executive order's fast implementation disrupted travel plans across the globe. Travelers of all types, including tourists, students, immigrants and people returning from vacations, were detained at airports after arriving in the U.S. Some remained in custody overnight. Most were released by Monday.\n\nThousands of people who were counting on the borders being open found themselves in limbo. They included a California man whose 12-year-old daughter, a citizen of Yemen, was prevented from boarding a flight to the U.S., a Syrian doctor who was barred from returning to his studies at Brown University, and an Iranian citizen who found herself stranded in Dubai, unable to return to her home in South Carolina after visiting her mother in Iran.\n\nThe suspension also blocked visas for interpreters who risked their lives to help American troops. The Pentagon is now compiling the names of Iraqis who have supported U.S. and coalition personnel to help exempt them from the 90-day immigration ban.\n\nTrump aides say the disruptions are temporary while the administration tightens security procedures.\n\n___\n\nIS IT LEGAL?\n\nActing Attorney General Sally Yates, a Democratic appointee, directed Justice Department attorneys Monday not to defend Trump's executive order, saying she was not convinced it was lawful. Trump then fired Yates and named longtime federal prosecutor Dana Boente as her replacement. Boente late Monday night directed the Justice Department to defend Trump's order.\n\nExperts said the temporary ban's legality hinges on questions of a president's authority to control borders and whether the policy discriminates against Muslims. Federal law gives the president the power to keep out \"any class of aliens\" who \"would be detrimental to the interests of the United States.\" But a different law prevents discrimination in the issuance of an immigrant visa based on a person's nationality or place of birth.\n\nFederal judges in New York and several other states issued orders temporarily blocking the government from deporting people with valid visas. Washington state's attorney general is suing Trump over the order. The Council on American-Islamic Relations also is arguing in a lawsuit that the ban violates the First Amendment's bar of preferential treatment for a religion by appearing to favor Christian over Muslim refugees.\n\nDissenting diplomats at the State Department were circulating a draft memo Monday lambasting the travel ban, saying it wouldn't make the country safer and would stand \"in opposition to the core American and constitutional values that we, as federal employees, took an oath to uphold.\" White House press secretary Sean Spicer responded that the diplomats should \"either get with the program or they can go.\"\n\n___\n\nHOW HAS TRUMP REACTED?\n\nThe president ridiculed Senate Minority Leader Charles Schumer for choking up at a news conference about the travel ban, accusing him of faking his tears. He blamed disruptions at airports on an airline computer glitch and demonstrations.\n\nAnd he is doubling down. According to a draft document obtained by The Associated Press, Trump is now considering an executive order calling for the identification and removal \"as expeditiously as possible\" of any foreigner from the U.S. who takes certain kinds of public welfare benefits. Such immigrants can already be deported under U.S. law, but the proposed order appears to signal a Trump administration effort to crack down on such cases.\n\n___\n\nWHO LIKES THE BAN?\n\nMany of the voters who propelled Trump into office. Trump drew cheers on the campaign trail when he explicitly promised to temporarily bar Muslims from entering the U.S. until border security was tightened. Supporters say the travel ban is proof that Trump is a man of his word.\n\n\"He's just unafraid,\" said retired social-service worker Judith Wilkenroh, 72, of Fredrick, Maryland. \"He's just going ahead like a locomotive, and I like him more and more every time he does something\n\n___\n\nHOW HAVE GLOBAL U.S. CORPORATIONS REACTED?\n\nHarshly. Executives from technology companies, which employ many immigrants, were some of the first to speak out. Tim Cook, the CEO of iPhone maker Apple Inc., told employees in a memo obtained by The Associated Press that his company does not support the order. \"Apple would not exist without immigration,\" Cook said.\n\nGoogle said it is donating cash to organizations that support immigrants. The heads of Ford, Coca-Cola, Goldman Sachs and e-commerce companies Amazon.com Inc., eBay Inc. and Etsy Inc. said they did not support Trump's order, as did the head of video streaming company Netflix Inc.\n\nGeneral Electric Co. CEO Jeff Immelt said the industrial conglomerate would make its \"voice heard\" with the new administration and Congress.", "authors": [], "publish_date": "2017-01-30", "source": "foxnews", "top_words": ["travel", "jolts", "trump", "fight", "ban", "immigrants", "support", "states", "trumps", "leads", "globe", "press", "order", "temporary", "legal"], "summary": "The temporary ban on admissions applies to citizens of Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\nBoente late Monday night directed the Justice Department to defend Trump's order.\nThe president ridiculed Senate Minority Leader Charles Schumer for choking up at a news conference about the travel ban, accusing him of faking his tears.\nSupporters say the travel ban is proof that Trump is a man of his word.\nGoogle said it is donating cash to organizations that support immigrants."}