{"url": "http://www.foxnews.com/transcript/2017/02/09/court-rejects-national-security-argument-for-travel-ban.html", "id": "213", "title": "Court rejects national security argument for travel ban", "text": "Watch the latest video at video.foxnews.com\n\nThis is a rush transcript from \"Special Report with Bret Baier,\" February 9, 2017. This copy may not be in its final form and may be updated.\n\nCHRIS WALLACE, ANCHOR: Let me just briefly reset the situation. And that is that the Ninth Circuit Court of Appeals has handed down its ruling. It has upheld the temporary restraining order from that federal judge in Washington, as I say, temporary restraining order stopping President Trump's executive order limiting travel from seven largely-Muslim nations and from all refugees coming into the country, an indefinite suspension of refugees from Syria. He said it was a matter of national security until they can figure out a more effective, extreme vetting measure to be able to tell who was coming into the country and whether they meant us harm or not.\n\nLet's bring in our panel to discuss these stunning developments: Lisa Boothe, columnist with the Washington Examiner; Julie Pace, White House correspondent for the Associated Press; and syndicated columnist Charles Krauthammer. I'm sure, Julie -- you've been on your little machine there trying to find out.\n\nJULIE PACE, ASSOCIATED PRESS: Right next to me.\n\nWALLACE: Any reaction?\n\nPACE: No reaction yet. I'm in the same boat as John Roberts right now. We expected this to come down a little bit later this evening. This caught a lot of people by surprise but we are expecting something from the White House soon.\n\nAs John said, I think we are probably going to have the official reaction and then the presidential Twitter reaction. But more broadly, beyond what the White House just says today and this is a big blow to the President in his first month in office.\n\nYou usually don't see this kind of check on presidential power this early in a presidency, although certainly this case will go on through the legal system.\n\nWALLACE: What did they expect? In others words, there had been comments and you could tell it in President Trump's remarks after the hearing, after he had listened in on the hearing. He was pretty contemptuous of the lawyers, the three judges in that Court of Appeals panel. Did they think this was going to against him?\n\nPACE: They weren't really trying to make predictions on it but certainly they listened to the audio that we all heard, when these judges were being pretty tough on the government lawyer in trying to get to the heart of the matter. I think the argument that you're going to see from the White House going forward, we're already starting to hear this broadly, is that presidents -- and this is true -- have a lot of sway over national security decisions. And because this goes forward in the court system, you're going to hear them try to back up that argument. That this is the president of the United States using intelligence information that he has to try to protect national security.\n\nWALLACE: Of course one of the -- and let me bring Lisa into this. One of the counter arguments there was the judge, and again, you know, there is some interesting facts. You hear the judge in federal district court in Washington state arguing with the president about national security but he said there is no evidence that any of the people from these seven countries have committed fatal terrorist attacks and that the -- the argument about national security doesn't hold much sway.\n\nLISA BOOTHE, WASHINGTON EXAMINER: Well, I think for the Trump administration, the haziness has hurt the administration. Whether it was the chaos over green cards or the fact that they move forward without having the Supreme Court nominee in place. And I think we've seen a lot of tension in Congress, and that's only going to escalate because the Democratic Party right now is going to be looking for any winds that they can get. They can certainly point to this as a win. Exploit this as a win. And it's also going to further hurt President Trump as he tries to move forward both his Cabinet nominees as well as his Supreme Court nominee.\n\nWALLACE: I mean, when you think of the fact that President Trump so clearly came in and some of his top people came in as disrupters. They were going to shake up Washington, they're going to change the system, and they were going to, as the president said, there is a new sheriff in town. He just got a full stop sign, a red light from a district court judge in Washington and the Ninth Circuit Court of Appeals.\n\nBOOTHE: Well, yes. I mean, I think a lot of people voted for President Trump because they wanted that disruption, they wanted that change, they wanted some of the things that he, you know, said that he was going to do, draining the swamp, if you will. But there's also checks and balances to that as well. We're obviously seeing that play out in the courts as well, and I think we'll also see that play out in Congress, as well. I mean, right now he's sort of moved forward just with executive actions but at some point he's going to have to govern, he's going to have to work with Congress to move legislation forward. You know, so we're going to see some of those checks and balances play out here in the next -- next few months. And as we're witnessing tonight as well.\n\nWALLACE: Charles. It's something, isn't it? That's my question for you.\n\n(LAUGHTER)\n\nCHARLES KRAUTHAMMER, SYNDICATED COLUMNIST: Right. It's good that you keep it open ended. Because I've got a lot to say.\n\nWALLACE: Go.\n\nKRAUTHAMMER: Look, the new sheriff is discovered. And unlike Dodge City, in Washington, there are other pre-existing institutions and he has just run into one. Now I think the judge -- the district court judge in saying that the threat is not what the president thinks it is way over stepping his bounds. His job is not to decide to weigh the national security issues having to do with immigration.\n\nI happen to agree with the judge, but that doesn't matter. The president has the constitutional authority to decide. He may have decided wrongly but he has the authority. And the judge, I think, was wrong.\n\nI don't think there's anybody who should be surprised that he was upheld by the Ninth Circuit. It's the most overturned, most left-wing court in the country. I just hope that the administration was ready for this with a contingency plan. I will remind you that when the district judge ruled against the administration, they did not file a brief for 24 hours. It should have been ready in 10 minutes to be handed over. And I hope they have -- now that they have an attorney general, at least in place to be -- they have a strategy for what they're going to. And my advice would be don't go to the Supreme Court because it will bounce back.\n\nWALLACE: Because there will be a tie?\n\nKRAUTHAMMER: It'll be a tie. You're not going to get in. You'll be back in the Ninth. Go back to the district court. And I suspect, as a pure, cynical political ploy, why not have it as an issue? You'll blame the court if anything happens. You'll be able to say you're being stymied. You need to have a fifth justice on the court for political, raw, cynical reasons. I think it would be advantageous to let the stay stand. I don't know what they are going to decide but they should have a contingency plan ready as of yesterday.\n\nWALLACE: But, you know, I was going to say, regardless of the merits of this argument, the idea that courts can sit there and say your argument about national security doesn't persuade us, that's happened before during the Bush administration.\n\nThere were several decisions after 9/11 that President Bush made and the Supreme Court, several times, said no, you've gone too far here. You've got to stop.\n\nKRAUTHAMMER: It's not been unusual but it is unusual for it to happen in the first 10 days of a new administration.\n\nWALLACE: I assume unprecedented.\n\nKRAUTHAMMER: With Obama, the temporary stay on his immigration, legalization of the five million illegal immigrants in the country, was stayed by a district judge in Texas and remained in place up until today until the time ran out for Obama and it effectively died.\n\nSo this happens on all sides, but, you know, Trump himself, with his tweets and his anger and his responses, has elevated this to an issue where it's monopolizing our show as if it was like the handing of the Ten Commandments from Sinai. It's a ruling from the Ninth Circuit that everybody should have expected.\n\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "authors": [], "publish_date": "2017-02-09", "source": "foxnews", "top_words": ["travel", "forward", "national", "ban", "security", "argument", "judge", "know", "court", "think", "going", "rejects", "president", "washington"], "summary": "And because this goes forward in the court system, you're going to hear them try to back up that argument.\nThat this is the president of the United States using intelligence information that he has to try to protect national security.\nHe just got a full stop sign, a red light from a district court judge in Washington and the Ninth Circuit Court of Appeals.\nNow I think the judge -- the district court judge in saying that the threat is not what the president thinks it is way over stepping his bounds.\nHis job is not to decide to weigh the national security issues having to do with immigration."}