{"url": "http://www.foxnews.com/transcript/2017/02/07/assistant-to-president-trump-on-legal-battle-over-travel-ban-why-trump-has.html", "id": "207", "title": "Assistant to President Trump on legal battle over travel ban; Why Trump has authority to put ban in place", "text": "Watch the latest video at video.foxnews.com\n\nThis is a rush transcript from \"Hannity,\" February 7, 2017. This copy may not be in its final form and may be updated.\n\nSEAN HANNITY, HOST: And this is a Fox News Alert. We are awaiting a decision from the U.S. 9th Circuit Court of Appeals after hearing oral arguments earlier today over a challenge to President Donald Trump's temporary travel ban. Now, this ruling could come down at any moment. We'll have the breaking news if, in fact, it does. Ed Henry will also have a full report on what happened in court today. Also analysis from Laura Ingraham, Jay Sekulow, Boris Epshteyn, Tami Lahren, Corey Lewandowski will all be here tonight.\n\nBut let me give you the truth of what's really going on and the analysis that nobody on TV is going to give you. This legal battle that you're watching unfold over President Trump's extreme vetting executive order to keep you safe is just one of many tools in (ph) the Democrats and what is a master plan to obstruct and damage President Donald Trump. And that is tonight's \"Opening Monologue.\"\n\nSo the Democratic Party and their liberal allies are plotting, planning, scheming to slow down, stop, and even destroy President Donald Trump and the agenda that you voted him to be president for.\n\nNow, the Washington Free Beacon is now reporting on the tactics that the left is already deploying. Now, we have not independently verified this, but according to the Washington Free Beacon, left-wing agitator David Brock, the founder of Media Matters, huge Clinton ally, hosted a private getaway in a ritzy resort last month. Over 100 rich liberal donors were there. And the Free Beacon obtained a copy of a confidential memo outlining Brock's plan year to year and their plan to take down President Donald Trump.\n\nNow, the document details how to expand Media Matters' mission, file lawsuits against the president, and even describes ways to impeach Donald Trump.\n\nNow, we reached out to Media Matters for comment on the Washington Free Beacon report, and instead of being truthful and honest, Media Matters, they did what they always do. They don't answer our questions, and instead they took a shot at me.\n\nBut David Brock's plan is not a secret. News outlets like Politico, The Hill have all reported on his post-election plans to go after President Trump every single solitary day. So what's happening is what you see going on now with this temporary travel ban and this lawsuit. It's just part of the Democrats' larger strategy, and it's becoming more and more obvious exactly what they're doing.\n\nWhat they've done here is they've gone court and judge shopping, and they have found the most liberal federal appeals court in the country to battle the Trump administration. The law which the Trump administration is using to defend the president's constitutional executive order is very clear. There's no ambiguity here. It reads the following: \"Whenever the president finds that the entry of any aliens or any class of aliens into the United States would be detrimental to the interests of the United States, he\" -- meaning the president -- \"may by proclamation and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or non-immigrants or impose on the entry of aliens any restrictions he made deem to be appropriate.\"\n\nNow, the left knows this, so that's why they're targeting liberal courts, liberal justices. That's why they're going judge shopping and finding jurisdictions that they know will be favorable to them, so that they can basically -- what they want to do here is ram their radical agenda down your throat. In other words, what they can't get done at the ballot box, what they can't get done legislatively, they're using the courts through judicial activism whether it's in your best interests or not.\n\nNow, we'd be very, very foolish to ignore what is the bigger plan here, and that's what tonight's hearing is all about. Now, they know that the list of seven countries that are affected by the president's temporary travel ban, well, they came directly from the Obama administration and Congress. But they don't care about that because the left's goal is to hurt President Donald Trump any way they can. And it doesn't matter if you and the American people -- it doesn't matter to them if you are put in danger because of this.\n\nNow, this comes down to what I have been telling now you for a week. It's the inconvenience of a few people that are not American citizens versus the safety and security of every American, and what's more important here, the willingness of one party, the Democratic Party and their allies, they are willing to gamble with your life. The president is not. That's what this debate is about.\n\nJoining us now in Washington with a full report on today's court hearing, our own Ed Henry. Very interesting, but I also think they went off track as to what the actual, well, legal questions before them were today in the 9th circuit.\n\nED HENRY, FOX NEWS CORRESPONDENT: Well, that's right. Good evening, Sean. The stakes are certainly high for President Trump because, as you suggest, this could be the beginning of a long legal, constitutional and political struggle.\n\nFor now, though, this three-judge panel is looking at a more narrow question of whether the president has the legal authority to do this and whether a U.S. district judge, who was attacked by the president on Twitter, overstepped with that restraining order to stop extreme vetting of refugees.\n\nNow, the president declared today this is common sense, that he's protecting the country, and he got some air cover from his homeland security secretary, John Kelly. While Kelly admitted the rollout was sloppy of the executive order and he should have delayed it to consult with Congress, the secretary said the president is correct that this is legal, and Kelly warned terrorists may have made it into America because of this district judge blocking the executive order.\n\nYet the administration's own lawyer struggled to make that very case to this panel of two Democrats and one Republican, a panel from, as you noted, the liberal 9th circuit court of appeals. And these judges hammered the Trump claim that several states cannot sue on behalf of businesses and residents. It got so rough that the administration lawyer admitted he wasn't breaking through.\n\n(BEGIN VIDEO CLIP)\n\nAUGUST E. FLENTJE, SPECIAL COUNSEL: I'm not sure I'm convincing the court, so I want to make one really key point with regard to the injunction. And that is that it is over-broad and should be immediately stayed to the extent it is over-broad even if the court thinks some applications of the order are problematic.\n\n(END VIDEO CLIP)\n\nHENRY: But a lawyer for Washington state struggled himself to back up the claim that the president is targeting Muslims. His best evidence was an interview Rudy Giuliani did with Fox News where the mayor suggested the president had him devise a Muslim ban just by another name. But one judge poked major holes in that by noting the executive order does not impact a majority of Muslims. Listen.\n\n(BEGIN VIDEO CLIP)\n\nJUDGE RICHARD R. CLIFTON, 9TH CIRCUIT COURT OF APPEALS: The seven countries encompass only -- I think a relatively small percentage of Muslims. I mean, do you have any information as to what percentage or what proportion of the adherents to Islam worldwide are citizens or residents of those countries? My quick penciling suggest it's something less than 15 percent.\n\nNOAH G. PURCELL, SOLICITOR GENERAL, OLYMPIA, WA: I have not done that math, Your Honor.\n\n(END VIDEO CLIP)\n\nHANNITY: He did not do the math yet. Interesting.\n\nFour possible scenarios now moving forward. The restraining order from the district judge -- they could just find that it cannot be appealed and throw this out. The states they could find lack standing to bring the case at all.\n\nThere are two other outcomes. The restraining order was improperly issued by the lower court, or that the restraining order was properly issued by the lower court and they could stop the executive order. In either one of those last two scenarios, Sean, this is likely to go on to the Supreme Court, where they'll fight it out. And let's remember, there's currently a basically a 4-4 split waiting for Judge Gorsuch.\n\nHANNITY: All right, there's more to that, too, because it might just end up in the hands of Anthony Kennedy. We'll get into that with our guests. Great report, Ed Henry.\n\n(CROSSTALK)\n\nHANNITY: And joining us how with reaction, special assistant to President Trump Boris Epshteyn is with us. I was a little shocked, Boris, to be honest. I felt that the government side, there were points that were left on the table that I would have made. Were you happy with the way it was argued?\n\nBORIS EPSHTEYN, SPECIAL ASSISTANT TO THE PRESIDENT: Absolutely, Sean. I mean, this is again is a procedural oral argument. The key issue here is, is that TRO, temporary restraining order over broad? And of course it is. It applies to folks that are not even in this country. And it's absolutely clear that TROs cannot be that broad and cannot have one judge in Washington state acting as a chief executive of this country.\n\nHANNITY: OK. The case is very straightforward. And I was a little -- well, not surprised because of the history of the 9th circuit court of appeals. They have been the most overturned court in history. But more important, this is a straightforward case. The president has the undisputed constitutional, statutory and legal authority to do what he did here!\n\nWhat gives them standing in this case, this judge standing or Seattle standing or the argument that they were trying to make that somehow, irreparable damage happened here, which made no sense to me whatsoever? These are not American citizens we're talking about.\n\nEPSHTEYN: Well, Sean, you're referencing -- you'd be a great lawyer. What you're referencing there are the merits. And we are very confident when this case is heard on the merits, just like in the case in the Massachusetts district court, this administration and thereby the American people will prevail in keeping this country secure and Americans safe.\n\nHANNITY: Why do you think and is it frustrating to you that they were asking specific questions about the percentage of worldwide Muslims impacted by this? The one judge, Richard Clifton, in the case, he says, Well, by my estimate, it was 85 percent are not impacted by this. So the term Muslim ban, which we all knew was false and fake news -- he was basically agreeing was not applicable here. And secondly, I'm listening to the arguments being laid out. I didn't think they laid a glove on the law, which is...\n\nEPSHTEYN: Well, there's a -- there's a -- you know, a lot of leftist spin out there in terms of calling it somehow a religious test. It absently is not that. This president has been very clear. And the executive order is very clear that this executive order is meant to make sure Americans are secure and those countries which have trouble providing information on those going from that country to the United States are already on a list, and the list was put together by President Obama and his State Department. And these are countries which are known as countries of concern, which again, cannot vet its own people.\n\nSo we need to provide that extreme venting. All we're talking about here is a 90-day pause in the case of these seven countries. That's all there is. And is that not worth it...\n\n(CROSSTALK)\n\nHANNITY: I can name 43 Muslim-majority countries, Boris, that are not impacted by this ban in any way, shape, matter or form...\n\nEPSHTEYN: That's right.\n\nHANNITY: ... including the most heavily populated in the world, not impacted in any way. Boris, thank you. Appreciate it.\n\nEPSHTEYN: Sean, thanks so much.\n\nHANNITY: And joining us now with much more on this, the editor-in-chief of Lifezette, Fox News contributor Laura Ingraham, and from the American Center for Law and Justice, Jay Sekulow is with us.\n\nYou filed an amicus curiae in this case, an amicus brief in this case. Are you as shocked as I am? I felt that you put in issues in your brief that the government and the Department of Justice representative that was arguing -- they should have been using that they didn't use! Did you see information and law left on the table here?\n\nJAY SEKULOW, AMERICAN CENTER FOR LAW AND JUSTICE: I did. You know, look, I think this is a really clear-cut case. The lawyer for the Department of Justice was asked a question, Are you saying -- this was from the judges -- that the president has the authority to do this on his own initiative? Is this his authority exclusively?\n\nAnd the answer to that question should have been immediately, Yes! That's what the Constitution says. That's what the statute says. But the Department of Justice lawyer hedged for a long time, and then they -- as you just mentioned, they adopted this fallback position that, Well, if you think it's over-broad -- and I've done over-broad statute cases at the Supreme Court -- you could strike down part of it but uphold part of it.\n\nThat is not the way you do this! The way you go into this case is the president had the authority to do this, period! The court may disagree with the policy, but that isn't the legal issue! The legal issue is, Does the president of the United States have the authority, statutorily, constitutionally to make this determination, this, as the statute says, this proclamation to put in place what he did here? And the answer to that is, Absolutely, he does. And it's...\n\n(CROSSTALK)\n\nSEKULOW: This is not a big issue, but...\n\n(CROSSTALK)\n\nSEKULOW: Yes.\n\nHANNITY: Let me go to Laura. There were really a simple issue before the court, does the president have the authority? I just put up the law. It's very clear constitutionally. The legislative branch gave him the authority. It's his number one job as commander-in-chief. Did the judge have the authority to put the ban in place? Beyond that...\n\nLAURA INGRAHAM, FOX NEWS CONTRIBUTOR: Well...\n\nHANNITY: ... the 9th circuit judges asking these questions about, Well, after 9/11...\n\nINGRAHAM: Yes.\n\nHANNITY: Go ahead.\n\nINGRAHAM: It was frustrating to watch. This is a frustrating argument for a lot of us to watch, I think, because this Justice Department lawyer is a career lawyer arguing this case on the telephone. This -- clearly, the Trump team was not ready -- and Jay, I bet you agree with me on this -- was not ready to defend this executive action in court.\n\nSEKULOW: Right.\n\nINGRAHAM: The petition should have been filed in every circuit court in the country within 10 minutes of this thing, frankly, being challenged. And we knew it was going to be challenged. They should have the petition already written for the Supreme Court because we know it's going there.\n\nAnd yet there seemed to be hesitation when he was asked about, Well, what evidence did the president have to believe that these seven countries -- I'm thinking to myself judges are now second- guessing the executive authority of the president of the United States who is the commander-in- chief, and in whom the Constitution vests the power to...\n\nHANNITY: All right, let me ask both of you...\n\n(CROSSTALK)\n\nINGRAHAM: ... types of matters.\n\nHANNITY: I was listening to the special counsel of Department of Justice, and I'm thinking, Wait a minute. Where is the solicitor general? Or Donald Trump...\n\nINGRAHAM: Not confirmed. Not appointed.\n\nHANNITY: ... even bringing in -- OK, or even bringing in temporarily outside counsel, strong, disciplined advocates instead of a career DOJ guy...\n\nSEKULOW: Yes.\n\nHANNITY: ... that I didn't get the impression even did his due diligence in preparing for this case? Jay, I don't fault the administration.\n\nSEKULOW: You know, what Laura said is...\n\nHANNITY: I fault the Department of Justice.\n\nSEKULOW: ... absolutely correct. I mean, it was -- it was painful to watch this. I mean, this was painful to listen to this argument. And it's because the lawyers didn't have their heart in it. And Laura's also absolutely correct. This is going to the Supreme Court, so none of the questions asked by these judges, including the ridiculous question about motive -- you know the answer to that should have been when they asked that question? So what? What does that have to do with it!\n\nHANNITY: It's irrelevant!\n\nSEKULOW: This isn't an evidentiary hearing.\n\nHANNITY: Right. Exactly.\n\nSEKULOW: This is a decision where a district court judge enjoined the president of the United States from something he has the statutory and constitutional authority to do! That is the only question there, and they just weren't ready.\n\nAnd I really do think the solicitor general's office should have been in there. I know we don't have a confirmed SG yet, but there are career SGs that are familiar with the appellate process.\n\nHANNITY: Well, in that sense...\n\nSEKULOW: This was a very...\n\n(CROSSTALK)\n\nSEKULOW: ... critical of other lawyers, but this was horrible argument.\n\nHANNITY: But this is important because the Democrats' purposeful delaying of the president even getting his attorney general in place or the solicitor general in this particular case hurt the president because now you have a career special counsel at the DOJ.\n\nINGRAHAM: Right.\n\nHANNITY: All right, let's talk about the next step. Knowing that the most overturned appeals court in the country is the 9th circuit, the most liberal, let's assume they were to rule against the administration, which is a possibility, although I was a little surprised that their questioning seemed to favor the administration more than I would have suspected.\n\nBut Laura, my question to you is...\n\nINGRAHAM: Yes.\n\nHANNITY: ... if they do not go with the administration, let's walk through the process. Doesn't it go to Anthony Kennedy?\n\nINGRAHAM: Yes, he's the justice in charge of the 9th circuit. So -- and Jay, you can back me up on this. I believe -- I mean, this is a big waste of time on the 9th circuit. They can go right to the Supreme Court. These are exigent circumstances involving matters of national security and the sovereignty of the United States going right to the executive branch powers.\n\nThis entire 9th circuit charade is not going to get them anywhere. They got to go right to the Supreme Court. I know it's 4-4, but I think they could win at the Supreme Court...\n\nSEKULOW: I do, too.\n\nINGRAHAM: ... because this case is ridiculous, regardless of what people think of the underlying merits. And let me just add one more...\n\n(CROSSTALK)\n\nINGRAHAM: Let me add one more thing.\n\n(CROSSTALK)\n\nINGRAHAM: Well, I would hope that sort of Sotomayor would cross over on this, or a Breyer. But let me just say this. I hope the administration has learned a really important lesson in this. You do not issue these types of executive orders that you know are going to be hot without your legal team in place. You need Sessions. You need the SG. You need the deputy SG. You need U.S. attorneys in place. You need all your ducks in a row and you need to make the case to the American people as to why this is necessary.\n\nI think a lot of this has become a distraction and an albatross around the administration's neck, and I think a lot of it is unnecessary.\n\nHANNITY: All right, let's go to process one more time, and then I want to move on to some of the political arguments I made in my \"Opening Monologue,\" Jay. In the process, assuming the 9th circuit, predictably liberal, legislating from the bench -- they don't go along with the administration, even though he has the constitutional, statutory, legislative authority to do it. So assume it goes to Anthony Kennedy. Walk us through what the options for Kennedy are. He can decide on his own or put it before the entire court.\n\nSEKULOW: Yes, so he can -- he can grant the stay. He could deny the state or he could refer it to the entire Supreme Court. I think the latter is more likely.\n\nAnd I'm with Laura. I think there are justices that normally, you wouldn't expect on a case like this, but I think this cuts across ideology. I mean, like I say, the four liberal members of the Supreme Court may completely disagree with the president's position on this, but that doesn't answer the legal question. And I think they would be hard-pressed, any of them, frankly, to say that the president did not have this authority.\n\nAnd by the way, this argument that this was an establishment clause case -- I mean, I spent 30 years...\n\nHANNITY: That was the most absurd...\n\n(CROSSTALK)\n\nSEKULOW: ... at the Supreme Court. That was absurd. Absurd.\n\n(LAUGHTER)\n\nHANNITY: I almost laughed when I heard -- because they've used the establishment clause...\n\nINGRAHAM: Laughable!\n\nHANNITY: ... for just about everything. All right, let me go to my \"Opening Monologue\" for a second here. This is what the Washington Free Beacon put out. Oh, I hope I didn't write any bad words on here. OK, I didn't. Democracy Matters...\n\n(LAUGHTER)\n\nHANNITY: Oh, Laura, you know, I'm -- I'm -- you're both attorneys! Protect me here! All right, this is what they're planning...\n\nINGRAHAM: Red line!\n\n(CROSSTALK)\n\n(LAUGHTER)\n\nHANNITY: So they're at this ritzy resort. They got all these big Democratic donors there. They lay out a plan, and among their plan of action is defeating Trump through impeachment. This is where it gets serious. The next aspect is they're going to combat anything that they disagree with, they say government misinformation, and then filing lawsuits against Donald Trump.\n\nINGRAHAM: Absolutely.\n\nHANNITY: Do both of you agree with...\n\nINGRAHAM: Yes, I mean...\n\nHANNITY: ... my analysis that this was not Seattle by accident, this was Seattle by...\n\nSEKULOW: (INAUDIBLE)\n\nHANNITY: This was judge shopping. This was 9th circuit shopping. They had thought through this strategy, and this was all done by design, and the Trump administration be better paying very close attention to what they are going to do to tie up in knots every part of his agenda. Jay.\n\nSEKULOW: Yes, well, listen, absolutely. And they specifically chose Washington state and they specifically did that because not only is it a liberal state judicially, but also it's in the 9th circuit. But what Laura said has got to be underlined and underscored. And that is the administration better be prepared for an ongoing litigation battle. And that's why you got to get these people confirmed and in place.\n\nBut the fact of the matter is, you got to be prepared for litigation here, and frankly, on this one, the Department of Justice -- and I've got a lot of respect -- I've worked with the Department of Justice. It was very disappointing to see what happened today.\n\nBut yes, the politics of this do not bode well, so they've got to get their act together...\n\nHANNITY: You see, I don't...\n\nSEKULOW: ... here.\n\nHANNITY: I don't blame the administration is much as you are here for a lot of different reasons. You know, the Democrats...\n\nSEKULOW: I blame DOJ, actually.\n\nHANNITY: Wait. The level of obstruction, the fact that Jeff Sessions is not the attorney general at this moment...\n\nSEKULOW: Yes.\n\nHANNITY: ... we need a solicitor general, the president could have brought in outside counsel -- that would have been viewed as controversial in and of itself. So we're stuck with a career -- and I'm not criticizing the guy, I just felt he left too many great points on the table and could have been better prepared.\n\nINGRAHAM: Well...\n\nSEKULOW: Yes.\n\nHANNITY: Laura?\n\nINGRAHAM: Yes, well, I -- again, this is what we have to expect. I told a top member of the administration a couple weeks after the election, looked him right in the eye and I said, I hope you understand every day, this is going to be a war. This is going to be a war to delegitimize your government. It's going to be a war to get you off track, get you on the defensive, get you to say stuff out of anger and then say, Aha, see, I told you so, get you to be tied up in knots in the legal system so you can't see straight. So you have to be ready for this.\n\nNone of us can be naive. You know, the Democrats are going to play the same smashmouth politics that they believe they were embarrassed by over the last year-and-a-half by Trump. They want vengeance.\n\nHANNITY: Let me...\n\n(CROSSTALK)\n\nINGRAHAM: They don't have a lot of power, but they have a lot of money.\n\nHANNITY: Laura, I've been saying the same thing in my own way in a different way. Every item on the Trump agenda -- this is extreme vetting. We're going to see this with originalists like Neil Gorsuch that the president made, I thought, a great nomination in that case. When the president does move forward with any aspect of repealing, replacing \"Obama care,\" there's going to be grandma is going to be dead in the streets.\n\nWhen he cuts taxes for the middle class and corporations, it'll be tax cuts for the rich. When it comes to energy, he wants to poison the air and water. When it comes to education, the NEA will scream bloody murder.\n\nINGRAHAM: Right.\n\nHANNITY: When it comes to any of these issues, building a wall, racism, xenophobia. You're right, this is the left's only strategy. They actually put it on paper! We have -- we know what their plan is.\n\nINGRAHAM: Yes.\n\nHANNITY: So going forward, we got to know or the administration's got to know...\n\nINGRAHAM: Be smart.\n\nHANNITY: Be smart. Jay?\n\nSEKULOW: Prepare for litigation because this is exactly what is going to happen. And when you are prepared for litigation, then you can answer the question that you're asked in a particular case.\n\nHANNITY: Well, don't you think Jeff Sessions...\n\nSEKULOW: And today, that didn't happen.\n\nHANNITY: ... would have done a much better job...\n\n(CROSSTALK)\n\nSEKULOW: I don't blame the president here. This was not the president's call.\n\nHANNITY: I agree with you. I don't blame the president at all.\n\nSEKULOW: This was a problem at Department of Justice, and we need to have leadership in these various agencies to get this under control. This was almost...\n\nHANNITY: But it's also the Democrats, Jay!\n\nSEKULOW: ... not litigated today in an embarrassing kind of way.\n\nHANNITY: If Jeff Sessions were the attorney general, this would be a very different hearing tonight.\n\nSEKULOW: Absolutely.\n\nHANNITY: Both agree with that? I agree with it.\n\nSEKULOW: Yes.\n\nHANNITY: I agree with myself.\n\nINGRAHAM: Well, yes, well, the question -- the -- the -- the answers would have been better. There wouldn't have been that hesitation. You wouldn't have heard the lawyer say, Well, this has been a fast process, or whatever he said. You wouldn't have that.\n\nSEKULOW: Oh, that was horrible.\n\nINGRAHAM: But I'm not sure the outcome would have been very different in the end.\n\nHANNITY: All right...\n\n(CROSSTALK)\n\nHANNITY: ... because it's the 9th circuit, and you're right to both jump forward and look to the Supreme Court because...\n\nINGRAHAM: They've already decided, Sean.\n\nHANNITY: But Laura...\n\nINGRAHAM: Sean, they've already decided this case. This case is decided already.\n\nHANNITY: Agree.\n\nINGRAHAM: They've already decided.\n\nHANNITY: I think...\n\nINGRAHAM: They went in, they already decided.\n\nHANNITY: I tend to agree with you. Jay was a little more optimistic when I spoke to him earlier on my radio show. But I know both of you, and you're both great attorneys. And without any preparation, I feel both of you could have done a better job. And I shouldn't feel that way, but I do blame the Democrats for their obstruction. That's hurtful to the president.\n\nINGRAHAM: Yes, well, I think...\n\nSEKULOW: I thought, Sean, the failure to answer the key question was the case was over before it started. I think the goose -- look, I think the goose was cooked, so to speak. But the argument itself -- you don't necessarily win a case in argument. You can sure lose them. And they had a tough road to go with the 9th circuit anyways, but not answering the first question, which was the key question, was just horrible.\n\nHANNITY: Yes. I also think Laura...\n\nINGRAHAM: Yes.\n\nSEKULOW: Painful.\n\nHANNITY: ... I think the fix was in. That's why they judge shopped. This is now -- every case is going to be going to the 9th circuit, and it's a waste of our time.\n\nGuys, good to see you both.\n\nINGRAHAM: Yes.\n\nHANNITY: Great analysis and insight. Thank you.\n\nUp next tonight, right here on this busy news night on \"Hannity\"...\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: It's gotten to a point where it's not even being reported, and in many cases, the very, very dishonest press doesn't want to report it.\n\n(END VIDEO CLIP)\n\nHANNITY: The president calling out the media for underreporting terrorist attacks, and the liberal press -- they're losing their mind. Corey Lewandowski, Matt Schlapp, they'll weigh in.\n\nAnd also later tonight...\n\n(BEGIN VIDEO CLIP)\n\nREP. MAXINE WATERS, D-CALIF.: The fact that he is wrapping his arms around Putin while Putin is continuing to advance into Korea...\n\n(END VIDEO CLIP)\n\nHANNITY: Huh? Korea? Somebody better tell Congresswoman Maxine Waters who's talking about impeaching Trump Putin isn't invading Korea!\n\nLater tonight also, we'll hear from Tami Lahren (ph). She's going to react to all of the liberal lunacy, and she's making a big, bit play all over social media with her commentaries. We'll talk to her about that and much more as we continue.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: Radical Islamic terrorists are determined to strike our homeland as they did on 9/11, as they did from Boston to Orlando to San Bernardino and all across Europe. You've seen what happened in Paris and Nice. All over Europe it's happening. It's gotten to a point where it's not even being reported. And in many cases, the very, very dishonest press doesn't want to report it. They have their reasons, and you understand that.\n\n(END VIDEO CLIP)\n\nHANNITY: All right, that was President Trump yesterday claiming the mainstream media often under-reports terror attacks all across the globe, which I agree with. Naturally, many members of the press took offense to those comments, even with some suggesting that the president was actually lying, which is now their favorite obsession. Watch this.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: President Trump told a U.S. military audience that there have been terrorist attacks that no one knows about because the media choose not to report them. It has been a busy day for presidential statements divorced from reality.\n\nUNIDENTIFIED FEMALE: For a president citing what he's called fake news...\n\nTRUMP: It's all fake news. It's phony stuff.\n\nUNIDENTIFIED FEMALE: Donald Trump appearing to deliver some of his own today about terror attacks abroad.\n\nUNIDENTIFIED MALE: This appears to be a talking point that is in search of a set of facts that just doesn't exist.\n\n(END VIDEO CLIP)\n\nHANNITY: Now, the media freak-out over President Trump. Over at MSNBC yesterday, Katy Tur made this stupid and outrageous remark. Take a look.\n\n(BEGIN VIDEO CLIP)\n\nKATY TURN, NBC CORRESPONDENT: What is your sense of why this president is going above and beyond, bending over backwards, if you will, to stay away from criticizing the Russian president and almost give him an excuse? As we know, there since 2000 been a couple dozen suspicious deaths of journalists in Russia who came out against the government there. Donald Trump has made no secret about going after journalists and his distaste for any news that doesn't agree with him here. Do you find that this is a dangerous path he's heading down?\n\n(END VIDEO CLIP)\n\nHANNITY: I don't even know what to say except nobody saw it except that you watched it here because nobody watches that station.\n\nAnyway, we're also awaiting the decision tonight about the appeals court, the 9th circuit, about President Trump's temporary travel ban. As soon as we hear, we will bring that to you live.\n\nFirst, joining us now, former Trump campaign manager, partner at Avenue Strategies, and that's Corey Lewandowski. And with the American Conservative Union, their chairman, Matt Schlapp is with us.\n\nYou know, Corey, as I look at this, this is how I see this. The lead up to 9/11 was the Khobar Towers. The lead up to 9/11 was the embassy bombings in Kenya and Tanzania. The lead up to 9/11 was the first Trade Center bombing, the USS Cole. The aftermath was the 9/11 Commission report. They are at war with us, we weren't at war with them. The president is pointing out with context and texture and example after example that the world is denying a reality and they've adopted a pre-9/11 mindset. And this is how they interpret his remarks. If we don't pay attention, we're going to wake up to another 9/11. That's what he's trying to say, at least my interpretation. What say you?\n\nCOREY LEWANDOWSKI, FORMER TRUMP CAMPAIGN MANAGER: Sean, what we know about this president is that he has been very clear he's going to put Americans first. And what that means when you're the president of the United States is making sure that you are vetting people who are coming in from potentially terrorist countries or known terrorist countries to make sure that we know who these people are and they're not going to commit jihad against us.\n\nOur immigration system is so fundamentally broken that we let a woman come into the country legally who committed mass jihad in San Bernardino. We need to do better. This president has pledged to do that that.\n\nHANNITY: Matt?\n\nMATT SCHLAPP, FOX NEWS CONTRIBUTOR: Yes. I just think it's amazing, we have just a terrible terrorist attack in San Bernardino, as Corey was talking about, and you know what President Obama called that? He put the flags at half-mast and in the order that came from the White House, he called it workplace violence.\n\nI think the American people are going to be with Donald Trump on this immigration policy and they're going to be with him on the broader question of protecting the homeland. And I think it's very important, I thought your previous segment had it exactly right. He's got to get the team around him. These policy fights are so important for the safety of the country and they are so important to have early success in this administration.\n\nHANNITY: Let me put up on the screen, this was put out by \"The Federalist,\" 16 news stories reporters have run that are fake news. The Martin Luther King bust, add to this the fact that they say a Muslim ban. If 43 countries, majority Muslim countries, and 90 percent of the world's Muslim population are not included, and this came up from both Congress and President Obama in terms of the seven countries that President Trump picked, how did they get away with all of these lies, Corey? This is just outright lying, and we know they colluded in the election with Hillary through WikiLeaks.\n\nLEWANDOWSKI: Don't let facts get in the way of reporting. Look, what we know that the media nowadays doesn't want to report facts. What they want to do is they want to report a story that sells more clicks and gets them more access to their website and generates more newsworthy stories for them.\n\nAnd what happens, as you know, Sean, is these reporters want to become the story. They don't want to report the news. They want to be the news. That's the difference nowadays.\n\nHANNITY: NBC, ABC, CBS, CNBC, MSNBC, CNN is the worst, Matt. I don't even know at this point why the Trump administration bothers to talk to these people. They are just a waste of time. All they want to do is call every representative from the administration a liar. I'm getting sick of watching it.\n\nSCHLAPP: Look, there's a lot of Americans that watch these stations. And there are choices out there on the dial, we all know that. They should turn to you first, Sean. Of course we know that as well. But the fact is this, which is that's why he's using Twitter. That's why he's talking directly to the American people. It's working.\n\nBut let me tell you something else. The American people know the liberals left wing. They know most members of the media vote for the Democratic candidate. They know they were with Hillary. They know the cast of \"Saturday Night Live\" was with Hillary. This is not surprising to the American people. They know there's a bias in the press.\n\nHANNITY: Guys, good to see you both. Appreciate your insight as always.\n\nWhen we come back, we are awaiting a decision from that U.S. ninth circuit court of appeals over President Trump's temporary travel ban. But first tonight.\n\n(BEGIN VIDEO CLIP)\n\nREP. NANCY PELOSI, D-CALIF., HOUSE MINORITY LEADER: We've seen nothing that I can work with President Bush on, and I am disappointed because I thought that there might be some interest because of what he said in the campaign.\n\n(END VIDEO CLIP)\n\nHANNITY: She can't work with President Bush? Somebody help this woman. He's not the president. Tomi Lahren, a social media superstar, is here to weigh in next. And also later tonight.\n\n(BEGIN VIDEO CLIP)\n\nPRESIDENT DONALD TRUMP: I just want to let you know that our job is to help you in law enforcement and we're going to help you do your job.\n\n(END VIDEO CLIP)\n\nHANNITY: President Trump, he met with sheriffs from all across the country today at the White House. Two members of law enforcement who were in that meeting will tell us what exactly what went on as \"Hannity\" continues on this busy news night.\n\n(COMMERCIAL BREAK)\n\nHANNITY: And this is a Fox News alert. We are awaiting a decision for the U.S. ninth circuit court of appeals about President Trump's temporary travel ban. As soon as they rule, we will bring you that news live. But first, at a press conference yesterday on Capitol Hill, Democrats were a little bit confused about current events when attempting to attack President Trump. You can't make this up. Take a look.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED FEMALE: I have not called for impeachment yet. He's doing it himself. Whether he's talking about his relationship with Putin and the Kremlin, knowing that he is responsible for supplying the bombs that killed innocent children and families in in Aleppo, and the fact that he is wrapping his arms around Putin while Putin is continuing to advance into Korea.\n\nPELOSI: We've seen nothing that we can work or I can work with President Bush on, and I'm disappointed because I thought because there might be some interest because of what he said in the campaign.\n\n(END VIDEO CLIP)\n\nHANNITY: You see the faces of Maxine Waters and the other guy behind her, President Bush, Russia invading Korea. Joining us now with reaction, the host of \"Tomi\" on the Blaze, Tomi Lahren, who is a social media sensation. I met you at when was it, at the inauguration of Donald Trump and at one of the after parties. And I didn't get a chance to ask you, but I've seen these viral videos of you where you have 45 million people watching you. And I'm going to break all the rules but you're not politically correct so I can. You're 24 years old, and yet you are so conservative, which by the way, warms my heart. How did you become so conservative?\n\nTOMI LAHREN, HOST, \"TOMI\" ON THE BLAZE: I've got to be honest. I think political correctness is intellectual dishonesty and I don't even know if I'm necessarily conservative. I'm honest. And that often lends itself to conservatism, I'll agree with you. But listen to Nancy Pelosi, listen to the farm team for the Democratic Party. They might as well be taking out their pantsuits for Trump's 2020 inauguration, it's that bad.\n\nHANNITY: It really is that bad. But how did you develop, for example, I don't know why when I was young and a teenager I had the radio on. My parents wouldn't say turn off the TV. They would say shut that radio off. I can't take it. At 2:00 in the morning I'd be listening to great pioneers of talk radio. Where did you develop I won't say conservative, but let's say conservative/libertarian, maybe, ideology and philosophy? That's unusual, 24 years old, to be fearless, outspoken on television, and getting as much popularity as you are.\n\nLAHREN: I grew up in that area of the country that's between the two coasts, the forgotten Americans. I grew up there and I had parents who are hardworking, average, everyday Americans. That also lends itself to conservatism. But I've got to tell you, Sean. I grew up watching this mainstream media and seeing a lot of BS perpetuated by the mainstream media, and I wanted to grow up and I wanted to combat that. So I started off at an early age, and we're just getting started.\n\nHANNITY: Did you support President Trump?\n\nLAHREN: You know, I didn't from the outset. But when he became our nominee it was a clear choice. It was Hillary Clinton or Donald Trump. The more that I got involved with some of the campaign activities, the more I heard President Trump speak, I got on board, because mostly I saw average, everyday Americans in the military, in law enforcement, the blue-collar Americans, I saw them gravitating towards him because they said, guess what, this man is it doing something amazing. He's running against the Democratic Party and in some ways the Republican Party, as well and he won.\n\nHANNITY: And he won, and I called it the forgotten man, forgotten women election, and there's a reason Ohio, Michigan, Wisconsin, and Pennsylvania, because these people are dying. They need jobs in manufacturing. By the way, same with kids, young people in big cities, they need jobs also and they're desperate.\n\nLet me ask you this. I've seen a lot of attacks against you, and I've watched from a distance. I don't know you. I only met you the one time. You're at a young age, and I started fairly young as well, a little older than you, about 27. How are you handling that? Do you care? Because I very early learned that I've got to just turn it off and not care, and now I actually in a very kind of sick twisted way enjoy it. How do you handle the attacks against you?\n\nLAHREN: I don't give it any attention. Honestly, Sean, sometimes they love you, sometimes they hate you. Either way, I'm still here. Either way, I still gets paid, and I'm still voicing the truth. So in order for me to give respect to what they're saying I have to respect them. And when they're on the Internet trolling me, saying nasty, disgusting, vile things, which, by the way is really a true testament to the unloving and intolerant left, I laugh it off because it's just a testament to what I'm doing. I'm getting under their skin and I love it.\n\nHANNITY: That's the fun part. That's what I've enjoyed watching as you move forward.\n\nAre you happy with how Donald Trump, how fast he's been acting keeping his promises? Because that to me is not something you see very often, especially in Washington, D.C.\n\nLAHREN: Oh, of course not. The swamp is freaking out. They don't know what to do. A president that's actually keeping his election promises, a president that's actually being proactive to bring jobs back, to protect our national security instead of being reactive like we saw for the last eight years, I'm amazed by it. I've got to tell you I'm pretty happy. And it's not just it upsets the liberals so much, but in a sick, twisted way that's also pretty entertaining for me.\n\nHANNITY: Tomi Lahren, congratulations on all your success. You can catch her on \"The Blaze.\" Her videos are usually viral, unlike my videos. They don't go viral. I'm too old, I guess. But we wish you all the best and will have you back. Thank you so much.\n\nLAHREN: See you soon.\n\nHANNITY: And up next tonight here on \"Hannity.\"\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: I just want to let you know that our job is to help you in law enforcement, and we're going to help you do your job.\n\n(END VIDEO CLIP)\n\nHANNITY: The president listening to sheriffs from all across the country today at the White House. We're going to speak to two of the sheriffs that were that were in that meeting. They'll bring us inside. That's next, straight ahead.\n\n(COMMERCIAL BREAK)\n\nHANNITY: Welcome back to \"Hannity.\" Today President Trump held the listening session, how refreshing, by the way, with sheriffs from all across the country at the White House, and here's what he told them. Take a look.\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: I just want to let you know that our job is to help you in law enforcement, and we're going to help you do your job. We will work with you on supporting your long-standing efforts to strengthen the bonds between the communities and the police, which is very important. It is sort of a new phenomenon to a certain extent. And it's happening more and more, some great results when you can strengthen the bonds.\n\n(END VIDEO CLIP)\n\nHANNITY: The president also promised that his administration is committed to border security and stopping terrorist attacks. Let's watch this.\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: We're committed to securing our borders to reduce crime, illegal drugs, human trafficking, especially in border counties, a lot of the border counties represented. We're also committed to working with law enforcement to stop terrorist attacks. You've been reading about that and seeing about that. They want to take a lot of our powers away.\n\n(END VIDEO CLIP)\n\nHANNITY: Joining us now with reaction are two law enforcement officers that were in that meeting, Rockingham County, North Carolina Sheriff Sam Page and Hennepin County, Minnesota, Sheriff Richard Stanek. Good to see you. Sheriff Page, let me start with you. Bring us inside the room, and, by the way, how refreshing. How different that the Cambridge police acted stupidly, Trayvon Martin, what happened at Ferguson or Baltimore. It's kind of refreshing to get some law enforcement support I would assume from a president.\n\nSHERIFF SAM PAGE, ROCKINGHAM COUNTY, NORTH CAROLINA: Absolutely. It's something we haven't seen in about eight years.\n\nHANNITY: Tell us about it. Bring us in the room.\n\nPAGE: Like I said, when we got in there, the president was basically saying he wanted to cooperate. He wanted to support collaboration between local, state, and federal law enforcement. He wanted to secure our borders, and that's a first. And again, he made a promise, we support him in that effort. And again, we're committed to work with him and his administration.\n\nHANNITY: Sheriff Stanek, are you seeing what we call the Ferguson effect that officers are now afraid to do their job for fear that, like when Obama was president, there would be a rush to judgment?\n\nSHERIFF RICHARD STANEK, HENNEPIN COUNTY, MINNESOTA: I think there's great hesitation at this point because of that very thing. Under the former president come out law enforcement were hamstrung. We weren't sure which way to turn. President Trump today laid it right on the line. He told us, look, local law enforcement, elected sheriffs of this country, do the right thing. We will support you and in turn our nation's elected sheriff's told him we have his back.\n\nHANNITY: I think that's really important. Do you feel that law enforcement should be in the business of supporting the federal government? I'll ask this to Sheriff Page. In other words, should law enforcement at the local level help to enforce federal laws, especially on immigration?\n\nPAGE: Let me say this, we work with federal taskforces at the local, state, and working with our federal partners.\n\nHANNITY: Some cities don't.\n\nPAGE: Again, I understand. But we have a lot of law enforcement officers across the country that work with these federal partnerships, so that's already there. But as far as situation on the sanctuary cities situation here, we all took an oath, an oath to obey the law and to uphold the law. And that's what we have to do. We have to do our job. We can't pick and choose what laws we are going to enforce. We have to enforce the law. And we need to work with our federal, local, state partner spirit\n\nHANNITY: I've got to leave it there, unfortunately, because we're out of time. Please tell the men and women that serve our communities in both your local communities thank you for what they do, and thank you both for what you do as well, putting your life on the line for all of us, we appreciate it.\n\nComing up, we need your help. A very important \"Question of the Day\" on this busy news night. Please stay with us.\n\n(COMMERCIAL BREAK)\n\nHANNITY: Welcome back to \"Hannity.\" Time for our Question of the Day. So who do you think is the worst offender of fake news, ABC, NBC, CBS, MSNBC, Politico, New York Times? You want my opinion? They are all lazy, they're all overpaid, especially on TV, and they're all a bunch of ideologues that are out of touch with people in poverty, on food stamps, and out of work.\n\nGo to Facebook.com/SeanHannity, @SeanHannity on Twitter. We'll see you back here tomorrow night.\n\n\n\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "authors": [], "publish_date": "2017-02-07", "source": "foxnews", "top_words": ["thats", "travel", "case", "battle", "trump", "ban", "place", "assistant", "know", "court", "think", "going", "law", "president", "authority", "video", "legal"], "summary": "News outlets like Politico, The Hill have all reported on his post-election plans to go after President Trump every single solitary day.\nThe stakes are certainly high for President Trump because, as you suggest, this could be the beginning of a long legal, constitutional and political struggle.\n(CROSSTALK)HANNITY: And joining us how with reaction, special assistant to President Trump Boris Epshteyn is with us.\n(END VIDEO CLIP)HANNITY: President Trump, he met with sheriffs from all across the country today at the White House.\nA president that's actually keeping his election promises, a president that's actually being proactive to bring jobs back, to protect our national security instead of being reactive like we saw for the last eight years, I'm amazed by it."}