{"url": "http://www.foxnews.com/opinion/2017/03/17/sean-hannity-alt-left-judges-put-american-lives-at-risk-by-blocking-travel-ban.html", "id": "28", "title": "Sean Hannity: Alt-left judges put American lives at risk by blocking travel ban", "text": "It was not hard to see this coming. Two President Obama-appointed federal U.S. district judges have blocked President Trump's revised travel ban executive order from taking effect.\n\nTrue to form, President Trump is fighting back, and reminding his supporters why they voted for him. You’ve got to love it.\n\n“Hundreds of refugees are under federal investigation for terrorism and related reasons,” Trump said at a rally in Nashville this week. “We have entire regions of the world destabilized by terrorism and ISIS. For this reason, I issued an executive order to temporarily suspend immigration from places where it cannot safely occur.\n\n“A judge has just blocked our executive order on travel and refugees coming into our country from certain countries,” he added incredulously.\n\nI've been saying for quite a while that this is all part of the radical alt-left's strategy to undermine and delegitimize the president. In this case, they are cherry picking liberal judges to rule against what are very legal, constitutional executive orders.\n\nBut these activist judges aren't just slowing down the president's agenda. They're putting the lives of Americans in jeopardy. It is clear the alt-left would rather score cheap political points than listen to the repeated warnings about the risks of letting unvetted foreigners into this country. And it's important for the left to hear this because these warnings that ISIS would infiltrate the refugee flow initially came from Obama-era top U.S. national security and intelligence officials.\n\nOne by one, Obama administration officials acknowledged the possibility to lawmakers over the last few years. They included former Director of National Intelligence James Clapper; ex-CIA Director John Brennan; Nicholas Rasmussen, Obama’s National Counterterrorism Center director; Assistant FBI Director Michael Steinbach; and State Department spokesman and former Navy Admiral John Kirby.\n\nBut FBI Director James Comey said it best, on Oct. 21, 2015.\n\n“We can only query against that which we have collected,” Comey said. “And so if someone has never made a ripple in the pond in Syria in a way that would get their identity or their interests reflected in our database, we can query our database until the cows come home, but we're not going to -- there'll be nothing show up because we have no record on that person.”\n\nIt is an outright dereliction of duty to ignore these warnings. I urge the alt-left critics of the ban to take a look at Fox News’ reporting from last week, in a story headlined, \"Iraqi insurgent fighter allegedly lied about identify, got through 'extreme vetting.’”\n\nAmerica needs to make a very profound, yet very simple choice. Do we want to sacrifice our safety over the fears of slightly inconveniencing a few people? And is there really something wrong with finding out if people who want to come to this country agree with our values, constitutional rights and principles?\n\nIt’s time to put protecting lives over political correctness. We cannot allow the alt-left to drag us back into the pre-9/11 mindset. Since that dark day, when 2,996 Americans died and more than 6,000 more were injured, we’ve had plenty of reminders to stay vigilant.\n\nWe saw what happened at the finish line in the Boston Marathon bombing in 2013. Terrorists took the lives of four people, including two policemen, and injured 264 innocent people.\n\nIn 2015 in San Bernardino, Calif., a jihadist couple slaughtered 14 and wounded 22 at a holiday party.\n\nAnd just last June, at Pulse nightclub in Orlando, Fla., a radical Islamist gunned down 49 and wounded 53 more.\n\nThese are just a few of the many terror attacks and plots that have occurred on American soil in the last two decades.\n\nIf the radical alt-left wants to continue to undermine the president's ability to keep Americans safe, and a single person dies because Trump's extreme vetting policy is being blocked, they will have blood on their hands. They will own it.\n\nAdapted from Sean Hannity's monologue on \"Hannity,\" March 16, 2017\n\nSean Hannity currently serves as host of FOX News Channel’s (FNC) Hannity (weekdays 9-10PM/ET). He joined the network in 1996 and is based in New York. Click here for more information on Sean Hannity.", "authors": ["Sean Hannity"], "publish_date": "2017-03-17", "source": "foxnews", "top_words": ["executive", "travel", "lives", "risk", "judges", "hannity", "ban", "national", "warnings", "radical", "sean", "blocking", "order", "director", "altleft", "president", "american"], "summary": "Two President Obama-appointed federal U.S. district judges have blocked President Trump's revised travel ban executive order from taking effect.\nFor this reason, I issued an executive order to temporarily suspend immigration from places where it cannot safely occur.\n“A judge has just blocked our executive order on travel and refugees coming into our country from certain countries,” he added incredulously.\nIn this case, they are cherry picking liberal judges to rule against what are very legal, constitutional executive orders.\nAdapted from Sean Hannity's monologue on \"Hannity,\" March 16, 2017Sean Hannity currently serves as host of FOX News Channel’s (FNC) Hannity (weekdays 9-10PM/ET)."}