{"url": "http://www.foxnews.com/us/2017/02/05/iranian-americans-feel-stuck-confused-afraid-travel-ban.html", "id": "268", "title": "Iranian Americans feel stuck, confused, afraid of travel ban", "text": "Iranian-American supermarket supervisor Alan Tahmasebi voted for Donald Trump last year, hoping a businessman would be more trustworthy than a politician.\n\nThe 35-year-old now sorely regrets it, seeing the havoc wreaked upon his fellow countrymen — and his family — since the new president issued a temporary travel ban on refugees and citizens from seven Muslim-majority countries, including his former home.\n\nTahmasebi and his wife have spent more than $7,000 on green card applications for their parents. Now, their parents are in limbo overseas as the Irvine couple awaits the birth of their second child.\n\n\"It was a land of opportunity but now, I don't think so,\" he said. \"They wish to come here and visit my new baby. They never worked with the army, with the government (in Iran) — I have no idea what is going on.\"\n\nThe ban has rattled Americans with ties to the listed countries, and its effects are perhaps most widespread among the country's thriving Iranian American community. The U.S. has nearly 370,000 Iranian immigrants, according to U.S. Census Bureau estimates, far more than the other countries targeted by the order.\n\nWhile Tehran and Washington have a lengthy history of friction, personal ties between residents of the two countries have held strong. Many Iranian Americans travel back to visit family or bring aging parents to join them in the U.S.\n\nSince Trump imposed the travel ban, tension between the two governments has continued to rise.\n\nOn Friday, Iran barred U.S. wrestlers from an important international tournament. The same day, the Trump administration imposed sanctions on 13 people and a dozen companies in response to Iran's recent ballistic missile test, increasing pressure on Tehran without directly undercutting a nuclear deal with the country.\n\nLater Friday, a federal judge temporarily blocked the travel ban following a lawsuit by Washington state and Minnesota that said Trump's order is causing significant harm to residents and effectively mandates discrimination.\n\nA federal appeals court on Sunday denied a Justice Department request for an immediate reinstatement of the ban, meaning the legal fight will continue for days at least.\n\nIranian Americans said they are perplexed as to why Iran is even on Trump's list, noting the country is not mired in war like Syria and Yemen. In addition, many Iranians came to the United States after the 1979 Islamic Revolution in search of religious and personal freedom and continue to cherish those ideals.\n\n\"There's two things in my country — one is people, one is government,\" Tahmasebi said. \"This new law is not for the government. It's for the people, who like the United States.\"\n\nIn the Southern California suburb of Irvine, a tidy strip mall hosts a pharmacy, bakery and dental office that cater to clients in English and Persian. At the supermarket, Tahmasebi said customers relish persimmon and other produce from Iran, but if relations between the countries sour further the store may have to bring in Pakistani or Chinese goods instead.\n\nThe vast majority of the country's Iranians and Iranian Americans live in California. The sizable community in Los Angeles — which includes members of diverse religious groups, including Muslims, Christians, Jews and Baha'i — has led some to adopt the nickname \"Tehrangeles.\"\n\nJeannine Stepanian, a 32-year-old lawyer who helped travelers detained at Los Angeles International Airport last weekend, said she comes from a family of refugees. First, her Armenian grandparents fled to Iran. Then, her parents, who are Christian and were born in Iran, sought safe haven in the United States after the Islamic Revolution.\n\n\"I felt like it could have been any one of my relatives this could have been happening to,\" said Stepanian, adding she is outraged by the ban.\n\nTrump's order placed a temporary halt on visitors and refugees from Iraq, Iran, Syria, Sudan, Libya, Somalia and Yemen. But citizens of these countries who are legal permanent residents in the United States initially were held for long hours at airports, and those who have immigrant visas also were denied entry.\n\nAli Vayeghan was stopped at the Los Angeles airport even though he had an immigrant visa. U.S. authorities put him on a plane back to Iran, but lawyers intervened to get him returned to the United States so he could reunite with his wife and son and get his green card.\n\nHis niece, 32-year-old artist Marjan Vayghan, said her friends have been nervously asking each other since the ban whether they have green cards or U.S. citizenship.\n\n\"There is this sense of, 'Are you a citizen, or do we need to Anne Frank you in our homes?' This is a situation where everybody is afraid,\" she said. \"We don't know who among us is safe.\"\n\nNow, many Iranians — even those who are legal permanent residents or American citizens — are rethinking their plans.\n\nMehran Sahraeian, a 51-year-old pharmacy technician, said he's been pleading with his mother not to visit his sister in Canada lest she face problems returning.\n\nEli Majd, a 37-year-old mother of two, said her husband is visiting family in Iran and she worries about him being able to return — even though he is an American. Sam Yebri, a 35-year-old lawyer, said his family probably won't vacation abroad for now because although he is a U.S. citizen, his passport lists his birthplace as Tehran.\n\n\"I have no problem with the security apparatus. There are concerns just about being an Iranian American at this time, I think, until cooler heads prevail,\" Yebri said.\n\nAt the Irvine supermarket, 45-year-old Iranian American Mary Far said she hasn't returned to Iran in two decades. She was hoping to go this summer to visit her brother and sister, whom she hasn't seen since she left the country. But with the travel ban, she isn't sure she'll make the trip.\n\n\"It affects a lot of people,\" she said. Then she burst into tears.\n\n___\n\nAssociated Press writer Christine Armario in Los Angeles contributed to this report.", "authors": [], "publish_date": "2017-02-05", "source": "foxnews", "top_words": ["iran", "travel", "ban", "family", "confused", "visit", "iranian", "united", "stuck", "countries", "afraid", "feel", "states", "americans", "american"], "summary": "The ban has rattled Americans with ties to the listed countries, and its effects are perhaps most widespread among the country's thriving Iranian American community.\nMany Iranian Americans travel back to visit family or bring aging parents to join them in the U.S.\nSince Trump imposed the travel ban, tension between the two governments has continued to rise.\nThere are concerns just about being an Iranian American at this time, I think, until cooler heads prevail,\" Yebri said.\nBut with the travel ban, she isn't sure she'll make the trip."}