{"url": "http://www.foxnews.com/transcript/2017/02/08/legal-showdown-over-president-trump-travel-ban.html", "id": "209", "title": "Legal showdown over President Trump's travel ban", "text": "Watch the latest video at video.foxnews.com\n\nThis is a rush transcript from \"The Five,\" February 8, 2017. This copy may not be in its final form and may be updated.\n\nERIC BOLLING, CO-HOST: Hello, everyone. I'm Eric Bolling along with Kimberly Guilfoyle, Bob Beckel, Dana Perino, and Greg Gutfeld. It's 5 o'clock in New York City and this is \"The Five.\"\n\nThe fate of President Trump's temporary travel ban is still in question as the liberal Ninth Circuit Court of Appeals takes another day to decide whether to uphold the ruling or strike it down. The court announced earlier there will be no decision today. The president still staunchly defending the need for his executive order, listen.\n\n(BEGIN VIDEO CLIP)\n\nPRESIDENT DONALD TRUMP: It was done for the security of our nation, the security of our citizens so that people come in who aren't going to do us harm. A bad high school student would understand this. Anybody would understand this. Right now, we are at risk because of what happened.\n\n(END VIDEO CLIP)\n\nBOLLING: One of the issues that came up during oral arguments yesterday was whether to consider statements by President Trump about Muslims while he was on the campaign trail.\n\n(BEGIN AUDIO CLIP)\n\nAUGUST FLENTJE, ATTORNEY, JUSTICE DEPARTMENT: We're not saying the case shouldn't proceed, but it is extraordinary for a court to enjoin the President's National Security determination based on some newspaper articles, and that's what has happened here.\n\nRICHARD CLIFTON, JUDGE, NINTH CIRCUIT COURT OF APPEALS: Stop, stop. This is Judge Clifton. Do you deny that in fact the statements attributed to then-candidate Trump and to his political advisors and most recently Mr. Giuliani, do you deny those statements were made?\n\nFLENTJE: Judge Clifton, no. I would note that Judge Robart himself said that he wasn't going to look at campaign statements.\n\n(END AUDIO CLIP)\n\nBOLLING: President Trump thinks the courts need to stop playing politics.\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: I don't ever want to call it court biased, so I won't cal it biased. And we haven't had a decision yet, but courts seem to be so political. And it would be so great for our justice system if they would be able to read a statement and do what's right. And that has to do with the security of our country which is so important.\n\n(END VIDEO CLIP)\n\nBOLLING: All right KG, we'll do politics in a second but hearing that back and forth between the Department of Justice's lawyer and then the appellate court judges, any indication on what they may be thinking?\n\nKIMBERLY GUILFOYLE, CO-HOST: Well it was interesting because I agree with so many of the legal experts and I said this last night on O'Reilly that this line of questioning was inappropriate. They are supposed to examine the executive order based on the four corners of the document. They were bringing up inappropriate line of questioning by saying things like well, Rudy Giuliani called at this and, you know, President Trump said this about -- irrelevant.\n\nIt's whether or not he in fact has the ability and the authority to protect national security and issue this executive order, and he in fact does. So whether they decide to legislate from the bench as a whole other matter but this is the Ninth Circuit Court of Appeals. They are well known for being quite liberal.\n\nBut there are two out of the three that are liberal justices and there is one that would be termed more of a moderate conservative. So it could split down on a 2-1 decision, but it shouldn't, because he has the authority and that's quite simply stated in the document.\n\nBOLLING: Yes, hold that. Here's the document, section 212 of the INA of the U.S. Code 1182. Just give me a second, the entry of any aliens or any class of aliens into the United States would be detrimental to the interests of the United States, the president may by proclamation suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants or impose on the entry of aliens, restrictions he may deem to be appropriate.\n\nNow Dana, the law seems clear, yet we may get an appellate court that says no. Sorry, Donald, you're not allowed to do this.\n\nDANA PERINO, CO-HOST: Well, another thing that -- because we're used to get everything where you press a button on your phone and something happens and your delivery comes whatever. This decision is not going to be that quick. The other thing is this is not even on the merits of the executive order itself. This is on the question of whether there can be a temporary restraining order.\n\nSo you haven't even gotten to a question of the original lawsuit filed by the State of Washington was on the merits. This hearing was about the temporary restraining order, which if ruled against the government, then they could find another path. I do think -- I wouldn't bring up the candidates statements but I do think that within that same weekend when you have Mayor Giuliani saying that he was asked to put together a Muslim ban that I think that that is admissible in terms of not looking back. I don't think there's anything wrong with him bringing it up.\n\nGUILFOYLE: And absolutely inadmissible because absolutely not allowed to be brought up. It has no bearing on it whatsoever what Rudy Giuliani or Joe Blow down the street says about it because it's -- it has no bearing on this. Whether the president has the authority to protect the country as a matter of national security says the president shall deem. No one else. Not VP or anybody else.\n\nPERINO: I'm not disagreeing that the president doesn't have that authority. I don't know what the ruling would be in a court but let's say that they want to use that. There's a reason that on the question of popularity of this executive order. It is not being split because of partisanship that is unnecessary.\n\nThe executive order is actually fairly narrow in scope but you can't even get to that point because you're talking about statements that were made on the record by somebody who said they were advising the president.\n\nBOLLING: All right, let me do a little politics with me, Greg. So, if this appellate court does come back and say no, I'm sorry, Donald Trump, we're going to uphold the stay. Then Trump wanted to push it forward. The Department of Justice wanted to go further -- it goes to a 4-4 Supreme Court.\n\nGREG GUTFELD, CO-HOST: It's going to be crazy.\n\nPERINO: But he could win 8-0. Literally, President Trump --\n\nBOLLING: Based on the merits.\n\nPERINO: -- could win 8-0 that win on the merits. I believe that, yes.\n\nBOLLING: Go ahead.\n\nGUTFELD: She answered my question.\n\nBOLLING: There you go.\n\nPERINO: Sorry.\n\nGUTFELD: All right. So let's talk about the fact that Giuliani actually said Muslim banned. He was talking about a Muslim ban and we're dealing with the most liberal judges -- Paula Abdul. These are the people that actually --\n\nBOLLING: How's that?\n\nGUILFOYLE: Interesting --\n\nGUTFELD: -- that actually said that this is -- this ban is harmful to citizens. I mean they actually believe that. That is the opposite of common sense. The vetting has no imposition -- imposes no problems on the citizens. It's garbage. So where does this reaction come from? It comes from the fact that these liberal judges are educated on liberal campuses who now equate national security to oppression.\n\nThe idea of protecting your family is somehow xenophobic and mean-spirited that you think that maybe you should have borders and maybe you should vet terrorists. In many of these judges minds are just another country's freedom fighter and that we are actually at fault. I think that's where this comes from. It bleeds out from academia and now we're going to end up having quite fight at the Supreme Court.\n\nBOLLING: You know what drives me crazy, KG, what is it, 10 circuits, 11, 12?\n\nGUILFOYLE: No, this is the ninth circuit that's in San Francisco --\n\nBOLLING: Right, but I think its 10 circuit, right. So, this one circuit, this one area is dictating what the rest of the policy should be for the rest of the country. Meanwhile there is one in the northeast that says his temporary travel ban is OK and constitutional.\n\nBOB BECKEL, CO-HOST: Well, Donald Trump is about to find out that there's three branches of government and his signature does not automatically make policy or make bad law. The fact of the matter is, I keep coming back to this, the last (ph) Yemen who had anything to do with terrorism in this country was 1975, number one. Number two, if you really want to be serious about this --\n\nBOLLING: Talk to Obama about that.\n\nGUTFELD: It's not a Muslim ban.\n\nBECKEL: If you want to be serious about it then ban people from Saudi Arabia and Pakistan. They're the principal --\n\nGUTFELD: That's why it's not a Muslim ban.\n\nGUILFOYLE: Why are you talking about Yemen? It's the hot bed of terrorism.\n\nGUTFELD: He targeted countries that have no centralized government. They have no government.\n\nGUILFOYLE: They are failed states.\n\nBOLLING: The Obama administration first --\n\nBECKEL: Wait a second, wait a second.\n\nGUILFOYLE: They're failed states.\n\nBECKEL: The people who sponsored this and paid for it are the Saudi's and the people who train are the Pakistanis. Those two countries alone are so much more important than these other ones. He picked -- this is low-hanging fruit.\n\nGUTFELD: Then why did Obama picked them?\n\nGUILFOYLE: But they have vetting process.\n\nPERINO: No, but I think there is a difference and that the paperwork and the passport details, all of that stuff, you can work with the Saudi government and the Pakistani government and others on those things.\n\nGUILFOYLE: Correct.\n\nPERINO: But if you have a failed state like in Somalia or Yemen or Sudan - - there's another place. I think that it makes sense to put those countries on.\n\nGUTFELD: I think you're right.\n\nBOLLING: But Bob --\n\nGUILFOYLE: She's right and that's what General Kelly exactly said.\n\nBOLLING: Iraq is on the list.\n\nBECKEL: That's what I mean. What about Iraq.\n\nBOLLING: But here's the point.\n\nGUTFELD: They're on the list.\n\nGUILFOYLE: Iraq is on the list.\n\nBOLLING: These are the seven countries that the Obama administration first pointed out. So, if you're going to point a finger on someone having a \"Muslim ban,\" look at the Obama administration for that.\n\nBECKEL: It's not a question if the Obama -- they're wrong. First of all they didn't put a temporary ban on anybody from those countries, but the other thing is, what they're talking about -- I understand that there are training taking place in those countries but I still contend that 90 percent of the training comes from Pakistan and we're still doing it, why, because we don't want to lose Pakistan as an ally in that part of the world.\n\nPERINO: But you can -- but the United States government can work with a functioning Pakistani government on (INAUDIBLE). We do have that kind of cooperation.\n\nBECKEL: Well we could do it with Iraq -- we run the government in Iraq.\n\nGUILFOYLE: That's a fact.\n\nGUTFELD: But doesn't it bother you that the idea of fighting ISIS is being conflated with targeting Muslims? You would hate that.\n\nBECKEL: Yes, I agree with that but ISIS was the first group to come out and say they were so happy about this ban and they were going to use this for recruitment --\n\nGUTFELD: Reverse psychology Bob.\n\nPERINO: But they will use everything --\n\nGUILFOYLE: Bob, they say that about everything.\n\nBECKEL: All right, well, we'll see.\n\nBOLLING: Can we do this? Let's listen how both sides are arguing the case. Here is the Justice Department's attorney. Listen.\n\n(BEGIN AUDIO CLIP)\n\nFLENTJE: In 2015 and 2016, both congress and the administration made determinations that these seven countries posed the greatest risk of terrorism. The president determined that there was a real risk. That's why the president determined that the best course was a temporary -- it's a short halt in entry for 90 days while these procedures are looked at, and that's understandable. The president comes into office with an obligation to protect the national security of our country.\n\n(END AUDIO CLIP)\n\nBOLLING: And not the lawyer from the other side from Washington State.\n\n(BEGIN AUDIO CLIP)\n\nNOAH PURCELL, SOLICITOR GENERAL, WASHINGTON STATE: In fact, it was the executive order itself that caused irreparable harm to our states, to Washington and Minnesota and our residents. So of course we believe that the federal government has shown no irreparable harm from reinstating the status quo prior to the executive order.\n\nCLIFTON: What's the harm to the state of Washington?\n\nPURCELL: We had students and faculties at our state universities who are stranded overseas. We had families that were separated. We had longtime residents who could not travel overseas to visit their families without knowing if they would be able to come back. We had lost tax revenue.\n\n(END AUDIO CLIP)\n\nBOLLING: Little quick around Greg, delays yes, exactly.\n\nGUTFELD: He is exaggerating that. We know it's exaggerated.\n\nBOLLING: -- the risk of opening up to terrorist.\n\nGUTFELD: How is not a safe travel pause not the sensible assessment after you see what's going on in Europe? Europe wishes that it hadn't done this. Germany wishes it had done this. How is this an imposition on society? It is pure common sense. No wonder these liberal judges don't understand it. They haven't seen common sense in years.\n\nBECKEL: You know, this is driving me crazy. You know that the vetting process to get in here are so strict right now.\n\nGUTFELD: I understand.\n\nBECKEL: And all Trump is doing is trying to fulfill a pledge he made o his supporters out there. He has no idea, none and his butt -- I didn't say it. I didn't say it -- buddy Bannon is even worse. They sat there and they picked out these countries that --\n\nGUILFOYLE: Bob, you have no proof to substantiate the statements that you're making. And in fact, the president of the United States is privy to the presidential briefings and all the information coming in from the intelligence agencies. And he also met with President Obama and had multiple conversations with him.\n\nGUTFELD: Yes.\n\nGUILFOYLE: So he is basing that on a set of facts and intelligence reports that he is privy to and he has an obligation as the commander-in-chief to protect national security interests of the United States. And the countries that are referred to our failed states that have improper, inadequate vetting in place like Dana said and General Kelly said.\n\nBECKEL: And not one of them can we draw --\n\nGUILFOYLE: So we cannot --\n\n(CROSSTALK)\n\nBOLLING: You know what you're doing? You're conflating two issues. You're talking about the vetting of a refugee program versus what Trump has said that we need to take a look at what -- the message that we allow people to come into the country via visa, via passport, for whatever reason, and to close any loopholes that a terrorist, as ISIS has promised, might be able to use. -\n\nBECKEL: You don't think that those are loopholes for years?\n\nBOLLING: But it's not --\n\nBECKEL: -- going back to the Bush administration.\n\nBECKEL: You're talking about a two year vetting process with the refugee program. This wasn't that.\n\nBECKEL: No, I'm talking about this 90-day stay.\n\nGUILFOYLE: Yes, exactly. It's a 90-day stay.\n\nBECKEL: And the idea that 90-day stay based on some holes in the process is ridiculous.\n\nBOLLING: Why?\n\nBECKEL: It is pure politics --\n\nBOLLING: How many holes do you need for one terrorist to get through? One hole, one terrorist can kill a lot of people.\n\nBECKEL: You name me one terrorist that came in and then --\n\nBOLLING: While they were trying to stop that from happening.\n\nGUTFELD: We've got a list of them that we've gone over all day on Fox News.\n\nPERINO: My final thought would be where is the government might lose in the ninth circuit, I believe that on the merits, President Trump will be successful if and when it gets to the Supreme Court.\n\nBOLLING: All right, we'll leave it right there. We got a lot more. Drama on the senate floor after desperate Democrats once again tries to derail president Trump's cabinet nominations. This time, attorney general Jeff Sessions gets the full Democratic treatment by Senator Elizabeth Warren and then she gets reprimanded, and it was one for the ages.\n\n(BEGIN VIDEO CLIP)\n\nSEN. ELIZABETH WARREN (D), MASSACHUSSETS: I appeal the ruling.\n\nSEN. STEVE DAINES (R), MONTANA: Objection is heard. The senator will take her seat.\n\n(END VIDEO CLIP)\n\nBOLLING: Senator Elizabeth Warren got rebuked and silenced, and now the vote is about to be held for Jeff Sessions any minute. We'll right back with that.\n\n(COMMERCIAL BREAK)\n\nPERINO: Welcome back. We are waiting for another vote shortly on one of President Trump's cabinet nominee, Jeff Sessions for attorney general. Last night, the senate finally cleared the way for the vote to move forward after Democrat staged another bid to derail a colleagues nomination.\n\n(BEGIN VIDEO CLIP)\n\nWARREN: He is, I believe, a disgrace to the Justice Department. Those were the words of Senator Ted Kennedy. Coretta Scott King also wrote to the judiciary committee.\n\nA person who has exhibited so much hostility to the enforcement of those laws.\n\nDAINES: The senator is reminded that is a violation of rule 19.\n\nWARREN: Mr. President, I don't think I quite understand. I'm reading a letter from Coretta Scott King.\n\nDAINES: Not (INAUDIBLE) what you just shared, however, you stated that a sitting senator is a disgrace to the Department of Justice.\n\n(END VIDEO CLIP)\n\nPERINO: The senate majority leader then pulled a rare move to silence Elizabeth Warren.\n\n(BEGIN VIDE CLIP)\n\nSEN. MITCH MCCONNELL (R), SENATE MAJORITY LEADER: Mr. President.\n\nDAINES: The majority leader.\n\nMCCONNELL: The senator is impugning the motives and conduct of our colleague from Alabama. I call the senator to order under the provisions of Rule 19.\n\nWARREN: Mr. President, I am surprised that the words of Coretta Scott King are not suitable for debate in the United States senate. I asked a leave (ph) of the senate to continue my remarks.\n\nDAINES: Is their objections?\n\nMCCONNELL: I object.\n\nWAREN: I appeal the ruling.\n\nDAINES: Objection is heard. The senator will take her seat.\n\n(END VIDEO CLIP)\n\nPERINO: All right, she got felled by rule 19, Greg.\n\nGUTFELD: Rule 19. Also delicious cereal. Look, you know what, what's hilarious about her is that she said something wrong that was refuted. Then she plays the victim card after she impugned Sessions. She is like someone who goes on twitter and trolls you and then you nail her and then she's like --\n\nPERINO: Blocks you.\n\nGUTFELD: She blocks you. She freaks out. Oh, my god. But the only problem is I don't think I would have silenced her because then you become -- you fall for it and then she becomes the victim by silencing her, you give her what she wants.\n\nAnd the thing is, I think a smarter thing for the Republicans should have been to say, you know, why are you exploiting the memory of Coretta Scott King and using her for the purpose that was never intended for the sake of a fund raising stunt (ph) and we love how you bring up Ted Kennedy. He was so great for women. He drowned them with his affections.\n\nBECKEL: Treat Greg.\n\nGUILFOYLE: Somebody call legal.\n\n(LAUGHTER)\n\nPERINO: He did raise a lot of money today.\n\nBECKEL: Yes, he did.\n\n(CROSSTALK)\n\nPERINO: -- but on a fundraising extravaganza.\n\nBECKEL: Look, one of the problems -- you know who doesn't also like what she said last night? Well, a lot of Democrats, and I'll tell you why. They know that Sessions is going to get in. I mean it's clear. It's going to happen.\n\nI don't think he should. I agree. I think he is a disgrace. But that's not the point. The point is he's going to get in and the Democrats --\n\nBOLLING: Why is he a disgrace?\n\nBECKEL: Why is a he a disgrace? Because he is a racist. He was racist --\n\nGUTFELD: Prove it!\n\n(CROSSTALK)\n\nBECKEL: Well --\n\nGUTFELD: He defended -- KKK got his death (ph).\n\nBECKEL: And then he got beaten in the senate for a federal judgeship. Why was that?\n\nGUTFELD: Because people like you were calling him a racist -- BECKEL: Anyway, (INAUDIBLE)\n\nGUTFELD: Yes, because it's not true --\n\nBECKEL: That's not the case. The point here is that the Democratic base is running from the Democrats and they want them by 56 percent I think to oppose anything that Trump does, and you've got to pick your shots.\n\nAnd Elizabeth Warren doing this, knowing full well that this guy was going to get through, save it for the guy who's going to get beaten. I'll guarantee you the labor secretary, the guy who's got an illegal -- undocumented person working for him, also beat up his wife.\n\nGUILFOYLE: Bob. Bob. You can't just like fling it and throw all this crazy stuff out there. You have to have proof of this. You can't just be sitting there saying this.\n\nBECKEL: Excuse me, for four years, I sat here and listened to swings about Barack Obama, you guys --\n\nGUILFOYLE: Oh, it's nothing.\n\nGUTFELD: Beating his wife.\n\nGUILFOYLE: Nothing.\n\nBOLLING: Anyway.\n\nBECKEL: That was in the \"New York Times.\" You don't believe that, I guess, right.\n\nPERINO: Let's get Eric and Kimberly in here.\n\nBOLLING: That's right. This morning I'm watching this. I'm trying to figure out what's playing out here because Mitch McConnell doesn't do anything that he hasn't thought out. So this was not -- a lot of people are like, oh, I can't believe he did that. Now we've handed -- now the right has handed Elizabeth Warren her first political ad of 2020.\n\nShe's going to cut that exact sound bite and say, look you can't -- a man can't tell a woman to sit down. But I think this was planned out. I think they -- this is a strategy. This is the long game. That the Trump administration, maybe the Senate has said -- with McConnell has said, she's the most beatable of the candidates that we see so far.\n\nPERINO: Put her forward, yeah, I've heard that.\n\nBOLLING: Put her forward. She is raising money like crazy right now and she -- for some reason --\n\nPERINO: She will be the poster child.\n\nBOLLING: Suddenly, it's not Cory Booker anymore and it's certainly no one is talking about Schumer and Pelosi right now. Everyone is talking about Elizabeth Warren. And by the way --\n\nPERINO: Now they're all going to try to --\n\nBOLLING: She plays well in two states, New York and California.\n\nPERINO: Kimberly, now is the -- they try to figure how they could outdo her.\n\nGUILFOYLE: Well here's the thing --\n\nBECKEL: A senator in the United States such as a Democrat couldn't beat Trump. He'll be impeached before that anyway.\n\nGUTFELD: He did beat one senator.\n\nGUILFOYLE: So, this was a pivotal moment for her. She is trying to continue her push forward. She's got poll numbers that are slipping, right. So she's able to then raise the money, stay relevant, the numbers are showing like 44 percent in the WBUR poll -- 44 percent of registered voters think that she should be re-elected again or is doing a good job. So she's vulnerable. She's vulnerable.\n\nPERINO: Yes, as an incumbent.\n\nGUILFOYLE: Absolutely, and they are going to target her. So this is a way for her to stay in the race.\n\nPERINO: And there's one other person who got a lot of attention and we'll be quite talking more about her, the new senator from California, Kamala Harris, excuse me. One of her tweets last night and I'm not measuring my tweet necessarily, but I just thought it was interesting. She is a brand- new senator. She had 40,000 re-tweets in support of Senator Warren. So she's up and coming.\n\nBOLLING: But they may be playing into it --\n\nPERINO: I think they are.\n\nBOLLING: -- plans for her 2020 --\n\nBECKEL: You think that that's smart?\n\nBOLLING: Yes.\n\n(CROSSTALK)\n\nPERINO: Remember my New Year's prediction?\n\nBOLLING: Mitch McConnell, what, he made a mistake? He doesn't make those mistakes.\n\nPERINO: Do you remember my New Year's prediction of who is going to try to challenge Donald Trump in 2020?\n\nGUILFOYLE: Al Franken.\n\nPERINO: Yes, and you saw over the weekend a little maneuvering.\n\nGUILFOYLE: I saw it.\n\nPERINO: All right. President Trump told a group of police chiefs today that he's going to help them fight crime and he also asked for their help to curb illegal immigration. That's next on \"The Five\".\n\n(COMMERCIAL BREAK)\n\nGUILFOYLE: Well, it was one of the most memorable feuds of the presidential campaign. Remember this?\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: OK, who is next? Yes, please.\n\nJORGE RAMOS, JOURNALIST: Mr. Trump, I have a question.\n\nTRUMP: Excuse me. Sit down. You weren't called. Sit down.\n\nRAMOS: No, no. I'm --\n\nTRUMP: Sit down.\n\nRAMOS: I am an immigrant and U.S. citizen and I have the right to ask a question.\n\nTRUMP: No you don't. You haven't been called.\n\nRAMOS: I have the right to ask a question.\n\nTRUMP: Go back to Univision.\n\n(END VIDEO CLIP)\n\nGUILFOYLE: Univision anchor Jorge Ramos got himself ejected from that press conference. Well he's still not letting up on Mr. Trump now that he's president, slamming his actions into curb illegal immigration. And then a ne op-ed Ramos writes, \"I've always publicly acknowledge that the United States gave me opportunities that Mexico, my country of origin, did not. But decades after I arrived here, the anti-immigrant rhetoric being turned into policy under Donald Trump has made me realize that I just don't recognize this country anymore.\"\n\nMr. Trump recognizes the threat some illegal immigrants pose to America. Today he asked a roomful of law enforcement officers for their help in getting them out.\n\n(BEGI VIDEO CLIP)\n\nTRUMP: You have the power and knowledge to tell General Kelly, now Secretary Kelly, who the illegal immigrant gang members are. Now you have that power because you know them. You're there. You're local. You know the illegals. You know the bad ones. You know the good ones. I want you to turn in the bad ones. Call Secretary Kelly's representatives and we'll get them out of our country and bring them back where they came from and we'll do it fast.\n\n(END VIDEO CLIP)\n\nGUILFOYLE: All right, Dana, so what do you make of the messaging here? He's saying specifically, \"Let us know who the bad ones are,\" meaning the criminals, the gangs, criminal recidivists.\n\nPERINO: I don't think anybody out there -- I think that's where everybody agrees, is on the criminals that are here illegally should absolutely be on the priority list to be gone first and deported first and not allowed back in. Like, none of this return five times and then eventually kill someone, like Kate Steinle.\n\nGUILFOYLE: Kate Steinle, yes.\n\nPERINO: I don't think George -- I don't think -- George, excuse me -- Jorge Ramos is speaking about that policy in particular. So I think that he is talking about the wall that he's said he opposed from the beginning. And also, there's this -- rumors about additional immigration deportation or curbs on others that are already here illegally that might not be criminals. I think that's what Jorge Ramos was talking about.\n\nGUILFOYLE: OK. Eric, what do you make of Ramos and then the president's comments?\n\nBOLLING: So on Jorge Ramos, that wall is not up, Jorge. You can still go that way if you want. And even when it's up, I think the wall allows people to leave.\n\nThat's the interesting thing about the wall. It keeps people from coming in; it certainly allows you to leave. That is the beauty of America.\n\nOn immigration, this is very unpopular in conservative circles. I've said it here. I think we should be increasing our legal immigration. We should make it easier to get citizenship status here. I think we let in a million a year, 980,000 a year right now. I think we should triple it -- double it, triple it. Two million, three million people. And thereby, everyone who says there are a lot of jobs that illegals are taking that maybe Americans won't take, that's probably true. That's very likely true. And that alleviate some of that pressure of, well, we need illegals to take those jobs. If you have two or three more million people per year coming in, businesses will be happy. The economy will certainly be happy, and hopefully, everyone except the hardline immigration people will be happy.\n\nGUILFOYLE: OK, so Greg, what do you make of it?\n\nGUTFELD: I make a lot of things out of it. The left...\n\nGUILFOYLE: Don't make it up.\n\nGUTFELD: Yes. The left keeps warning everybody we shouldn't normalize Trump. Don't normalize Trump. But what they're doing is they're trying to abnormalize normal behavior.\n\nSo if you're against illegal felons, you know, running -- coming here and running gangs, somehow that's abnormal. If you're -- you know, you're against terrorists blending in with migrants, that's abnormal. If you are for a stronger border, that's abnormal.\n\nThe trick is we have -- we have history's losers telling us that the right thing to do is somehow freakish, is somehow abnormal. The whole point is to paint normal as weird, because we have, the last eight years, progressive radicalism running the country. And that, to me, is weird.\n\nGUILFOYLE: All right. What -- I understand weird, too.\n\nGUTFELD: You do, too.\n\nGUILFOYLE: Yes.\n\nGUTFELD: You've been there.\n\nGUILFOYLE: (UNINTELLIGIBLE)\n\nBECKEL: A couple things strike me, Greg, on your point. I don't know a single liberal, not one, that I've talked to that doesn't agree with what Dana said about wanting to get people who committed crimes out.\n\nPERINO: Right\n\nBECKEL: The other thing is for Trump to stand...\n\nBOLLING: What about sanctuary cities?\n\nBECKEL: Well, no, no. You're still going back to Wall Street, those people. Those are...\n\nGUILFOYLE: Occupy Wall Street. I speak Bob.\n\nGUTFELD: Bob-splaining.\n\nBECKEL: But the other -- the other thing is here's Trump saying to these sheriffs, saying, \"You know who the bad guys are.\" They probably do. Which means they're probably trying to arrest them already. That's another example of Trump saying, \"Hey, I can tell you, you can do this. Turn to us, we'll...\"\n\nBOLLING: They're not allowed to.\n\nBECKEL: Oh, bull.\n\nBOLLING: That's right. In sanctuary cities, you can be a criminal, and they're not -- they're instructed by the mayors of the cities not to turn them over to ICE.\n\nGUILFOYLE: That's the whole point.\n\nBOLLING: Keep them in jail. Keep them there.\n\nGUILFOYLE: That's how this guy ended up.\n\nBOLLING: ... let them go.\n\nBOLLING: Is that true in Arizona?\n\nGUILFOYLE: San Francisco, Bob, this guy came back in and out. He was a criminal, a recidivist. Five different offenses, and he comes back in again, and he shoots and guns down Kate Steinle as she's walking there with her father.\n\nBOLLING: And ICE, you turn them over and the city says, \"No, we're not turning him over.\"\n\nBECKEL: You're talking about one city. I'm talking...\n\nBOLLING: No, I'm not.\n\nBECKEL: In the state of Texas...\n\nBOLLING: It's 300 municipalities. Three hundred municipalities.\n\nBECKEL: By the way, the 3 million that you talked about, I think is a very smart thing. It's exactly what Ronald Reagan did. As a matter of fact, that's exactly what Ronald Reagan said.\n\nPERINO: It's a pretty conservative -- it is actually a pretty conservative point of view.\n\nBECKEL: It's -- you know, he passed -- the last time there was an immigration or amnesty bill, it was Ronald Reagan's bill that he got passed in 1986. And it made a lot of sense, and he said the same thing: \"Let's bring them in. They'll take jobs that our people don't want to take, and they'll pay taxes. Let's do it, and let's stop fighting this.\" That was Ronald Reagan. It made a lot of sense.\n\nGUILFOYLE: All right.\n\nBECKEL: Trump wants everybody in with a bunch of gangsters and machine gunners, which is just ridiculous.\n\nGUILFOYLE: That's not what he just said. He said specifically there are good and there are bad. And I want you to tell us who the bad ones are so that we can get them out. He was quite careful to specify and delineate between the two. OK, good idea.\n\nWhen \"The Five\" returns, Hillary Clinton has reemerged with a controversial prediction about the future. Don't miss this one, next.\n\n(COMMERCIAL BREAK)\n\nGUTFELD: Like Bigfoot emerging from the brush, Hillary Clinton has released a taped message. I wonder if she says that, despite all the challenges we face, she remains convinced that, yes, the future is female.\n\n(BEGIN VIDEO CLIP)\n\nHILLARY CLINTON, FORMER DEMOCRATIC PRESIDENTIAL NOMINEE: Despite all the challenges we face, I remain convinced that yes, the future is female.\n\n(END VIDEO CLIP)\n\nGUTFELD: What does that even mean? Will a meteor strike, taking out just the dudes?\n\nShe said this at the Makers Conference, a storytelling platform for women's issues. I love stories, so here's one:\n\nIt's about a candidate and a party who relied on identity politics so much, they forgot their own country. It's about a candidate who got so obsessed over being a woman, she forgot she was human. Everything instead became black, Hispanic, female, gay, lesbian, you name it, creating a competing mess of victim tribes. That woman and her party lost; yet she can't let go.\n\nWhich reminds me of another story: That of Hiroo Onoda, a Japanese officer who came out of hiding in 1974 in the Philippines, unaware that the Japanese forces had surrendered 29 years before. He went back to Japan, but he couldn't adapt to life back home, so he ran off to Brazil. The war was over. His side lost, but he was unable to grasp a country that moved on from his old ideas.\n\nAs the Democratic Party still clings to identity-driven division, you can imagine the same destiny. They lost the war but still trudge the same old turf, clinging to divisive weapons that backfired. I don't think Brazil will take them.\n\nGUILFOYLE: Good.\n\nGUTFELD: So you know what I love about this, Dan? She says the future is female. She's right, because guys are in trouble. This is what I can't stand about identity politics. Early life adversity, according to studies, hurts boys more. They get suspended more. They drop out of school. They do terrible in schools. But they don't care about that, because...\n\nPERINO: They don't have an entire media complex devoted to their well- being and their confidence.\n\nGUTFELD: Yes.\n\nPERINO: Like, look, I'm a girl, obviously.\n\nGUTFELD: Really?\n\nPERINO: And when I was a little kid, my dad bought me the yellow T-shirt with this black writing, and it was a really hideous T-shirt, but I wore it all the time. And it said \"Anything boys can do, girls can do better.\" There's...\n\nGUILFOYLE: I like that.\n\nPERINO: And that fed into my ability to have confidence and to be able to make it in a man's world, whatever.\n\nGUTFELD: Right.\n\nPERINO: So now life is totally different. The future is actually a robot...\n\nGUTFELD: Right.\n\nPERINO: ... in terms of automation, because that is where things are going. It's absolutely happening.\n\nGUTFELD: They're sexless.\n\nPERINO: There was big -- big enough concern for Laura Bush, when she was the first lady, to actually start a program that was targeted just for boys, because there needed to be some balancing out. But I'm not a mother of a young boy. Somebody else is.\n\nGUILFOYLE: I just happen to be.\n\nGUTFELD: Well, Jasper is a boy.\n\nGUILFOYLE: Good point.\n\nGUTFELD: Kimberly, she can't let go. The world has moved on. But they cling to this identity politic.\n\nGUILFOYLE: I know, so she's clinging to have -- try to have some relevance still, but I actually feel she's doing a disservice to women and to young women looking for positive role models. Because you shouldn't wake up in the morning and look at yourself and say, \"OK, I'm a woman,\" and then just find yourself in those terms. That, to me, is self-limiting.\n\nYou should say, \"Who am I as an individual?\"\n\nGUTFELD: Right.\n\nGUILFOYLE: \"What would like to do and accomplish? What are my goals and dreams? And how am I going to set about achieving them?\"\n\nBecause that's how it is. People have fought very hard for rights in this country, equal rights, and for women to have it, and we have those rights. So start moving forward...\n\nGUTFELD: Right.\n\nGUILFOYLE: ... and don't wallow in this idea that you're not good enough if you're not born a man and that you're automatically operating at a disadvantage. I don't see it that way.\n\nPERINO: It's actually saying the system is rigged.\n\nGUTFELD: Yes. You know -- very funny.\n\nGUILFOYLE: Complain about the dry cleaning.\n\nGUTFELD: Speaking of wallowing, can I show you the Audi ad?\n\nBOLLING: Hoping you would?\n\nGUTFELD: This is -- talk about an ad that is so dishonest in its assumptions about the sexes. Roll it.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: What do I tell my daughter? Do I tell her that despite her education, her drive, her skills, her intelligence, she will automatically be valued as less than every man she ever meets? Or maybe I'll be able to tell her something different.\n\n(END VIDEO CLIP)\n\nGUTFELD: So Eric, the white men who came up with that ad said all women are born victims. That's a great message.\n\nBOLLING: You know, and I saw the ad, and I felt the same way. And then I did a little research on it. And I've got to tell you, I think Audi is onto something here. Forbes -- a bunch of studies show that women comprise two-thirds of all car-buying decisions. So if you're a guy watching football, seeing that ad, you're going, \"I can't believe they just did that.\" But apparently, women who are the car buying decision makers in the household say, \"Hey, I like that. I like that Audi ad.\"\n\nGUTFELD: Do you think that women like that?\n\nGUILFOYLE: I don't like it.\n\nPERINO: I think it spoke to them.\n\nGUTFELD: Terrible.\n\nGUILFOYLE: I'll never buy an Audi.\n\nBOLLING: Can I add One More Thing? Audi, to their credit, does pay women at an equal pay scale that they do men. They have fewer women executives than men, but they do pay.\n\nGUTFELD: Not a single one on their board.\n\nPERINO: True.\n\nGUILFOYLE: Their -- their truth is that, in fact, women do do as well as men, but nevertheless, they put forward a deceiving ad to try to manipulate...\n\nGUTFELD: It's a lie!\n\nGUILFOYLE: ... and sell cars.\n\nBOLLING: All ads are lies.\n\nGUTFELD: You know what? They accused other companies of doing something wrong and saying, \"We're right.\" But the companies are -- it's a myth. The gender gap is a myth. We know this. We've done the stats.\n\nAll right, Bob, I want to get you into this. Do you want to talk about Hillary? Do you want to talk about the ad? Do you want to say how awesome my monologue was?\n\nBECKEL: I just want to say, I thought it was a terrific ad, probably the best one the Super Bowl had.\n\nGUTFELD: Because it was dishonest.\n\nBECKEL: Secondly, I think that Eric is exactly right, that there's a lot of marketing behind this, not...\n\nGUTFELD: You're assuming women like that? No. No strong woman would like that ad.\n\nPERINO: Is it supposed to -- is it supposed to appeal to your emotions? Yes. Look, I mean, we...\n\nGUTFELD: So women are emotional and men aren't? Women don't want facts.\n\nPERINO: We blew off -- we didn't even cover that day, like, on the show because we had so many other things covering. But the day at the women's march, yes, they actually believe that. You might not, but there's a significant portion who do.\n\nGUTFELD: But they're living in a lie.\n\nBECKEL: They're not living in a lie; they're living in your lie. The fact of the matter is...\n\nPERINO: I agree.\n\nGUTFELD: Give me the stats on the gender gap then.\n\nBECKEL: When you say identity politics, you always list blacks, labor, women.\n\nGUTFELD: Labor?\n\nBECKEL: Women are 52 percent of this country.\n\nGUTFELD: Really? I had no idea.\n\nPERINO: And they are doing better in almost every measure.\n\nBECKEL: They are.\n\nPERINO: In schools, in medical school, law school.\n\nBECKEL: And they're going to do better and better. And that's where she's right.\n\nGUTFELD: And boys are doing worse and worse and worse.\n\nBECKEL: That's right. And the future...\n\nGUTFELD: And you're saying that's good.\n\nGUILFOYLE: And a woman -- and a woman ran for president of the United States and, if she wasn't such a bad candidate, maybe she would have won. Condoleezza Rice would have done better.\n\nGUTFELD: Should have been Oprah.\n\nGUILFOYLE: All right.\n\nPERINO: She should have gone to Wisconsin.\n\nGUTFELD: There you go. Wisconsin's great. Excellent cheese.\n\nAhead, Valentine's Day is coming up, and Bob Beckel may consider asking this woman to be his date. Did you know this, Bob?\n\nBECKEL: Yes, she's very pleasant to go out with.\n\nGUTFELD: She's dumped her husband of 22 years over his support for President Trump. Bob is in love. Next.\n\n(COMMERCIAL BREAK)\n\nBECKEL: Kim McCormick, who's 77 years old and lives in Washington state, made a very brave and correct decision. She decided, after 22 years of marriage, that she was going to divorce her husband, Bill. Why? Because Bill was stupid enough to vote for Donald Trump.\n\nNow, Eric, do you think there's something more here than just this vote?\n\nGUILFOYLE: Hard-hitting newsy segment.\n\nBOLLING: A girl after your own heart. Is that right, Bob?\n\nBECKEL: Absolutely.\n\nBOLLING: Did I set you up on a date once?\n\nBECKEL: We only have two minutes. That's all for me.\n\nBOLLING: Here. I'm thankful that I live in a household that we're both pro-Trump. That worked out just nicely.\n\nGUILFOYLE: Bob. Bob.\n\nBECKEL: I'm sorry. I was told to say she was separated, not divorced. Takes a little while to get divorced, guys. I've done it before.\n\nAll right.\n\nGUILFOYLE: Anyway.\n\nBECKEL: Let's move right on. Dana, what do you think?\n\nPERINO: Well, I think it's sad if politics gets in the middle of a loving relationship that you have with the spouse that you've committed your life to. That's unfortunate.\n\nBECKEL: Probably a little crazy. Greg.\n\nGUILFOYLE: Yes, someone was looking to get out.\n\nGUTFELD: Yes, you know what? He was trying to get out because she was voting for Hillary. So they flipped it on him. But you're right. The political should never take precedence over the personal. It should be -- you should be in love, regardless of ideology.\n\nGUILFOYLE: Dana was like, \"Wait, it's a no-fault state.\" Right?\n\nBECKEL: What do you think?\n\nGUILFOYLE: I just said it.\n\nBECKEL: Well, say it again.\n\nGUILFOYLE: Fine, so I think that there's more to this story. I'm thinking somebody was trying to get out of this.\n\nBECKEL: I think that he was probably cheating on her.\n\nGUILFOYLE: A head fake.\n\nGUTFELD: ... Bob.\n\nBECKEL: Sorry, my two minutes is up. That's all they give the liberal on this show. \"One More Thing\" is up next.\n\n(COMMERCIAL BREAK)\n\nGUILFOYLE: I rest my case.\n\nBOLLING: Time for \"One More Thing.\" I'll start with some exciting news.\n\nThanks to you all -- thank you so much -- my first book, \"Wake Up, America,\" was a big New York Times bestseller. Well, I'm happy to announce that I'm working on a second book, which will be out later this year. Check it out. President Trump promised to drain the swamp. I dredge through that swamp, showing historical examples right up today of some of the creepiest creatures and activities in the D.C. swamp and how Trump can drain it. \"The Swamp\" is available right now for preorder everywhere books are sold and on EricBolling.com. And maybe I can get Dana to read it and recommend it.\n\nPERINO: You know I'll read it. I'm the only one who reads all of them.\n\nBOLLING: I know.\n\nGUTFELD: That is true.\n\nPERINO: I will read it, and I will give it a very nice review.\n\nGUTFELD: A speed reader.\n\nBOLLING: An honest review.\n\nGUILFOYLE: She reads -- she reads everything. I, like, skip every other page.\n\nBOLLING: We're going to move on, but there is so much material. I mean, I'm literally taking examples of corruption.\n\nPERINO: You've got a theory.\n\nBECKEL: I'm going to promote my book. Will you shut up and let's move on.\n\nGUILFOYLE: I have something cute. Nine seconds of awesomeness. All right. So time for a \"Five Cuteness Alert.\" No nexio.\n\nGUTFELD: Better not be.\n\nGUILFOYLE: The parents -- stop. The parents of a young baby noticed that their little guy started crying every time he heard a clarinet playing. hey decided to film the amazing reaction. Watch.\n\n(BEGIN VIDEO CLIP)\n\n(CLARINET MUSIC)\n\n(BABY CRYING)\n\n(END VIDEO CLIP)\n\nPERINO: Oh, my gosh.\n\nGUTFELD: He's having ear problems.\n\nGUILFOYLE: Doesn't he kind of look like Bob's face?\n\nBECKEL: That's what I look like after the show's over.\n\nGUILFOYLE: No, you do that. When you pout, you stick out -- you kind of jut out your lower lip like that and you go like that. Awww.\n\nGUTFELD: It's hurting his ears, though.\n\nBOLLING: Greg, you're up.\n\nGUTFELD: OK. Time for this.\n\n(BEGIN VIDEO CLIP)\n\nGUTFELD: Greg's Fashion News.\n\n(END VIDEO CLIP)\n\nGUILFOYLE: You know you have nothing to do with fashion.\n\nGUTFELD: I know everything about fashion. Get out of my way, Kimberly.\n\nAll right. Let's talk about Michaela Perwin. She's an aspiring fashion designer. She goes to Parsons. For her senior project, she designed this dress. Do you know what's so incredible about this dress? It's made out of pages of my book.\n\nBOLLING: Oh, my goodness.\n\nGUTFELD: That's not cool.\n\nBOLLING: Oh, my goodness.\n\nGUTFELD: Ripped right out of my book.\n\nGUILFOYLE: Oh, my gosh.\n\nGUTFELD: Even if you don't like what I read...\n\nPERINO: It looks amazing.\n\nGUTFELD: ... you can't stand my opinions, you can wear my dress. Good job, Michaela Perwin. Excellent work. And...\n\nPERINO: That's a lot of talent.\n\nGUTFELD: It is a lot of talent.\n\nPERINO: I like it.\n\nBOLLING: Page 236, I tell you.\n\nGUILFOYLE: I want a guy to make something -- outfit out of my book.\n\nGUTFELD: Yes, one day.\n\nGUILFOYLE: Pajamas. Some pajamas.\n\nGUTFELD: I rest my case.\n\nGUILFOYLE: Oh, my God.\n\nPERINO: So you've heard -- I came up with that one. OK, I didn't come up with that. I did come up with this. A podcast with Chris Stirewalt called \"I'll Tell You What.\" Guess what, guys? Well, actually, here, take a listen. This is how we describe it.\n\n(BEGIN VIDEO CLIP)\n\nPERINO: How would you describe your podcast? Well, we just talk about what we ate.\n\nCHRIS STIREWALT, CO-HOST, \"I'LL TELL YOU WHAT': And death.\n\nPERINO: Girl weekend and euthanasia.\n\nSTIREWALT: Right. A lot of death.\n\nPERINO: A little Elizabeth Warren thrown in there. Robes, lounge wear.\n\nSTIREWALT: Bare-legged bacon cooking.\n\nPERINO: Yes.\n\nSTIREWALT: It's all good.\n\nPERINO: It's really eclectic.\n\n(END VIDEO CLIP)\n\nPERINO: That's the podcast. We tape it every Wednesday. You can subscribe to it on iTunes. But starting this Sunday at 8 a.m., believe it or not, on Sirius XM Channel 450, and on the FOX News Radio app, you're going to get to hear the podcast. I'm a little worried, because I don't think anybody at FOX has actually ever listened to the podcast. But that's your description.\n\nBOLLING: Very good.\n\nPERINO: Sundays at 8 a.m., on your way to church.\n\nGUILFOYLE: That's a bad example of racier than \"The Five\"?\n\nGUTFELD: Here we go.\n\nBECKEL: Finally, everybody's proud about their book, but I was gone when - - Greg had 12 books while I was gone. He plugged each one of them. This is my book right here. It's called \"I Should Be Dead.\" Which I should be. \"My Life Surviving Politics, TV and Addiction.\"\n\nIt is not a political book. It's much more about addiction and finding some faith that will bring you out of it. Because it was a long, difficult struggle.\n\nGUTFELD: Buy the book.\n\nBECKEL: You can get it. Buy the book at Amazon...\n\nPERINO: Great cover.\n\nGUTFELD: I bet you can get it -- I think you can get it at Barnes & Noble. You can get it at Amazon and Barnes and Noble, because I remember seeing it there.\n\nBECKEL: See, I didn't know all these things. You know these things. I don't.\n\nPERINO: We should send you on a book tour to the Villages.\n\nGUTFELD: Yes.\n\nGUILFOYLE: And it has a great ending, with Bob back here at the table with us. God bless.\n\nBOLLING: Oh, boy. He may not come back.\n\nAll right. Got to leave it right there. Set your DVRs. Never miss an episode of \"The Five.\" That's it for us. \"Special Report\" coming up right -- four, three, two...\n\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "authors": [], "publish_date": "2017-02-08", "source": "foxnews", "top_words": ["thats", "travel", "right", "trump", "ban", "dont", "know", "think", "going", "trumps", "youre", "showdown", "president", "video", "legal"], "summary": "They were bringing up inappropriate line of questioning by saying things like well, Rudy Giuliani called at this and, you know, President Trump said this about -- irrelevant.\nI don't know what the ruling would be in a court but let's say that they want to use that.\nGUTFELD: I think you're right.\nSo, if you're going to point a finger on someone having a \"Muslim ban,\" look at the Obama administration for that.\nPERINO: I don't think George -- I don't think -- George, excuse me -- Jorge Ramos is speaking about that policy in particular."}