{"url": "http://www.foxnews.com/us/2017/01/29/protests-erupt-at-airports-following-trump-travel-ban.html", "id": "233", "title": "Protests erupt at airports following Trump travel ban", "text": "President Donald Trump's travel ban barring citizens of seven predominantly Muslim nations entry into the U.S. has sparked protests around the country.\n\nA look at what is happening:\n\n___\n\nNEW YORK\n\nCries of \"Let them in!\" rose up from a crowd of more than 2,000 people protesting at John F. Kennedy Airport, where 12 refugees were detained Saturday. Celebrities including \"Sex and the City\" actress Cynthia Nixon joined the demonstration. \"What Donald Trump did in the last 24 hours is disgusting, disgraceful and completely un-American and I'm here in protest,\" said protester Pamela French. The agency that runs the airport tried to restore order by shutting down the train that runs to airport terminals. Gov. Andrew Cuomo, a Democrat, reversed that decision, saying people had a right to protest. \"The people of New York will have their voices heard,\" he said in a statement.\n\n___\n\nNEWARK, NEW JERSEY\n\nMore than 120 people clutching signs denouncing the Trump immigration orders gathered at Newark Liberty International Airport. NorthJersey.com reports that they joined lawyers who'd rushed to the airport to defend the rights of refugees and immigrants who were being detained and denied entry.\n\n___\n\nFAIRFAX, VIRGINIA\n\nDozens of protesters inside Washington Dulles International Airport chanted \"Love, Not Hate, Makes America Great\" and \"Say It Loud, Say it Clear, Muslims Are Welcome Here,\" as travelers walked through a terminal to a baggage claim area to collect luggage and greet their loved ones. There was a heavy police presence during the peaceful protest. Virginia Gov. Terry McAuliffe said during a press conference at Dulles that he has asked Virginia Attorney General Mark Herring to look into \"all legal remedies\" available to help individuals who may be detained in Virginia.\n\n___\n\nDENVER\n\nDozens of people converged on Denver International to show their support for refugees. Standing in the main terminal Saturday, they sang \"Refugees are welcome here.\" Some held signs declaring their identity, such as Jew or Christian, and the phrase \"I come in peace.\" Denver has some direct international flights but it wasn't clear whether anyone has been detained under the president's executive order.\n\n___\n\nCHICAGO\n\nA crowd of demonstrators held a rally at O'Hare International Airport. The Chicago Sun-Times reports protesters blocked vehicle traffic to O'Hare's international terminal for a time. The newspaper says some arriving travelers joined the protest, while others were upset by the demonstrations.\n\nLawyers working with the International Refugee Assistance Project tell the Chicago Tribune that 17 people who had been detained at O'Hare all released by late Saturday.\n\nAmong those released before the federal judge's order was Hessan Noorian, a suburban Park Ridge resident returning with his family from Iran, the Tribune reported.\n\nNoorian, who is of British and Iranian citizenship and has a green card, was detained at O'Hare after he and his wife, Zahra Amirisefat, a U.S. citizen, arrived from Tehran, the newspaper said.\n\nThe couple, who told the Tribune that they work at a community college in the Chicago area, said they were questioned for five hours.\n\nAfter Noorian was released, his wife told the Tribune: \"I can't believe something like this can happen to someone with a green card.\"\n\n__\n\nDALLAS\n\nProtesters who gathered at Dallas/Fort Worth International Airport Saturday evening voiced their displeasure with Trump's executive order. The crowd of a few dozen ballooned into hundreds of demonstrators who frequently chanted \"Set them free!\" At times, cheers erupted from the crowd as those who were detained got released.\n\nAmong those still held at the Dallas-Fort Worth International Airport at midnight Saturday was a 70-year-old Iranian widow, Shahin Hassanpour, whose son said she suffers from high blood pressure and had breast cancer surgery four years ago. She obtained an immigrant visa in November on her son's petition.\n\nBahzad Honarjou, a 43-year-old network engineer, said he spoke twice to his mother by phone after her 9 a.m. arrival, but that they hadn't talked since courts stayed the executive order, meaning she should have been released.\n\nHundreds of protesters stood in the waiting area and chanted \"This is what democracy looks like.\"\n\nImmigration agents were not being very communicative, Honarjou said.\n\n\"They were like a machine when I talked to them today,\" he said. His mother only speaks a few words of English and a fellow passenger was translating for her from her native Farsi as no immigration agents spoke the language, he said.\n\nHassanpour was originally going to be deported on a Sunday flight, she informed her son the first time they spoke.\n\n\"She was about to cry,\" he said. \"She is not able to take (tolerate) a 20-hour flight back to Iran.\"\n\nHonarjou said he is a U.S. citizen, obtained entry in a lottery, and has been in the country for seven years. Why did he come?\n\n\"To have a better life and to make more money,\" he said. \"And, you know, for the freedom.\"\n\n___\n\nSEATTLE\n\nAbout 1,000 protesters gathered at Seattle-Tacoma Airport, sitting down in the concourse with a large American flag reading \"We are America.\" Aayah Khalaf, a Muslim American, was sitting at home watching the protest on television when she and her friend studying from Egypt decided to join the rally. It was her second time joining a protest. The first one was the Women's March. \"It's not just against Muslims. It against environmental rights and human rights overall. I think everybody has to stand up against this,\" said Khalaf, 29.\n\n___\n\nPORTLAND, OREGON\n\nA protest by several dozen people in and around Portland International Airport briefly disrupted light rail service at the airport. The Oregonian/OregonLive reports that the demonstrators carried signs and chanted \"Say it loud, say it clear, refugees are welcome here\" and \"No ban no wall America is for us all.\"\n\n___\n\nLOS ANGELES\n\nAbout 300 people expressed their displeasure with the ban at Los Angeles International Airport Saturday night. Protesters entered the airport's Tom Bradley International Terminal after holding a candlelight vigil.\n\nAvriel Epps held a candle and a large photo a drowned 3-year-old Syrian boy who washed up on a Turkish beach in 2015 and became a haunting symbol of the Syrian refugee crisis.\n\n___\n\nSAN FRANCISCO\n\nHundreds of protesters blocked the street outside at San Francisco International Airport's international terminal to express their opposition to the barring of some people from Muslim-majority nations.\n\n___\n\nSAN DIEGO\n\nAs motorists honked their support, demonstrators outside San Diego International Airport chanted \"No hate, no fear, everyone is welcome here.\"", "authors": [], "publish_date": "2017-01-29", "source": "foxnews", "top_words": ["protests", "travel", "international", "airport", "trump", "airports", "ban", "tribune", "following", "protest", "terminal", "welcome", "chanted", "refugees", "protesters", "detained", "erupt"], "summary": "___NEWARK, NEW JERSEYMore than 120 people clutching signs denouncing the Trump immigration orders gathered at Newark Liberty International Airport.\n__DALLASProtesters who gathered at Dallas/Fort Worth International Airport Saturday evening voiced their displeasure with Trump's executive order.\n___LOS ANGELESAbout 300 people expressed their displeasure with the ban at Los Angeles International Airport Saturday night.\nProtesters entered the airport's Tom Bradley International Terminal after holding a candlelight vigil.\n___SAN DIEGOAs motorists honked their support, demonstrators outside San Diego International Airport chanted \"No hate, no fear, everyone is welcome here.\""}