{"url": "http://www.foxnews.com/us/2017/01/29/us-judge-bars-deportations-under-trump-travel-ban.html", "id": "236", "title": "US judge bars deportations under Trump travel ban", "text": "A federal judge's emergency order has temporarily barred the U.S. from deporting people from nations subject to President Donald Trump's travel ban. The judge said travelers who had been detained had a strong argument that their legal rights had been violated.\n\nThe Department of Homeland Security issued a statement early Sunday that said the court ruling would not affect the overall implementation of the White House order and it affected a relatively small number of travelers who were inconvenienced by security procedures upon their return.\n\nThe emergency order was issued by U.S. District Judge Ann Donnelly in New York Saturday night after lawyers for the American Civil Liberties Union filed a court petition on behalf of people from seven predominantly Muslim nations who were detained at airports across the country as the ban took effect.\n\nThe judge's order addressed only a portion of Trump's executive action. As the decision was announced, cheers broke out in crowds of demonstrators who had gathered at American airports and outside the Brooklyn courthouse where the ruling was issued.\n\nThe order barred U.S. border agents from removing anyone who arrived in the U.S. with a valid visa from Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen. It also covered anyone with an approved refugee application.\n\nIt was unclear how quickly the judge's order might affect people in detention, or whether it would allow others to resume flying.\n\n\"Realistically, we don't even know if people are going to be allowed onto the planes,\" ACLU lawyer Lee Gelernt said. \"This order would protect people who they allow to come here and reach U.S. soil.\"\n\nDHS said the court ruling would have no effect on the overall executive action.\n\n\"President Trump's Executive Orders remain in place — prohibited travel will remain prohibited, and the U.S. government retains its right to revoke visas at any time if required for national security or public safety,\" according to the DHS statement.\n\nStephen Miller, a senior adviser to the White House, said: \"Nothing in the Brooklyn judge's order in anyway impedes or prevents the implementation of the president's executive order which remains in full, complete and total effect.\"\n\nUnder Trump's order, it had appeared that an untold number of foreign-born U.S. residents now traveling outside the U.S. could be stuck overseas for at least 90 days even though they held permanent residency green cards or other visas. However, an official with the Department of Homeland Security said Saturday night that no green-card holders from the seven countries cited in Trump's order had been prevented from entering the U.S.\n\nSome foreign nationals who were allowed to board flights before the order was signed Friday had been detained at U.S. airports, told they were no longer welcome. The DHS official who briefed reporters by phone said 109 people who were in transit on airplanes had been denied entry and 173 had not been allowed to get on their planes overseas.\n\nIn her three-page order, Donnelly wrote that without the stay \"there will be substantial and irreparable injury to refugees, visa-holders and other individuals from nations subject to the Jan. 27, 2017, executive order.\"\n\nTrump billed his sweeping executive order as a necessary step to stop \"radical Islamic terrorists\" from coming to the U.S. It included a 90-day ban on travel to the U.S. by citizens of Iraq, Syria, Iran, Sudan, Libya, Somalia or Yemen and a 120-day suspension of the U.S. refugee program.\n\nTrump's order singled out Syrians for the most aggressive ban, indefinitely blocking entry for anyone from that country, including those fleeing civil war.\n\nThe directive did not do anything to prevent attacks from homegrown extremists who were already in America, a primary concern of federal law enforcement officials. It also omitted Saudi Arabia, home to most of the Sept. 11 hijackers.\n\nAs a candidate Trump pledged to temporarily ban Muslims from coming to the U.S., then said he would implement \"extreme vetting\" for people from countries with significant terror concerns. He told reporters Saturday the order is \"not a Muslim ban.\"\n\n\"It's working out very nicely,\" Trump said of the implementation of his order. \"We're going to have a very, very strict ban and we're going to have extreme vetting, which we should have had in this country for many years.\"\n\nThe order sparked protests at several of the nation's international airports, including New York's Kennedy and Chicago's O'Hare and facilities in Minneapolis and Dallas-Fort Worth. In San Francisco, hundreds blocked the street outside the arrival area of the international terminal. Several dozen demonstrated at the airport in Portland, Oregon, briefly disrupting light rail service while hoisting signs that read \"Portland Coffee Is From Yemen\" and chanting anti-Trump slogans. U.S. lawmakers and officials around the globe also criticized the move.\n\nTwo of the first people blocked from entering the United States were Iraqis with links to the U.S. military. Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi were detained by immigration officials after landing at New York's Kennedy airport Friday night. Both had been released by Saturday night after their lawyers intervened.\n\nThe government can exempt foreign nationals from the ban if their entry is deemed in the national interest. But it was not immediately clear how that exemption might be applied.\n\nDiplomats from the seven countries singled out by Trump's order would still be allowed into the U.S.\n\nThose already in the U.S. with a visa or green card would be allowed to stay, according to the official, who wasn't authorized to publicly discuss the details of how Trump's order was being put in place and spoke only on condition of anonymity.\n\nTrump's order also directed U.S. officials to review information as needed to fully vet foreigners asking to come to the U.S. and draft a list of countries that don't provide that information. That left open the possibility that citizens of other countries could also face a travel ban.\n\nThe U.S. may still admit refugees on a case-by-case basis during the freeze, and the government would continue to process requests from people claiming religious persecution, \"provided that the religion of the individual is a minority religion in the individual's country.\"\n\n___\n\nAssociated Press writers Darlene Superville and Eric Tucker in Washington, Ellen Knickmeyer in San Francisco, Jeff Karoub in Detroit, and Karen Matthews, Rachel Zoll, Verena Dobnik and William Mathis in New York contributed to this report.\n\n___\n\nFollow Alicia A. Caldwell on Twitter at www.twitter.com/acaldwellap", "authors": [], "publish_date": "2017-01-29", "source": "foxnews", "top_words": ["bars", "executive", "travel", "trump", "allowed", "deportations", "ban", "security", "night", "judge", "officials", "trumps", "countries", "order"], "summary": "A federal judge's emergency order has temporarily barred the U.S. from deporting people from nations subject to President Donald Trump's travel ban.\nThe judge's order addressed only a portion of Trump's executive action.\nTrump billed his sweeping executive order as a necessary step to stop \"radical Islamic terrorists\" from coming to the U.S.\nTrump's order singled out Syrians for the most aggressive ban, indefinitely blocking entry for anyone from that country, including those fleeing civil war.\nThat left open the possibility that citizens of other countries could also face a travel ban."}