{"url": "http://www.foxnews.com/us/2017/02/02/man-sent-back-to-iran-under-trump-travel-ban-returns-to-us.html", "id": "255", "title": "Man sent back to Iran under Trump travel ban returns to US", "text": "An Iranian man turned away from Los Angeles International Airport under President Donald Trump's executive order barring immigrants from seven Muslim-majority nations returned Thursday to an emotional welcome from family members who greeted him with California-grown flowers and well-wishers who sang \"This Land Is Your Land.\"\n\n\"Welcome to your new home,\" Mayor Eric Garcetti told Ali Vayeghan as he walked out of an airport terminal.\n\nVayeghan's family had been waiting to welcome him last Friday at the same terminal when he was detained for several hours by immigration officials then sent back to Iran.\n\nHe was allowed to return to the U.S. after the American Civil Liberties Union filed legal action against the federal government.\n\nOn Sunday, U.S. District Judge Dolly M. Gee ruled that Vayeghan had a legal travel visa and had been approved for a green card and that not allowing his return was unconstitutional and would do him grave harm.\n\n\"I'm very happy and I'm very grateful,\" he said Thursday.\n\nVayeghan was among hundreds of people detained or turned away from U.S. airports after the ban was implemented. Garcetti said Thursday he was the first to be brought back, promising he would not be the last.\n\n\"This is a huge victory for the Vayghan family and for Ali but there are dozens, perhaps hundreds of people who are in the same situation,\" said Peter Bibring, an ACLU attorney who worked on the case. \"Many of them don't know they might have been unlawfully returned.\"\n\nVayeghan traveled to the U.S. to join his family in Los Angeles and see his son in Indiana for the first time in 12 years.\n\nBut what was expected to be a happy reunion turned into a wrenching ordeal.\n\nVayeghan's brother, sister-in-law and niece had gathered at the airport with flowers and signs, 15 minutes before the flight was scheduled to arrive. They watched family after family greet loved ones as hours passed and Vayeghan did not emerge.\n\nWhen they inquired with airport workers they were told a new immigration order had been issued and it could take several hours to process. At midnight, there was still no sign of him and an airport information desk was closed.\n\n\"At that point we got really, really frightened,\" his niece, Marjan Vayghan, told The Associated Press. \"Because as far as we were concerned, he had just vanished into thin air.\"\n\nThe family eventually returned to their home in West Los Angeles, lights still on and a table filled with Vayeghan's favorite foods. His niece posted a message on Facebook lamenting her uncle's ordeal and fell asleep crying into her pillow.\n\nThe next day the family returned to the airport, stunned to find thousands of people carrying signs and candles to protest the travel ban.\n\nAt an airport news conference shortly before his arrival Thursday, his niece was almost overwhelmed with joy as she thanked the judge, attorneys, mayor and others for getting her uncle safely back.\n\n\"We're just so overwhelmed by this level of love and amazingness,\" she said. \"Thank you so much. Last Friday we felt like the three loneliest people in the world, and the next day and up until now there is just so much love.\"\n\nHer father noted that when attorneys approached him at the airport offering to help, he asked how much he'd have to pay and they refused to take his money.\n\n\"I don't know what to say,\" said Hossein Vayghan. \"I'm thanking everybody here and all the news, all the press.\"\n\n___\n\nAP writer John Rogers contributed to this story.", "authors": [], "publish_date": "2017-02-02", "source": "foxnews", "top_words": ["returned", "iran", "travel", "airport", "trump", "vayeghan", "ban", "family", "los", "niece", "told", "man", "returns", "hours", "turned", "vayghan", "sent"], "summary": "\"Welcome to your new home,\" Mayor Eric Garcetti told Ali Vayeghan as he walked out of an airport terminal.\nVayeghan was among hundreds of people detained or turned away from U.S. airports after the ban was implemented.\nThey watched family after family greet loved ones as hours passed and Vayeghan did not emerge.\n\"At that point we got really, really frightened,\" his niece, Marjan Vayghan, told The Associated Press.\nThe next day the family returned to the airport, stunned to find thousands of people carrying signs and candles to protest the travel ban."}