{"url": "http://www.foxnews.com/us/2017/02/06/us-court-to-hear-arguments-on-trumps-travel-ban.html", "id": "272", "title": "US court to hear arguments on Trump's travel ban", "text": "A U.S. federal appeals court Tuesday will hear arguments over President Trump’s controversial temporary travel ban, and whether Trump’s order should be restored after last week’s federal judge’s ruling.\n\nThe filing with the Ninth Circuit Court of Appeals came three days after a federal judge in Washington state halted Trump's order and granted a nationwide stay.\n\nTRUMP DENIES PUTIN TIES AFTER COMMENT BACKLASH, RIPS 'HATERS'\n\nThe Justice Department said U.S. District Judge James Robart's order was \"vastly overbroad\" and said Trump's executive order was \"a lawful exercise of the President's authority over the entry of aliens into the United States and the admission of refugees.\"\n\nThe appeals court refused to immediately reinstate the ban, and lawyers for Washington and Minnesota -- two states challenging it -- argued anew on Monday that any resumption would \"unleash chaos again,\" separating families and stranding university students.\n\nVIDEO: JUDGE NAPOLITANO'S TAKE ON THE TRAVEL BAN LEGAL BATTLE\n\nOral arguments were set for Tuesday afternoon. Whatever the appeals court decides, either side could ask the Supreme Court to intervene.\n\nIt could prove difficult, though, to find the necessary five votes at the high court to undo a lower court order; the Supreme Court has been at less than full strength since Justice Antonin Scalia's death a year ago. The last immigration case that reached the justices ended in a 4-4 tie.\n\nThe president's executive order has faced legal uncertainty ever since Friday's ruling by Robart, which challenged both Trump's authority and his ability to fulfill a campaign promise.\n\nThe State Department quickly said people from the seven countries — Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen — could travel to the U.S. if they had valid visas. The Homeland Security Department said it was no longer directing airlines to prevent affected visa holders from boarding U.S.-bound planes.\n\nOn Monday in Colorado, a graduate student who had traveled to Libya with her 1-year-old son to visit her sick mother and attend her father's funeral was back in Fort Collins after having been stopped in Jordan on her return trip. She was welcomed with flowers and balloons by her husband and other children.\n\nTwo Yemeni brothers whose family has sued over the travel ban, and who'd been turned away in the chaotic opening days of the order, arrived at Dulles International Airport in Virginia, where they were greeted by their father.\n\n\"America is for everybody,\" Aqel Aziz said after greeting his sons.\n\nSyrian immigrant Mathyo Asali said he thought his life was \"ruined\" when he landed at Philadelphia International Airport on Jan. 28 only to be denied entry to the United States. Asali, who returned to Damascus, said he figured he'd be inducted into the Syrian military. He was back on U.S. soil Monday.\n\n\"It's really nice to know that there's a lot of people supporting us,\" Asali told Gov. Tom Wolf, who greeted the family at a relative's house in Allentown.\n\nThe legal fight involves two divergent views of the role of the executive branch and the court system.\n\nThe government has asserted that the president alone has the power to decide who can enter or stay in the United States, while Robart has said a judge's job is to ensure that an action taken by the government \"comports with our country's laws.\"\n\nHis Friday ruling triggered a Twitter rant by Trump, who dismissed Robart as a \"so-called judge.\" On Sunday, Trump tweeted, \"Just cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!\"\n\nThe Associated Press contributed to this report.", "authors": [], "publish_date": "2017-02-06", "source": "foxnews", "top_words": ["travel", "hear", "ban", "appeals", "judge", "court", "united", "states", "trumps", "order", "arguments", "robart"], "summary": "A U.S. federal appeals court Tuesday will hear arguments over President Trump’s controversial temporary travel ban, and whether Trump’s order should be restored after last week’s federal judge’s ruling.\nThe filing with the Ninth Circuit Court of Appeals came three days after a federal judge in Washington state halted Trump's order and granted a nationwide stay.\nVIDEO: JUDGE NAPOLITANO'S TAKE ON THE TRAVEL BAN LEGAL BATTLEOral arguments were set for Tuesday afternoon.\nWhatever the appeals court decides, either side could ask the Supreme Court to intervene.\nIt could prove difficult, though, to find the necessary five votes at the high court to undo a lower court order; the Supreme Court has been at less than full strength since Justice Antonin Scalia's death a year ago."}