{"url": "http://www.foxnews.com/us/2017/02/11/opponents-trump-travel-ban-look-to-score-another-win.html", "id": "296", "title": "Opponents of Trump's travel ban look to score another win", "text": "Opponents of President Donald Trump's travel ban sought Friday to rack up another legal victory against the measure, believing they have the administration on the defensive after a federal appeals court refused to reinstate the order.\n\nAs government attorneys debated their next move, they faced unsympathetic judges on both coasts.\n\nThe San Francisco-based 9th U.S. Circuit Court of Appeals sided Thursday with the states of Washington and Minnesota in refusing to reinstate the ban, opening the possibility that the case could advance to the U.S. Supreme Court. On Friday, a federal judge in Virginia also seemed inclined to rule against the administration in a different challenge.\n\nFor his part, Trump said Friday that he is considering signing a \"brand new order\" while the ban is held up in court.\n\nSpeaking to reporters on Air Force One as he flew to Florida for the weekend, the president said he expected his administration to win the legal battle over his original directive. But he said the White House was also weighing other alternatives, including making changes to the order, which suspended the nation's refugee program and barred all entries from seven Muslim-majority countries.\n\nIn Virginia, a lawyer for the state asked a judge to impose a preliminary injunction barring the government from enforcing a portion of Trump's Jan. 27 executive order that bars anyone from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen from entering the U.S. for 90 days.\n\nA preliminary injunction would be long-lasting, continuing through the trial in a case. Still, because of the 9th Circuit's decision refusing to reinstate the order, the practical effect of any decision in Virginia may be muted for now.\n\nJudge Leonie Brinkema, who was appointed to the federal bench by President Bill Clinton in 1993, did not seem satisfied with answers about the executive order from an administration lawyer.\n\nBrinkema said that the order \"clearly has all kinds of weaknesses,\" and she asked the government to explain the justification for the ban, saying courts have been \"begging\" for that explanation. The president can legally suspend the entry of non-citizens into the country when he \"finds\" that their entry \"would be detrimental to the interests of the United States.\"\n\n\"Finds,\" she said, doesn't mean just \"think.\"\n\nVirginia's Solicitor General Stuart Raphael said the government has been unable to answer the charge that the ban was targeted at Muslims.\n\nBrinkema, who did not say when she will rule, said that there was strong evidence that the order is harmful to national security. She quoted from a joint declaration filed in the case by former national security, foreign policy and intelligence officials, including former secretaries of state Madeline Albright and John Kerry, former Homeland Security Secretary Janet Napolitano and former CIA Director and Secretary of Defense Leon Panetta.\n\n\"In our professional opinion, this Order cannot be justified on national security or foreign policy grounds. It does not perform its declared task of 'protecting the nation from foreign terrorist entry into the United States,\" the declaration states.\n\nThe group continued that Trump's executive order \"could do long-term damage to our national security and foreign policy interests.\"\n\nA lawyer for the administration, Erez Reuveni, countered that the group is not in the current administration. But he did not give any additional justification for the order. Instead, Reuveni argued that Virginia does not have the right to challenge the ban and that Brinkema does not have the power to review the president's executive order.\n\nAs for how the government will move forward in the 9th Circuit case, Reuveni said no decisions had been made.\n\n\"We may appeal. We may not,\" Reuveni said. \"All options are being considered.\"\n\nMoments after the ruling Thursday, Trump tweeted, \"SEE YOU IN COURT,\" adding that \"THE SECURITY OF OUR NATION IS AT STAKE!\" But he did not specify what court he meant.\n\nThe administration could appeal the ruling to a larger 9th Circuit panel or bypass that step and go straight to the U.S. Supreme Court. That could put the decision over whether to keep the temporary restraining order suspending the ban in the hands of a divided court that has a vacancy. Trump's nominee, Neil Gorsuch, probably could not be confirmed in time to take part in any consideration of the ban, which would expire in 90 days unless it is changed.\n\nIn addition to the challenge in Virginia brought by Virginia Attorney General Mark Herring, a Democrat, the ban still faces lawsuits around the country, some filed by refugees directly affected by it. The Trump administration did win a legal victory earlier this month in Massachusetts, where a federal judge in Boston declined to extend a temporary injunction against the travel ban. But a separate federal ruling in Seattle later in the day put the ban on hold nationwide. It was the Seattle judge's ruling that was ultimately appealed to the 9th Circuit.\n\n___\n\nAssociated Press writers Ken Thomas and Darlene Superville in Washington and Gene Johnson in Seattle contributed to this report.", "authors": [], "publish_date": "2017-02-11", "source": "foxnews", "top_words": ["ruling", "travel", "ban", "look", "virginia", "win", "security", "court", "9th", "trumps", "federal", "opponents", "order", "administration", "score"], "summary": "Opponents of President Donald Trump's travel ban sought Friday to rack up another legal victory against the measure, believing they have the administration on the defensive after a federal appeals court refused to reinstate the order.\nFor his part, Trump said Friday that he is considering signing a \"brand new order\" while the ban is held up in court.\nThe group continued that Trump's executive order \"could do long-term damage to our national security and foreign policy interests.\"\nThe Trump administration did win a legal victory earlier this month in Massachusetts, where a federal judge in Boston declined to extend a temporary injunction against the travel ban.\nBut a separate federal ruling in Seattle later in the day put the ban on hold nationwide."}