{"url": "http://www.foxnews.com/opinion/2017/03/16/gregg-jarrett-4-things-need-to-know-about-rulings-against-trumps-latest-travel-ban.html", "id": "26", "title": "Gregg Jarrett: 4 things you need to know about the rulings against Trump's latest travel ban", "text": "Federal judges in Hawaii and Maryland ruled against President Trump’s revised travel ban with separate, but similar, orders blocking the main provisions of his executive order which limits travel and immigration to the United States from six predominately Muslim countries. Here is what you need to know about the rulings from these judges:\n\n1.) Legally, what did the 2 judges find wrong with the revised travel ban?\n\nPrincipally, that the executive order violates the Establishment Clause in the First Amendment of the Constitution because it discriminates against Muslims. The judges relied not on the detailed language of the executive order, but on several of the remarks President Trump made as a candidate on the campaign trail, even though he later revised his stance on immigrants seeking entry into the U.S.\n\nThe judges largely ignored the President’s justification stated specifically in the ban that he was acting in the interest of national security to protect American citizens from potential terrorists because the 6 banned nations are state sponsors of terrorism (as identified by Congress and President Obama in an anti-terrorism law) and those governments do not assist the U.S. in vetting applicants with background checks.\n\n2.) How unusual is it for a judge to rely so heavily on campaign rhetoric?\n\nIt is extraordinary and well beyond the scope of what judges are supposed to consider. Candidates for office often make statements they don’t entirely mean. Or they later revise or change their views. That is what candidate Trump did. After first claiming he would institute a Muslim ban, he later changed his stance to say that he would ban entry from countries that pose a terrorist threat.\n\nBut these two judges ignored his revised position and accused the President of using national security as a pre-text for banning Muslims. In doing so, the judges were pretending to read President Trump’s mind. It smacks of judicial activism and appears contrary to established law on judicial review. Courts don’t normally consider campaign rhetoric in interpreting a law or executive order.\n\n3.) At the same time, 5 judges on the 9th circuit court of appeals issued their own opinion. What was it?\n\nThis was also unusual. In an unsolicited filing, five Republican-appointed judges on the 9th Circuit (the same court which last month ruled against President Trump’s first travel ban) wrote this in a published opinion:\n\n“Whatever we as individuals may feel about the President or the executive order, the President’s decision was well within the powers of the presidency.”\n\nThese five judges all but accused their colleagues of judicial activism and overreach because they don’t like President Trump or his policies. The five judges recognized that the President has both constitutional (Article 1, Section 8) and statutory authority (the 1952 Immigration and Nationality Act) to dictate immigration as it applies to national security threats.\n\n4.) So, what happens next?\n\nThe ruling by the judge in Hawaii can be appealed to the 9th Circuit Court of Appeals. The Maryland ruling would be appealed to the 4th Circuit. They could be reversed on appeal. Or not.\n\nAfter that, the cases could wind their way up to the U.S. Supreme Court, which currently has 8 Justices. Neil Gorsuch, President Trump’s nominee to fill the seat left vacant by Antonin Scalia’s death, is set to begin confirmation hearings next week. It is possible Democrats may try to delay his confirmation vote, leaving a potential 4-4 split on the high court. In that case, the lower appellate court rulings would stand. But if those rulings conflict, it is unclear what would happen.\n\nBut all of this may turn out to be moot. The main part of the travel ban will expire after 90 days.\n\nGregg Jarrett joined FOX News Channel (FNC) in 2002 and is based in New York. He currently serves as legal analyst and offers commentary across both FNC and FOX Business Network (FBN).\n\n", "authors": ["Gregg Jarrett"], "publish_date": "2017-03-16", "source": "foxnews", "top_words": ["executive", "travel", "rulings", "judges", "revised", "ban", "circuit", "know", "court", "order", "trumps", "need", "jarrett", "things", "latest", "president", "gregg"], "summary": "Legally, what did the 2 judges find wrong with the revised travel ban?\nPrincipally, that the executive order violates the Establishment Clause in the First Amendment of the Constitution because it discriminates against Muslims.\nThe ruling by the judge in Hawaii can be appealed to the 9th Circuit Court of Appeals.\nNeil Gorsuch, President Trump’s nominee to fill the seat left vacant by Antonin Scalia’s death, is set to begin confirmation hearings next week.\nThe main part of the travel ban will expire after 90 days."}