{"url": "http://www.foxnews.com/transcript/2017/02/10/retired-marine-message-about-travel-ban-goes-viral-kansas-secretary-state-talks.html", "id": "215", "title": "Retired Marine's message about travel ban goes viral; Kansas secretary of state talks Trump's border wall plans", "text": "Watch the latest video at video.foxnews.com\n\nThis is a rush transcript from \"Hannity,\" February 10, 2017. This copy may not be in its final form and may be updated.\n\nSEAN HANNITY, FOX NEWS HOST: And welcome to \"Hannity.\" And tonight, I have a message for all the liberals and the members of the media who are cheering about the 9th circuit court's decision to uphold the suspension of President Trump's temporary travel ban. It's time to put petty politics aside and start caring about the safety and security of the American people. This is a wake-up call, and that is tonight \"Opening Monologue.\"\n\nAs of this very moment, refugees and other travelers from Iraq, Iran, Syria, Sudan, Somalia, Libya and Yemen are still allowed to enter the United States, blocking President Trump's plan for extreme vetting. Right now, our guard is down, and people are pouring into this country.\n\nNow, earlier today, President Trump had this to say about the 9th circuit court's ruling. Take a look.\n\n(BEGIN VIDEO CLIP)\n\nDONALD TRUMP, PRESIDENT OF THE UNITED STATES: We are going to keep our country safe. We are going to do whatever is necessary to keep our country safe. We had a decision which we think will be very successful with. It shouldn't have taken this much time because safety is a primary reason, one of the reasons I'm standing here today, the security of our country. The voters felt that I would give it the best security. So we'll be doing something very rapidly having to do it with additional security for our country. You'll be seeing that sometime next week. In addition, we will continue to go through the court process, and ultimately, I have no doubt that we'll win that particular case.\n\n(END VIDEO CLIP)\n\nHANNITY: And earlier today on Air Force One, President Trump said this.\n\n(BEGIN VIDEO CLIP)\n\n(CROSSTALK)\n\nTRUMP: The unfortunate part is it takes time statutorily (INAUDIBLE) We'll win that battle. But we also have a lot of other options, including just filing a brand-new order (INAUDIBLE)\n\nQUESTION: (INAUDIBLE)\n\nTRUMP: Could very well be, but I like to keep you -- you know, I'd like to surprise you. We need speed for reasons of security, so it could very well be that we do that.\n\n(END VIDEO CLIP)\n\nHANNITY: Now, President Trump -- he gets it. He's making the safety and security of you, the American people, a top priority, and for good reason. Now, we have been warned by top Obama administration intelligence and national security officials that ISIS could infiltrate the refugee population. They've all said it. Watch this.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: Would that bring in Syrian refugees, pose a greater risk to Americans?\n\nUNIDENTIFIED MALE: I mean, it's clearly a population of concern.\n\nUNIDENTIFIED MALE: The concern is in Syria, the lack of our footprint on the ground in Syria, that the databases won't have the information we need. So it's not that we have a lack of process, it's there's a lack of information.\n\nUNIDENTIFIED MALE: And that obviously raises grave concern as to be able to do proper background checks of the individuals coming into the country\n\nUNIDENTIFIED MALE: I don't obviously put it past the likes of ISIL to infiltrate operatives among refugees.\n\nUNIDENTIFIED MALE: We can only query against that which we have collected. And so if someone has never made a ripple in the pond in Syria in a way that would get their identity or their interests reflected in our database, we can query our database until our cows come home, but we're not going to-- there'll be nothing show up because we have no record on that person.\n\nUNIDENTIFIED MALE: There is some fear -- some fear that some of these refugees may actually be posing as refugees, but they might actually be al Qaeda or ISIS terrorists trying to sneak into Europe or the United States. What do you make of that?\n\nUNIDENTIFIED MALE: Well, certainly, that's a possibility. I mean, you can't -- you can't dismiss that out of hand.\n\nUNIDENTIFIED MALE: We should be conscious of the potential that Daesh may attempt to embed agents within that population.\n\n(END VIDEO CLIP)\n\nHANNITY: Now, President Trump is listening to the top intelligence and defense officials in this country. And now the president of Syria -- he's actually echoing those same concerns. Now, keep in mind, Syria is one of the countries on Trump's travel ban list. And here's what President al Assad told Yahoo! News. Take a look.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: Are some of these refugees, in your view, aligned with terrorists?\n\nBASHAR AL-ASSAD, PRESIDENT OF SYRIA: Oh, definitely.\n\nUNIDENTIFIED MALE: Definitely?\n\nASSAD: Definitely. You can find it on the net. The same pictures that you show them, in some cases, of course, in some instances -- those terrorists in Syria holding the machine gun or killing people, they are peaceful refugees in Europe or in the West in general. Yes, that's true.\n\n(END VIDEO CLIP)\n\nHANNITY: That's the Syrian president, essentially, a guy who's a dictator, admitting that some refugees are definitely terrorists. Wow. Now, to make things worse, The Washington Times is reporting, quote, \"77 percent of refugees allowed into the U.S. since the travel ban began come from the seven suspect countries.\"\n\nAnd that's not all. Today, the people in Iran -- they were celebrating the 38th anniversary of the 1979 Islamic revolution by burning American flags and once again chanting, Death to America. Of course, this is nothing new from Iran, where American flags, Israeli flags and that type of burning and chanting -- well, that's like a favorite national pastime.\n\nYou may remember when the supreme leader of Iran was caught on tape calling for the death of America. Watch this.\n\n(VIDEO CLIP)\n\nHANNITY: Now, clearly, the people you just witnessed chanting, Death to America -- they don't like you. They don't like us. They don't like our way of life, and they're definitely not in search of the American dream.\n\nNow, here's the most alarming part of all. The left is in a pre-9/11 mentality. They've forgotten the past. And I fear, as a country, we may be doomed to repeat this. So to all of you out there applauding this 9th circuit decision, listen up. It's time for a very important history lesson.\n\nYou may remember September 11, 2001, America changed forever after an al Qaeda-orchestrated terror attack devastated our country and led to the deaths of nearly 3,000 people. And as documented by the 9/11 commission report, Dr. Condoleezza Rice testified that for years, quote, \"The terrorists were at war with us, but we were not yet at war with them.\"\n\nNow, that finding is so compelling because in the years leading up to 9/11, it was no secret that Islamic extremists were hell-bent on destroying the United States and killing the American people. In fact, leading up to 9/11, terrorists were responsible for, remember, the bombing of the Khobar Towers, the bombing of the embassies in Tanzania and Kenya, a deadly attack on the USS Cole, and even the first World Trade Center attack. In 1993, we had plenty of warnings. We have a similar build-up now in violence all across the world.\n\nEurope has been rocked by terror attack after terror attack. And here at home, Islamic extremists -- remember, San Bernardino, the Pulse nightclub in Orlando, Chattanooga, Fort Hood, the Boston Marathon. ISIS has repeatedly declared war on this country, just as al Qaeda did prior to 9/11.\n\nAnd right now, those so-called journalists and the alt left radical mainstream media -- they're lying and their calling President Trump's temporary travel ban a religious test or a Muslim ban. And they are doing a complete disservice to you, the American people.\n\nIf we do not take this threat seriously, it's not a matter of if, it is a certainty. It's a matter of when we will be hit again. It's going to happen. So to all of the people conspiring out of political correctness trying to stop the president's safety measures, I'm warning you, you will be tied to all of this.\n\nAnd yes, I'm talking about Senator Chuck Schumer and his crocodile tears and the hypocrisy he's shown, President Obama, who appeased Iran and couldn't even say the words \"radical Islam,\" the liberal and Democratic politicians, members of the mainstream media.\n\nI've said this many times. To all of those out there who are more worried about the slight inconvenience of a few travelers versus the lives of the American people -- to you, my message is clear. If another 9/11-style attack is committed here in the United States, blood will be on your hands. Deal with that!\n\nJoining me now is former Trump campaign manager, partner at Avenue Strategies, Corey Lewandowski, from the American Center for Law and Justice, our friend, Jay Sekulow, is back. Good to see you both.\n\nAll right, Corey, let me start with you. This is so simple and basic, inconvenience versus gambling with the lives of Americans. Why is this even problematic? Why is left so dug into this pre-9/11 mindset?\n\nCOREY LEWANDOWSKI, FMR. TRUMP CAMPAIGN MANAGER: Sean, what I don't understand is the notion that we don't want to put American first. You know, this is what the president talked about in the campaign. This is what he's implementing, and what he has said very clearly is that his priority is to make sure that the people of this country, the United States of America, are safe from all enemies foreign and domestic.\n\nAnd what that means is before we let people into the country, who we have no idea what -- who they are or what their intentions are, we're going to slow down. We're going to have a better vetting system. And how is the left even trying to argue that this isn't the best interests of all Americans? They are so out of touch with what's going on in America, this is why they continue to lose elections.\n\nHANNITY: All right, let me go to Jay. Jay, you have been so all over the legal side of all of this. The president earlier today on Air Force One suggested what you have been suggesting last night, that he move forward with another executive order, rather than going back to the Seattle court or going to Justice Kennedy, who then would make a decision one way or the other or send it to the entire Supreme Court.\n\nI think you like the idea of a new executive order, correct?\n\nJAY SEKULOW, AMERICAN CENTER FOR LAW AND JUSTICE: Yes. Yes because what that will do is rectify any inconsistency, or at least perceived inconsistency, between the executive order and the directive from the White House.\n\nWhat the president simply does is change a paragraph, take a paragraph from the White House directive, put it into the executive order, reissue the executive order. It moots out the existing 9th circuit case, moots out the Washington state federal court case.\n\nThe same groups will file a lawsuit, and they may win at the district court and they may win at the court of appeals. But let me tell you what that happens when that one goes to the Supreme Court of the United States. You don't have to worry about a 4-4 split, that's 8 to nothing. The president has the authority, period. And there's no confusion.\n\nHANNITY: Why would the change of one paragraph -- and you were nice enough, kind enough to send over suggestive (sic) language that you like to me earlier today on my radio show. But why would the change of one paragraph make all the difference, and even though you recognize that the Seattle court may go the same way, the 9th circuit predictably could go the same way -- why would this make all the difference before the Supreme Court?\n\nSEKULOW: Yes, because for the Supreme Court, what they're going to look at is an issue. What is the issue that will be before the Supreme Court? And that issue will be, does the president have the statutory and constitutional authority to issue the executive order, and did that executive order fit within that statutory authority?\n\nThe answer to that will be yes, especially if you end (INAUDIBLE) I don't want to too technical here -- the due process issue, this issue of, were the people that had Green Cards or visa included or not? Initially, it wasn't clear in the executive order. Then there was a White House directive saying, No, were not going to apply it to the Green Card holders, to the folks with visas, the students. Now if you clarify that, there's no ambiguity.\n\nSo there's only one thing that can be looked at, does the president have that statutory authority?\n\nHANNITY: Yes, but you know and I know--\n\nSEKULOW: Is there a constitutional basis?\n\nHANNITY: But that was really the question before the court this time. I mean, you know when you have a judicial activist court like the 9th circuit or this judge in Seattle -- I mean, what -- and I guess this is an important political question, Corey, is Democrats can't get done at the ballot box by convincing Americans to vote for them, what they can't get done legislatively -- that's why judicial activism is such a danger because they look for courts to legislate from the bench. That's why this election I think was so important.\n\nLEWANDOWSKI: Sean, this election is so clear, right? This is so clear. The Democrats' ideas have been, you know, just completely decimated. The American people have rejected them wholeheartedly. What you look forward to in 2018 is a number of Democrat U.S. senators sitting in states that are up for -- that are going to be up for reelection in states that Donald Trump won. You look at Florida, Missouri, Montana. You know, you go right down the list, Ohio.\n\nThese are places where the American people voted overwhelmingly for President Trump and his agenda, and now you've got Democrats sitting in those seats who are going to have to try and defend themselves against the Trump agenda.\n\nAnd the bottom line is the people of those states have rejected the left- leaning politics and the left-leaning agenda because they want a new course for America.\n\nHANNITY: You know, it's funny, Jay, this -- I don't -- I don't think they're honest people, but Politifact was trying to catch me all day on my statement that the 9th circuit is one of the most overturned, if not the most overturned court of appeals in the country, relating (ph) the cases going up to the Supreme Court. Depending on the number of years you count, they're either one or two, correct?\n\nSEKULOW: Right. Yes, and 80 -- the American Bar Association published in 2010 that they were overturned 80 percent of the time. That's the ABA.\n\nAnd then if you look at the other data that's gathered by just going the Supreme Court Web site, looking at the cases, doing the analysis, they're either number one most years -- I mean, mostly number one -- a couple of times, they're number two.\n\nBut if you look at it over a -- say a decade, you're talking about an 80 percent overturned rate. So number 1 one year, number 2 the next year. That tells you about their jurisprudence. I mean, my joke always was--\n\nHANNITY: But you know what's great about that?\n\nSEKULOW: -- if you win in the 9th circuit, that's not good news, you're going to lose at the Supreme Court.\n\nHANNITY: So what the president now is leaning towards, which I know you agree with, the new executive order, and you're even predicting it might go exactly the same way at the court level and then up to the 9th circuit, but you say there's no way the Supreme Court would stay with that. History has proven you're probably right--\n\nSEKULOW: I just can't imagine the Supreme Court saying -- yes, I can't imagine the Supreme Court saying the president doesn't have authority. They may try to raise that, you know, religion clause issue of it's preferring religious minorities--\n\nHANNITY: That's not going to fly.\n\nSEKULOW: -- but the Supreme Court -- I've done those religion cases at the Supreme Court, and they know that that is not going to go anywhere with the U.S. Supreme Court. Nowhere, 8 to zero.\n\nHANNITY: I agree with you. All right, guys, good to see you both.\n\nAppreciate for it\n\nAnd up next on this busy news night tonight here on \"Hannity\"--\n\n(BEGIN VIDEO CLIP)\n\nSTEVEN GERN, FORMER U.S. MARINE: My simple question was, as an American, if I went out in town right now, would I be welcome? And they (INAUDIBLE) said, Absolutely not, you would not be welcome.\n\n(END VIDEO CLIP)\n\nHANNITY: All right, it is the video that is exploding on Facebook -- get this, 44 million views! The man is a former Marine staff sergeant. He filmed that last week while he was in Iraq serving as a private contractor. Now, he was sent back to America for his own safety after he posted the video. You'll meet him next.\n\nPlus, a new report says the border wall will be built in about three-and-a- half years. We'll get reaction from the Kansas secretary of state, Kris Kobach. And Geraldo Rivera, Bo Dietl are also with us straight ahead.\n\n(COMMERCIAL BREAK)\n\n(NEWSBREAK)\n\nHANNITY: And welcome back to \"Hannity.\" Former Marine staff sergeant Steve Gern was working as a private security contractor in Iraq -- well, at least until a few days ago when he was forced to flee the country. Now he posted a video on Facebook talking about President Trump's temporary travel ban. It got more than 44 million views! Watch this.\n\n(BEGIN VIDEO CLIP)\n\nGERN: I'm currently in Iraq, which is one of the countries that were on the list. And there's been a lot of discussion about the executive order. Obviously, in the United States there's a lot going on. And over here, there's a lot going on, as well, just a lot of things you all don't see.\n\nSo the other morning, were having a discussion on the executive order, and a lot of the Iraqis obviously showed their displeasure in this executive order and why they feel like they've been betrayed by the United States, and so on. I listened to what they had to say, and after they were done, you know, yelling and screaming about their opinion on things, I asked a simple question. And I got an answer to that simple question and I got it without hesitation.\n\nMy simple question was, As an American, if I want out in town right now, would I be welcome? And they answered (INAUDIBLE) said absolutely not. You would not be welcome. And I said, OK, so what would happen if I want out in town? And they said the locals would snatch me up and kill me within an hour. I'd be tortured first, and after they were done torturing me, I'd probably be beheaded. It would, you know, go on video for everybody to see as, you know, an example.\n\nThe point I'm trying to make is, you know, this is the local populace that would do this. This isn't ISIS. This isn't al Qaeda. This isn't the PMU (ph). This isn't a militia from the Iranians or anything like that. This is the local populace that would do this.\n\nSo my question to them was pretty simple then after that. If you would do this to me in your country, why would I let you in my country? Because all this means to me is that if you had the opportunity to take the life of an American, you would do it.\n\nSo maybe that's something you all need to think about back there. If this is the way some of these cultures feel, this is the way that these countries feel about Americans, why would you be so naive to believe that if they came to the United States, they would do anything any different from what they would do right here in their own country?\n\n(END VIDEO CLIP)\n\nHANNITY: And joining us now to share his story is Steve Gern. Steve, good to see you. Thanks for being here.\n\nGERN: Thank you, sir. Thanks for having me.\n\nHANNITY: I know you say these are simple questions that you're asking, but they're really profound questions that clearly hit a nerve. Were you surprised by the 44 million views?\n\nGERN: Absolutely, I was. I posted that at 11:00 o'clock at night, and I went to bed, got up at 05 the next morning for -- to get ready for mission. I was told that it had hit 1.1 million at that time. I didn't think anything of it. I kind of laughed it off. And I went out on mission, got my weapons, and came back from mission, put my weapons up and was figuring about that time, it was around 5 million views. And I was expecting, obviously, a call on the radio to make it to the office. And I shortly -- shortly after, I got that call.\n\nHANNITY: All right, so you really were advised this had gone so viral -- and people now know what you look like -- you were sent home. Is there any chance you get to ever go back?\n\nGERN: I don't know what the intentions are of the company I'm currently working for or employed by. I do know that I was removed, obviously, for safety issues. So I do not know exactly where we're going to go from here.\n\nHANNITY: All right, let -- I guess the -- what's so frustrating about this is, to me, it's a very simple equation. We're not saying that you can't come to America. We're saying that we need to check you out. What really bothers me deep down inside is when all our top intelligence officials are telling us that we -- that ISIS will infiltrate the refugee population -- well, ISIS may be evil, but that doesn't mean they're stupid. And\n\nI got to imagine that they would train people to withstand whatever questioning would come their way. How do you ever positively ascertain what is in somebody's heart, if they want to come to America, if they want to come here for freedom or they want to come here to proselytize, or they want to come here to hurt Americans and blow up a school or a mall or whatever.\n\nGERN: You're really not going to be able to. And what I have learned over the years of working, you know, in Iraq and Afghanistan is they're very good at manipulation. They can manipulate just about anyone. And they're really good at it. So they can tell you what they -- you know, what they want you to hear, and they can keep that up for many, many years. And then eventually, when it's time, they'll do what they believe is right.\n\nHANNITY: Yes.\n\nGERN: And if that is to, you know, hurt an American or hurt many of us at one time, they're going to do it.\n\nHANNITY: I think your admonition -- I know you said these are simple questions, but they're very deep, very profound and very timely and relevant to the debate that's going on in the country.\n\nSir, glad you got home safe. Thank you for being with us. Congratulations on the 44 million hits.\n\nAnd when we come back, a new report indicates how long it will take for the border wall to be built and how much it will cost.\n\nPlus, earlier this week, protests broke out in the streets of Phoenix over the deportation of a convicted criminal illegal alien. Kris Kobach is here.\n\nAnd also later tonight--\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: I feel totally confident that we will have tremendous security for the people of United States. We will be extreme vetting.\n\n(END VIDEO CLIP)\n\nHANNITY: President Trump speaking about the need for extreme vetting during today's press conference. We'll check in with Geraldo Rivera, Bo Dietl. They're coming up tonight right here on \"Hannity.\"\n\n(COMMERCIAL BREAK)\n\nHANNITY: Welcome back to \"Hannity.\" So Reuters is reporting citing a U.S. Department of Homeland Security internal reports that President Trump's border wall is projected to cost up to $21.6 billion and could take more than three years to construct. But while the border wall plans moved ahead, protesters took to the streets of Phoenix on Wednesday night following the arrest of an illegal immigrant woman, a convicted criminal, who was later deported.\n\nJoining us now with reaction is the secretary of state of Kansas, Kris Kobach is with us. Good to see you, sir. How are you?\n\nKRIS KOBACH, KANSAS SECRETARY OF STATE: Great to be back with you.\n\nHANNITY: I know a lot of people were pushing for you to be in charge of the department of homeland security. I also understand you met with the president. Did you talk specifically about the wall?\n\nKOBACH: We have talked about the wall. And I think he regards it as one of his top priorities in the White House to get this project uncover and the America people want it done. And it's doable. It's 1,989 miles of border. We only have about 386 miles right now that you would consider a true impervious wall or a serious fence. There's a lot to build. But you know, we put a man on the moon and this is not a high-tech project. This is a low-tech project. This is getting barriers in place, and it will get done.\n\nHANNITY: To me it's so basic and so fundamental and so simple, it's one of those common sense measures. I understand the expense aspect of it, but I would ask the president numerous times when we were out traveling with him and the other candidates and some of the town halls we did, and he was very clear. He didn't expect Mexico to write him a check. He said no, but when we renegotiate NAFTA and other trade deals or other economic deals, we will have so much of my financial benefit that's how it will get paid for. Do you agree that that is totally possible, as I do?\n\nKOBACH: Yes, I do. And Sean, there's actually probably half a dozen ways that we could recoup the money back from Mexico. We could do it through a surcharge on Mexican immigrants coming in, or nonimmigrants, people coming in temporarily on their visas. We could do it by basically stopping remittances, the payment that illegal aliens and legal elites send home to Mexico and use that as leverage. There's so many ways we could get Mexico to effectively indirectly pay for this wall that I think it's silly that people question that it can't be done.\n\nHANNITY: As one of the most outspoken advocates as I have been in favor of the small for many, many years, we are talking about 2006 law allows for 700 plus miles to be built. Is that enough from your perspective? You think that's enough?\n\nKOBACH: Well, the 2006 law compelled, demanded that it be built, and Congress wanted to make a statement. But there doesn't have to be a statute from Congress ordering the executive branch to build the wall. There just needs to be funds from Congress.\n\nSo the 700 miles is not enough. But it's not like we did another act from Congress ordering President Trump to build the entire 2,000 miles. We've got all the statutory authority we need. Now we just need funding to pay the price.\n\nHANNITY: All right, good to see you, sir. Thank you for your advocacy for our safety and security, we appreciate it.\n\nWhen we come back, a new poll shows you, the American people, you trust the White House more than the alt left, radical mainstream media, to be truthful. Can't blame them. Joe Concha, Lisa Boothe, they'll weigh in.\n\nBut first, tonight.\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: I feel totally confident that we will have tremendous security for the people of the United States. We will be extreme vetting.\n\n(END VIDEO CLIP)\n\nHANNITY: President Trump, he spoke about the need for extreme vetting at the White House today. Up next we'll get reaction from Geraldo Rivera, Bo Dietl as \"Hannity\" continues.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: I feel totally confident that we will have tremendous security for the people of the United States. We will be extreme vetting. There are tremendous threats to our country. We will not allow that to happen, I can tell you that right now. We will not allow that to happen.\n\n(END VIDEO CLIP)\n\nHANNITY: That was President Trump talking about extreme vetting during today's joint press conference with the Japanese prime minister. Joining us now with reaction in the New York City, mayoral candidates, our friend Bo Dietl, who by the way, I'm endorsing, but if it hurts you I'm not going to endorse you.\n\n(LAUGHTER)\n\nBO DIETL, FORMER NYPD DETECTIVE: I am independent. The Democrats dumped me.\n\nHANNITY: I want everyone in the audience to know --\n\nGERALDO RIVERA, FOX NEWS SENIOR CORRESPONDENT: The Democrats dumped him?\n\nHANNITY: You have not lived until you have been out on the town with Bo Dietl and Geraldo Rivera. Some of the best days of my life or with these two guys.\n\nRIVERA: Sean and I both endorse you, Bo.\n\nDIETL: I am an independent conservative right now. Well, all I can say is, Sean, my heart just dropped when we were watching that video from 9/11 because I was down there that day when those towers came down. And you know what's happening right now, Sean, since this ban has been now released, all of a sudden 1,100 have come into our country of refugees, 1,100 from the seven different countries that were supposed to be banning.\n\nWhat my problem is right now is we forget real quickly in Syria, two of the passport places in the main cities in Syria were taken over by ISIS. They are printing their own passports. They have fake passports. We are not stopping them. Now they know, they're like rats coming out of the sewer. Come to America. It's wide open right now. This is so damn ridiculous. Then you get attorney generals in that state of Washington patting each other on the back like they did something so good. All we want to do is know who's coming in who wants to kill us Americans.\n\nHANNITY: Let me bring Geraldo in here. Geraldo, you are do I get along, and we agree and disagree occasionally. I know one of your most passionate issues as immigration. All right, so we have some differences on it. But this to me is something we probably would agree on, and that is you want to come to our country, our top intelligence officials, and now even President Assad is announcing terrorists are going to infiltrate the ISIS population, the refugee population.\n\nRIVERA: You're a pure-hearted patriot, you're a sincere person, and I cherish our friendship. But that's not what we're talking about here. We're talking about, of course, the president United States, the 45rd president, we are all proud to call him our friend as well. But what his Justice Department did in this case and whoever counseled him on drafting that executive order --\n\nHANNITY: It really wasn't his Justice Department.\n\nRIVERA: It was a little late, it was bush league. You did at the top of this program, you put together this is why we should be afraid, this is the danger posed by immigration from these seven troubled countries. You I submit did a better job, the producers of this program did a better job in presenting the risk, the imminence of the risk than the federal government did in the case before the district court and before the ninth circuit.\n\nHANNITY: I agree with you.\n\nRIVERA: It was so mediocre, the president should dump this executive order right now, start all over again. Give me a felt tip pen and a yellow pad. I'll give you an executive order that will be constitutional. For example, you are afraid of imminent ISIS attack. So why do you stop the seven-year- old coming for the heart transplant or you break up elderly couple or the students that are matriculated in the state university?\n\nHANNITY: It was temporary.\n\nRIVERA: It was so -- but temporary can't be stupid.\n\nHANNITY: Let me agree with one point, Geraldo. Geraldo, I heard the arguments that night, and I was screaming listening to them, because you're right. In our sleep, all of us could have done a better job. This was not Donald Trump's attorney general. He had not been approved yet, and that was the problem with obstructionism, right?\n\nRIVERA: Well, you can say that if Jeff Sessions had been in place, something would have been different. I tend to doubt it. For example, you and I, we had a debate over the order. I said this isn't substantive. This is hubris. This is just action for action's sake. It's not decisive in the sense that it's designed to accomplish a result. For example, why do you not exclude people who already have green cards from your order? What about people from valid visas? People who have global passports?\n\nDIETL: OK, we all agree.\n\nRIVERA: All you end up doing is ticking off everybody and stimulating these demonstrations.\n\nDIETL: We all agree with that. So what we got to do right now, the president has got to immediately put another order, clarify what we got to do. This is life and death now. I was there September 11th when those building came down, I saw the destruction that people were up against. Geraldo, I'm real nervous about it because right now they're just coming in faster than ever because now they know there's an opening there. Nobody is watching the gate, and they're all rushing in. And I'm nervous about this. President Trump should respond on this, get a new order immediately.\n\nRIVERA: Here's what he says, here's what the president can say. I declare victory. Why do I declare victory? Because under President Obama there were 110,000 refugees approved for this program. Guess what? There are only good to be 50,000 this fiscal year. In other words, Donald Trump's actions have already sliced this program more than in half.\n\n(CROSSTALK)\n\nRIVERA: If you have a kid or a grandpa or triplets that are seven years old, that's --\n\nHANNITY: That's common sense applied to the law. You and I both agree.\n\nRIVERA: Bo could interview, he'd find out. You're not talking about 23- years-old strapping guys.\n\nDIETL: Geraldo, Geraldo, let's look at the migration into Europe, 80 percent of them are young males, good fit young males. They're not any women and children there.\n\nRIVERA: I don't know that to be true, Bo. And we're not talking about Europe. We're talking about the United States.\n\nHANNITY: Coming up, a new poll reveals the American people believed the Trump administration is more truthful than the mainstream minute. Joe Concha, Lisa Boothe, they react coming up straight ahead.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: I happen to how dishonest the media is. I happen to know stories about me that should be good or bad. I don't mind a bad story if it's true, but I don't like bad stories, stories that should be a positive story when the make them totally negative. I understand the total dishonesty of the media better than anybody. And I let people know it. The media is a very, very dishonest arm. And we'll see what happens.\n\n(END VIDEO CLIP)\n\nHANNITY: That was President Trump calling out the dishonest press. A brand new poll released on Tuesday shows the majority of people agree with him. According to an Emerson College poll, 49 percent of registered voters believe that the Trump administration is truthful compared to only 39 percent that said the media tells the truth.\n\nNow, The Hill's media reporter Joe Concha wrote about the poll's findings early this week, and President Trump tweeted it doubt. Joe now joins us as well as Fox News contributor Lisa Boothe. Joe, I've known you for a long time. When I saw that, I'm thinking this is great for Joe. The president just tweeted out his article. But the polls said, doesn't it speak volumes?\n\nJOE CONCHA, THE HILL: We've known this for a while, Sea, that there is overwhelming bias in the media. It's not something I have to explain to your audience anymore. USA Today did a poll right before the election, and they asked who do you think the American press is rooting for in this election, Hillary Clinton or Donald Trump? And by a 10-1 margin, they said of course Hillary Clinton, including a majority of Democrats noticed that Democrats were obviously getting the benefit of the doubt from the press.\n\nSo this is something that is no longer something that's a secret or I have to explain or you have to explain. The cat's out of the bag. And that's because of WikiLeaks, Sean. That was devastating to the fourth estate. That showed a debate questions being shared in advance, open collusion with the Clinton campaign.\n\nHANNITY: Joe, You and I discussed this, the media didn't cover the WikiLeaks because it impacted them, their collusion with Hillary Clinton and their campaign, and at the highest levels, the highest level of corruption we've seen. Lisa Boothe, I want your thoughts.\n\nLISA BOOTHE, COLUMNIST, WASHINGTON EXAMINER: Absolutely, Sean. I think what we've seen from the media is really this concerted effort to undermine the credibility of President Trump. But what they don't seem to understand is their credibility is at risk here too. And what we've seen in just the recent polling that Joe pointed out and also just from Gallup is that trust in media is at an all-time low.\n\nAnd President Trump is right when he says that the media can be blatantly dishonest. We've seen stories even from The Washington Post recently literally making of meetings that never happened between Steve Bannon and Homeland Security Secretary Kelly. Secretary Kelly said that story is a fantasy. And it has been discredited because that meeting just simply didn't happen and the reporter actually never wanted reached up to the White House for a comment. So when you see that kind of commits, it's just sort of laughable for the media to continue to try to undermine the Trump administration and undermine their credibility when they don't have any credibility.\n\nHANNITY: We have this list that we've been putting up on the screen all the time, at least 16 that we've identified examples of stories, fake news stories that have run since Trump has been president. But then there are other stories, Joe, like I'm watching Chuck Todd said isn't this a religious litmus test? And how many people in the media have set on the refugee issue and the executive order of the president, how many have gone as far as to say, oh, this is a Muslim man when it doesn't impact about 90 percent of the world's Muslim population, 43 majority Muslim countries not impacted. It's not even dishonesty. It's an outright lie because they know the truth.\n\nCONCHA: There's not accountability, that's the problem, Sean. With all these reporters at senior levels, New York Times, Politico, showing the sheriff's stories in advance, for example, were they reprimanded? Were they fired? No. They were promoted in certain cases. Glenn Thrush of Politico literally shared stories in advance with John Podesta asking for approval while he was at political. And The New York Times knows this and they hired him to cover the Trump White House.\n\nHANNITY: He fits right in.\n\nCONCHA: So we know that they're biased and we know that they're corrupt. But the priority, Sean, also are completely out of whack. Think about the blistering pace of the Trump administration has been acting. There's been an executive order at least once every other day, 11 total. There was a Supreme Court justice that was nominated. How many times have you seen any major newspapers or any major outlets analysis around what happens now that we're going to have a conservative leaning Supreme Court? Or, what does it mean that we're dropping out of TPP or that federal law enforcement may be getting involved in taking on gangs, which is responsible for thousands of deaths in this country? The priorities, Sean, also are completely out of whack.\n\nHANNITY: I couldn't agree with Joe more, Lisa. They way I've been saying it, while they're focused on their fake news stories and their petty attacks and calling Trump a liar, they're missing huge shock and awe campaign, and a political earthquake that is erupting under their feet, and they don't get it. They don't get Trump. I don't think they ever will, will they?\n\nBOOTHE: We saw that in general election as well, and I think also the reason why their credibility is in question and why voters don't trust them is there's a clear double standard that exists, Sean. And I can tell you as someone who has worked on Republican campaigns and has worked for Republican members of Congress, it is so clear. We just see the double standard between the fact that the media wants to call into question the credibility and the trustworthiness of this administration, but what about Benghazi? What about the blatant lies that the Obama administration told us? What about fact that Ben Rhodes bragged about the media and the public about the Iran deal? What about the fact that Jonathan Gruber basically said the American people stupid, we're stupid, and that's how the Obamacare law essentially got passed? Where was the outrage then from the media? Why weren't they holding the Obama administration's feet to the fire?\n\nHANNITY: You are so right, and it is -- journalism is dead and we have an informational crisis. But people are voting with their clickers, I can tell you that. Guys, good to see you both, great column, congratulations, Joe.\n\nWhen we come back, we need your help, an important \"Question of the Day.\" And we are introducing a new segment that you can participate in. That's next.\n\n(COMMERCIAL BREAK)\n\nHANNITY: Time for our big \"Question of the Day\" today. Do you think liberals are gambling with the lives and the safety of you, the American people? Go to Facebook.com/SeanHannity, @SeanHannity on Twitter, let us know what you think.\n\nAlso tonight, big announcement. I want to talk about a new segment we'll be starting on the program. It is called \"Hannity Hotline.\" You have something you want to say to me, nice mean, whatever, anything you want, we'll be playing some of your comments on air. Call the number you see right there on your screen, 877-225-8587, 877-225-8587, and we'll start playing some of your messages next week. Can't wait to hear from you, especially those that love me or hate me.\n\nAnyway, that is all the time we have left this evening. As always, thank you for being with us. Hope you have a great week. We'll see you back here on Monday.\n\nEND\n\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "authors": [], "publish_date": "2017-02-10", "source": "foxnews", "top_words": ["thats", "message", "travel", "right", "viral", "plans", "trump", "state", "retired", "know", "wall", "talks", "court", "theyre", "secretary", "trumps", "going", "president", "american", "video"], "summary": "Now, earlier today, President Trump had this to say about the 9th circuit court's ruling.\n(END VIDEO CLIP)HANNITY: Now, President Trump is listening to the top intelligence and defense officials in this country.\nBut it's not like we did another act from Congress ordering President Trump to build the entire 2,000 miles.\nNow, The Hill's media reporter Joe Concha wrote about the poll's findings early this week, and President Trump tweeted it doubt.\nI think what we've seen from the media is really this concerted effort to undermine the credibility of President Trump."}