{"url": "http://www.foxnews.com/us/2017/02/02/federal-judges-to-hear-arguments-defending-trump-travel-ban.html", "id": "252", "title": "Federal judges to hear arguments defending Trump travel ban", "text": "Federal judges on opposite coasts are due Friday to hear legal arguments defending President Donald Trump's travel ban on citizens from seven predominantly Muslim countries. The ban is sure to reverberate through the courts on a likely path to an appeals court or the U.S. Supreme Court. Here's a look at how the legal issues may play out:\n\n___\n\nQ: WHAT HAS HAPPENED IN COURTS TO CHALLENGE THE PRESIDENT'S EXECUTIVE ORDER?\n\nA: The American Civil Liberties Union, several attorneys general and immigrant advocacy groups went to federal court to block Trump's action, which barred entry of refugees for four months and citizens of seven Muslim-majority countries — Iraq, Iran, Libya, Somalia, Sudan, and Yemen — for three months and Syrians indefinitely.\n\nFederal judges in Boston, Brooklyn, New York, Los Angeles and Alexandria, Virginia, issued temporary restraining orders blocking at least parts of the order.\n\nThe Brooklyn judge on Thursday extended her order until Feb. 21, and a Justice Department lawyer said the government would ask her to throw out the case.\n\nFurther hearings are scheduled around the country to determine if temporary orders should be upheld and extended.\n\nBecause the emergency petitions were made ex parte, meaning the federal government had little or no time to respond, hearings Friday in Boston and Seattle will give the government a better opportunity to defend the president's order after the chaos that ensued last weekend when travelers were stranded at airports.\n\n___\n\nQ: WHAT IMPACT HAVE THE TEMPORARY COURT ORDERS HAD?\n\nA: Many of those detained at airports were released, some before court orders were issued and more afterward. In Boston, all the named plaintiffs detained at Logan International Airport were freed, said Carol Rose, executive director of the ACLU of Massachusetts.\n\nIn New York, two named plaintiffs from Iraq were released, though the judge anticipated the case could expand to a class action representing a broader array of people, including tourists, students and permanent legal residents with green cards.\n\nIn several cases, visitors with visas that were valid when issued arrived on U.S. soil to find the State Department had revoked those privileges. Some were turned around and, in some cases, deported.\n\nThe federal judge in Los Angeles ordered the U.S. government Tuesday not to cancel any validly obtained immigrant visas or bar anyone from the seven nations holding them from entering the U.S.\n\nBut the government has maintained that order and similar ones do not apply because the visas are no longer valid. The named plaintiffs in the L.A. case, a group of Yemenis still in Djibouti, were not allowed to board planes to the U.S.\n\nJayashri Srikantiah, a professor at Stanford Law School and director of the Immigrants' Rights Clinic, said that while the court order appears to clear the way for entry, a more fundamental barrier exists.\n\n\"The first step is for them is whether they can obtain a valid boarding pass,\" Srikantiah said. \"They need to be permitted to board so there can be a discussion at the border about what happens next.\"\n\n___\n\nQ: WHAT ARE THE LEGAL ISSUES JUDGES NEED TO SORT OUT?\n\nA: The main issues before the courts are whether Trump had the authority to issue the executive order and whether it was constitutional. The constitutional questions include whether the travelers were entitled to some kind of hearing before being barred and whether their religion played any role in their treatment.\n\nOn the issue of due process, a legal permanent resident will have firmer standing in court than someone on a tourist visa, said Stephen Vladeck, a professor at the University of Texas School of Law.\n\nThe religion issue has played out publicly with advocates and protesters claiming Trump's action was intended to ban Muslims. The president tweeted that it was not a ban on Muslims and was not about religion.\n\nHowever, several of the lawsuits point out Trump's campaign rhetoric about banning Muslims and statements about making exceptions for Christians from the seven countries.\n\n\"The government can't single out one religion for harsher treatment than another,\" Vladeck said.\n\nThat issue presents the strongest argument for those who have the weakest legal standing in U.S. courts, such as a refugee who's never set foot in the country, Vladeck said.\n\n___\n\nQ: WHAT WILL HAPPEN IF COURTS RULE INCONSISTENTLY?\n\nA: With different challenges filed in so many courts, there is likely to be confusion going forward, legal experts said.\n\n\"You have the opportunity, frankly, for a dizzying array of judicial decisions trying to parse out how it applies to different groups of noncitizens,\" Vladeck said.\n\nThe Department of Justice is likely to take a case to a court of appeal to try to make sense of the many rulings, said Josh Blackman, a professor at South Texas College of Law in Houston.\n\nOf course, those appellate courts could disagree, which has happened on many major issues including gay marriage and ultimately put the issue before the Supreme Court.\n\nThe high court would probably not hear the case until the fall. The orders, which could be extended, are due to expire long before that.\n\n\"This order will not be the final word on it,\" Blackman said.", "authors": [], "publish_date": "2017-02-02", "source": "foxnews", "top_words": ["seven", "travel", "hear", "judges", "trump", "courts", "ban", "orders", "issues", "vladeck", "court", "trumps", "defending", "federal", "issue", "order", "arguments", "legal"], "summary": "Federal judges on opposite coasts are due Friday to hear legal arguments defending President Donald Trump's travel ban on citizens from seven predominantly Muslim countries.\nHere's a look at how the legal issues may play out:___Q: WHAT HAS HAPPENED IN COURTS TO CHALLENGE THE PRESIDENT'S EXECUTIVE ORDER?\n___Q: WHAT IMPACT HAVE THE TEMPORARY COURT ORDERS HAD?\nA: Many of those detained at airports were released, some before court orders were issued and more afterward.\n___Q: WHAT ARE THE LEGAL ISSUES JUDGES NEED TO SORT OUT?"}