{"url": "http://www.foxnews.com/transcript/2017/02/07/president-travel-ban-executive-order-goes-to-court.html", "id": "208", "title": "The president's travel ban executive order goes to court", "text": "Watch the latest video at video.foxnews.com\n\nThis is a rush transcript from \"Special Report with Bret Baier,\" February 7, 2017. This copy may not be in its final form and may be updated.\n\nBILL HEMMER, FOX NEWS: So a moment ago we were listening to the ongoing arguments being made in San Francisco. I want to drop in on a moment here. We picked a section of the government's case where the judge is asking a question and the attorneys from the Justice Department are answering that. Just dip in and try and listen to the key aspect of the risk involved on behalf of the Trump White House.\n\n(BEGIN AUDIO CLIP)\n\nJUDGE RICHARD CLIFTON, NINTH CIRCUIT COURT OF APPEALS: Is there any reason for us to think there is a real risk where the circumstances have changed such that there would be a real risk if existing procedures weren't allowed to stay in place while the administration, the new administration, conducts its review?\n\nAUGUST FLENTJE, ASSISTANT ATTORNEY GENERAL SPECIAL COUNSEL: Well, the president determined that there was a real risk. That's why the president determined that the best course was a temporary -- it's a short halt in entry for 90 days while these procedures are looked at.\n\n(END AUDIO CLIP)\n\nHEMMER: So that is in essence the crux of the argument they are debating there in San Francisco. It is ongoing there, by telephone, nonetheless.\n\nI want to bring in our panel right now: Tom Rogan, columnist for National Review and Opportunity Lives, and Mara Liasson, national political correspondent of National Public Radio, editor in chief of Lifezette, Laura Ingraham, and syndicated columnist Charles Krauthammer. Good evening to all of you tonight. You were all listening. It's ongoing. Laura, can the government win here?\n\nLAURA INGRAHAM, LIFEZETTE.COM: It's going to be hard at the Ninth Circuit. The government should win. And a couple thoughts after listening to the early part of this oral argument. Number one, it's not easy to do an oral argument on the phone. Usually in cases this important, you will do it in the presence of the judge's appearance to argue the case. It's a little harder on the phone where you have pauses and the second time delay. That's a little bit of an odd.\n\nThe thing that I really noticed is how ill-suited judges are to sit in judgment of foreign policy or national security issues, which is what they are doing here, when they really examine the question of standing and the question of whether there is a rationale for this particular executive order. The statutes and the issue of sovereign immunity, it's very clear that the president has the authority on this issue.\n\nYou have this Justice Department lawyer who is a career lawyer. He's been at the Justice Department for a long time. But he's not one of Trump's guys. He's like the third person that was selected because the other two had to recuse themselves because their old law firm is involved in the case. So this circuit, as Charles said last night and many nights before, is the most reversed of the country by the Supreme Court. And tonight they sounded a lot more like ideologues than they did like justices to me in knowing the facts of this case.\n\nHEMMER: Tom, based on what you heard, what do you think?\n\nTOM ROGAN, NATIONAL REVIEW: I agree that if you look at the precedents of constitutional law there is a clear inclination to provide the executive with all possible doubt as issues and cases pertain to national security. Article two, section, two, the president is the commander in chief.\n\nBut I think I agree with Laura in the sense that you listen to the arguments. I was actually surprised, even though the ninth circuit is known for this reputation, I was surprised quite how emotionally vested the tenor of the questioning seemed to be. And of course it's via telephone, you don't see the body language. But I think President Trump has a challenge on his hands.\n\nHEMMER: You are suggesting the questioning is more aggressive than you would expect?\n\nROGAN: The nature of the questioning in terms of, there seems to be a sort of idea that some of the precedents on the notion of executive power, on national security, doesn't exist.\n\nHEMMER: Mara, I just want to go back to the piece of sound we just heard there. You heard the attorney for the Justice Department the president determined there was a real risk here. And the law has always sided going back to the early 1950s with the commander-in-chief.\n\nMARA LIASSON, NATIONAL PUBLIC RADIO: Right. It's interesting the two areas that Donald Trump cares most about, trade and immigration, happen to be the two things that the president has the most control over. And here he is exercising his control.\n\nThis is kind of inning number one in what's going to be a very long fight. It will go to the Supreme Court, and there's going to be issues of executive power and then there's going to be the question of whether this is a religious test or not. They haven't gotten into that yet. But this is an area where traditionally the president gets a lot of deference. He says there was some kind of imminent risk. If we continue to let people in even under our current system of what the Obama administration would have said was pretty --\n\nHEMMER: National security. In a moment we're going to play another clip, the closing argument that the attorney for the Justice Department made. Charles, you were listening. And granted, it wasn't the full context of the states making their case, but you thought the attorney for the Justice Department was having a tough time.\n\nCHARLES KRAUTHAMMER, SYNDICATED COLUMNIST: I'm not sure he was top of his class way back in law school. He was not -- if you are going to do this, you really have to be prepared with answers. Clearly he wasn't.\n\nBut I must say I was surprised. We only heard the first half, meaning the presentation of the case on behalf of the federal government. And I found that the three judges were extremely aggressive. Now, it could be, having not heard the second half, which would be the questioning of the state, the state attorneys, that they would be equally aggressive. I just don't know.\n\nBut from the tone of the questioning, it looks as if the judges were extremely inclined to maintain the stay by the district court. We are in the middle of this, but we are talking about it. It is unfolding as we speak. So it is necessarily rather speculative.\n\nBut that was a pretty hostile bench the federal government was facing. And I am not sure it was appropriate. What they were arguing was the merits of the case, and I think they were sort of doing what is not in their purview. They are supposed to judge whether or not the president exceeded his authority. It's a very hard case to make, but they probably will find he did.\n\nHEMMER: Laura, listen to the final clip I will get you to comment on this.\n\n(BEGIN VIDEO CLIP)\n\nFLENTJE: I would strongly encourage the court, even if it has concerns with the government's position, that it immediately stay the portion of the injunction that applies outside the boundaries of the U.S. and extends beyond people who have been -- who are in the U.S. or who have been in the U.S. Thank you.\n\n(END VIDEO CLIP)\n\nHEMMER: It's a narrow issue when it comes down to it. Do the states have the right to bring the case?\n\nINGRAHAM: That goes right to the question which I think the lawyer for the Justice Department didn't raise early enough. Do foreigners living in foreign countries have a constitutional right to come into the United States? And do states have the standing to bring cases -- really what they are doing is essentially bringing it on their behalf. They claim that there's irreparable injury to the states if this executive order is allowed to be instituted and continues. But that is just a real leap. But do foreigners have a constitutional right to enter the United States? That is a whole separate question, but I think the answer to that is no.\n\nHEMMER: Here is how they made the case on the behalf of the state of Washington a moment ago.\n\n(BEGIN VIDEO CLIP)\n\nNOAH PURCELL, WASHINGTON SOLICITOR GENERAL: It was the executive order itself that caused irreparable harm to our states, to Washington and Minnesota, and our residents, and to many other states and people as described in many amicus briefs that have been filed. So of course we believe that the federal government has shown no irreparable harm from reinstating the status quo prior to the executive order.\n\n(END VIDEO CLIP)\n\nHEMMER: You have technology companies in the state Washington saying they could not access their employees. And that may or may not be the case, but how do you then balance that with national security?\n\nLIASSON: We are told national security usually trumps that, and we'll see if they do that.\n\nBut there's two things going on here. One is you say the ninth circuit is a more liberal bench, but those judges are human beings. And what I wonder is after you've had a president attack a judge and say if something bad happens, blame it on him on the entire court system, I wonder how much that affects.\n\nINGRAHAM: They are not doing their job and they are actually acting unethically if they allow that to cloud their decision-making. That's not what a judge is supposed to do. They are supposed to look at the statute, the constitution, and the facts at hand.\n\nLIASSON: I'm raising the question whether it affects them.\n\nHEMMER: But Laura, you believe the court will send it back to the state of Washington.\n\nINGRAHAM: They are not going to lift the stay that the district court put on it. This will go back to the district court perhaps to argue on the merits. They will file immediately at the Supreme Court, the U.S. government, and Lord knows what's going to happen at the court with perhaps four-four.\n\nHEMMER: If that is the case, then it's ongoing as the arguments are ongoing in the state of Washington.\n\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "authors": [], "publish_date": "2017-02-07", "source": "foxnews", "top_words": ["executive", "travel", "case", "national", "ban", "goes", "court", "going", "states", "justice", "order", "president", "department", "presidents", "question"], "summary": "You have this Justice Department lawyer who is a career lawyer.\nHe's been at the Justice Department for a long time.\nYou heard the attorney for the Justice Department the president determined there was a real risk here.\nIn a moment we're going to play another clip, the closing argument that the attorney for the Justice Department made.\nINGRAHAM: That goes right to the question which I think the lawyer for the Justice Department didn't raise early enough."}