{"url": "http://www.foxnews.com/us/2017/02/06/white-house-expresses-confidence-travel-ban-will-be-restored.html", "id": "274", "title": "White House expresses confidence travel ban will be restored", "text": "The White House says it expects the courts to restore President Donald Trump's ban on refugees and travelers from seven predominantly Muslim countries. Its argument for the executive order is founded on a claim of national security.\n\nThe next opportunity for the president's team to argue in favor of the ban will come in the form of a response to a lawsuit by Washington state and Minnesota contending that Trump's order harms residents and effectively mandates discrimination.\n\nThe 9th U.S. Circuit Court of Appeal has ordered the Justice Department to file its briefs by 6 p.m. EST Monday.\n\nThe San Francisco-based appeals court has already turned down a Justice Department request to set aside immediately a Seattle judge's ruling that put a temporary hold on the ban nationwide.", "authors": [], "publish_date": "2017-02-06", "source": "foxnews", "top_words": ["expresses", "travel", "ban", "turned", "travelers", "court", "house", "trumps", "confidence", "department", "justice", "order", "white", "restored", "washington"], "summary": "The White House says it expects the courts to restore President Donald Trump's ban on refugees and travelers from seven predominantly Muslim countries.\nIts argument for the executive order is founded on a claim of national security.\nThe next opportunity for the president's team to argue in favor of the ban will come in the form of a response to a lawsuit by Washington state and Minnesota contending that Trump's order harms residents and effectively mandates discrimination.\nCircuit Court of Appeal has ordered the Justice Department to file its briefs by 6 p.m. EST Monday.\nThe San Francisco-based appeals court has already turned down a Justice Department request to set aside immediately a Seattle judge's ruling that put a temporary hold on the ban nationwide."}