{"url": "http://www.foxnews.com/transcript/2017/02/06/judge-napolitano-talks-travel-ban-legal-battle-epshteyn-executive-order-is.html", "id": "205", "title": "Judge Napolitano talks travel ban legal battle; Epshteyn: Executive order is completely lawful", "text": "Watch the latest video at video.foxnews.com\n\nThis is a rush transcript from \"The First 100 Days,\" February 6, 2017. This copy may not be in its final form and may be updated.\n\nMARTHA MACCALLUM, HOST: Breaking tonight, the Trump administration taking a spike to the courts and tonight we are expecting a ruling on this, either allowing the president's immigration order to go forward or perhaps triggering a historic showdown that could end up in the U.S. Supreme Court.\n\nI'm Martha MacCallum and this is day 18, folks, of \"The First 100,\" and it's another busy one.\n\nJust within the last hour, the Trump Justice Department challenging a federal judge who would put a hold on the president's plan to temporarily suspend immigration from seven countries in the Middle East.\n\nIn moments, Andrew Napolitano will talk with us about President Trump's case and whether or not it holds up in court. Then we'll be joined by special assistant to the president Boris Epshteyn. He will give us the White House reaction and we'll talk about the priorities with this vetting issue and whether or not another one of President Trump's biggest campaign promises, tax reform, should have come first.\n\nBut let's go first to chief White House correspondent, John Roberts, who joins us at the White House.\n\nGood evening, John.\n\nJOHN ROBERTS, CHIEF WHITE HOUSE CORRESPONDENT: Martha, good evening to you. It's 5:52 eastern time. The White House filed its brief to reinstate the extreme vetting executive order, to lift the temporary restraining order that was placed on it by a Seattle Federal District Judge James Robart on Friday night.\n\nIn the 15-page briefing, the Department of Justice which prepared the brief argues that the president has, quote, the \"express statutory authority to suspend entry of any class of aliens to protect the national interest.\" And that the ban is, quote, \"To permit an orderly review and revision of screening procedures to ensure that adequate standards are in placed to protect against terrorist attacks.\" In other words, this is temporary.\n\nThe brief also argues that the established case law has determined that states have no standing to bring suits saying, quote, \"A state lacks authority to sue as the representative of its citizens to protect them from the operation of federal law.\"\n\nThe White House and at the Department of Justice contend that the district judge's order was both incorrect and far too sweeping, insisting that it would actually take away the president's right to bar citizens of a country that the president was at war with.\n\nThey also argue that third-party aliens have no constitutional right to enter the country, nor does the U.S. provide any form of judicial review for denied visa.\n\nThe White House, though, is facing a barrage of opponents in its attempt to reinstate the ban. The attorneys general of 16 states have joined the fight. Major corporations like Apple, Microsoft, Google, Uber, and eBay are all against the president as is TESLA and SpaceX headed up by Elon Musk, who is actually on the president's business advisory board.\n\nBut it was clear from his visit to MacDill Air Force base today in Tampa, headquarters of CENTCOM, which really is the nerve center for the fight against terrorism, that that part of the military at least is with him.\n\n(BEGIN VIDEO CLIP)\n\nPRESIDENT DONALD TRUMP: We need strong programs, so that people that love us and want to love our country and will end up loving our country are allowed in. Not people that want to destroy us and destroy our country.\n\n(APPLAUSE)\n\n(END VIDEO CLIP)\n\nROBERTS: A lot of spontaneous cheers and applause there. And Martha, here's something that perhaps you and the judge can chew over here. The judge -- the district judge in making his ruling said that no one from any of seven named countries in the executive order had ever been arrested for an act of terrorism or even just arrested, which is blatantly false.\n\nThe guy that ran into all of those folks at Ohio State University was a refugee from Somalia and there are plenty of others as well. The legal record there is clear.\n\nThe Ninth Circuit Court of Appeals, by the way, has scheduled an hour of oral arguments to take place tomorrow evening at 6:00. So I would imagine the judge will probably know better, Martha, that we will get a ruling on this until Wednesday at the earliest.\n\nBack to you.\n\nMACCALLUM: John, thank you very much.\n\nSo here now is Judge Andrew Napolitano, \"Fox News\" senior judicial analyst.\n\nJudge, what's going on here?\n\nANDREW NAPOLITANO, FOX NEWS SENIOR JUDICIAL ANALYST: Wow. We have a federal district court judge in Seattle who basically second guess the president on the wisdom and propriety of the president's executive order. And that is absolutely not the job of federal judges in our society.\n\nThe law on which Donald Trump, President Trump, relied is crystal clear. A 1952 statute which says just as John Roberts read from the government's brief that the president of the United States has the authority to suspend any immigration of an individual or a group or a class of people for public health, public safety or national security. It's not the president and the courts, it's not the president and the Congress, it's the president alone. That's really --\n\nMACCALLUM: But those who are opposing him are saying that they are paying more attention to the 1965 law, which says that the president or the country can't discriminate against immigrants based on race, nationality, or place of birth.\n\nNAPOLITANO: Correct. So what the president can discriminate on the basis of geography if he makes a finding that people from a geographical area are more likely than not to contain people to harm us --\n\n(CROSSTALK)\n\nMACCALLUM: Which is probably what President Obama used when he did it, right?\n\nNAPOLITANO: Correct. And the president can always discriminate for a short period of time in order to put in place more stringent vetting procedures where people will be identified and examined on an individual rather than on a group basis, which is basically what President Trump said in that executive order.\n\nMACCALLUM: So tomorrow night, we're going to hear an hour of argument on this.\n\nNAPOLITANO: Yes.\n\nMACCALLUM: And then when do you expect we will get a decision? And does it go to the Supreme Court?\n\nNAPOLITANO: I think we'll get a decision on Wednesday because this is a court that is required to write its decisions. And I think they know that the losing side is going to appeal to the Supreme Court.\n\nMy view is the president is so much in the right, the states are so much in the wrong, they don't even have a standing to sue, meaning they can only sue if they have been harmed and they haven't.\n\nThey are claiming that people that live in those states are harmed, and at the obligation of those alleging harm to sue. But if the Justice Department wins and the states of Washington and Minnesota appeal to the Supreme Court, I don't think the Supreme Court will hear it.\n\nBut if the states win and the Justice Department appeals to the Supreme Court, I think the Supreme Court will hear it because the Supreme Court is interested in the orderly administration of governmental function. And this is profoundly disorderly for a single federal judge to stop the president from examining people with more care as they enter the country.\n\nMACCALLUM: All right. Judge, thank you.\n\nNAPOLITANO: You're welcome.\n\nMACCALLUM: As we get more breaking news on this, we'll come back to you. Thank you very much.\n\nNAPOLITANO: You bet.\n\nMACCALLUM: Good to see you tonight.\n\nNAPOLITANO: You got it.\n\nMACCALLUM: So Boris Epshteyn is a special assistant to the president.\n\nBoris, good evening to you. Good to see you.\n\nBORIS EPSHTEYN, SPECIAL ASSISTANT TO PRES. DONALD TRUMP: Good evening, Martha. Good to see you.\n\n(CROSSTALK)\n\nMACCALLUM: So you have been hearing all of this back and forth. You know, one of the questions in my mind is in terms of White House strategy, you know, so here you are, you've got something that may go to the Supreme Court, which would probably split on a 4-4 decision right now. And then you have the people who oppose this administration wanting to drag their heels on George Gorsuch, because they don't want to put him in and lose this decision even if it's months from now.\n\nEPSHTEYN: Martha, let's separate these two points. First of all on this. The executive order is completely lawful. The hearing tomorrow, the oral arguments tomorrow are on the procedural matter. And matter is can this judge in Seattle stay this executive order? Could stop a restraining order be in place?\n\nNow what's going to happen is the Ninth Circuit will decide one way or another and if the Ninth Circuit decides against somehow the administration, which it would should not, the administration should prevail in a merit, it will not. It will then just go back to the district court. This is an emergency appeal with the Ninth Circuit to stay the temporary restraining order. I know that's a lot of legalities --\n\nMACCALLUM: Oh I hear you.\n\nEPSHTEYN: But the bottom line here is that, the next step here in no way the Supreme Court. The next step is to hear the full case on the merits. And full issue on the merits just has happen in the Massachusetts District Court, we are very confident that the White House, the administration and therefore the American people will prevail.\n\n(CROSSTALK)\n\nMACCALLUM: All right. So you are saying that you believe that there's a good chance that this ends tomorrow in your favor.\n\nEPSHTEYN: Absolutely. We will learn tomorrow in the administration's favor. And if for some reason, it does not, it will end in the administration's favor on the merits just as it did in the Massachusetts District Court.\n\nMACCALLUM: All right. I want to play a sound bite from Bill O'Reilly's interview with President Trump with regard to tax reform. Here's what he said.\n\n(BEGIN VIDEO CLIP, \"THE O'REILLY FACTOR\")\n\nBILL O'REILLY, HOST: 2017, can Americans expect a tax cut?\n\nTRUMP: I think so, yes. And I think before the end of the year, I would like to say yes.\n\n(END VIDEO CLIP)\n\nMACCALLUM: All right. So that sort of picked up the ears of a lot of people. And they said wait a minute, we were promised tax reform early. The markets have been, you know, going great guns based on growth that is going to, you know, come to the bottom line of companies because of tax cuts and all of this stuff. And now we are hearing maybe that will happen in the spring, which means it wouldn't be voted on until the fall. And, you know, a lot of businesses out there are wondering what that means for them.\n\nEPSHTEYN: Well, let's not take that one statement out of context. It's obvious that this president has worked very hard throughout the transition and the first two plus weeks of the administration to fulfill campaign promises. And he just had a statement that he is going to be working very hard to put in tax relief this year.\n\nMACCALLUM: All right. Would that be retroactive to January of 2017?\n\nEPSHTEYN: We will be putting that information out there, Martha, in terms of the specifics on the tax group as this president fully said and making sure that Americans are not burdened by the overarching and really two heavy taxes that have been put in place by the Democrats and going back to what he was talking about during the campaign. It's simpler tax brackets for individuals and a lower corporate tax bracket.\n\nMACCALLUM: All right. So no commitment on whether that would be retroactive, correct?\n\nEPSHTEYN: We'll be putting that information out there as part of a broader proposal, broader legislation.\n\nMACCALLUM: A lot of people look at everything that's going on in the incredible busy 18 days, and I know that you all see that as progress and you want to be firing on all cylinders, which I think a lot of people get. But you look at what's going on now and whether or not this vetting issue could go up to the Supreme Court.\n\nYou have Judge Gorsuch, with who you very much want to get confirmed. And some people say they are doing too much at once. You know, they need to focus on things like tax reform and not be getting themselves caught up in the courts on this extreme vetting issue at this point. What do you say?\n\nEPSHTEYN: Well, the obstruction is from the left. And including the left, this judge that, you know, as John Roberts said patently wrong on the fact that folks in these countries have been arrested on extremism and potential terrorism in this country, that's obstructionist from the left.\n\nObstructions from the left is not allowing for nominees of the president for cabinet seats to be confirmed. And any sort of discussion on that, confirming Judge Gorsuch is just that obstruction.\n\nHe is a true judge of judge, a perfect picked to be the ninth justice on the Supreme Court. So just because the left tries to obstruct does not mean that this president, our administration, are going to somehow stop.\n\nWe will continue going full speed ahead for the American people because that's why President Trump was elected.\n\nMACCALLUM: Boris Epshteyn, thank you very much. Good to have you here tonight.\n\nEPSHTEYN: Thank you. Thanks so much.\n\nAMANPOUR: So we will also go live to Seattle a little bit later where Dan Springer is standing by with any new information that comes out of the judges in Ninth Circuit as they hear arguments on the president's travel restrictions.\n\nPlus, President Trump makes new remarks about Vladimir Putin that has stunned some on the left and on the right. So we're going to have a former Trump campaign advisor and a former Obama administration official who will go head-to-head on that.\n\nPlus new drama over the Republicans promised to do away with Obamacare. Chris Stirewalt and Mo Elleithee have the inside scoop from Capitol Hill when we come back.\n\n(BEGIN VIDEO CLIP)\n\nO'REILLY: Can Americans in 2017 expect a new health care plan ruled out by the Trump administration?\n\nTRUMP: This year.\n\n(END VIDEO CLIP)\n\n(COMMERCIAL BREAK)\n\nMACCALLUM: Developing tonight, we are less than an hour away from a news- making sit-down between our own Bill O'Reilly and President Trump.\n\nThe first part of this interview sent shock waves through Washington when Bill O'Reilly asked the president about his relationship with Russian President Vladimir Putin.\n\n(BEGIN VIDEO CLIP)\n\nO'REILLY: Do you respect Putin?\n\nTRUMP: I do respect him, but --\n\n(CROSSTALK)\n\nO'REILLY: Do you? Why?\n\nTRUMP: Well, I respect a lot of people but that doesn't mean I'm going to get along with them. He's a leader of his country. I say it's better to get along with Russia than not. And if Russia helps us in the fight against ISIS, which is a major fight and Islamic terrorism all over the world.\n\nO'REILLY: Right.\n\nTRUMP: Major fight. That's a good thing.\n\nWill I get along with him, I have no idea. It's possible I won't.\n\n(CROSSTALK)\n\nO'REILLY: He's a killer, though. Putin's a killer.\n\nTRUMP: There are a lot of killers. We got a lot of killers. What, you think our country is so innocent? Do you think our country is so innocent?\n\nO'REILLY: I don't know of any government leaders that are killers.\n\nTRUMP: Well, take a look at what we have done, too. We've made a lot of mistakes. I've been against the war in Iraq from the beginning.\n\nO'REILLY: Yes, mistakes are different than --\n\n(CROSSTALK)\n\nTRUMP: We've made a lot of mistakes. OK, but a lot of people were killed. So a lot of killers around, believe me.\n\n(END VIDEO CLIP)\n\nMACCALLUM: That got a lot of attention today.\n\nJoining me now, Pete Hoekstra, former House Intel Committee chairman and former Trump campaign national security advisor. And Marie Harf, a former spokesperson for the Obama State Department and a \"Fox News\" contributor.\n\nWelcome to both of you. Good to have you here tonight.\n\nPete, let me start with you on this. Your reaction to that statement by President Trump.\n\nPETE HOEKSTRA, FORMER HOUSE INTELLIGENCE COMMITTEE CHAIRMAN: Well, I'm actually kind of surprised by the question or the commenting by Bill O'Reilly saying, well, you know, Putin is a killer.\n\nWe know that. But America has done business with very bad people for an extended period of time. When I was on the Intelligence Committee, I met with Putin, I met with Gaddafi, I met with Assad, Karimov of Uzbekistan. And in some way, at least the last three -- Qaddafi, Assad and Karimov helped us achieve our national security interests.\n\nUnder the Obama administration, they dealt with some very, very ugly groups and individuals, dealing with the Muslim brotherhood in Egypt to move our agenda forward.\n\nMACCALLUM: But that's not what he said. He didn't say that. He said -- you know, he didn't say well, we dealt with a lot of bad actors before and sometimes that's what we have to do. He said we are not so innocent either. That's what got people upset. He was, you know, making an equivalency.\n\nHOEKSTRA: He may have been referring to our relationship with these kinds of individuals -- the Muslim brotherhood, the Libyan-Islamic fighting group in Libya. The February 17 Martyrs Brigade in Libya. And who knows who we armed and equip in Syria to overthrow Assad?\n\nThese are some very ugly groups. And the groups in Libya, there's a lot of indications that the groups we partnered with in Libya to overthrow Gaddafi are actually some of the same people who engaged with killing our ambassador and three other Americans in Benghazi.\n\nMACCALLUM: Marie, would you agree with what Pete Hoekstra is saying?\n\nMARIE HARF, FORMER OBAMA ADMINISTRATION OFFICER: No, and I think there are two problems here with what Donald Trump said. First, he did draw an equivalency. If Barack Obama had said what Donald Trump said, I can only imagine the outrage that people like Congressman Hoekstra and other Republicans would have had.\n\nThat's not American exceptionalism as I know it. And he also dismissed Putin's gross human rights violations, including killing activist, journalist. It really was an extraordinary statement. And I don't think you can compare it to working with the Muslim brotherhood or groups in Libya. I think that's a false comparison.\n\nMACCALLUM: So let's go back to why he may have said it. And I'm curious about the strategy that the Trump administration has on this. And whether or not, you know, Pete, they believe that Russia could help us with ISIS. And I also wonder because he made very negative comments about Iran, if he is trying to drive a wedge between Russia and Iran, you know, to cozy up to them to some extent and to push and to isolate Iran. Is that possible?\n\nHOEKSTRA: Oh, it's very, very possible. Actually, President Obama made some of the same types of statements where he said America has done some -- you know, hasn't always been right, we've made mistakes, and those kinds of things.\n\nBut I think you are exactly right. For Donald Trump, eliminating and minimizing the threat of ISIS' top on his priority list and he recognizes with the growth of influence that Russia has had in the Middle East over the last number of years both in terms of their effectiveness in Syria and other place in the middle east and the role that they play with Iran, that if we are going to address both of those issues, somehow we have to see if there's a way that we can build a relationship with Russia.\n\nMACCALLUM: Marie, is that what he is trying to do? Is he trying to isolate Iran and sort of get on the same side with Russia when it comes to ISIS?\n\nHARF: I think that's giving his strategy a little more credit than I think is actually there. I have seen no organized strategic thinking coming out of this White House on the Middle East.\n\nAnd, look, there are ways to work with Russia that don't include talking down America, making a moral equivalency between Putin and the United States, and dismissing when Putin kills political opponents. There's ways to do it that don't add up to what Donald Trump said.\n\nMACCALLUM: All right. We're going to leave it there. Very interesting. Thank you to you both. Good to have you here tonight.\n\nHOEKSTRA: Great. Thank you.\n\nMACCALLUM: So coming up at 8:00 on \"The O'Reilly Factor,\" the next part of O'Reilly's exclusive interview with President Trump. Here's a preview.\n\n(BEGIN VIDEO CLIP)\n\nO'REILLY: You know it was fascinating to watch you at the inauguration with Barack Obama. You gave a speech. But your speech excoriated him. You basically took his administration apart and he is sitting 5 feet away from you.\n\nTRUMP: See, I'm an honest person. The country has very, very deep-seated problems. We have to do something about it. And if you notice, when I finish my speech, I turned around, shook his hand --\n\nO'REILLY: Yes, oh, absolutely.\n\nTRUMP: And he was very gracious and smiling.\n\nO'REILLY: I don't know if he was happy with that speech.\n\nTRUMP: I don't know, but he seemed to be.\n\n(END VIDEO CLIP)\n\nMACCALLUM: More to come. Full interview, 8:00 on \"O'Reilly Factor.\"\n\nStill ahead right here, we are learning more about what the Ninth Circuit is planning to do tomorrow with the president's order restricting travel to some Mid-East countries.\n\nPlus, new fall out next on the plan to repeal Obamacare. How is that going in Washington? Chris Stirewalt and Mo Elleithee weigh in just ahead.\n\nPlus, President Trump visits Central Command headquarters today. It was quite an event. He delivers a new promise on the war against ISIS.\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: We will defeat radical Islamic terrorism and we will not allow it to take root in our country. We're not going to allow it.\n\n(END VIDEO CLIP)\n\n(COMMERCIAL BREAK)\n\nMACCALLUM: Breaking tonight, President Trump has arrived back at the White House after his first visit to United States Central Command headquarters as commander-in-chief.\n\nWhen he was there, he met with enlisted personnel over lunch before an intense speech to service members vowing to outfit the military with new and improved resources and pledging victory against ISIS.\n\nWatch.\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: We are up against an enemy that celebrates death and totally worships destruction. You've seen that. ISIS is on a campaign of genocide, committing atrocities across the world. To these forces of death and destruction, America and its allies will defeat you. We will defeat them.\n\n(END VIDEO CLIP)\n\nMACCALLUM: Strong words from the president.\n\nGeneral Jack Keane is chairman of the Institute for Study of War and a \"Fox News\" military analyst.\n\nGeneral, welcome. Good to see you here tonight.\n\nGEN. JACK KEANE, FOX NEWS MILITARY ANALYST: Good to be here, Martha.\n\nMACCALLUM: So what are today's signal in terms of what changes in the fight against ISIS?\n\nKEANE: Well, first of all, it's just great that he visited these two commands. I mean, for our viewers to understand, these Central Command and Special Operations Command, these are the two commands that have largely had the burden of fighting the 9/11 wars for the last 15, 16 years. So they are troops, are the ones that have done all of the fighting largely and certainly all of the dying.\n\nAnd I know that they appreciate it very much, the commander-in-chief coming here after being in office in two weeks.\n\nHe has said that he wants a comprehensive strategy from his general officers. He's going to get it. It will come from Central Command. And certainly, I know for a fact that they have been looking at options for some time. They knew there would be a new commander-in-chief, whether Democrat or Republican, they had no idea. But they knew they would have to present some options for change from what is currently being executed.\n\nSo I think what we will see is what the president wants. He's been very clear. Urgency, we're going to get this thing done. We're going to get it done quick and he's willing to put the resources on it to get it done. So I think that will be a change from what we've done in the past.\n\nMACCALLUM: You touch on something that is so important and you heard the cheers in the room. They are feeling as if someone is listening to them. And that the mission that they have been given long ago, that in many ways people believe they have been stymied. And you look at the fact that you had three secretaries of defense under President Obama who left that position and criticized him, openly in books that they wrote saying that he wasn't listening to the military and that he wasn't doing what needed to be done to defeat ISIS. So this is a whole new ball game. Is it not?\n\nKEANE: Oh, yes, absolutely. And they know that.\n\nListen, the career force that's in both of those commands as oppose to the troops that come in and spend two, three or four years with us, and we certainly welcome the sacrifice that they are making, but that career force has been back to Iraq and Afghanistan multiple times over these last 15 and 16 years.\n\nThey watched us pull away from Iraq and squander the victory that they had achieved. And they -- we are now in a situation in Afghanistan where the war is not winnable. And this come as a result of policy decisions made by the previous administration and these troops understand that clearly.\n\nMACCALLUM: So does that mean we go back in in bigger numbers. What does the time frame look like on this?\n\nKEANE: Well, for Afghanistan, that's a different policy change. We'll talk about that in another time. But when it comes to ISIS, they will put options on the table to increase the resources that we are providing to help beat the Iraqis be successful. That probably will not require a lot of new troops on our part.\n\nFor the war in Syria, we do not have a ground force that's capable. So they are going to have to put options on a table, Arab coalition, regional forces, and possibly U.S. direct combat forces, or just increase what we are doing now.\n\nThey are showing all those options and they'll let them see what the risks are associated.\n\nNow Martha, we have never done this before. Obama has never seen anything like that.\n\nMACCALLUM: All right, General Keane, more to come on that. Thank you very much sir. Good to see you.\n\nKEANE: OK. Take care, Martha.\n\nMACCALLUM: So also tonight, there are new questions on the White House's plans to repeal Obamacare. Chris Stirewalt and Mo Elleithee next on reports that GOP's efforts may be in a bit of a trouble.\n\nPlus, with protest around the country, we are going live to Seattle next for breaking news on what the court is now planning to do with President Trump's travel restriction.\n\n(COMMERCIAL BREAK)\n\nMACCALLUM: Breaking tonight, we have just learned that at this exact hour tomorrow night, a federal appeals court will hear arguments whether or not to reinstate President Trump immigration executive order. Correspondent Dan Springer gets a closer look to what is going on in Seattle and what we can expect tomorrow, hi Dan.\n\nDAN SPRINGER, FOX NEWS CORRESPONDENT: Hi, Martha. Things are moving quickly. About 90 minutes ago, the Trump administration made its case issuing an illegal brief. Its argument as to why this federal court judge in Seattle, in their opinion, was way off base in issuing that temporary restraining order late Friday afternoon. It wrote in part the exclusion of aliens is also a fundamental act of sovereignty, inherent in the executive power to control the foreign affairs of the nation. Judge James Robart seemed to side with the state of Washington, which argued that President Trump's extreme vetting executive order was motivated by religious discrimination, not a desire to keep Americans safe. At one point, he even incorrectly said that not a single person from the seven mostly Muslim countries had been arrested on terrorism charges since 9/11. The Associated Press today fact-check and came up with at least two examples of refugees from Iraq who were arrested in the U.S. while plotting attacks.\n\nNow the issue goes to the ninth circuit court of appeals. A three-judge panel will hear arguments by phone tomorrow at 3:00 Pacific time. They are spread out all over the country. Lawyers for each side will have 30 minutes apiece. Two of the three judges were nominated by Democrats. William Canby was picked by President Carter in 1980. Michelle Friedland was just selected by President Obama. Richard Clifton was nominated by President George W. Bush and confirmed in 2002. If the panel upholds the temporary restraining order, the Trump administration will almost certainly appealed. It could try a larger 11 judge panel on the ninth circuit court or go straight to the Supreme Court where justice Anthony Kennedy will decide whether or not the issue will stay and then let the court, the full core weigh in. Now it would take five justices to overturn the decision of the appeals court if it's a 4-4 tie, and right now we have a 4-4 split between -- with conservatives and liberals on the court. It's a 4-4 split, the lower court's decision will be upheld.\n\nMACCALLUM: What is this mean for Judge Neil Gorsuch is the big question tonight? Dan, thank you very much.\n\nWe are checking developing news tonight on Obamacare and reports that the Republican plans to repeal and replace may be running into a little bit of trouble. Trace Gallagher has more on that, Trace.\n\nTRACE GALLAGHER, FOX NEWS CORRESPONDENT: There does seem to appear to bit of a stalemate inside the Republican Party. On the one side you have those who want Obamacare repealed immediately. In fact GOP Congressman Jim Jordan of Ohio and Mark Meadows of North Carolina say the very same affordable care act repeal bill to pass the house back in 2015 also passed the senate, but was vetoed by the president. President Obama should be voted on again and sent it to President Trump's desk ASAP. Tennessee Senator Lamar Alexander who chairs the Senate Health Committee clearly prefers a step-by-step approach, saying he would like to see lawmakers come up with fixes to the current insurance market before repealing parts of the law, which is similar to the timeline President Trump laid out during his interview with Bill O'Reilly. Watch.\n\n(BEGIN VIDEO CLIP)\n\nTRUMP: In the process and maybe it will take till some time into next year, but we are certainly going to be in the process. Very complicated, Obamacare is a disaster. You have to remember, Obamacare doesn't work. So we are putting in a wonderful plan. It statutorily takes a while to get.\n\n(END VIDEO CLIP)\n\nGALLAGHER: Even House Speaker Paul Ryan who believes Obamacare is collapsing under its own weight and is currently crafting a bill that would unravel big chunks of it the health care law. He is getting pressure though to make sure the repeal legislation includes replacement measures, because several GOP lawmakers in the house and senate, like Kentucky Senator Rand Paul have vowed not to allow millions of people to suddenly lose coverage. Experts say the biggest problem with the affordable care act is that not enough young and healthy people signed up to offset the cost of older and sicker people. Now the GOP has to remedy that with a plan the whole party can apparently rally around. Martha.\n\nMACCALLUM: Thank you, Trace. Joining us on this, Chris Stirewalt Fox News Politics Editor and Mo Elleithee, former spokesman for the DNC and a Fox News Contributor, gentlemen welcome, good to have you both here. So, you know the point worth looking at it, I mean the Republicans have said for a year that they have 50 plans to replace this thing Chris and now it comes time to do it and they seem to be at odds.\n\nCHRIS STIREWALT, FOX NEWS DECISION DESK CORRESPONDENT: They have been cracking walnuts on the soccer since 2009, 2009. Now they get down to go time and they are not ready to go. Part of it is that whatever happened, everybody said that they don't want any disruption. There will be no disruption. And the Democrats felt the same way with President Obama was trying to get the original put in. They're going to be disruptions. Remember, all the people who lost their plans, the doctors, and all that stuff. There is inherent disruption on this. Right now, Republicans are arguing before they talk about a plan, but they are really arguing about is when to pay that political cost. There is a political cost and tended to this with disappointing members of your base, it has to do with frustrating people in the middle, when do you do it and how? Until he gets on with that, they are not going to be able to settle on a plan.\n\nMACCALLUM: So in the meantime, Mo you have people whose premiums have skyrocketed. I think we have a map that shows all of the states, 39 of them have higher premiums. Plus you got businesses owners all across the country who believe that this is going to, you know, sort of be levitated for them to some extent. That really weighs into the business decisions that they make as well.\n\nMO ELLEITHEE, EXECUTIVE DIRECTOR OF GEORGETOWN UNIVERSITY INSTITUTE OF POLITICS: I think Chris is absolutely right. There is a political cost here. At the base of the Republican Party demands, they expect it. They want full repeal come hell or high water. It doesn't matter what else happens. There are a lot of members of congress who are feeling the pressure, but at the same time, there is a very real human cost. If they were to move forward the repeal without a replacement, the nonpartisan congressional budget office's is estimating tens of millions of people would lose their coverage and premiums would double, double from where they are now in a matter of years, if they repeal without a replacement. And Chris is right. These guys have had seven years to work on this. They've had over 50 votes in the house to repeal it. How come they don't have their act together now? You would think that they would walk into office, this is the moment they have been waiting for, full control of the government. You think they would walk into office with the replacement plan ready to go. I think they are realizing the problem while campaigning.\n\nMACCALLUM: There so my questions right now, excuse me Mo, about priorities in the administration. The things that they are doing first as we talked about before tax reform is something that people really want to see. Obamacare is something they thought they would have ready to roll, and you can't forget the people who don't like the situation as it is. A lot of people feel like they have got something better out of Obamacare, but others want this monkey off their back and quickly.\n\nSTIREWALT: Sure. There are only so many day ones. We've heard a lot about day one. On day one I will do this, on day one I will do that. On the proverbial day one, you can only do one thing at a time. The president wants to go directly to tax change, he want to go to tax cuts, he wants to go to the trillion dollar infrastructure spending plan, he wants to juice the economy, he wants to do what other larger economies in the world have done, and pour gas on the fire to try and get the U.S. economy warning. He wants to do that, but you can do that if you are doing Obamacare first, so it's a matter of choosing, because congress can only process so much at a time.\n\nMACCALLUM: So many would say that, that put gas on the fire in the economy. If you deal with Obamacare upfront and to give people relief from these premium hikes and you figure out a way to have cross state environment where people can get, you know, choosing their pan in a better way, that that will be a good signal for business.\n\nSTIREWALT: Ryan and Trump are dancing. Ryan is trying to encourage Trump to choose, you have to choose. Do you want to deal with Obamacare or this first? Not everything can go first. As you say, Ryan obviously said, I am perfectly happy, you want to do Obamacare first, let's do that. If you want to do the taxes first, you can do that, but it's got to be one or another. You can't do it all concurrently.\n\nMACCALLUM: Mo, Chris, thank you very much. We have to leave it there. Thank you very much. So could one of the most controversial Democrats in Washington find herself soon out of the job, a report that might surprise you on Senator Warren, coming up next and the Super Bowl story that you did not see on TV when Bill Hemmer joins us to tell us what he saw at the big game when we come back.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nELIZABETH WARREN MASSACHUSETTS SENATOR: It is up to us. It is up to the progressives. We need to make it very clear that we, as progresses, as Democrats, as Americans, stand for bold progressive agendas. Stand for real solutions in this crisis. Stand for changes that will make a difference in the lives of millions of people. We need to make clear that we will fight.\n\n(END VIDEO CLIP)\n\nMACCALLUM: So, fight they will. That was Democratic Senator Elizabeth Warren, and now a new poll is suggesting that she might have a fight on her hands indeed. That is one of the most controversial liberal senators in congress. A survey shows 46 percent of Massachusetts voters believe that she should not be reelected. And remember, this is a woman that has often mentioned as a 2020 presidential candidate. So what is she up against here? David Wohl is an attorney and Jessica Tarlov, Democratic Pollster and Senior Research Director at Bustle Trends. Good to see you both tonight. You hear about putting people back to work, bold aggressive agenda, and you look at what we just saw happen in the November election. You have to wonder, you know, what she is talking about, David?\n\nDAVID WOHL, TRUMP SUPPORTER: Yes, I mean look, Miss Warren is a far left senator who has been far more obsessed with denigrating and insulting our great president Mr. Trump then she is serving as the needs of her constituents. Remember Martha, that voters in Massachusetts are a fickle bunch. I mean in 2010, they put GOP Senator Scott Brown in office. They are also great sports fans, as we know from last night. Tom Brady winning his fifth Super Bowl, and he is a great friend of Mr. Trump. And Warren's number one opponent may be next year Curt Schilling who is a former Red Sox great picture. That is going to be a big battle. So she needs to look at what she is doing and focus more on her constituents than trying to tear down our new president.\n\nMACCALLUM: All right. The Super Bowl is apparently that time as well.\n\nJESSICA TARLOV, DEMOCRATIC STRATEGIST: I am not sure about the sports angle here, but I think what Elizabeth Warren is talking about it's critical to Democrat success, not only her own, but for us in 2020. This is something that Joe Biden's been out there talking about, Bernie Sanders as well, But essentially, Democrats have ignored the last few decades how hard it's been for the middle class, and that is why many white working- class and middle class voters went for Donald Trump in the election. I actually salute her for scene --\n\nMACCALLUM: There is a divide it seems, when you look at the election process to head the DNC. You have a progressive side of that, and then you have the establishment side.\n\nTARLOV: Exactly.\n\nMACCALLUM: Joe Biden and Hillary Clinton. There in a real struggle right now. Let's face it. They had a very difficult election season in November.\n\nTARLOV: We absolutely did. I am still a little upset about it, obviously, but I am powering through. And yes, we are deeply divided, you know, Bernie Sanders versus Hillary Clinton. That will go on for a long time. We need to find a unity message obviously and a unity candidate. I'm concerned that neither Tom Perez nor Keith Ellison is that candidate. We might need to look further, maybe to the mayor of south bend, Indiana, a veteran, someone I think it's very exciting for us. We also need to look at younger candidates -- which is, why I find it so interesting that PPP polling just shows our top 320 candidates are Joe Biden, Bernie Sanders, and Elizabeth Warren.\n\nMACCALLUM: David?\n\nWOHL: If she doesn't win in 2018, the Senate Race, she is not going to be a realistic candidate for 2020 for the Democratic nominee for president.\n\n(CROSSTALK)\n\nRemember something, hold on, and remember what happened to Bernie Sanders, the far left candidate last year before he could be nominated, the DNC cannibalized him. They destroyed him, they tore apart his campaign, he didn't even know about it, and she is cut from the same cloth as Bernie. That is going to be a big problem for her as well.\n\nTARLOV: Bernie Sanders did not lose the primary because of what the DNC did to them.\n\nWOHL: Absolutely.\n\nMACCALLUM: Thank you guys, three words coming up, Super Bowl, Bill Hemmer, next.\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: Tossed away. He did! Patriots win the Super Bowl! Brady has his fifth! What a comeback!\n\n(END VIDEO CLIP)\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: There is not much going right for New England. Out of the shotgun, Ryan gets picked. Paul is out. This is a fumble. New England hasn't. Brady, end zone, touchdown! Danny Amendola! It is broken up and the past is no sign yet. Comes out the people, and they are saying it is a catch. Handoff, touchdown! James White! Tossed to white, he did! Patriots win the Super Bowl! Brady has his fifth! What a comeback!\n\nTOM BRADY, QUARTERBACK NEW ENGLAND PATRIOTS: Thank you to all our fans. Everyone back in Boston, New England, we love you. You have been with us all year. We are bringing this (BEEP) home!\n\nUNIDENTIFIED MALE: Tom Brady!\n\n(END VIDEO CLIP)\n\nMACCALLUM: You got to love it. We just want to relive the whole thing all over again for the Patriots fans, and I'm sorry to the Falcon fans. President Trump praised the Patriots quarterback Tom Brady as they arrived back home where they brought that (BEEP) home, as Tom Brady said when they are on the bus. The Patriots come back last night from a 25-point deficit with a game for the ages. Tom Brady started with a four game suspension, not just a memory without a doubt, the greatest quarterback to play the game. He is fresh on the Super Bowl as he always is, he only missed one when we are in Iowa last year. It was hard for him as my great friend Bill Hemmer. Hi, Bill.\n\nBILL HEMMER, \"AMERICA'S NEWSROOM\" CO-HOST: How are you? What are doing up tonight?\n\nMACCALLUM: What are you doing up tonight?\n\nHEMMER: I just flew in from Houston. Martha here is what I want to tell you. As you just said, I felt it. At halftime, fans were celebrating. They thought they had in the bank. The reason why I have been to a dozen Super Bowl is because it is the single greatest event that America does every year. At least that kicked off, everybody in that stadium is happy, and you just never know, Martha, what is going to happen. Last night, it was absurd how that game ended up. No one could think that.\n\nMACCALLUM: Bill knows that my son and I have a divided family. My son and I are very big Pats fans. He left to play ping-pong for about 5 minutes and because he was so upset. What about the Roger Goodell moment? That was a little uncomfortable out there on the trophy stand. I saw Goodell sort of like, you know, skipped down the backstairs like he is going out of here.\n\nHEMMER: I think what you may not have been able to hear on TV rip the amount of boomers that were out for him. Boston does not like him, but Goodell was asked before the Super Bowl what happens if you have to hand the trophy to Tom Brady? He took it in stride. He said no problem. There was a handshake there. I thought it went pretty well. The amazing thing Martha, you think about this, you are down 28-12. I brought my niece. She is a schoolteacher in Houston, Texas. We started making our way for the exit around 8 minutes 30 seconds left. We couldn't get out the door, because something kept changing over and over. Here's what I want you to think about. The final 8 minutes of regulation, every break possible that New England could get they got including the coin toss going into overtime. You can't draw that stuff up.\n\nMACCALLUM: Here is why, I do a quote of the night every night. I don't know if you want the show. Here it is. Tom Brady says you want to know which ring is my favorite, the next one, Bill. The next one is always his favorite.\n\nHEMMER: I will just to say one more thing. The Falcons were really impressive. I think they got worn down, perhaps by the game or the moment, but they've got a really good chance of getting back there next year.\n\nMACCALLUM: Great catch by Julian Edelman. Bill, great to see you, thank you so much, I will see you soon my friend.\n\nHEMMER: You got it.\n\nMACCALLUM: Thanks for watching everybody. I'm Martha McCallum. We will see you back here at 7:00 p.m. tomorrow night we will have big news from the West Coast on the travel ban decision for the Trump administration. Thanks for joining us. Have a great night everybody. Bill O'Reilly is coming up with the Trump interview, right after this.\n\n\n\nContent and Programming Copyright 2017 Fox News Network, LLC. ALL RIGHTS RESERVED. Copyright 2017 CQ-Roll Call, Inc. All materials herein are protected by United States copyright law and may not be reproduced, distributed, transmitted, displayed, published or broadcast without the prior written permission of CQ-Roll Call. You may not alter or remove any trademark, copyright or other notice from copies of the content.", "authors": [], "publish_date": "2017-02-06", "source": "foxnews", "top_words": ["executive", "completely", "travel", "trump", "right", "judge", "epshteyn", "talks", "know", "think", "going", "court", "lot", "napolitano", "video", "order", "president", "lawful", "legal"], "summary": "We have a federal district court judge in Seattle who basically second guess the president on the wisdom and propriety of the president's executive order.\nThe law on which Donald Trump, President Trump, relied is crystal clear.\nI want to play a sound bite from Bill O'Reilly's interview with President Trump with regard to tax reform.\nMACCALLUM: So coming up at 8:00 on \"The O'Reilly Factor,\" the next part of O'Reilly's exclusive interview with President Trump.\nIts argument as to why this federal court judge in Seattle, in their opinion, was way off base in issuing that temporary restraining order late Friday afternoon."}