{"url": "http://www.foxnews.com/us/2017/02/01/admin-clarifies-again-travel-ban-rules-for-legal-residents.html", "id": "248", "title": "Admin clarifies, again, travel ban rules for legal residents", "text": "Legal permanent U.S. residents from seven countries whose citizens are covered by a three-month American travel ban won't need special permission to come back to the United States after all, the Trump administration announced Wednesday.\n\nWhite House spokesman Sean Spicer said green card holders will now be allowed to enter and leave the United States as they please, despite the ban. Spicer's announcement was the latest effort to clarify and adjust President Donald Trump's executive order banning travel and immigration from seven majority-Muslim countries.\n\nThe order, signed Friday, has caused drawn international criticism and spawned widespread panic among travelers and apparent confusion within the government about how the order should be implemented.\n\nIn the earliest hours of the travel ban, green card holders were blocked from getting on planes overseas or detained upon their arrival. Also blocked were some Iraqi nationals with special visas issued to people who helped U.S. troops fighting in that country.\n\nAs of Tuesday more than 1,000 green card holders had been let in under a special waiver, acting Customs and Border Protection Commissioner Kevin McAleenan said.\n\nSpicer said Wednesday that for \"the sake of efficiency,\" green card holders \"no longer need a waiver.\"\n\nThe executive order also included a four-month halt to the U.S. refugee program and an indefinite ban on U.S. travel for all Syrians.\n\n___\n\nFollow Alicia A. Caldwell on Twitter at www.twitter.com/acaldwellap", "authors": [], "publish_date": "2017-02-01", "source": "foxnews", "top_words": ["seven", "travel", "residents", "special", "ban", "holders", "clarifies", "rules", "card", "united", "states", "green", "order", "admin", "legal"], "summary": "Legal permanent U.S. residents from seven countries whose citizens are covered by a three-month American travel ban won't need special permission to come back to the United States after all, the Trump administration announced Wednesday.\nWhite House spokesman Sean Spicer said green card holders will now be allowed to enter and leave the United States as they please, despite the ban.\nIn the earliest hours of the travel ban, green card holders were blocked from getting on planes overseas or detained upon their arrival.\nAs of Tuesday more than 1,000 green card holders had been let in under a special waiver, acting Customs and Border Protection Commissioner Kevin McAleenan said.\nSpicer said Wednesday that for \"the sake of efficiency,\" green card holders \"no longer need a waiver.\""}