{"url": "http://www.foxnews.com/opinion/2017/03/21/israel-and-trump-travel-ban-offers-pundit-chance-to-show-own-bigotry.html", "id": "29", "title": "Israel and Trump travel ban offers pundit a chance to show own bigotry", "text": "A recent panel discussion regarding the Trump travel ban was infected by the bigotry of one of the participants. The host, Don Lemon, called on former prosecutor John Flannery to express his views on the decision of a federal judge to stay the order. This was Flannery's response:\n\n\"...Here's Trump saying that we have to write rules. What have they been doing? They've been sitting on their hands doing nothing this entire time. And our dear colleague, Alan Dershowitz, I think, hopes that this may secure Israel and thinks that this is a bogus argument...\"\n\nI asked him what he was talking about, since in my dozens of TV appearances discussing the travel ban, I have never once mentioned Israel, and certainly never made the argument that the ban – which I oppose as a matter of policy – would \"secure Israel.\"\n\nHe replied: \"I think that's what you believe.\"\n\nI shot back: \"I never said a word about Israel. You know when you focus everything I say on Israel it really raises questions about your own bigotry and bias.\"\n\nI then asked him directly \"what does this have to do with Israel? Why...do you have to bring in Israel to attack me and criticize me? Is it because I'm Jewish? You know your bigotry is showing?\"\n\nHe then said it has \"everything\" to do with Israel. He insisted that Israel is the \"reason you're taking the position you are. Because of your own bias.\"\n\nThe \"position\" to which he was referring is my view that although the travel ban is bad policy, it is probably not unconstitutional. Instead of responding to my \"position\" on the merits, he again – quite irrelevantly – repeated that he doesn't think the ban \"will help Israel.\"\n\nHaving heard variations on this argument many times in my debates about a wide range of issues – that my loyalty to Israel clouds my judgment and disqualifies me as an objective critic – I really tore into him: \"You can't believe anything I say because I'm a Jew and a Zionist? For shame on you, sir.\" I then announced that I don't want to be on panels with him in the future.\n\nAt the end of the segment Don Lemon asked if anyone wanted to \"apologize\" or explain if they feel they \"were taken out of context.\"\n\nFlannery chimed in: \"I have trouble understanding you Alan, in connection with this argument about the appeal...we have an honest disagreement about that.\"\n\nI responded: \"my only criticism of you was that you raised the issue of Israel and somehow questioned my motives because yes, I'm a Jew who supports Israel.\"\n\nThere was no legitimate reason for Flannery to bring Israel into the discussion. At no point during my analysis of Trump's revised travel ban – and I have spoken on this issue broadly both on TV and in print – did I suggest that this executive order relates to Israel, let alone would \"secure\" her. In suggesting that the reason for my position on the travel ban is \"because of [my] own bias\" toward Israel – and by doubling down on this position throughout the segment – Flannery engaged in an old trope: that one's dual loyalty undercuts their objectivity when it comes to analysis of domestic political issues here in the United States. By morphing the discussion about the constitutionality of U.S. immigration policy into a polemic against me and my pro-Israel \"bias,\" Flannery displayed his own bias.\n\nI'm glad I called Flannery out on this issue. I don't know generally what his views are about Israel. But his willingness to argue to an international TV audience that I am biased on the travel ban issue because I see every issue through the lens of my pro-Israel views, is dangerous if unrebutted. The reality is that the U.S. travel ban has little or nothing to do with Israel, but in Flannery's distorted mind it has \"everything\" to do with Israel if expressed by a Jewish supporter of Israel.\n\nThere is an old joke about a European student who was obsessed with Jews. Every time the professor gave an assignment, the student would find a way to bring in the Jews. Finally, in exasperation, he assigned the students to write an essay on the Pachyderm. The obsessed student handed in his essay, with the title: \"The Elephant and the Jewish Question.\"\n\nAlan M. Dershowitz is Felix Frankfurter Professor of Law, Emeritus, at Harvard Law School and author of, \"Trumped Up! How Criminalization of Political Differences Endangers Democracy,\" which is now available. Follow Alan Dershowitz on Twitter: @AlanDersh Facebook: @AlanMDershowitz.", "authors": ["Alan Dershowitz"], "publish_date": "2017-03-21", "source": "foxnews", "top_words": ["bigotry", "travel", "position", "trump", "ban", "tv", "views", "israel", "think", "flannery", "student", "issue", "chance", "pundit", "offers"], "summary": "A recent panel discussion regarding the Trump travel ban was infected by the bigotry of one of the participants.\nYou know when you focus everything I say on Israel it really raises questions about your own bigotry and bias.\"\nThe \"position\" to which he was referring is my view that although the travel ban is bad policy, it is probably not unconstitutional.\nInstead of responding to my \"position\" on the merits, he again – quite irrelevantly – repeated that he doesn't think the ban \"will help Israel.\"\nThe reality is that the U.S. travel ban has little or nothing to do with Israel, but in Flannery's distorted mind it has \"everything\" to do with Israel if expressed by a Jewish supporter of Israel."}