{"url": "http://www.foxnews.com/sports/2017/01/31/pat-tillmans-widow-blasts-trumps-travel-ban.html", "id": "200", "title": "Pat Tillman's widow blasts Trump's travel ban", "text": "Pat Tillman’s widow ripped President Donald Trump’s executive order on immigration Sunday, saying on Facebook it’s not what her late husband “served for and not what he died for.”\n\nTillman was an All-American linebacker during his time at Arizona State University and was drafted by the Arizona Cardinals. He enlisted in the U.S. Army in 2002 and was killed by friendly fire while serving in Afghanistan in 2004.\n\nHis wife Marie Tillman started the Pat Tillman Foundation, a group that provides scholarships to military veterans and their spouses. She said in her Facebook message that she was “deeply saddened” over the news of Trump’s executive order.\n\nTrump has received tremendous blowback from the executive order, which temporarily bans refugees from seven predominantly Muslim nations.\n\nTrump relieved acting Attorney General Sally Yates of her duties Monday after she directed the Justice Department attorneys not to defend Trump's controversial executive refugee and immigration ban.\n\nYates, a holdover from the Obama Administration, was replaced by Dana Boente, the U.S. Attorney for the Eastern District of Virginia. Boente, 62, was sworn in Monday evening. He will lead the Justice Department pending the confirmation of Sen. Jeff Sessions, Trump's nominee for attorney general, by the Senate.", "authors": ["Ryan Gaydos"], "publish_date": "2017-01-31", "source": "foxnews", "top_words": ["pat", "executive", "travel", "facebook", "ban", "immigration", "tillman", "trumps", "blasts", "general", "attorney", "tillmans", "justice", "order", "widow"], "summary": "His wife Marie Tillman started the Pat Tillman Foundation, a group that provides scholarships to military veterans and their spouses.\nShe said in her Facebook message that she was “deeply saddened” over the news of Trump’s executive order.\nTrump has received tremendous blowback from the executive order, which temporarily bans refugees from seven predominantly Muslim nations.\nTrump relieved acting Attorney General Sally Yates of her duties Monday after she directed the Justice Department attorneys not to defend Trump's controversial executive refugee and immigration ban.\nHe will lead the Justice Department pending the confirmation of Sen. Jeff Sessions, Trump's nominee for attorney general, by the Senate."}