{"url": "http://www.foxnews.com/travel/2017/06/28/supreme-court-travel-ban-flood-lawsuits-expected-from-ruling.html", "id": "231", "title": "Supreme Court travel ban: Flood of lawsuits expected from ruling", "text": "President Trump's freshly reinstated travel ban takes effect Thursday, sparking concerns of another round of airport nightmares and legal chaos.\n\nThe travel ban, which restricts visitors from six Muslim majority nations, was shelved due to injunctions issued by lower courts until the Supreme Court ruled Monday it could be largely reinstated pending a hearing on the merits in the fall. But when it was initially rolled out earlier this year, it triggered confusion in airports and courtrooms throughout the country.\n\nThis time, the Trump administration hopes will be smoother.\n\n“We will keep those traveling to the United States and partners in the travel industry informed as we implement the order in a professional, organized and timely way,” State Department spokeswoman Heather Nauert told Bloomberg News.\n\nBut language in the high court's order may only contribute to confusion this time around, say some legal experts. By carving out an exception for travelers with \"bona fide\" relationships to people in the U.S., the revised ban could be vulnerable to endless legal challenges.\n\nRelated Image Expand / Collapse\n\nThe State Department told Fox News that it is awaiting a determination from the Department of Justice on how to define a bona fide relationship, and also how to implement the policy once it's defined. State officials are in consultation with the DOJ on the bona fide relationship policy.\n\nPeople who do not have a verifiable relationship with individuals or entities, such as companies, in the United States after June 26, 2017, will “likely” be prevented from entering the country. Tourists from Sudan, Somalia, Yemen, Iran, Libya and Syria also may be barred admission.\n\nThere were just 110,365 tourists from those six countries last year, according to State Department data.\n\n“Generally, there are relatively few individuals from the ban countries who are issued visitor visas,” said immigration attorney Matthew Kolken. \"It is exceptionally difficult to prove that they will return to a country where there is civil unrest, or where their lives are in danger.”\n\nSUPREME COURT DECISION SHIFTS MOMENTUM IN TRUMP TRAVEL BAN CASE\n\nThe Supreme Court’s ruling affects “refugees who lack any” connection to the U.S. That means that a visitor from the six countries who cannot demonstrate “a bona fide relationship” with individuals or entities in the United States after June 26, 2017, will likely be precluded from entering the country.\n\n“Tourists may also be barred from admission if they don't have any established links to the country,” said Kolken.\n\nRelated Image Expand / Collapse\n\n“I see nothing in the court’s order which would preclude connections to the U.S. from being developed going forward as long as they are not developed for the purpose of avoiding the travel ban,” said David Leopold, former president of the American Immigration Lawyers Association.\n\nIt could be fertile ground for legal debate if refugees begin creating connections with people in the U.S. now, and somehow avoid the appearance of trying to avoid the key part of the ruling. “My guess is the Trump administration will take the narrowest possible view and try to exclude as many people as possible under the narrow stay,” said Leopold.\n\nAdvocates for limited immigration say the executive order should be fully implemented.\n\n“The Supreme Court’s decision, while helpful to some degree,” said Andrew Arthur of the Center for Immigration Studies, “will lead to significant litigation from individuals who claim they have the requisite relationship to be admitted, until the court issues its final ruling.”\n\nImmigrant rights groups raised the possibility that the ruling may have a deleterious effect on professionals trying to move between countries, such as a doctor from Iran hired by a U.S. company. Once again, it may depend on the timing of the relationship. “Physicians from Iran with a (current) job offer from a U.S. hospital will likely be issued a visa absent any other security concern,” said Kolken.\n\nRelated Image Expand / Collapse\n\n“If there was a relationship in the past, but no likelihood of a future relationship, the doctor will likely be excluded” from entering the U.S., added Arthur.\n\nTRUMP TRAVEL BAN: SUPREME COURT REINSTATES KEY PARTS OF EXECUTIVE ORDER\n\n“We handle many foreign physicians, researchers, IT professionals and others who qualify for professional and extraordinary ability visas,” said Leopold. “Most, if not all, have a bona fide relationship with a U.S. employer and therefore should not be affected.”\n\nBut Leopold still has harsh criticism for the Trump administration’s immigration policies. “This administration’s purpose is to disrupt and slow-walk the visa process. The anti-immigrant extremists setting Trump Administration policy are aiming at putting a huge ‘Closed for Business’ sign on the Statue of Liberty. These policies will hurt and cost America dearly.”\n\nBut Arthur pointed out that the travel ban was always intended to be temporary. “The administration is attempting to catch its breath, determine what we don’t know and determine what additional requirements we need to put in place to make sure individuals who pose a danger to the U.S. won’t be able to get in.”\n\nThe strategy may be working in some countries. Fox News has reported that the new U.S.-leaning Somali government has taken steps to beef up its vetting of prospective émigrés. U.S. Ambassador to Somalia Stephen Schwartz told Fox News that the country’s president was receptive to new vetting requirements, like biometric identification and even taking in deported Somalis, which has increased under the Trump administration.\n\n“Given the unsettled history of Somalia, the government can attempt to reconstruct the institutions that would have existed, such as registries, in order to help us verify visas for Somalis seeking to come to the United States,” said Arthur. Due to Somalia’s long-running civil war, and no central government, most of the country’s residents don’t even have valid birth certificates.\n\nMeanwhile Kolken, whose firm helps foreigners gain legal entry to the U.S., has said that the Trump administration treats refugee children better than the prior administration.\n\n“President Trump deprioritized the deportation of refugee children from Central America that were at the top of the list under President Obama,” said Kolken.", "authors": ["Christopher Wallace"], "publish_date": "2017-06-28", "source": "foxnews", "top_words": ["ruling", "fide", "travel", "relationship", "courts", "trump", "lawsuits", "ban", "supreme", "immigration", "court", "individuals", "expected", "order", "flood", "legal"], "summary": "President Trump's freshly reinstated travel ban takes effect Thursday, sparking concerns of another round of airport nightmares and legal chaos.\nBut language in the high court's order may only contribute to confusion this time around, say some legal experts.\nState officials are in consultation with the DOJ on the bona fide relationship policy.\nTRUMP TRAVEL BAN: SUPREME COURT REINSTATES KEY PARTS OF EXECUTIVE ORDER“We handle many foreign physicians, researchers, IT professionals and others who qualify for professional and extraordinary ability visas,” said Leopold.\nThese policies will hurt and cost America dearly.”But Arthur pointed out that the travel ban was always intended to be temporary."}