{"url": "http://www.foxnews.com/us/2017/02/09/reaction-to-court-refusing-to-reinstate-trump-travel-ban.html", "id": "287", "title": "Reaction to court refusing to reinstate Trump travel ban", "text": "A federal appeals court refused to reinstate President Donald Trump's ban on travelers from seven predominantly Muslim nations. Here is some reaction to the decision:\n\n___\n\n\"SEE YOU IN COURT. THE SECURITY OF OUR NATION IS AT STAKE!\" — Trump, in a tweet\n\n___\n\n\"Well, Mr. President, we just saw you in court, and we beat you. ... We have led the way in standing up for the Constitution. We have led the way in standing up for our businesses. We have led the way in standing up for our students.\" — Washington state Gov. Jay Inslee, whose state sued over the ban, along with Minnesota\n\n___\n\n\"We have a situation where the security of our country is at stake, and it's a very, very serious situation, so we look forward ... to seeing them in court.\" — Trump, in an impromptu appearance in the West Wing\n\n___\n\n\"The confusion and chaos that resulted from the administration's hasty and harmful executive order should be a lesson to keep intact carefully developed procedures that have kept America safe. We are grateful that we can get back to work resettling refugees who have fled the terrors of war and violence, while also caring for those who remain trapped in conflict zones.\" — David Miliband, president of the International Rescue Committee that helps refugees resettle\n\n__\n\n\"I don't think they're (the federal government) going to be well-received at the Supreme Court for all kinds of reasons, but mainly because this is a reasonable decision. The precedents are there, they've weighed the issues.\" — Carl Tobias, law professor at the University of Richmond Law School\n\n___\n\n\"It's a very important message that judges are not just politicians in robes and not just political hacks. The role of the judge is to transcend politics. That's why they're appointed for life, so they don't worry about what's popular, they worry about what's legally correct.\" — Jessica Levinson, professor at Loyola Law School\n\n___\n\n\"The government's erratic and chaotic attempts to enforce this unconstitutional ban have taken a tremendous toll on innocent individuals, our country's values, and our standing in the world.\" — Omar Jadwat, director of the organization's Immigrants' Rights Project\n\n___\n\n\"Bottom line, this is a complete victory for the state of Washington. ... We are a nation of laws, as I have said from day one, those laws apply to everyone in our country, and that includes the president of the United States.\" — Washington Attorney General Bob Ferguson\n\n___\n\n\"The executive order was haphazard in its approach and roll-out; not properly vetted by the Congress or the federal Departments of State, Justice, Homeland Security, or Defense; and created needless chaos for children, families, students, physicians, businesses, and travelers.\" — Minnesota Attorney General Lori Swanson, whose state sued over the ban, along with Washington\n\n___\n\n\"The statute provides a president ... with great latitude and authority to protect the citizens and to protect the nation's national security. This was not argued on the merits. Now that we'll have an opportunity to argue on the merits we look forward to doing that. We look forward to prevailing.\" — White House counselor Kellyanne Conway\n\n___\n\n\"These cases can get abstract, but this case has real human consequences.\" Washington Solicitor General Noah Purcell.\n\n___\n\n\"The Justice Department is reviewing the decision and considering its options.\" — Agency statement", "authors": [], "publish_date": "2017-02-09", "source": "foxnews", "top_words": ["travel", "reaction", "led", "trump", "standing", "ban", "state", "security", "refusing", "court", "reinstate", "president", "washington", "look", "way"], "summary": "A federal appeals court refused to reinstate President Donald Trump's ban on travelers from seven predominantly Muslim nations.\n— Trump, in a tweet___\"Well, Mr. President, we just saw you in court, and we beat you.\n... We have led the way in standing up for the Constitution.\n— Washington state Gov.\n— Omar Jadwat, director of the organization's Immigrants' Rights Project___\"Bottom line, this is a complete victory for the state of Washington."}