{"url": "http://www.foxnews.com/us/2017/05/09/trump-comments-on-muslims-could-haunt-him-in-appeals-court.html", "id": "372", "title": "Trump's comments on Muslims could haunt him in appeals court", "text": "The first federal appeals court to hear a challenge to President Donald Trump's revised travel ban appeared unconvinced that it should ignore the Republican's repeated promises on the campaign trail to bar Muslims from entering the country.\n\nAn attorney for the president urged the 4th U.S. Circuit Court of Appeals on Monday to focus on the text of the religiously neutral executive order rather than use campaign statements to infer that the policy was driven by anti-Muslim sentiment.\n\nBut that idea was challenged by several members of the 13-judge panel, which is examining a ruling that blocks the administration from temporarily barring new visas for citizens of Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\n\"Is there anything other than willful blindness that would prevent us from getting behind those statements?\" asked Judge Henry Floyd, who was appointed to the court by President Barack Obama.\n\nThe 4th Circuit ruling is crucial for Trump, whose travel ban is expected to end up in the U.S. Supreme Court. The 4th Circuit is the first appeals court to examine the revised travel ban, which Trump's administration rewrote in an attempt to thwart legal challenges. It's unclear when the judges will issue their written decision.\n\nTrump's attorneys likely see the moderate court as friendlier territory than the 9th U.S. Circuit Court of Appeals, which conservatives have long attacked for being too liberal. The 9th Circuit is scheduled to hear another challenge to the revised travel ban next week.\n\nThe 4th Circuit \"is historically quite conservative and quite pro-government, so for the Trump administration to lose before the full 4th Circuit I think would be quite a body blow for the second version of the executive order,\" said Stephen Vladeck, a professor at the University of Texas law school.\n\nA federal judge in Maryland who blocked the revised travel ban in March cited Trump's comments as evidence that the executive order is a realization of Trump's promised Muslim ban.\n\nThe administration argues that the court shouldn't question the president's national security decisions based on campaign statements. The countries were chosen because they present terrorism risks and the ban applies to everyone in those countries regardless of religion, it says.\n\n\"This is not a Muslim ban. Its text doesn't have to anything to do with religion. Its operation doesn't have anything to do with religion,\" Acting Solicitor General Jeffrey Wall told the court.\n\nOmar Jadwat, an attorney for the American Civil Liberties Union, noted that Trump's call for a \"total and complete shutdown\" of Muslims entering the U.S. remained on his campaign website even after he took office. That call, which was still online earlier Monday, appeared to have been taken down by the afternoon hearing.\n\nJadwat said the administration has failed to provide a legitimate national security reason for the policy.\n\n\"The order is completely unprecedented in our nation's history,\" Jadwat said.\n\nJudge Paul Niemeyer repeatedly challenged Jadwat's arguments, questioning the wisdom in opening the door to using a president's past to evaluate the constitutionality of a policy.\n\n\"Can we look at his college speeches? How about his speeches to business men 20 years ago?\" asked Niemeyer, who was tapped by President George H. W. Bush.\n\nThe first travel ban in January triggered chaos and protests across the country as travelers were stopped from boarding international flights and detained at airports for hours.\n\nAfter a three-judge panel of the 9th Circuit refused in February to let the travel ban take effect, the administration tweaked the order and issued a new one.\n\nThe new version made it clear the 90-day ban covering those six countries doesn't apply to those who already have valid visas. It removed language that would give priority to religious minorities and erased Iraq from the list of banned countries.\n\nBut critics said that although the new executive order affects fewer people, it remains a realization of Trump's promised Muslim ban and cannot stand.\n\nEven if the Trump administration wins in the 4th Circuit, the travel ban will remain on hold unless it also overturns a federal judge's decision in Hawaii.\n\nVladeck said the Supreme Court may be more willing to hear the case if there's a split among the appeals courts.\n\nBut Richard Primus, a professor of constitutional law at the University of Michigan law school, said he thinks the Supreme Court will ultimately hear the case no matter what the appeals courts decide.\n\n\"A case this big, a case this salient, is one that some of the justices are not going to want to pass up,\" he said.\n\n___\n\nAssociated Press writer Sarah Rankin contributed to this report.\n\n___\n\nFollow Alanna Durkin Richer at http://twitter.com/aedurkinricher . Read more of her work at http://apne.ws/2hIhzDb .", "authors": [], "publish_date": "2017-05-09", "source": "foxnews", "top_words": ["haunt", "travel", "revised", "ban", "appeals", "comments", "circuit", "court", "4th", "trumps", "order", "muslims", "administration"], "summary": "The first federal appeals court to hear a challenge to President Donald Trump's revised travel ban appeared unconvinced that it should ignore the Republican's repeated promises on the campaign trail to bar Muslims from entering the country.\nThe 4th Circuit ruling is crucial for Trump, whose travel ban is expected to end up in the U.S. Supreme Court.\nThe 4th Circuit is the first appeals court to examine the revised travel ban, which Trump's administration rewrote in an attempt to thwart legal challenges.\nCircuit Court of Appeals, which conservatives have long attacked for being too liberal.\nA federal judge in Maryland who blocked the revised travel ban in March cited Trump's comments as evidence that the executive order is a realization of Trump's promised Muslim ban."}