{"url": "http://www.foxnews.com/opinion/2017/06/28/cnn-turns-elmo-into-propaganda-puppet.html", "id": "37", "title": "CNN turns Elmo into propaganda puppet", "text": "CNN, the nation's Fake News leader, has reached an all-time low -- using a beloved children's character to attack President Trump's temporary travel ban.\n\nClick here for a free subscription to Todd's newsletter - a must-read for Conservatives!\n\nThe network produced a bizarre Facebook Live Chat that featured CNN reporter Clarissa Ward, Sherrie Westin from Sesame Street, International Rescue Committee's David Miliband and Elmo - a hand puppet.\n\n“They like to play and learn just like Elmo and all his friends at Sesame Street,” Elmo said during the interview. “Elmo thinks it’s important to know that everybody is the same deep down and that’s very important.”\n\nCNN reported that Elmo visited a Syrian refugee camp - calling the trip \"really wonderful.\"\n\nTo continue reading Todd's column from ToddStarnes.com, click here.\n\nTodd Starnes is host of Fox News & Commentary. His latest book is “The Deplorables’ Guide to Making America Great Again.” Follow him on Twitter @ToddStarnes and find him on Facebook.", "authors": ["Todd Starnes"], "publish_date": "2017-06-28", "source": "foxnews", "top_words": ["todds", "cnn", "elmo", "sesame", "facebook", "westin", "ward", "wonderfulto", "street", "puppet", "turns", "visited", "propaganda"], "summary": "CNN, the nation's Fake News leader, has reached an all-time low -- using a beloved children's character to attack President Trump's temporary travel ban.\nThe network produced a bizarre Facebook Live Chat that featured CNN reporter Clarissa Ward, Sherrie Westin from Sesame Street, International Rescue Committee's David Miliband and Elmo - a hand puppet.\n“They like to play and learn just like Elmo and all his friends at Sesame Street,” Elmo said during the interview.\n“Elmo thinks it’s important to know that everybody is the same deep down and that’s very important.”CNN reported that Elmo visited a Syrian refugee camp - calling the trip \"really wonderful.\"\nHis latest book is “The Deplorables’ Guide to Making America Great Again.” Follow him on Twitter @ToddStarnes and find him on Facebook."}