{"url": "http://www.foxnews.com/us/2017/03/06/300-refugees-subjects-fbi-terror-investigations-u-s-officials-say.html", "id": "313", "title": "300 refugees subjects of FBI terror investigations, U.S. officials say", "text": "Hundreds of people admitted to the United States as refugees are the subjects of FBI counterterrorism investigations involving ISIS – including some individuals from countries cited on President Trump’s revised travel ban.\n\nTrump’s order, which was announced late Monday morning, temporarily bans travel to those without valid visas from Sudan, Syria, Iran, Libya, Somalia and Yemen.\n\nNearly a third of the 1,000 FBI domestic terrorism cases – 300 – involve those admitted to the U.S. as refugees, a Department of Homeland Security official said Monday. That number was confirmed later in the day by Attorney General Jeff Sessions during a news conference. Officials said some of those 300 came to “infiltrate” the U.S., while others were radicalized once they were in the country.\n\n\"Like every nation, the United States has a right to control who enters our country and to keep out those who would do us harm,\" Sessions said.\n\nThe officials who spoke Monday morning didn’t detail the current immigration status of those 300 people who were subjects of government terror probes, Reuters reported, citing a source.\n\nOne official also sought to clarify the apparent conflict with a leaked DHS report that appeared to show no connection between refugees and terrorism. The official said the draft document, which was reported by The Associated Press on Feb. 24, was not complete, had not been vetted through the interagency process and did not reflect classified information.\n\nFBI Director James Comey said in late 2015 that some 900 terror investigations were going on, and probes were active in every state. But Monday's development marked the first official concrete linkage between the refugee program and terrorism.\n\nAt the time, Comey indicated the bureau was stretched thin by the sheer volume of investigations.\n\n\"If that becomes the new normal,\" Comey said, \"that would be hard to keep up.\"\n\nSecretary of Homeland Security John Kelly said the travel ban announced Monday was a key to ansuring the refugee program is conducted safely.\n\n\"We must undertake a rigorous review of our visa and refugee vetting programs to increase our confidence in the entry decisions we make for visitors and immigrants to the United States,\" Kelly said. \"We cannot risk the prospect of malevolent actors using our immigration system to take American lives.\"\n\nSeveral refugees have already participated in mass attacks in recent years motivated by apparent Islamic radicalism.\n\nSomali refugee Abdul Razak Ali Artan rammed his car into a crowd at The Ohio State University in November after posting a message on Facebook warning America not to interfere with Muslim communities. Somali refugee Dahir Adan reportedly yelled “Allahu Akbar” and asked one victim if they were Muslim during a September rampage in which he stabbed and injured nine people at a Minnesota mall. Seddique Mateen, the father of Pulse nightclub shooter Omar Mateen, is an Afghan refugee. Countless other refugees have been convicted of plotting attacks or planning to join ISIS abroad.\n\nThough they didn’t enter the nation as refugees, several other terrorists have benefited from inadequate vetting to come to the U.S.\n\nTashfeen Malik, who was born in Pakistan, came to the U.S. on a K-1 “fiancée” visa prior to engaging in a deadly shooting spree with husband Syed Rizwan Farook that killed 14 and injured 22 others in December 2015. Dzhokhar and Tamerlan Tsarnaev, the brothers who orchestrated the 2013 Boston Marathon bombing, were born in Kyrgyzstan and entered the U.S. when their family filed for asylum.\n\nCatherine Herridge is an award-winning Chief Intelligence correspondent for FOX News Channel (FNC) based in Washington, D.C. She covers intelligence, the Justice Department and the Department of Homeland Security. Herridge joined FNC in 1996 as a London-based correspondent.", "authors": ["Catherine Herridge"], "publish_date": "2017-03-06", "source": "foxnews", "top_words": ["travel", "official", "homeland", "security", "comey", "refugee", "officials", "united", "states", "300", "fbi", "department", "refugees", "terror", "investigations", "subjects", "say"], "summary": "Hundreds of people admitted to the United States as refugees are the subjects of FBI counterterrorism investigations involving ISIS – including some individuals from countries cited on President Trump’s revised travel ban.\nNearly a third of the 1,000 FBI domestic terrorism cases – 300 – involve those admitted to the U.S. as refugees, a Department of Homeland Security official said Monday.\nOfficials said some of those 300 came to “infiltrate” the U.S., while others were radicalized once they were in the country.\n\"Like every nation, the United States has a right to control who enters our country and to keep out those who would do us harm,\" Sessions said.\nFBI Director James Comey said in late 2015 that some 900 terror investigations were going on, and probes were active in every state."}