{"url": "http://www.foxnews.com/us/2017/03/05/trump-expected-to-sign-new-travel-ban-order.html", "id": "312", "title": "Trump expected to sign new travel ban order", "text": "President Donald Trump is preparing to sign a revised executive order temporarily barring the entry of people from certain Muslim-majority countries and halting the nation's refugee program.\n\nA White House official says plans to roll out the order are on track for Monday. The official insisted on anonymity in order to discuss the order ahead of the official announcement.\n\nThe new order has been in the works since shortly after a federal court blocked Trump's initial effort, but the administration has repeatedly pushed back the signing.\n\nTrump administration officials have said the new order aims to overcome the legal challenges to the first. It's goal will be the same: keep would-be terrorists out the United States while the government reviews the vetting system for refugees and visa applicants from certain parts of the world.\n\nTrump's original orders temporarily blocked citizens of Iran, Iraq, Somalia, Sudan, Yemen, Syria and Libya from coming to the United States and put on hold the U.S. refugee program.\n\nThe revised order is expected to remove Iraq from the list of countries whose citizens face a temporary U.S. travel ban, following pressure from the Pentagon and State Department, which had urged the White House to reconsider, given Iraq' key role in fighting the Islamic State group.\n\nThe new order is also expected to make other changes, including no longer singling out Syrian refugees for an indefinite ban and making clear that all existing visas will be honored.\n\nTrump signed his original executive order in late January, sparking confusion and anger as travelers were detained at U.S. airports and barred from boarding flights at foreign airports.\n\nThe signing is expected to spark a new round of lawsuits and outrage.\n\n___\n\nAssociated Press writer Alicia Caldwell contributed to this report.", "authors": [], "publish_date": "2017-03-05", "source": "foxnews", "top_words": ["travel", "official", "trump", "revised", "ban", "temporarily", "state", "iraq", "united", "states", "sign", "expected", "order", "white"], "summary": "President Donald Trump is preparing to sign a revised executive order temporarily barring the entry of people from certain Muslim-majority countries and halting the nation's refugee program.\nA White House official says plans to roll out the order are on track for Monday.\nThe official insisted on anonymity in order to discuss the order ahead of the official announcement.\nTrump administration officials have said the new order aims to overcome the legal challenges to the first.\nIt's goal will be the same: keep would-be terrorists out the United States while the government reviews the vetting system for refugees and visa applicants from certain parts of the world."}