{"url": "http://www.foxnews.com/us/2017/05/27/supreme-court-travel-ban-case-could-test-trumps-reach.html", "id": "392", "title": "Supreme Court travel ban case could test Trump's reach", "text": "The Supreme Court may soon decide how courts are supposed to view presidential power in the age of Donald Trump.\n\nThe administration has promised a high court appeal of a ruling blocking the president's ban on visitors from six majority Muslim countries. The case could be a major test for the young administration and for a court that has its 5-4 conservative majority restored with the confirmation of Trump nominee Neil Gorsuch as the ninth justice.\n\nFirst, the justices must agree to intervene — something they'll probably do considering the importance of the issue. If so, then they will be dealing with an area of the law, immigration, where courts have given presidents a lot of leeway.\n\nBut the president's power over immigration is not absolute, and several lower courts have prevented Trump from putting in place a temporary ban on travel to the U.S. by residents of Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nThe travel policy was first issued a week after Trump took office on Jan. 20 and then revised following initial unfavorable court rulings. The dispute is unusual because Trump himself has supplied much of the evidence that opponents said demonstrated that anti-Muslim prejudice lay behind the policy.\n\nAt issue in the case are statements Trump made during the campaign, in interviews and in his actions as president.\n\n\"We've never really had, at least in recent decades a case like this which involves blatant evidence of pretextual discrimination by the president himself and also in the immigration sphere,\" said Ilya Somin, a professor at George Mason University's Antonin Scalia Law School.\n\nThe 4th U.S. Circuit Court of Appeals ruled against the travel policy Thursday, saying that Trump's comments helped show that the policy was \"steeped in animus and directed at a single religious group.\"\n\nOne key issue may be whether statements from candidate Trump should carry any weight. Three dissenting judges on the 4th Circuit said the statements shouldn't because candidates say many things while campaigning and shouldn't necessarily be held to them.\n\nJosh Blackman, a professor at the South Texas College of Law in Houston, said he thinks the Trump factor that was central to the 4th Circuit's ruling could be less pronounced at the Supreme Court.\n\nThe court could pay more attention to declarations from Attorney General Jeff Sessions and Homeland Security Secretary John Kelly in support of the policy. \"The justices recognize their decisions will long outlive Donald J. Trump. They'll be a little more careful to recognize that this isn't only for or about Trump,\" Blackman said.\n\nYet it may not be possible for the justices to separate the issue from Trump himself, said Richard Primus, a University of Michigan law professor.\n\n\"If a different president had issued this order, would it be unconstitutional? The question falsely assumes that another president could have issued this order. This order only makes sense from an administration that wants to demonstrate to its constituency that it doesn't like Muslims,\" Primus said. \"Neither Obama nor Clinton, or either President Bush, would have issued this order.\"\n\nIt's hardly clear how the Supreme Court might eventually rule in the case, but Justice Anthony Kennedy probably will be in the majority whatever the outcome. That's because Kennedy, closer to the ideological center of the court than any of his colleagues, often casts the decisive vote when the court is otherwise split between conservatives and liberals.\n\nBoth sides in the dispute have pointed to an opinion Kennedy wrote in 2015 in Kerry v. Din, a case in which an American citizen sought to challenge the denial of a visa for her Afghan husband.\n\nKennedy sided with the other conservative justices in favor of the Obama administration and against U.S. citizen Fauzia Din. But 4th Circuit Chief Judge Roger Gregory used Kennedy's opinion to buttress his majority opinion against the Trump travel ban.\n\nJudges must \"step away from our deferential posture and look behind the stated reason for the challenged action\" when a lawsuit makes a strong argument about bad faith motivating the policy, Gregory wrote, citing Kennedy's opinion.\n\nThe dissenting judges said Gregory misread Kennedy's opinion. \"Nowhere did the Din Court authorize going behind the government's notice for the purpose of showing bad faith,\" the dissenters said.\n\nKennedy could well settle the disagreement over what he meant, and whether the travel ban is upheld or falls.", "authors": ["Mark Sherman"], "publish_date": "2017-05-27", "source": "foxnews", "top_words": ["travel", "case", "trump", "test", "ban", "supreme", "majority", "reach", "court", "opinion", "law", "trumps", "president", "justices", "policy"], "summary": "The Supreme Court may soon decide how courts are supposed to view presidential power in the age of Donald Trump.\nThe administration has promised a high court appeal of a ruling blocking the president's ban on visitors from six majority Muslim countries.\nThe travel policy was first issued a week after Trump took office on Jan. 20 and then revised following initial unfavorable court rulings.\nCircuit Court of Appeals ruled against the travel policy Thursday, saying that Trump's comments helped show that the policy was \"steeped in animus and directed at a single religious group.\"\nBut 4th Circuit Chief Judge Roger Gregory used Kennedy's opinion to buttress his majority opinion against the Trump travel ban."}