{"url": "http://www.foxnews.com/us/2017/03/09/latest-hawaii-is-1st-state-to-sue-over-new-travel-ban.html", "id": "327", "title": "The Latest: Hawaii is 1st state to sue over new travel ban", "text": "The Latest on the state of Hawaii's challenge to President Donald Trump's revised travel ban (all times local):\n\n8:15 p.m.\n\nThe state of Hawaii has become the first state to sue to stop President Donald Trump's revised travel ban.\n\nAttorneys for the state filed the lawsuit Wednesday in federal court in Honolulu. The state had previously sued over Trump's initial travel ban, but that lawsuit was put on hold while other cases played out across the country.\n\nHawaii gave notice Tuesday night that it intended to file an amended lawsuit to cover the new ban, which plans to goes into effect March 16.\n\nThe revised executive order bars new visas for people from six predominantly Muslim countries and temporarily shuts down the U.S. refugee program. It doesn't apply to travelers who already have visas.\n\nHawaii's lawsuit says the order will harm Hawaii's Muslim population, tourism and foreign students.\n\n____\n\n5:25 p.m.\n\nA day after President Donald Trump signed a revised travel ban, attorneys for Hawaii said the state plans to challenge that order as well.\n\nThe state wants to amend its existing lawsuit challenging Trump's previous order to contest the revised one, according to a motion filed Tuesday in federal court in Honolulu.\n\nThe new order bars new visas for people from six Muslim-majority countries and temporarily shuts down America's refugee program, affecting would-be visitors and immigrants from Iran, Syria, Somalia, Sudan, Yemen and Libya.", "authors": [], "publish_date": "2017-03-09", "source": "foxnews", "top_words": ["travel", "hawaii", "revised", "ban", "visas", "state", "order", "donald", "sue", "trumps", "lawsuit", "latest", "president", "1st"], "summary": "The Latest on the state of Hawaii's challenge to President Donald Trump's revised travel ban (all times local):8:15 p.m.\nThe state of Hawaii has become the first state to sue to stop President Donald Trump's revised travel ban.\nThe state had previously sued over Trump's initial travel ban, but that lawsuit was put on hold while other cases played out across the country.\n____5:25 p.m.A day after President Donald Trump signed a revised travel ban, attorneys for Hawaii said the state plans to challenge that order as well.\nThe state wants to amend its existing lawsuit challenging Trump's previous order to contest the revised one, according to a motion filed Tuesday in federal court in Honolulu."}