{"url": "http://www.foxnews.com/us/2017/05/08/appeals-court-to-weigh-challenge-to-revised-trump-travel-ban.html", "id": "369", "title": "Appeals court to weigh challenge to revised Trump travel ban", "text": "After a series of stinging legal defeats, President Donald Trump's administration hopes to convince a federal appeals court that his travel ban targeting six-Muslim majority countries is motivated by national security, not religion.\n\nThe 4th U.S. Circuit Court of Appeals on Monday will examine a ruling that blocks the administration from temporarily barring new visas for citizens of Iran, Libya, Somalia, Sudan, Syria and Yemen. It's the first time an appeals court will hear arguments on the revised travel ban, which is likely destined for the U.S. Supreme Court.\n\nPointing to the Republican's promises on the campaign trail to bar Muslims from entering the country, a federal judge in Maryland found in March that the policy appeared to be driven primarily by religious animus.\n\nAttorneys for the U.S. Justice Department say the court shouldn't rely on Trump's statements, but on the text of the policy, which they say is necessary to protect the country from terrorism. The banned countries represent just a fraction of the predominantly Muslim countries worldwide, they note.\n\n\"The court should have focused on official acts, not perceived subjective motivations,\" the attorneys say in court documents.\n\nThe American Civil Liberties Union and National Immigration Law Center say Trump wants the courts to \"blind themselves to the ample, public, and uncontested evidence\" that the policy targets Muslims.\n\n\"The basic question in this case is whether the mountain of evidence that exists as to the improper motive is going to be looked at by this court or swept under the rug,\" said Omar Jadwat, director of the ACLU's Immigrants' Rights Project, who will argue the case Monday.\n\nIn an extraordinary move signifying the importance of the case, the 4th Circuit decided to bypass the three-judge panel that typically first hears appeals and go straight to the full-court hearing.\n\nWhile the 4th Circuit was long considered one of the most conservative appeals courts in the country, it moved to the center under President Barack Obama, who appointed six of the 15 active judges.\n\nNow, nine judges are Democratic appointees and five judges are Republican appointees. Chief Judge Roger Gregory was given a recess appointment to the court by President Bill Clinton and was reappointed by President George W. Bush.\n\nIt will likely be weeks before the 4th Circuit issues a decision. And even if the court sides with Trump, the travel ban will remain blocked unless the president also wins in another appeals court.\n\nA federal judge in Hawaii has also blocked the six-country travel ban as well as the freeze on the U.S. refugee program. A three-judge panel of the 9th U.S. Circuit Court of Appeals will meet next Monday to hear arguments in that case.\n\nAudio of the 2:30 p.m. EDT 4th Circuit will be broadcast live on C-SPAN. The court will also provide a link to the audio feed on its website.\n\n___\n\nFollow Alanna Durkin Richer at http://twitter.com/aedurkinricher\n\nRead more of her work at http://apne.ws/2hIhzDb", "authors": [], "publish_date": "2017-05-08", "source": "foxnews", "top_words": ["travel", "revised", "trump", "ban", "challenge", "appeals", "circuit", "judge", "court", "4th", "president", "weigh", "policy", "say"], "summary": "After a series of stinging legal defeats, President Donald Trump's administration hopes to convince a federal appeals court that his travel ban targeting six-Muslim majority countries is motivated by national security, not religion.\nIt's the first time an appeals court will hear arguments on the revised travel ban, which is likely destined for the U.S. Supreme Court.\nAnd even if the court sides with Trump, the travel ban will remain blocked unless the president also wins in another appeals court.\nA federal judge in Hawaii has also blocked the six-country travel ban as well as the freeze on the U.S. refugee program.\nCircuit Court of Appeals will meet next Monday to hear arguments in that case."}