{"url": "http://www.foxnews.com/us/2017/05/15/another-appeals-court-to-weigh-trumps-revised-travel-ban.html", "id": "375", "title": "Federal judges ask if travel ban is biased against Muslims", "text": "Federal judges on Monday peppered a lawyer for President Donald Trump with questions about whether the administration's travel ban discriminates against Muslims and zeroed in on the president's campaign statements, the second time in a week the rhetoric has faced judicial scrutiny.\n\nActing Solicitor General Jeffrey Wall, defending the travel ban, told the three-judge panel of the 9th U.S. Circuit Court of Appeals that the executive order should be reinstated because it falls well within the president's authority.\n\n\"No one has ever attempted to set aside a law that is neutral on its face and neutral in its operation on the basis of largely campaign trail comments made by a private citizen running for office,\" he said.\n\nFurther, Wall said the president had backed off the comments he made during the campaign, clarifying that \"what he was talking about was Islamic terrorist groups and the countries that sponsor or shelter them.\"\n\nNeal Katyal, who represented Hawaii, a plaintiff in the lawsuit, expressed disbelief at that argument and said Trump had repeatedly spoken of a Muslim ban during the presidential campaign and after.\n\n\"This is a repeated pattern of the president,\" Katyal said.\n\nThe 9th Circuit panel was hearing arguments over Hawaii's lawsuit challenging the travel ban, which would suspend the nation's refugee program and temporarily bar new visas for citizens of Iran, Libya, Somalia, Sudan, Syria and Yemen. The judges will decide whether to uphold a Hawaii judge's decision in March that blocked the ban.\n\nLast week, judges on the 4th Circuit Court of Appeals heard arguments over whether to affirm a Maryland judge's decision putting the ban on ice. They also questioned whether they could consider Trump's campaign statements, with one judge asking if there was anything other than \"willful blindness\" that would prevent them from doing so.\n\nDozens of advocates for refugees and immigrants rallied outside the federal courthouse in Seattle, some carrying \"No Ban, No Wall\" signs.\n\nWall's insistence that the travel ban should be upheld because it is \"neutral,\" without reference to Islam, drew pointed questions from Judge Richard Paez. An executive order issued by President Franklin Roosevelt that led to the internment of 110,000 Japanese-Americans during World War II similarly was couched as a necessity for national security and made no reference to residents of Japanese heritage, Paez noted.\n\nThe U.S. Supreme Court upheld that executive order in a challenge brought by California resident Fred Korematsu. The ruling is now widely considered regrettable.\n\n\"Would the Korematsu executive order pass muster under your test today?\" Paez grilled Wall.\n\n\"No, Judge Paez,\" he answered\n\n\"Why not? 'Facially legitimate' — that's all you say!\" Paez said. \"You emphasize 'facially legitimate.'\"\n\n\"I want to be very clear about this,\" Wall said solemnly. \"This case is not Korematsu, and if it were I wouldn't be standing here and the United States would not be defending it.\"\n\nWall went on to argue that unlike the Korematsu case, Trump's executive order probably wouldn't be questioned but for the statements he made as a candidate.\n\nPaez also questioned Katyal about Trump's statements, calling them \"profound.\" But the judge wondered whether Trump is forever forbidden from adopting an executive order along the lines of his travel ban.\n\nKatyal said no, and suggested the president could begin by repudiating his earlier statements or by working with Congress.\n\n\"If you rule for him, you defer to the president in a way that history teaches us is very dangerous,\" Katyal said.\n\nMonday's arguments marked the second time Trump's efforts to restrict immigration from certain Muslim-majority nations have reached the San Francisco-based 9th Circuit.\n\nAfter Trump issued his initial travel ban on a Friday in late January, bringing chaos and protests to airports around the country, a Seattle judge blocked its enforcement nationwide — a decision that was unanimously upheld by a three-judge 9th Circuit panel.\n\nThe president then rewrote his executive order, rather than appeal to the U.S. Supreme Court, and in March, U.S. District Judge Derrick Watson in Honolulu blocked the new version from taking effect, citing what he called \"significant and unrebutted evidence of religious animus\" in Trump's campaign statements.\n\n\"Again, in this court, the President claims a nearly limitless power to make immigration policy that is all but immune from judicial review,\" Hawaii Attorney General Douglas Chin wrote to the 9th Circuit. \"Again, he must be checked.\"\n\nAt his daily briefing, White House press secretary Sean Spicer expressed confidence that the executive order will be upheld by the appeals court.\n\n\"The executive order is fully lawful and will be upheld. We fully believe that,\" Spicer said.\n\nThe travel ban cases are expected to reach the Supreme Court, but that would likely be cemented if the 4th and 9th Circuits reach differing conclusions about its legality. Because of how the courts chose to proceed, a full slate of 13 judges heard the 4th Circuit arguments last week, while just three, all appointees of President Bill Clinton, will consider the case in Seattle.\n\nWith the possibility for myriad concurring or dissenting opinions, it could take the 4th Circuit longer to rule, noted Carl Tobias, a law professor at University of Richmond law school in Virginia.\n\n__\n\nAssociated Press reporter Martha Bellisle contributed to this report.", "authors": ["Gene Johnson"], "publish_date": "2017-05-15", "source": "foxnews", "top_words": ["executive", "travel", "judges", "ban", "circuit", "judge", "court", "biased", "federal", "ask", "order", "president", "muslims", "campaign"], "summary": "Acting Solicitor General Jeffrey Wall, defending the travel ban, told the three-judge panel of the 9th U.S.\nCircuit Court of Appeals that the executive order should be reinstated because it falls well within the president's authority.\nLast week, judges on the 4th Circuit Court of Appeals heard arguments over whether to affirm a Maryland judge's decision putting the ban on ice.\nWall's insistence that the travel ban should be upheld because it is \"neutral,\" without reference to Islam, drew pointed questions from Judge Richard Paez.\nBut the judge wondered whether Trump is forever forbidden from adopting an executive order along the lines of his travel ban."}