{"url": "http://www.foxnews.com/us/2017/05/15/who-are-3-judges-who-heard-arguments-on-trump-travel-ban.html", "id": "382", "title": "Who are 3 judges who heard arguments on Trump travel ban?", "text": "Three judges appointed by President Bill Clinton heard the appeal Monday of Hawaii's challenge to President Trump's travel ban targeting six predominantly Muslim countries.\n\nThe San Francisco-based 9th U.S. Circuit Court of Appeals heard arguments in its Seattle courthouse.\n\nThe 4th U.S. Circuit Court of Appeals in Virginia is considering a similar ruling.\n\nThe U.S. Supreme Court could take up the issue if the appeals courts issue contradictory decisions.\n\nThe three 9th Circuit judges are:\n\nMICHAEL DALY HAWKINS, 72\n\nClinton, a Democrat, appointed Hawkins in 1994 after Hawkins served as Arizona's top federal prosecutor from 1977 to 1980 and as a U.S. Marine Corps judge deciding court martials from 1973 to 1976.\n\nHawkins was in private practice for 14 years before Clinton appointed him.\n\nIn 2012. Hawkins joined Judge Stephen Reinhardt's majority ruling striking down California's gay marriage ban. It was the first federal appeals court ruling that determined gay marriage bans were unconstitutional. The U.S. Supreme Court, in another case, ruled similarly three years later.\n\nRONALD GOULD, 70\n\nClinton appointed Gould in 1999. After clerking for U.S. Supreme Court Judge Potter Stewart from 1974 to 1975, Gould joined the prominent law firm Perkins Coie, where he remained until his appointment to the bench.\n\nGould listens to oral arguments electronically from his Seattle court because of multiple sclerosis.\n\nIn 2014, he wrote the majority decision that high schools must provide the same athletic amenities to girls as boys. The ruling expanded the U.S Department of Education's so-called Title IX mandate to treat male and female college athletes the same.\n\nRICHARD PAEZ, 70\n\nClinton elevated Paez to the appeals court from federal district court in Los Angeles in 1999. Clinton had appointed Paez to the district court five years earlier after Paez spent 13 years as a state judge in California.\n\nBefore he became a judge, Paez worked as a staff attorney for the Legal Aid Foundation of Los Angeles, Western Center on Law and Poverty and California Rural Legal Assistance.\n\nHe wrote the majority opinion in 2011 that Arizona lawmakers went too far when they enacted strict immigration regulations, including making it a state crime to lack immigration papers. The U.S. Supreme Court later ruled similarly.", "authors": [], "publish_date": "2017-05-15", "source": "foxnews", "top_words": ["ruling", "travel", "hawkins", "judges", "trump", "ban", "appeals", "appointed", "supreme", "judge", "majority", "court", "paez", "gould", "arguments", "heard"], "summary": "Three judges appointed by President Bill Clinton heard the appeal Monday of Hawaii's challenge to President Trump's travel ban targeting six predominantly Muslim countries.\nHawkins joined Judge Stephen Reinhardt's majority ruling striking down California's gay marriage ban.\nIt was the first federal appeals court ruling that determined gay marriage bans were unconstitutional.\nRONALD GOULD, 70Clinton appointed Gould in 1999.\nRICHARD PAEZ, 70Clinton elevated Paez to the appeals court from federal district court in Los Angeles in 1999."}