{"url": "http://www.foxnews.com/us/2017/03/29/us-judge-to-hear-arguments-on-longer-block-to-travel-ban.html", "id": "355", "title": "US judge to hear arguments on longer block to travel ban", "text": "A federal judge in Hawaii who temporarily blocked President Donald Trump's revised travel ban planned to hear arguments Wednesday on whether to extend his order until the state's lawsuit works its way through the courts.\n\nBut even if U.S. District Judge Derrick Watson does not issue a longer-lasting hold on the ban, the temporary block would stay in place until he rules otherwise. Legal experts say it is unlikely Watson would side with the Trump administration.\n\nThe state says the policy discriminates against Muslims, while the government says it falls within Trump's power to protect national security.\n\nHere's a look at what led up to Wednesday's hearing in Honolulu:\n\n___\n\nTHE TEMPORARY ORDER\n\nThis month, Watson prevented the federal government from suspending new visas for people from six Muslim-majority countries and freezing the nation's refugee program. The ruling came just hours before the ban was to take effect.\n\nWatson, nominated to the bench by former President Barack Obama in 2012, agreed with Hawaii that the ban would hurt the state's tourism-dependent economy and that it discriminates based on nationality and religion.\n\nTrump called the ruling an example of \"unprecedented judicial overreach.\"\n\nThe next day, a judge in Maryland also blocked the six-nation travel ban but said it wasn't clear that the suspension of the refugee program was similarly motivated by religious bias.\n\nThe federal government appealed the Maryland ruling to the 4th U.S. Circuit Court of Appeals and sought to narrow the Hawaii ruling.\n\n___\n\nWHAT DOES HAWAII WANT?\n\nThe state has urged Watson to extend his ruling until the lawsuit is resolved.\n\n\"And after the repeated stops and starts of the last two months, it would ensure that the constitutional rights of the plaintiffs, and of Muslim citizens throughout the United States, could be finally and fully vindicated,\" lawyers for the state said in a court filing.\n\nIsmail Elshikh, the imam of a Honolulu mosque, has joined the legal challenge, saying the ban would prevent his Syrian mother-in-law from visiting family in the U.S.\n\n___\n\nWHAT DOES THE TRUMP ADMINISTRATION WANT?\n\nThe Department of Justice opposes Hawaii's request to extend Watson's temporary order. But the department said that if the judge agrees, he should narrow the ruling to cover only the part of Trump's executive order that suspends new visas for people from Somalia, Iran, Syria, Sudan, Libya and Yemen.\n\nHawaii's lawsuit doesn't show how the state would be harmed by other sections of the ban, including suspending the refugee program, government attorneys said in court papers.\n\nOther parts of the travel ban \"do not apply to plaintiffs at all, but instead simply facilitate the government's ability to identify and fix potential gaps in the nation's vetting procedures,\" Trump lawyers wrote.\n\nTrump's revised executive order involves \"a detailed review of the national security risks that pose the greatest threats to the nation, and it then provided targeted measures to address those security risks in a religiously neutral manner,\" government lawyers say in court documents.\n\n___\n\nCAN AN APPEALS COURT AFFECT THE HAWAII RULING?\n\nThe president is asking the 4th U.S. Circuit Court of Appeals to put the ruling by the judge in Maryland on hold while it considers the case.\n\nThe Richmond, Virginia-based appeals court will hear arguments May 8. If the court sides with the federal government, it would not have a direct effect on the Hawaii ruling, legal experts said.\n\nThe Trump administration's best bet for saving the travel ban is to have the case go before the U.S. Supreme Court, said Richard Primus, a professor of constitutional law at the University of Michigan law school.\n\n\"What a ruling in 4th Circuit in favor of the administration would do is create a split in authority between federal courts in different parts of the country,\" he said. \"Cases with splits in authority are cases the U.S. Supreme Court exists to resolve.\"", "authors": [], "publish_date": "2017-03-29", "source": "foxnews", "top_words": ["ruling", "travel", "hear", "hawaii", "trump", "ban", "state", "judge", "block", "court", "longer", "federal", "watson", "arguments"], "summary": "A federal judge in Hawaii who temporarily blocked President Donald Trump's revised travel ban planned to hear arguments Wednesday on whether to extend his order until the state's lawsuit works its way through the courts.\nBut even if U.S. District Judge Derrick Watson does not issue a longer-lasting hold on the ban, the temporary block would stay in place until he rules otherwise.\nThe next day, a judge in Maryland also blocked the six-nation travel ban but said it wasn't clear that the suspension of the refugee program was similarly motivated by religious bias.\nCircuit Court of Appeals to put the ruling by the judge in Maryland on hold while it considers the case.\nIf the court sides with the federal government, it would not have a direct effect on the Hawaii ruling, legal experts said."}