{"url": "http://www.foxnews.com/us/2017/02/23/oregon-joins-suit-against-president-trump-travel-ban.html", "id": "307", "title": "Oregon joins suit against President Trump's travel ban", "text": "Oregon asked a federal court late Wednesday to join a lawsuit filed by Washington state against an immigration ban imposed by President Donald Trump.\n\nAttorney General Ellen Rosenblum said in the motion that Oregon also needs protection from the ban on immigrants from seven predominantly Muslim countries, which she said would harm Oregon's businesses, residents, universities, health care and economy.\n\nThe lawsuit filed by Washington Attorney General Bob Ferguson on Jan. 30 resulted in a judge suspending Trump's temporary ban. Minnesota previously joined the lawsuit.\n\nRosenblum wrote in the motion filed in U.S. District Court for the Western District of Washington that if Washington and Minnesota prevail, the court might craft a limited remedy instead of a nationwide injunction, which would not address the harm caused to Oregon.\n\nBoth Rosenblum and Ferguson said in recent interviews with The Associated Press that they are increasingly sharing information and consulting with each other and with other Democratic counterparts, as the White House and Congress try to roll back former President Barack Obama's policies and steer a conservative course for the nation.\n\nAt stake are health care, the environment, immigrant rights, marijuana legalization and many other issues.\n\n\"What I am very proud of is that state attorneys general are stepping up to the plate,\" Rosenblum said, citing efforts by her counterparts, including in Virginia, Massachusetts, New York and Hawaii.\n\nRosenblum told AP that Oregon is also readying for a court battle in case the federal government tries to curtail abortion rights.\n\nIn particular, Rosenblum worries that the federal government will try to force states to restrict abortion rights by cutting funding for Planned Parenthood. The Hyde Amendment already prevents federal dollars from funding abortions, she said, but Planned Parenthood also offers treatment for sexually transmitted diseases and preventive health care. She said she already has staffers researching a possible response.\n\n\"The penalizing of an organization that provides abortions but that does a huge amount of other very, very important health care, to treat our citizens, absolutely, we're going to push back against that to the greatest extent possible,\" Rosenblum said.\n\nAttorneys general, particularly from more liberal states, are coordinating more via informal phone calls and emails, and in meetings such as those of the Democratic Attorneys General Association, which Rosenblum co-chairs.\n\nTrump has promised to issue a revised travel ban, saying it's needed to keep America safe. Ferguson said in a telephone interview late Tuesday that his team is ready to take further action.\n\n\"When it comes out, we will scrutinize it to see if it is constitutional and lawful,\" Ferguson said. \"If it is not, you can be sure we'll be following up.\"\n\nThe events before and after Trump's signing of the executive order highlight the new level of communication among liberal states' attorneys general. The Democratic Attorneys General Association had just finished holding a meeting in Florida when Trump signed the order, on Jan. 27, a Friday.\n\nFerguson was flying back to Seattle but already had lined up a team of five attorneys and support staff ready to pounce. As travelers from the banned countries were detained at airports across America and were prevented from boarding U.S.-bound flights, Ferguson's team worked through the weekend.\n\n\"The pace for those 72 hours, to say it was intense would be significant understatement,\" Ferguson said. \"We felt every hour mattered.\"\n\nOn Jan. 30, they asked a federal court for a temporary restraining order to prevent enforcement of Trump's order, claiming it was unconstitutional. Rosenblum said she helped organize a statement from 18 attorneys general supporting Ferguson's lawsuit.\n\nEric Schneiderman, attorney general for New York, which was one of those 18 states and which also filed a lawsuit, said attorneys general are having an \"awakening\" regarding the Trump administration.\n\nRosenblum said Ferguson deserves praise for being \"first out of the gate\" and that she feels no rivalry about being first to stand up against White House orders that are seen as illegal or unconstitutional.\n\n\"There's going to be plenty to go around,\" Rosenblum said.\n\n___\n\nFollow Andrew Selsky on Twitter at https://twitter.com/andrewselsky", "authors": [], "publish_date": "2017-02-23", "source": "foxnews", "top_words": ["travel", "joins", "ban", "rosenblum", "court", "oregon", "order", "trumps", "attorneys", "general", "ferguson", "federal", "states", "president", "health", "washington", "suit"], "summary": "Oregon asked a federal court late Wednesday to join a lawsuit filed by Washington state against an immigration ban imposed by President Donald Trump.\nThe lawsuit filed by Washington Attorney General Bob Ferguson on Jan. 30 resulted in a judge suspending Trump's temporary ban.\nThe events before and after Trump's signing of the executive order highlight the new level of communication among liberal states' attorneys general.\nThe Democratic Attorneys General Association had just finished holding a meeting in Florida when Trump signed the order, on Jan. 27, a Friday.\nOn Jan. 30, they asked a federal court for a temporary restraining order to prevent enforcement of Trump's order, claiming it was unconstitutional."}