{"url": "http://www.foxnews.com/us/2017/03/07/trump-new-travel-ban-comes-without-chaos-first-one.html", "id": "323", "title": "Trump's new travel ban comes without the chaos of first one", "text": "When President Donald Trump signed his first travel ban with scant warning and little planning seven days into his presidency, he meant to signal he was a man of action. After the lawsuits, chaos at airports and international criticism, Trump's rewritten travel ban sent a different message: The White House has learned some lessons.\n\nThe Trump administration's unveiling of its revised restrictions on travel and refugees was deliberate and cautious, an implicit acknowledgement of some of the unforced errors from the first rollout. The executive order was announced by Trump's Cabinet officials, some of whom felt cut out of consultations on the earlier version. It does not go into effect immediately, giving the world time to assess its impact.\n\nThe White House took weeks of consultation with agency heads about how best to withstand expected legal challenges.\n\nThe scaled-back order will still face fire from critics. It bars new visas for people from six Muslim-majority countries and temporarily shuts down America's refugee program, affecting would-be visitors and immigrants from Iran, Syria, Somalia, Sudan, Yemen and Libya.\n\nDepartment of Homeland Security intelligence analysts have questioned the rationale behind it, concluding that citizenship is an \"unlikely indicator\" of terrorism threats to the United States.\n\nBut the new ban does eliminate many of the original order's most contentious elements. It removes Iraq from the list of banned countries — at the urging of U.S. military and diplomatic leaders — and it makes clear that current visa holders will not be impacted. It also removes language that would give priority to religious minorities — a provision some interpreted as a way to help Christians get into the U.S. while excluding Muslims.\n\nTrump signed the order without fanfare in a closed-press ceremony in the Oval Office.\n\nLegal experts say the new order addresses some of the constitutional concerns raised by a federal appeals court about the initial ban but leaves room for more legal challenges.\n\n\"It's much clearer about how it doesn't apply to groups of immigrants with more clearly established constitutional rights,\" said University of Texas law professor Stephen Vladeck. \"That's a really important step.\"\n\nTrump officials say the goal hasn't changed: keeping would-be terrorists out of the United States while the government reviews vetting systems for refugees and visa applicants from certain parts of the world.\n\n\"It is the president's solemn duty to protect the American people, and with this order President Trump is exercising his rightful authority to keep our people safe,\" said Secretary of State Rex Tillerson at a brief press announcement, where he, Homeland Security Secretary John Kelly and Attorney General Jeff Sessions served as the public faces of the rollout.\n\nThe original travel ban led to instant chaos at airports as Homeland Security officials scrambled to interpret how it was to be implemented and some travelers were detained before being sent back overseas or blocked from getting on airplanes abroad. The order quickly became the subject of several legal challenges and was put on hold last month by a federal judge in Washington state.\n\nThis time, there was none of that chaos. The new order won't take effect until March 16, despite repeated warnings from Trump and his aides that any delay would put national security at risk by allowing the entry of \"bad dudes\" who want to cause harm to the country.\n\nPress secretary Sean Spicer told reporters at the White House that Trump approved the final details of the revised executive order on Saturday night after meeting with Kelly, Sessions and members of his legal staff and policy team.\n\nTrump's new order reinstates his four-month ban on all refugees from around the world and keeps in place his plan to reduce the number of refugees to be allowed into the United States this budget year to 50,000. Syrians are also no longer subjected to an indefinite ban, despite Trump's insistence as a candidate that they pose a serious security threat.\n\nLee Gelernt, deputy director of the American Civil Liberties Union's Immigrants' Rights Project, said the group will try to block the new order from taking effect, either by amending the existing lawsuits that blocked Trump's original ban or seeking a new injunction.\n\n\"The only way to actually fix the Muslim ban is not to have a Muslim ban,\" said Omar Jadwat, director of the project.\n\nWashington Attorney General Bob Ferguson, whose state won a court order blocking the travel ban, said the new travel ban is more legally palatable than the old one but that it still poses concerns and could prompt further court challenges from the state.\n\n\"Bottom line is the president has capitulated on numerous key provisions that we contested in court about a month ago,\" Ferguson said at a news conference in his Seattle office. \"This is a very significant victory for the people of the state of Washington.\"\n\n___\n\nFollow Alicia A. Caldwell on Twitter at http://twitter.com/acaldwellap and Jill Colvin at http://twitter.com/colvinj", "authors": [], "publish_date": "2017-03-07", "source": "foxnews", "top_words": ["travel", "trump", "ban", "security", "chaos", "refugees", "court", "trumps", "order", "white", "comes", "legal"], "summary": "When President Donald Trump signed his first travel ban with scant warning and little planning seven days into his presidency, he meant to signal he was a man of action.\nAfter the lawsuits, chaos at airports and international criticism, Trump's rewritten travel ban sent a different message: The White House has learned some lessons.\nThe executive order was announced by Trump's Cabinet officials, some of whom felt cut out of consultations on the earlier version.\nSyrians are also no longer subjected to an indefinite ban, despite Trump's insistence as a candidate that they pose a serious security threat.\nWashington Attorney General Bob Ferguson, whose state won a court order blocking the travel ban, said the new travel ban is more legally palatable than the old one but that it still poses concerns and could prompt further court challenges from the state."}