{"url": "http://www.foxnews.com/us/2017/02/14/federal-judge-blocks-trump-travel-ban-for-virginia-residents.html", "id": "303", "title": "Federal judge blocks Trump travel ban for Virginia residents", "text": "A federal judge has granted a preliminary injunction barring the Trump administration from implementing its travel ban in Virginia, adding another judicial ruling to those already in place challenging the ban's constitutionality.\n\nThe Monday ruling is significant from a legal standpoint because U.S. District Judge Leonie Brinkema found that an unconstitutional religious bias is at the heart of the travel ban, and therefore it violates First Amendment prohibitions on favoring one religion over another. She said the evidence introduced so far indicates that Virginia's challenge to the ban will succeed once it proceeds to trial.\n\nA federal appeals court in California has already upheld a national temporary restraining order stopping the government from implementing the ban, which is directed at seven Muslim-majority countries. But the ruling by the 9th Circuit Court of Appeals was rooted more in due process grounds, said Virginia Attorney General Mark Herring, a Democrat who brought the lawsuit against Trump in Virginia.\n\n\"Judge Brinkema's ruling gets right to the heart of our First Amendment ... claim,\" Herring said in a conference call Monday night.\n\nIn her 22-page ruling, Brinkema writes that Trump's promises during the campaign to implement what came to be known as a \"Muslim ban\" provide evidence that the current executive order unconstitutionally targets Muslims.\n\n\"The president himself acknowledged the conceptual link between a Muslim ban and the EO (executive order),\" Brinkema wrote. She also cited news accounts that Trump adviser Rudy Giuliani said the executive order is an effort to find a legal way for Trump to be able to impose his Muslim ban.\n\nHerring said that \"the overwhelming evidence shows that this ban was conceived in religious bigotry.\"\n\nAlso, the preliminary injunction issued Monday night by Brinkema in Alexandria is a more permanent type of injunction than the temporary restraining order issued in the Washington state case. Herring said he expects the injunction to remain in place until the case goes to trial.\n\nBrinkema's injunction, though, applies only to Virginia residents. Herring had asked the judge to issue the injunction nationwide, but Brinkema limited it to Virginia, saying that the nationwide restraining order in place out of the Washington state case already provides much of the relief Virginia is seeking. Herring said he could ask the judge to extend the injunction nationally if the 9th Circuit stay gets reversed.\n\nVirginia's lawsuit also does not challenge the portion of the executive order directed at refugees. The 9th Circuit case covers refugees.\n\nVirginia based its arguments on the harms the state would suffer if the travel ban were allowed to go forward. The state has said, for instance, that 1,000 students at its universities and dozens of university staff members and professors could be affected by the ban.\n\nIn her ruling, Brinkema said the Trump administration offered no justification for the travel ban, and wrote that the president's executive power \"does not mean absolute power.\"\n\nBrinkema chided the federal government for offering no evidence to support its rationale for the ban, other than arguing the president's authority for issuing such an order.\n\nShe said the president's executive authority is still limited by the Constitution. \"Every presidential action must still comply with the limits set by Congress' delegation of power and the constraints of the Constitution, including Bill of Rights,\" she wrote.\n\nA Justice Department spokeswoman did not immediately return an email seeking comment Monday night. Trump has raised the possibility that he will issue a new executive order to replace the one being challenged in court.", "authors": [], "publish_date": "2017-02-14", "source": "foxnews", "top_words": ["executive", "blocks", "travel", "residents", "ruling", "trump", "ban", "judge", "brinkema", "herring", "federal", "order", "virginia", "injunction"], "summary": "A federal judge has granted a preliminary injunction barring the Trump administration from implementing its travel ban in Virginia, adding another judicial ruling to those already in place challenging the ban's constitutionality.\n\"The president himself acknowledged the conceptual link between a Muslim ban and the EO (executive order),\" Brinkema wrote.\nVirginia based its arguments on the harms the state would suffer if the travel ban were allowed to go forward.\nIn her ruling, Brinkema said the Trump administration offered no justification for the travel ban, and wrote that the president's executive power \"does not mean absolute power.\"\nTrump has raised the possibility that he will issue a new executive order to replace the one being challenged in court."}