{"url": "http://www.foxnews.com/us/2017/03/21/muslim-advocacy-group-seeks-broader-travel-ban-injunction.html", "id": "348", "title": "Muslim advocacy group seeks broader travel-ban injunction", "text": "A judge is weighing a request from a Muslim civil rights group for an even broader injunction against President Donald Trump's proposed travel ban than what is already in place.\n\nFederal judges in Hawaii and Maryland have issued orders that already block the vast majority of Trump's revised ban, which would restrict immigration from refugees and from six majority-Muslim countries.\n\nAt a hearing Tuesday in Alexandria, lawyers for the Council on American-Islamic Relations asked a judge to issue an injunction blocking the entire executive order. Lawyer Gadeir (geh-DEER') Abbas said a section of the order affecting how waivers are granted for visa applicants remains in force.\n\nActing Assistant Attorney General Chad Readler said the remaining provisions of the travel ban have no practical effect on how the government issues visas.", "authors": [], "publish_date": "2017-03-21", "source": "foxnews", "top_words": ["advocacy", "travel", "seeks", "ban", "travelban", "visas", "judge", "broader", "trumps", "group", "weighing", "order", "muslim", "waivers", "visa", "injunction"], "summary": "A judge is weighing a request from a Muslim civil rights group for an even broader injunction against President Donald Trump's proposed travel ban than what is already in place.\nFederal judges in Hawaii and Maryland have issued orders that already block the vast majority of Trump's revised ban, which would restrict immigration from refugees and from six majority-Muslim countries.\nAt a hearing Tuesday in Alexandria, lawyers for the Council on American-Islamic Relations asked a judge to issue an injunction blocking the entire executive order.\nLawyer Gadeir (geh-DEER') Abbas said a section of the order affecting how waivers are granted for visa applicants remains in force.\nActing Assistant Attorney General Chad Readler said the remaining provisions of the travel ban have no practical effect on how the government issues visas."}