{"url": "http://www.foxnews.com/opinion/2017/06/06/trumps-terror-tweets-are-not-making-us-any-safer.html", "id": "33", "title": "Trump's terror tweets are not making us any safer", "text": "President Trump’s response to the terror attack in London this past weekend did more to politicize the issue than respond to terror in a firm, unifying, and proactive way.\n\nRather than sending words of support, Trump took the opportunity to criticize London’s Mayor Sadiq Khan and use the attack as a platform to support his “travel ban.”\n\nTrump and Khan – the first Muslim mayor of London – engaged in a public argument on Twitter regarding Trump’s mischaracterization of Khan’s statement on increased police activity.\n\nKhan attempted to dismiss the Twitter feud with Trump and focus on the aftermath of the attack, and was greeted by more invectives from the president criticizing his response.\n\n“We must stop being politically correct and get down to the business of security for our people,” Trump tweeted. “If we don't get smart it will only get worse[.]” Then later, regarding the stagnation of his travel ban, “In any event we are EXTREME VETTING people coming into the U.S. in order to help keep our country safe. The courts are slow and political!”\n\nTrump’s tweets were inflammatory. Rather than simply offering words of support – as he did in his more empathetic statements in reaction to the attacks in Manchester earlier this month, and Westminster in March – he is pushing forward with his own agenda, one of the only world leaders who has used the attack as a call to action.\n\nMore to the point, though, he is beginning to use international events to promote is own domestic agenda.\n\nBy focusing on the attacks in the U.K., he is hoping to garner greater support for his “travel ban,” as well as other national security issues like the wall on the southern border. He views these attacks as opportunities to push his plans forward, regardless of the fear it stirs in the American public.\n\nHis comments towards Islam and terror, for instance, dominate the news cycle and hinder leaders like Khan from effectively responding to the attacks. All while continuing to play into his favor on the domestic side as he hopes the Supreme Court will uphold his “travel ban.”\n\nThis is not the first time that Trump has tied politics and terrorism. On a more domestic level, Trump has said he will cut federal funding to “sanctuary cities.” One of the largest of these is New York City, which currently receives $190 million in funding from Homeland Security. NYPD Commissioner James O’Neill has called the funding “the backbone of our entire counterterrorism apparatus.” By threating to remove funding over a difference of ideology, Trump is at risk of putting all of New York City at risk of a terror attack.\n\nAs Trump’s recent international trip has shown, he is determined to forge stronger relationships with Israel, Saudi Arabia, and Egypt – partnerships that will be critical to addressing the threat of terror both here at home and abroad. Relationships with our European allies – specifically our NATO partners – remain somewhat fragile, though clearly working cohesively with all our allies to drive out extremism globally is the best path forward.\n\nYet Trump continues his strategy of belittling and punishing those who disagree with him. He continues to target groups as a whole for the nation’s problems and attempts to scapegoat the Islamic community for the global terror threat. This is the type of behavior that will only continue to radicalize fringe groups and will not bring us anywhere closer to a safer world.\n\nDouglas E. Schoen is a Fox News contributor. He has more than 30 years experience as a pollster and political consultant. His new book is \"Putin's Master Plan\". Follow him on Twitter @DouglasESchoen.", "authors": ["Douglas Schoen"], "publish_date": "2017-06-06", "source": "foxnews", "top_words": ["travel", "tweets", "safer", "trump", "security", "support", "twitter", "making", "funding", "trumps", "terror", "attacks", "attack"], "summary": "President Trump’s response to the terror attack in London this past weekend did more to politicize the issue than respond to terror in a firm, unifying, and proactive way.\n“We must stop being politically correct and get down to the business of security for our people,” Trump tweeted.\nHis comments towards Islam and terror, for instance, dominate the news cycle and hinder leaders like Khan from effectively responding to the attacks.\nHe continues to target groups as a whole for the nation’s problems and attempts to scapegoat the Islamic community for the global terror threat.\nThis is the type of behavior that will only continue to radicalize fringe groups and will not bring us anywhere closer to a safer world."}