{"url": "http://www.foxnews.com/us/2017/03/10/democratic-ags-mount-fight-against-trump-travel-ban.html", "id": "330", "title": "Democratic AGs mount fight against Trump travel ban", "text": "In stepping up legal challenges to President Donald Trump's revised travel ban, Democratic attorneys general are trying to use the court system to thwart the executive branch in the same way their GOP counterparts did under President Barack Obama.\n\nWashington state Attorney General Bob Ferguson said Thursday he was asking a federal judge to find that his order last month halting the old travel ban applies to the new one, too.\n\nFerguson's action came a day after Hawaii launched its own lawsuit. Washington, Minnesota, Oregon, New York and Massachusetts planned to file a new complaint challenging the revised travel ban Monday.\n\n\"My message to President Trump is: Not so fast,\" Ferguson said.\n\nFerguson and his fellow Democratic attorneys general are now doing what Republicans did when Obama was in office — filing lawsuits to block policies. Republican attorneys general took Obama to court over a variety of issues, most notably his health care legislation.\n\nAttorneys general are the chief lawyers for state governments and can sue more broadly on behalf of their states. Most are elected and can act independently of their legislatures or governors, although Ferguson, for example, has the support of Washington Gov. Jay Inslee, also a Democrat.\n\nTrump's revised ban bars new visas for people from six predominantly Muslim countries: Somalia, Iran, Syria, Sudan, Libya and Yemen. It also temporarily shuts down the U.S. refugee program.\n\nUnlike the initial order, the new one says current visa holders won't be affected, and removes language that would give priority to religious minorities.\n\nHawaii Attorney General Doug Chin said that the state could not stay silent on Trump's travel ban because of Hawaii's unique culture and history. Hawaii depends heavily on tourism, and the revised ban would hurt the state's economy, he said.\n\nThe courts need to hear \"that there's a state where ethnic diversity is the norm, where people are welcomed with aloha and respect,\" Chin said.\n\nIn the original lawsuit targeting the first ban, Ferguson said it was unconstitutional and hurt the state's businesses and universities.\n\nFerguson said it's not the government, but the court, that gets to decide whether the revised order is different enough that it would not be covered by previous temporary restraining order.\n\nWhite House spokesman Sean Spicer said Thursday the administration believed the revised travel ban will stand up to legal scrutiny.\n\n\"We feel very confident with how that was crafted and the input that was given,\" Spicer said.\n\nFerguson said he was pleased other that attorneys general had sought to take part in the legal action. On Thursday, the Seattle judge granted Oregon's request to join Washington and Minnesota in the case opposing the travel ban; New York and Massachusetts say they'll also join the case.\n\n\"We have a strong case and they are willing to join our efforts,\" Ferguson said of his fellow Democrats. New York Attorney General Eric Schneiderman in a statement called the executive order \"a Muslim ban by another name.\"\n\nOther states that have filed briefs supporting Washington's initial lawsuit include California, Connecticut, Delaware, Illinois, Iowa, Maine, Maryland, New Mexico, Pennsylvania, Rhode Island, Vermont and Virginia.\n\n___\n\nSinco Kelleher reported from Honolulu. Associated Press writers Tarek Hamada in Phoenix and Gene Johnson in Seattle contributed to this report.", "authors": [], "publish_date": "2017-03-10", "source": "foxnews", "top_words": ["travel", "trump", "revised", "fight", "ban", "state", "ags", "democratic", "mount", "order", "attorneys", "general", "ferguson", "states", "york"], "summary": "Washington, Minnesota, Oregon, New York and Massachusetts planned to file a new complaint challenging the revised travel ban Monday.\nRepublican attorneys general took Obama to court over a variety of issues, most notably his health care legislation.\nTrump's revised ban bars new visas for people from six predominantly Muslim countries: Somalia, Iran, Syria, Sudan, Libya and Yemen.\nIn the original lawsuit targeting the first ban, Ferguson said it was unconstitutional and hurt the state's businesses and universities.\nWhite House spokesman Sean Spicer said Thursday the administration believed the revised travel ban will stand up to legal scrutiny."}