{"url": "http://www.foxnews.com/opinion/2017/06/26/dershowitz-supreme-court-will-likely-uphold-most-trump-travel-ban.html", "id": "35", "title": "Dershowitz: Supreme Court will likely uphold most of Trump travel ban", "text": "The Supreme Court’s decision to hear arguments in October regarding President Trump’s second travel ban may not itself tell us much about the likely outcome of the case. But the high court’s decision to allow parts of the ban to go forward now – even before hearing the arguments—strongly suggests that there are a majority of justices who will uphold the most important parts of the ban.\n\nThe Supreme Court decided to permit enforcement of the ban “with respect to foreign nationals who lack any bona fide relations with a person or entity in the United States.”\n\nThe Justices thus drew the distinction I have been urging since the president issued his initial ban. In a series of columns and TV appearances, I urged the president to withdraw the first ban and substitute a version that excludes only individuals who do not have a green card or other connections to the United States. The Constitution accords very different protections to U.S. persons --including green card holders -- than to individuals with no legal status in the United States. The example I gave was of a man from Yemen who had never visited this country and has no connection to it, but would like to take a trip to Disneyland. Such a person has no constitutional right to come into our country and he can be excluded for virtually any reason.\n\nThis does not mean that the courts would uphold a ban that expressly discriminates against Catholics, Jews, or Muslims. But a ban that applies to countries that have a serious problem vetting potential terrorists would be valid even if all of those countries had Muslim majorities. The president has a right to focus on Islamic terrorism as a primary source of danger to Americans, and Islamic terrorism comes disproportionately from Muslim majority countries.\n\nWhen Willie Sutton was asked “Why do you rob banks?” his answer was “Because that’s where the money is.” Of course, not all the money is kept in banks, and not all terrorists come from Muslim majority countries. But the president has wide authority to pick and choose among countries. Moreover, the countries selected by President Trump were all previously selected by President Obama for a related purpose.\n\nIt is impossible to know whether this will have any positive effect on reducing terrorist attacks in the U.S. But under our law, the president has no burden to prove that he is right as a matter of policy – only that he had the authority to make the decision.\n\nPresident Trump recently announced that he regretted substituting the second executive order for the first one, calling the second one a politically correct watered down version. The Supreme Court’s decision shows that he was wrong, and that I was right in urging the administration to make the substitution. It also shows that many of the pundits, including lawyers and law professors, were wrong when they predicted that the entire ban would be found unconstitutional. These good and decent people tend to substitute wishful thinking for hard constitutional analysis. But as Justice Oliver Wendell Holmes, Jr. once put it: The job of the lawyer is to predict what the courts will do in fact.\n\nBut it is always difficult to predict how the justices will divide over a contentious issue such as the travel ban. The lower courts relied heavily on what Donald Trump had said as a candidate with regard to banning Muslims from entering. The Court’s decision to allow part of the ban to go forward suggests that Trump’s statements will not be accorded the same weight by the Supreme Court that they were accorded by the lower courts. The high court will recognize the implications of striking an otherwise legitimate ban because of what a president said when he was a candidate. To follow the lower court reasoning, the very same ban could be constitutional if issued by one president and unconstitutional if issued by another. That is not the way the law generally operates in this country.\n\nSo the travel ban will now go into effect with regard to non-American persons. It is impossible to know whether this will have any positive effect on reducing terrorist attacks in the U.S. But under our law, the president has no burden to prove that he is right as a matter of policy – only that he had the authority to make the decision.\n\nThe Court is likely to find that he had that authority. There are parts of the travel ban that may face some criticism from the justices. But it is likely that the core of the ban will be upheld.\n\nThe president should not take this as a sign that he was correct in wanting to reissue the initial ban. The Supreme Court has signaled that at least parts of the initial ban would raise serious Constitutional issues.\n\nNotwithstanding these early signs, it is still impossible to predict with certainty what the Supreme Court will do after hearing arguments in October. We cannot even be certain of the composition of the Supreme Court in light of persistent rumors regarding resignations. But right now, if I had to bet widows and orphans money on the outcome of the case, I would bet that the high court would uphold those parts of the travel ban that applies to persons with no connection to the United States.\n\nAlan M. Dershowitz is Felix Frankfurter Professor of Law, Emeritus, at Harvard Law School and author of, \"Trumped Up! How Criminalization of Political Differences Endangers Democracy,\" which is now available. Follow Alan Dershowitz on Twitter: @AlanDersh Facebook: @AlanMDershowitz.", "authors": ["Alan Dershowitz"], "publish_date": "2017-06-26", "source": "foxnews", "top_words": ["parts", "likely", "travel", "dershowitz", "courts", "trump", "uphold", "ban", "supreme", "right", "court", "countries", "president", "law"], "summary": "The Supreme Court’s decision to hear arguments in October regarding President Trump’s second travel ban may not itself tell us much about the likely outcome of the case.\nBut it is always difficult to predict how the justices will divide over a contentious issue such as the travel ban.\nSo the travel ban will now go into effect with regard to non-American persons.\nNotwithstanding these early signs, it is still impossible to predict with certainty what the Supreme Court will do after hearing arguments in October.\nWe cannot even be certain of the composition of the Supreme Court in light of persistent rumors regarding resignations."}