{"url": "http://www.foxnews.com/us/2017/03/10/travel-ban-challenge-puts-hawaii-few-muslims-in-spotlight.html", "id": "332", "title": "Travel ban challenge puts Hawaii's few Muslims in spotlight", "text": "Hawaii has 5,000 or so Muslims — less than 1 percent of the state's population — who are finding themselves thrust into an international spotlight after the state's top lawyer launched a challenge to President Donald Trump's revised travel ban, saying it contradicts the islands' welcoming culture that values diversity.\n\nNamed as a plaintiff in the federal lawsuit fighting the ban is Ismail Elshikh, the imam of the island of Oahu's only mosque — a converted plantation-style house in a hilly Honolulu neighborhood a few miles from Waikiki beach where Muslims who gather in the prayer room know they're facing Mecca when the view of iconic Diamond Head is at their backs.\n\nElshikh's mother-in-law is a Syrian living in Syria who won't be able to visit her relatives in Hawaii because of the ban, and that will deprive the rights of Elshikh, his wife and their children as U.S. citizens, said Hawaii Attorney General Doug Chin.\n\nIt was difficult for the shy and reserved Elshikh to make the decision to join the lawsuit and he is not speaking publicly because of legal reasons and fears for his security in a state that has seen a rise in threats to Muslims that started just before Trump was elected, said Hakim Ouansafi, who is the president of the Muslim Association of Hawaii.\n\n\"It took some thinking. It took some convincing,\" Ouansafi said.\n\nChin said the small size of Hawaii's Muslim community had no bearing on his decision to challenge the travel ban because \"they are part of our community. They should not be labeled presumptively as terrorists.\"\n\nAlso, the lawsuit is a way to protect a minority community in state familiar with the wrongs committed when Japanese Americans were sent to internment camps during World War II, Chin said. \"And we should speak for them in ways that people did not speak for the Japanese back in the 1940s when everything was happening,\" he said.\n\nThe first Muslims in Hawaii can be traced back to the 1800s, Ouansafi said. Today, Hawaii's Muslims have ties to 46 countries, including Asian and Arab countries. About 30 percent are American-born who converted to Islam, he said. And about 80 of Hawaii's Muslim families are originally from the six countries named in the revised travel ban.\n\n\"It's beautiful mix,\" Ouansafi said. \"It's the melting pot. It's the true definition of Hawaii — except it's a smaller community.\"\n\nYoussef Dakroub, born and raised in Lebanon, met his wife who is from Hawaii in Dubai. They moved to Oahu in 2006, where he now owns a Moroccan and Lebanese food restaurant in downtown Honolulu.\n\nDakroub, who describes himself as Muslim but not religious, said the lawsuit challenging the travel ban reinforced his belief that Hawaii is the right place for him to live.\n\n\"Hawaii is home,\" he said.\n\nOuansafi, who is from Morocco and is the executive director of the Hawaii Public Housing Authority, said he considers Hawaii the most inclusive and safest place for minorities to live in the U.S. But he is troubled by the recent spate of hate threats directed at Muslims.\n\nThe threats started before the election and increased when Trump became president, prompting the association to install security cameras, he said.\n\nOn Jan. 27, a man followed two Muslim children getting off a city bus and harassed them, Ouansafi said. A spokeswoman for the Honolulu Police Department said a harassment case was opened and an investigation is ongoing.\n\nAbout two weeks ago, the mosque recorded an anonymous caller yelling: \"Killing Muslims is God's will.\"\n\nHawaii's lawsuit also argues that the travel ban will hurt the economy of a state that depends on a constant stream of visitors from all corners of the world.\n\nThe Honolulu mosque is already seeing the impact, Ouansafi said.\n\nBefore Trump's election, the popular Friday afternoon prayer service used to see many Muslim tourists show to join local residents in prayer.\n\nThe numbers of praying tourists have since declined and some Muslims who are not from countries covered by the ban don't want to travel to Hawaii anymore, Ouansafi said.\n\n\"They can take their money and take it elsewhere,\" he said. \"We have princes and we have rulers from Muslim countries that do come. They don't want to be stuck at the airport. They don't want to be insulted in the street.\"", "authors": [], "publish_date": "2017-03-10", "source": "foxnews", "top_words": ["ouansafi", "travel", "hawaii", "spotlight", "ban", "puts", "challenge", "state", "hawaiis", "threats", "countries", "lawsuit", "muslim", "muslims"], "summary": "Chin said the small size of Hawaii's Muslim community had no bearing on his decision to challenge the travel ban because \"they are part of our community.\nAnd about 80 of Hawaii's Muslim families are originally from the six countries named in the revised travel ban.\nHawaii's lawsuit also argues that the travel ban will hurt the economy of a state that depends on a constant stream of visitors from all corners of the world.\nThe numbers of praying tourists have since declined and some Muslims who are not from countries covered by the ban don't want to travel to Hawaii anymore, Ouansafi said.\n\"We have princes and we have rulers from Muslim countries that do come."}