{"url": "http://www.foxnews.com/us/2017/06/01/trump-asks-supreme-court-to-reinstate-travel-ban.html", "id": "395", "title": "Trump asks Supreme Court to reinstate travel ban", "text": "The Trump administration has asked the Supreme Court to immediately reinstate its ban on travelers from six mostly Muslim countries and refugees from anywhere in the world, saying the U.S. will be safer if the policy is put in place.\n\nThe Justice Department filing to the high court late Thursday argued that lower courts that blocked the Trump policy made several mistakes, including relying on statements President Donald Trump made during the 2016 campaign.\n\nThe legal fight pits the president's significant authority over immigration against what lower courts have said is a policy that purported to be about national security but was intended to target Muslims.\n\nThe Justice Department is \"confident that President Trump's executive order is well within his lawful authority to keep the nation safe and protect our communities from terrorism,\" spokeswoman Sarah Isgur Flores said. \"The president is not required to admit people from countries that sponsor or shelter terrorism, until he determines that they can be properly vetted and do not pose a security risk to the United States.\"\n\nRights groups that have been fighting the policy in the courts said the justices should not allow the travel and refugee bans to take effect.\n\n\"Again and again, our nation's courts have found that President Trump's Muslim ban is unconstitutional. We will continue to defend our plaintiffs' right to live free from fear of discriminatory treatment by the federal government,\" said Karen Tumlin, legal director of the National Immigration Law Center.\n\nImmigration officials would have 90 days to decide what changes are necessary before people from Iran, Libya, Somalia, Sudan, Syria and Yemen may resume applying for visas. The U.S. refugee program would be halted for 120 days.\n\nIt takes a majority of the court, at least five justices, to put the policy into effect.\n\nThe 4th U.S. Circuit Court of Appeals called the national security concerns an after-the-fact justification for a policy that was \"rooted in religious animus and intended to bar Muslims from this country.\" The appeals court ruled against reinstating the travel policy by a 10-3 vote last week.\n\nA federal judge in Hawaii also blocked the temporary ban on refugees, and that issue is now being considered by the 9th U.S. Circuit Court of Appeals.\n\nTrump signed his first executive order on travel a week after he took office in January. It applied to travelers from the six countries as well as Iraq and took effect immediately, causing chaos and panic at airports as the Homeland Security Department scrambled to figure out who the order covered and how it was to be implemented.\n\nA federal judge blocked it eight days later, an order that was upheld by a 9th Circuit panel. Rather than pursue an appeal, the administration said it would revise the policy.\n\nIn March, Trump issued a narrower order, but federal courts that have examined it so far have blocked it as well.\n\nThursday's filing reflects many of the same arguments that administration lawyers have made in the lower courts. The filing asserts that the court \"should not consider campaign-trail comments\" and that \"virtually all of the president's statements on which the court of appeals relied were made before he assumed office\" and before he took an oath to defend the Constitution. \"Taking that oath marks a profound transition from private life to the nation's highest public office, and manifests the singular responsibility and independent authority to protect the welfare of the nation that the Constitution reposes in the president,\" it reads.\n\nThe administration is asking for quick action from the high court that would freeze the lower court rulings and allow the policy to be put in place. Both sides would file their legal arguments about whether the policy violates the Constitution or federal law over the summer and the justices could hear argument as early as the fall, under the schedule proposed by the administration Thursday.\n\nThe Supreme Court is almost certain to step into the case because it almost always has the final say when a lower court strikes down a federal law or presidential action.\n\nBut the initial vote on whether to let the travel ban take effect, even as the court weighs the case, would signal whether the government is likely to win in the end. If at least five justices vote to let the travel ban take effect, there's a good chance they also would uphold the policy later on.\n\nThe temporary nature of the bans means they could well have run their course by the time the case is ready to be argued, unless the court were to schedule an unusual special argument session.", "authors": ["Mark Sherman", "Sadie Gurman"], "publish_date": "2017-06-01", "source": "foxnews", "top_words": ["travel", "administration", "courts", "trump", "lower", "ban", "supreme", "asks", "court", "reinstate", "federal", "order", "president", "policy"], "summary": "The appeals court ruled against reinstating the travel policy by a 10-3 vote last week.\nIn March, Trump issued a narrower order, but federal courts that have examined it so far have blocked it as well.\nThe Supreme Court is almost certain to step into the case because it almost always has the final say when a lower court strikes down a federal law or presidential action.\nBut the initial vote on whether to let the travel ban take effect, even as the court weighs the case, would signal whether the government is likely to win in the end.\nIf at least five justices vote to let the travel ban take effect, there's a good chance they also would uphold the policy later on."}