{"url": "http://www.foxnews.com/us/2017/03/19/latest-judge-rejects-request-to-clarify-travel-order.html", "id": "347", "title": "The Latest: Judge rejects request to clarify travel order", "text": "The Latest on a lawsuit filed in Hawaii over the Trump administration's revised travel ban (all times local):\n\n11:05 a.m.\n\nA federal judge has rejected the Justice Department's request for clarification on his temporary order blocking President Donald Trump's revised travel ban.\n\nU.S. District Judge Derrick Watson said in court records Sunday that there's nothing unclear about his order and the federal government can't ask for a distinction that officials failed to make in earlier briefs and arguments.\n\nThe Justice Department had asked Watson to clarify that his temporary restraining order only applied to the ban on travel from six mostly Muslim countries and not a global freeze on refugees entering the United States.\n\nWatson issued the order in response to a lawsuit filed by the state of Hawaii, concluding there was \"significant and unrebutted evidence of religious animus\" behind the travel ban.\n\n___\n\n8 a.m.\n\nHawaii is opposing a request for a judge to clarify his order blocking President Donald Trump's revised travel ban, saying the federal government can't try to change a ruling already issued by the court.\n\nIn court papers filed Saturday, the state asks for a longer-lasting preliminary injunction to cover the Wednesday order by U.S. District Judge Derrick Watson or expedited briefings on whether the injunction should be issued.\n\nIt comes after the Justice Department asked Watson to clarify that his temporary order only applies to the ban on travel from six mostly Muslim countries and not a global freeze on refugees entering the United States.\n\nWatson concluded there was \"significant and unrebutted evidence of religious animus\" behind the travel ban.\n\nTrump has indicated the ruling will be appealed.", "authors": [], "publish_date": "2017-03-19", "source": "foxnews", "top_words": ["watson", "travel", "revised", "ban", "judge", "filed", "rejects", "federal", "clarify", "justice", "order", "temporary", "request", "latest"], "summary": "The Latest on a lawsuit filed in Hawaii over the Trump administration's revised travel ban (all times local):11:05 a.m.A federal judge has rejected the Justice Department's request for clarification on his temporary order blocking President Donald Trump's revised travel ban.\nWatson issued the order in response to a lawsuit filed by the state of Hawaii, concluding there was \"significant and unrebutted evidence of religious animus\" behind the travel ban.\n___8 a.m.Hawaii is opposing a request for a judge to clarify his order blocking President Donald Trump's revised travel ban, saying the federal government can't try to change a ruling already issued by the court.\nIt comes after the Justice Department asked Watson to clarify that his temporary order only applies to the ban on travel from six mostly Muslim countries and not a global freeze on refugees entering the United States.\nWatson concluded there was \"significant and unrebutted evidence of religious animus\" behind the travel ban."}