{"url": "http://www.foxnews.com/us/2017/04/21/judge-seems-reluctant-to-issue-another-travel-ban-injunction.html", "id": "366", "title": "Judge seems reluctant to issue another travel ban injunction", "text": "A federal judge on Friday seemed reluctant to issue another nationwide injunction against President Donald Trump's revised travel ban, saying two courts already have halted the bid to stop immigration from six predominantly Muslim counties.\n\nU.S. District Judge Tanya Chutkan said at a hearing in the nation's capital that blocking the executive order might be an \"academic exercise\" given similar rulings from courts in Hawaii and Maryland.\n\nChutkan heard arguments from Iranian-American and Muslim groups that say Iranians have faced unusual delays and disruptions in visa processing even while the ban is on hold. They want a more sweeping injunction than those imposed by other courts, one that seeks in part to resume the normal visa application process.\n\nBut Chutkan expressed concern that ordering consular officials to issue visas \"would take the court into areas where the court is not supposed to act.\"\n\nJustice Department lawyers disputed the challengers' claims and said the court should not second-guess the president's foreign policy decisions.\n\nAfter a two-hour hearing, Chutkan asked both sides for additional briefing on the practical implications of ruling in the case.\n\nThe organizations challenging the ban include the Pars Equality Center, the Iranian American Bar Association, the National Iranian American Council and the Public Affairs Alliance of Iranian Americans. The lawsuit includes more than a dozen people who claim the order is harming students, interfering with business travel and separating couples and families.\n\nThe case is unusual because Chutkan earlier this week allowed witnesses to testify in court about the effects of the travel ban, the first time a judge has permitted live testimony in a case challenging the order.\n\nRepresenting the Iranian-American groups, lawyer Cyrus Mehri said no other court in the country has the \"robust record\" that shows the harm caused by the ban.\n\n\"We've had ongoing harm of visas being cancelled and they're still not being reinstituted,\" Mehri said.\n\nFederal judges in Maryland and Hawaii last month blocked the vast majority of the ban, which would restrict immigration of people from six predominantly Muslim countries — Iran, Libya, Somalia, Sudan, Syria and Yemen. The Trump administration is appealing both rulings.\n\nThe revised travel ban issued in March is narrower than an earlier one from January that was blocked by a federal judge in Washington state. It temporarily bars new visas for citizens of the six countries and suspends the U.S. refugee program for 120 days.\n\nActing Assistant Attorney General Chad Readler argued that the ban targets countries, not religious groups, and said the court should not undermine the president's power to protect national security.\n\n\"It's not a dispute with the Iranian people, it's a problem with the Iranian government,\" Readler said.\n\nBut Chutkan said those arguments are undercut by comments Trump and his advisers made during the election campaign and after indicating a desire to focus on Muslims.\n\nAny decision in the Washington, D.C., case to block the travel ban would take effect only if the other two orders were reversed. But it also could be broader if it covers part of the order affecting visa procedures.\n\nChutkan suggested the portion relating to the visa process seems to rely on other sections already halted by another court.\n\nJustice Department lawyer Daniel Schwei said there was no evidence to suggest visa delays for some Iranians had anything to do with the travel ban. He warned the court against issuing an order that would amount to \"global micromanagement of the State Department's consular posts and offices.\"", "authors": [], "publish_date": "2017-04-21", "source": "foxnews", "top_words": ["travel", "reluctant", "ban", "visas", "judge", "court", "chutkan", "iranian", "order", "issue", "muslim", "visa", "injunction"], "summary": "A federal judge on Friday seemed reluctant to issue another nationwide injunction against President Donald Trump's revised travel ban, saying two courts already have halted the bid to stop immigration from six predominantly Muslim counties.\nBut Chutkan expressed concern that ordering consular officials to issue visas \"would take the court into areas where the court is not supposed to act.\"\nThe revised travel ban issued in March is narrower than an earlier one from January that was blocked by a federal judge in Washington state.\nAny decision in the Washington, D.C., case to block the travel ban would take effect only if the other two orders were reversed.\nJustice Department lawyer Daniel Schwei said there was no evidence to suggest visa delays for some Iranians had anything to do with the travel ban."}