{"url": "http://www.foxnews.com/opinion/2017/06/05/gregg-jarrett-justice-ginsburg-must-disqualify-herself-in-trump-travel-ban-case.html", "id": "32", "title": "Gregg Jarrett: Justice Ginsburg must disqualify herself in the Trump travel ban case", "text": "Oliver Wendell Holmes once wrote that a judge should extinguish all politics in public comments when elevated to the Bench.\n\nBecause Justice Ruth Bader Ginsburg failed to heed those words, she should disqualify herself from the U.S. Supreme Court’s review of President Trump’s revised travel ban.\n\nIn a series of interviews last July, she leveled disparaging comments about then-candidate Trump that were stunning and unprecedented for a sitting high court justice.\n\nIn interviews with the Associated Press and the New York Times she remarked, “I can’t imagine what the country would be with Donald Trump as our president. For the country, it could be four years. For the court, it could be –I don’t even want to contemplate that.” Then she added that her husband would have declared, “Now it’s time for us to move to New Zealand.”\n\nDays later, in a CNN interview, she said of candidate Trump, “He is a faker. He has no consistency about him. He says whatever comes into his head at the moment. He really has an ego. How has he gotten away with not turning over his tax returns?”\n\nThose words reflect a clear bias, if not personal animus, toward the man who would go on to become president. Her public comments were not only injudicious, but reckless – especially given that Trump was about to win the Republican nomination days later and stood a chance of becoming the next president.\n\nEvery justice knows that legal disputes involving the president and his decisions or orders will inevitably make their way to the Supreme Court.\n\nThe Federal Statute\n\nThe rules demanding disqualification are set forth very clearly by federal statute, 28 USC 455:\n\nAny justice…shall disqualify himself in any proceeding in which his impartiality might reasonably be questioned. He shall also disqualify himself…where he has a personal bias or prejudice concerning a party.”\n\nThe law’s application to the case at hand is straight forward. Is there any doubt that Ginsburg’s comments demonstrate a personal bias or prejudice against President Trump? Indeed, they show an outright hostility.\n\nHow can she possibly be fair or, equally important, be perceived by the public as fair? She cannot. The appearance of partiality is just as damning to the fair administration of justice as any genuine personal bias.\n\nMoreover, the language of the statute is mandatory: “Any Justice shall disqualify” him or herself. Ginsburg has no choice but to step aside from the case. Harvard Law professor Alan Dershowitz has taken it further to say she should recuse herself from all court cases involving President Trump.\n\nWould Recusal Impact The Case?\n\nWithout Ginsburg, the Supreme Court would be left with three so-called “liberal” justices versus four “conservatives.” But the more moderate Anthony Kennedy is sometimes the “swing” justice, so there is no telling how he might cast his vote. If he were to side with the liberal faction, the result would be a 4-4 tie. That would leave in place the lower court’s decision striking down the ban, although the issues are still being litigated in the appellate courts.\n\nHowever, there is ample reason to uphold the ban. The Supreme Court has never relied on campaign rhetoric in deciding a case, as the lower courts did. Why? Because it is beyond the authority of judges. Their duty is to examine what is in the executive order itself and determine whether it violates the Constitution.\n\nCampaign rhetoric is subject to change depending on how the political winds blow. Candidates routinely alter their positions or even reverse their policies during the course of an election. Such rhetoric is no more reliable than the weather.\n\nThe order itself states valid reasons for the ban. The six identified countries do nothing to assist the U.S. to screen or verify the background of applicants, and those nations pose serious terror threats that jeopardize U.S. national security.\n\nIt is hard to argue that President Trump’s true purpose is to discriminate against Muslims. Of the top ten countries with the largest Muslim populations, only one country, Iran, is on the banned list.\n\nIf Americans are to have confidence that their nation’s highest justices adhere to the highest standards, then ethics cannot be something of mere “convenience.” Judicial integrity must have meaning and certitude. Decisions must be free of doubt that cases are heard fairly and impartially. Antipathy toward a party is an unconscionable breach.\n\nThe noble traditions of the Supreme Court will be compromised should Ruth Bader Ginsburg decide she is above the law and beyond the scruples it demands.\n\nGregg Jarrett joined FOX News Channel (FNC) in 2002 and is based in New York. He currently serves as legal analyst and offers commentary across both FNC and FOX Business Network (FBN).\n\n", "authors": ["Gregg Jarrett"], "publish_date": "2017-06-05", "source": "foxnews", "top_words": ["travel", "ginsburg", "case", "trump", "ban", "supreme", "comments", "rhetoric", "court", "personal", "jarrett", "disqualify", "justice", "president", "gregg"], "summary": "Because Justice Ruth Bader Ginsburg failed to heed those words, she should disqualify herself from the U.S. Supreme Court’s review of President Trump’s revised travel ban.\nIn a series of interviews last July, she leveled disparaging comments about then-candidate Trump that were stunning and unprecedented for a sitting high court justice.\nIs there any doubt that Ginsburg’s comments demonstrate a personal bias or prejudice against President Trump?\nHarvard Law professor Alan Dershowitz has taken it further to say she should recuse herself from all court cases involving President Trump.\nThe Supreme Court has never relied on campaign rhetoric in deciding a case, as the lower courts did."}