{"url": "http://www.foxnews.com/us/2017/03/16/excerpts-travel-ban-rulings-by-hawaii-maryland-judges.html", "id": "339", "title": "Excerpts of travel ban rulings by Hawaii, Maryland judges", "text": "Judges on opposite sides of the U.S. have ruled against President Donald Trump's revised travel ban, temporarily blocking it from taking effect as scheduled Thursday. Here are some key excerpts from the decisions in Hawaii and Maryland :\n\n___\n\nHAWAII RULING: MUSLIM DISCRIMINATION\n\nU.S. District Judge Derrick Watson blocked the executive order that suspends new visas for people from six predominantly Muslim countries and halts the U.S. refugee program. He agreed with Hawaii that the travel ban amounts to discrimination based on nationality and religion.\n\nThe Justice Department argued the executive order is about national security and is religiously neutral because the six countries represent a small fraction of the world's 50 Muslim-majority nations.\n\n\"The illogic of the government's contentious is palpable,\" Watson's wrote. \"The notion that one can demonstrate animus toward any group of people only by targeting all of them at once is fundamentally flawed.\"\n\nEqually flawed, he wrote, was the notion that the ban didn't target Islam because it applies to all individuals in Somalia, Iran, Iraq, Syria, Sudan, Libya and Yemen.\n\n\"It is undisputed ... that these six countries have overwhelmingly Muslim populations. ... It would therefore be no paradigmatic leap to conclude that targeting these countries likewise targets Islam,\" he wrote.\n\n___\n\nHAWAII RULING: HARM TO IMAM\n\nIsmail Elshikh of Honolulu joined the lawsuit, saying it would prevent his Syrian mother-in-law from visiting.\n\nJustice Department lawyers said the order hasn't hurt Elshikh because his mother-in-law had not yet completed the visa process and had not been denied entry. Watson soundly rejected that argument.\n\n\"These alleged injuries have already occurred and will continue to occur once the executive order is implemented and enforced — the injuries are not contingent ones,\" he wrote.\n\n\"Dr. Elshikh is likely to suffer irreparable injury in the absence of a TRO (temporary restraining order),\" he later added.\n\n___\n\nHAWAII RULING: GOVERNMENT MOTIVATION\n\nWatson also rejected the government's argument that the courts shouldn't look into the \"veiled psyche\" and \"secret motives\" of federal decision makers.\n\n\"The government need not fear,\" Watson wrote. \"The remarkable facts at issue here require no such impermissible injury. For instance, there is nothing 'veiled' about this press release: 'Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States.'\"\n\n___\n\nMARYLAND RULING: TRUMP'S STATEMENTS\n\nU.S. District Judge Theodore Chuang found evidence from statements by Trump and his advisers that the order was aimed at certain countries to try to ban Muslims without explicitly mentioning the Islamic faith.\n\nThe administration said the ban intended to protect the United States from terrorism.\n\n\"Significantly, the record also includes specific statements directly establishing that Trump intended to effectuate a partial Muslim ban by banning entry by citizens of specific predominantly Muslim countries deemed to be dangerous, as a means to avoid, for political reasons, an action explicitly directed at Muslims,\" the judge wrote.\n\nCiting comments by Trump on \"Meet the Press,\" Chuang said, \"When questioned whether his new formulation was a 'rollback' of his call for a 'Muslim ban,' he described it as an 'expansion' and explained that 'people were so upset when I used the word Muslim,' so he was instead 'talking territory instead of Muslim.'\"\n\n___\n\nMARYLAND RULING: NATIONAL SECURITY\n\nChuang also concluded that while the ban might have a legitimate national-security purpose, that was secondary to its primary objective of keeping Muslims out of the U.S.\n\n\"Significantly, during the time period since the Reagan administration, which includes the immediate aftermath of September 11, 2001, there have been no instances in which the President has invoked his authority ... to issue a ban on the entry into the United States of all citizens from more than one country at the same time, much less six nations all at once,\" the judge wrote. \"In the two instances in which nationals from a single country were temporarily stopped, there was an articulable triggering event that warranted such action.\"\n\n___\n\nMARYLAND RULING: GOVERNMENT HARM\n\nFinally, Chuang concluded that the government had not shown how it would be harmed if the ban were stopped from taking effect.\n\n\"Defendants, however, have not shown, or even asserted, that national security cannot be maintained without an unprecedented six-country travel ban, a measure that has not been deemed necessary at any other time in recent history. Thus, the balance of the equities and the public interest favor the issuance of an injunction,\" he wrote.\n\n___\n\nNuckols reported from Greenbelt, Maryland.", "authors": [], "publish_date": "2017-03-16", "source": "foxnews", "top_words": ["ruling", "travel", "rulings", "hawaii", "judges", "excerpts", "ban", "wrote", "trump", "maryland", "judge", "countries", "order", "muslim", "muslims", "watson"], "summary": "Judges on opposite sides of the U.S. have ruled against President Donald Trump's revised travel ban, temporarily blocking it from taking effect as scheduled Thursday.\nHere are some key excerpts from the decisions in Hawaii and Maryland :___HAWAII RULING: MUSLIM DISCRIMINATIONU.S. District Judge Derrick Watson blocked the executive order that suspends new visas for people from six predominantly Muslim countries and halts the U.S. refugee program.\nHe agreed with Hawaii that the travel ban amounts to discrimination based on nationality and religion.\n___HAWAII RULING: HARM TO IMAMIsmail Elshikh of Honolulu joined the lawsuit, saying it would prevent his Syrian mother-in-law from visiting.\n\"The government need not fear,\" Watson wrote."}