{"url": "http://www.foxnews.com/us/2017/03/27/13-states-urge-appeals-court-to-ok-trump-travel-ban.html", "id": "352", "title": "13 states urge appeals court to OK Trump travel ban", "text": "A group of 12 state attorneys general and one governor is backing President Donald Trump's revised travel ban targeting six predominantly Muslim countries, telling a federal appeals court Monday that the Republican acted lawfully in the interest of national security.\n\nThe states are urging the 4th U.S. Circuit Court of Appeals to overturn a lower court judge's ruling that blocked part of the president's revised executive order. The states say the administration's action is not a \"pretext for religious discrimination\" and does not violate the constitution.\n\n\"The Executive Order's temporary pause in entry by nationals from six countries and in the refugee program neither mentions any religion nor depends on whether affected aliens are Muslim,\" the states write in the brief with the Richmond, Virginia-based court. \"Thus, the Executive Order is emphatically not a 'Muslim Ban.'\"\n\nThe states are Alabama, Arizona, Arkansas, Florida, Kansas, Louisiana, Montana, Oklahoma, South Carolina, South Dakota, Texas and West Virginia. Gov. Phil Bryant of Mississippi also joined.\n\nThe appeal stems from a ruling from a federal judge in Maryland earlier this month. That ruling and a separate one in Hawaii were victories for civil liberties groups and advocates for immigrants and refugees, who argued that Trump's temporary ban on travel from six predominantly Muslim countries violated the Constitution.\n\nThe Trump administration argued that the revised executive order, which includes a temporary ban on refugees and a cap on the number of refugees who can enter the country, was intended to protect the United States from terrorism. Citizens from Iran, Libya, Somalia, Sudan, Syria and Yemen are temporarily barred from entering the country under the order, though there are exceptions.\n\nThe 4th Circuit has set oral arguments in the Maryland case for May 8.\n\nThe administration urged the court in a brief also filed Monday to put the lower court ruling on hold and let the executive order take effect while its appeal is pending. Lawyers for Trump said the people named in the case haven't shown they will suffer \"substantial harm\" and that the nationwide injunction blocking the ban is \"fatally overbroad.\"\n\n____\n\nAssociated Press reporter Jessica Gresko contributed to this report from Washington.\n\n____\n\nFollow Alanna Durkin Richer at http://twitter.com/aedurkinricher. Read more of her work at http://bigstory.ap.org/journalist/alanna-durkin-richer.", "authors": [], "publish_date": "2017-03-27", "source": "foxnews", "top_words": ["executive", "ruling", "travel", "urge", "trump", "revised", "ban", "appeals", "court", "order", "refugees", "13", "temporary", "states", "ok", "muslim"], "summary": "Circuit Court of Appeals to overturn a lower court judge's ruling that blocked part of the president's revised executive order.\nThe states say the administration's action is not a \"pretext for religious discrimination\" and does not violate the constitution.\n\"Thus, the Executive Order is emphatically not a 'Muslim Ban.'\"\nThe Trump administration argued that the revised executive order, which includes a temporary ban on refugees and a cap on the number of refugees who can enter the country, was intended to protect the United States from terrorism.\nThe administration urged the court in a brief also filed Monday to put the lower court ruling on hold and let the executive order take effect while its appeal is pending."}