{"url": "http://www.foxnews.com/us/2017/03/13/latest-states-seeks-tuesday-trump-travel-ban-hearing.html", "id": "333", "title": "The Latest: States seeks Tuesday Trump travel ban hearing", "text": "The Latest on a lawsuit filed by Washington and other states seeking to block President Donald Trump's revised travel ban (all times local):\n\n9:41 a.m.\n\nWashington and four other states trying to block President Donald Trump's revised travel ban targeting predominantly Muslim nations are seeking a Tuesday hearing before a federal judge in Seattle.\n\nIn a new complaint filed Monday in U.S. District Court, Washington state Attorney General Bob Ferguson says the new travel ban is unconstitutional and harms state residents, universities and businesses, especially tech companies like Microsoft and Amazon who rely on foreign workers. California, Maryland, Massachusetts, New York and Oregon joined Washington in the legal action.\n\nFerguson filed new documents after a federal judge last week said he wouldn't immediately rule on whether his restraining order against the old ban applies to the new Trump executive order.\n\nFerguson asked for a hearing to be held Tuesday. The revised travel ban is scheduled to go into effect Thursday.\n\nTrump's revised ban blocks new visas for people from six predominantly Muslim countries including Somalia, Iran, Syria, Sudan, Libya and Yemen.\n\n___\n\n9:33 a.m.\n\nCalifornia is the latest state to join a legal challenge to President Donald Trump's revised travel ban.\n\nAttorney General Xavier Becerra said Monday that California would sign on as a plaintiff in a lawsuit challenging the ban's constitutionality.\n\nBecerra said in a statement that the order despite being changed still represents an attack on people based on their religion or national origin.\n\nDemocratic attorneys general nationwide are trying to use the court system to thwart the executive branch's travel order.\n\nTrump's revised ban bars new visas for people from six predominantly Muslim countries: Somalia, Iran, Syria, Sudan, Libya and Yemen.\n\nIt also temporarily shuts down the U.S. refugee program.", "authors": [], "publish_date": "2017-03-13", "source": "foxnews", "top_words": ["travel", "muslim", "seeks", "trump", "revised", "ban", "state", "predominantly", "trumps", "general", "states", "president", "hearing", "washington", "latest"], "summary": "The Latest on a lawsuit filed by Washington and other states seeking to block President Donald Trump's revised travel ban (all times local):9:41 a.m.Washington and four other states trying to block President Donald Trump's revised travel ban targeting predominantly Muslim nations are seeking a Tuesday hearing before a federal judge in Seattle.\nThe revised travel ban is scheduled to go into effect Thursday.\nTrump's revised ban blocks new visas for people from six predominantly Muslim countries including Somalia, Iran, Syria, Sudan, Libya and Yemen.\n___9:33 a.m.California is the latest state to join a legal challenge to President Donald Trump's revised travel ban.\nTrump's revised ban bars new visas for people from six predominantly Muslim countries: Somalia, Iran, Syria, Sudan, Libya and Yemen."}