{"url": "http://www.foxnews.com/us/2017/03/27/latest-hawaii-keep-travel-ban-halted-without-hearing.html", "id": "353", "title": "The Latest: Hawaii: Keep travel ban halted without hearing", "text": "The Latest on lawsuits challenging President Donald Trump's travel ban (all times local):\n\n3:40 p.m.\n\nHawaii is asking a judge to extend his order blocking President Donald Trump's travel ban without holding another hearing.\n\nU.S. District Judge Derrick Watson temporarily halted the ban from taking effect, but his order is set to expire Wednesday. That's when he's scheduled a hearing on Hawaii's request to block the ban until the state's lawsuit works its way through the courts.\n\nHawaii says in court documents that nothing has changed since Watson ruled and a hearing is unnecessary. The state says that it will ensure the constitutional rights of Muslim citizens across the U.S. are vindicated.\n\nThe Department of Justice says that if the judge grants the request, it should only cover the part of Trump's executive order that suspends new visas for people from six Muslim-majority countries.\n\n___\n\n10:20 a.m.\n\nPresident Donald Trump's administration is asking a federal appeals court to let his travel ban go into effect while it considers the case.\n\nAttorneys for the president want the 4th U.S. Circuit Court of Appeals to put on hold a lower court judge's ruling that blocked his revised travel ban targeting six predominantly Muslim countries while the court considers the merits of its appeal.\n\nThe administration says the people named in the case haven't shown they will suffer \"substantial harm\" if the order takes effect. The administration says the nationwide injunction blocking the ban is \"fatally overbroad.\"\n\nThe Maryland ruling and a separate ruling in Hawaii were victories for civil liberties groups and advocates for immigrants and refugees.\n\nThe Richmond, Virginia-based court will hear arguments in the case May 8.", "authors": [], "publish_date": "2017-03-27", "source": "foxnews", "top_words": ["ruling", "travel", "hawaii", "ban", "judge", "court", "order", "donald", "trumps", "latest", "president", "hearing", "effect", "halted"], "summary": "The Latest on lawsuits challenging President Donald Trump's travel ban (all times local):3:40 p.m.Hawaii is asking a judge to extend his order blocking President Donald Trump's travel ban without holding another hearing.\nU.S. District Judge Derrick Watson temporarily halted the ban from taking effect, but his order is set to expire Wednesday.\n___10:20 a.m.President Donald Trump's administration is asking a federal appeals court to let his travel ban go into effect while it considers the case.\nCircuit Court of Appeals to put on hold a lower court judge's ruling that blocked his revised travel ban targeting six predominantly Muslim countries while the court considers the merits of its appeal.\nThe Maryland ruling and a separate ruling in Hawaii were victories for civil liberties groups and advocates for immigrants and refugees."}