{"url": "http://www.foxnews.com/us/2017/05/25/q-look-at-latest-legal-loss-for-trump-travel-ban.html", "id": "387", "title": "Q&A: A look at latest legal loss for Trump travel ban", "text": "A Virginia-based federal appeals court pulled no punches in refusing to reinstate President Donald Trump's revised travel ban, with judges in the 10-3 majority calling the administration's action discriminatory and its reasoning nonsensical.\n\nThe 4th U.S. Circuit Court of Appeals opinion Thursday upheld a Maryland judge's decision to block the travel ban from taking effect. It was the first appeals court to weigh in on the travel ban.\n\nA three-judge panel of the San Francisco-based 9th Circuit is expected to rule soon after hearing arguments in Seattle this month, and the issue is likely to reach the Supreme Court.\n\nHere's a look at what the 4th Circuit decided and what might come next.\n\n___\n\nARE TRUMP'S CAMPAIGN STATEMENTS RELEVANT?\n\nAccording to at least eight of the judges in the majority, yes. Chief Judge Roger Gregory wrote that it was appropriate to consider Trump's comments calling for a Muslim ban.\n\nBut Gregory stressed there should be no bright-line rule governing when it's appropriate to consider an officeholder's campaign statements.\n\n\"A person's particular religious beliefs, her college essay on religious freedom, a speech she gave on the Free Exercise Clause — rarely, if ever, will such evidence reveal anything about that person's actions once in office,\" he wrote. \"For a past statement to be relevant to the government's purpose, there must be a substantial, specific connection between it and the challenged government action.\"\n\nThe groups challenging the ban made a compelling case that the primary purpose of Trump's revised travel ban was to discriminate against Muslims, in violation of the Constitution's ban on the government favoring or disfavoring any religion, the majority said.\n\nOne judge, Stephanie Thacker, an appointee of President Barack Obama, said in a concurring opinion she would not consider statements by candidate Trump — but, she added, it wasn't necessary to. She cited Trump adviser Rudy Giuliani's comments following Trump's inauguration that the president had asked him to figure out how to legally implement a Muslim ban.\n\nThe three dissenting judges, Republican appointees Paul Niemeyer, Dennis Shedd and G. Steven Agee, accused the majority of \"fabricating a new proposition of law.\" Campaign statements — often ambiguous, retracted, clarified and politically charged — might provide fertile ground for anyone who wanted to recast the intent of an official's action in an effort to show discrimination, they said.\n\n___\n\nNATIONAL SECURITY\n\nActing Solicitor General Jeffrey Wall argued that the president's directive falls squarely within his duty to secure the nation's borders and that it does not discriminate against Muslims in its language or in its operation.\n\nThe majority didn't buy it.\n\nThe only examples Trump's order cited of immigrants born abroad and convicted of terrorism-related crimes in the United States include two Iraqis and a Somalian refugee, Gregory wrote. Iraq is not among the six predominantly Muslim countries included in the travel ban, and the Somalian came to the U.S. as a child and was radicalized here as an adult.\n\nThe travel ban \"appears to be a post hoc, secondary justification for an executive action rooted in religious animus and intended to bar Muslims from this country,\" he wrote.\n\nIn her concurrence, Thacker called the government's reasoning untenable. She noted that two non-Muslim nations, the Philippines and Venezuela, weren't included among the banned countries even though they are home to terrorist groups and fail to help verify information about people attempting to travel to the United States.\n\n\"The Government has not consistently applied the criteria it claims it used, and the reason seems obvious — and inappropriate,\" she wrote.\n\n___\n\nSUPREME COURT\n\nAttorney General Jeff Sessions swiftly said the Justice Department will ask the Supreme Court to review the 4th Circuit's decision. Sessions says the Justice Department \"strongly disagrees\" and will continue to vigorously defend Trump's order. He says the court's ruling blocks Trump's \"efforts to strengthen this country's national security.\"\n\nThe Supreme Court almost always has the final say when a lower court strikes down a federal law or presidential action.\n\nTrump could try to persuade the Supreme Court to allow the policy to take effect, even while the justices weigh whether to hear the case, by arguing that the court orders blocking the ban make the country less safe.\n\nA vote on whether to grant that request could signal the court's ultimate decision.\n\nIt takes a majority of the court, five votes, to put a lower court ruling on hold. One factor in that first vote is whether the government is likely to win in the end. If at least five justices vote to let the travel ban take effect, there's a good chance they also would uphold the policy later on.\n\nConversely, it's hard to imagine that a majority would uphold the travel ban if there are not five votes to let it take effect pending a final ruling.\n\n___\n\nAssociated Press writer Mark Sherman in Washington, D.C., contributed.", "authors": ["Gene Johnson"], "publish_date": "2017-05-25", "source": "foxnews", "top_words": ["travel", "wrote", "judges", "trump", "loss", "ban", "majority", "supreme", "vote", "qa", "court", "trumps", "latest", "effect", "look", "legal"], "summary": "Circuit Court of Appeals opinion Thursday upheld a Maryland judge's decision to block the travel ban from taking effect.\nIt was the first appeals court to weigh in on the travel ban.\n___SUPREME COURTAttorney General Jeff Sessions swiftly said the Justice Department will ask the Supreme Court to review the 4th Circuit's decision.\nThe Supreme Court almost always has the final say when a lower court strikes down a federal law or presidential action.\nIf at least five justices vote to let the travel ban take effect, there's a good chance they also would uphold the policy later on."}