{"url": "http://www.foxnews.com/us/2017/03/10/syrian-refugee-challenges-new-travel-ban-in-federal-court.html", "id": "331", "title": "Syrian refugee challenges new travel ban in federal court", "text": "A Syrian refugee trying to bring his family to Wisconsin renewed his challenge of President Donald Trump's travel ban in federal court Friday, arguing the new order is clearly anti-Muslim and just as illegal as the president's first travel ban.\n\nTrump issued an executive order in January banning travelers from seven predominantly Muslim countries, including Syria, from entering the United States. The Syrian, who is a Sunni Muslim, filed a federal lawsuit in Madison in February alleging that he had been trying to get visas for his wife and 3-year-old daughter so they could escape Aleppo when Trump's order halted the process. He alleged the ban was unconstitutional. The refugee filed the lawsuit anonymously to protect his family's safety.\n\nU.S. District Judge William Conley declared the lawsuit moot after a federal judge in Washington state blocked the ban. But Conley told the Syrian to check back in since Trump was expected to issue a second ban.\n\nThe refugee filed a new complaint Friday, alleging his family won't be able to get visas by the ban's March 16 effective date. He argued the order is essentially the same as the first and violates his constitutional rights to due process, equal protection and freedom of religion. The lawsuit asks Conley to issue a temporary restraining order blocking the ban as well as an injunction.\n\n\"The Executive Order, like its predecessor, effectuates President Trump's long-standing campaign promise of implementing a 'total and complete shutdown of Muslims entering the United States,'\" the lawsuit states. \"It also unlawfully and unconstitutionally prevents Plaintiff from reuniting with his wife and young daughter, and this Court should set it aside.\"\n\nThe U.S. Justice Department is defending the ban. An agency spokeswoman didn't immediately respond to an email seeking comment.\n\nTrump's initial ban barred travelers from seven countries: Somalia, Iran, Syria, Sudan, Libya, Yemen and Iraq. It also suspended the U.S. refugee program for 120 days. The order sparked numerous lawsuits, including the Syrian refugee's initial federal complaint in Wisconsin. U.S. District Judge James Robart in Washington state blocked the ban on Feb. 3.\n\nTrump issued a new order Monday that removed Iraq from the list of countries and temporarily shuts down the refugee program. Unlike the first order, the new ban won't affect current visa holders and removes language that would give priority to religious minorities. Hawaii filed a lawsuit challenging the new ban Wednesday; other states with Democratic attorneys general plan to sue next week.\n\nAccording to the Syrian refugee's lawsuit, he fled his country to avoid near-certain death at the hands of two military factions, one a Sunni-aligned group fighting against President Bashar al-Assad's regime and one fighting in support of Assad. The pro-Assad forces thought he was sympathetic to the other side and the anti-Assad army targeted him because he was a Sunni and traveled to pro-Assad areas to manage his family's business.\n\nBoth sides tortured him and threatened to kill him, the lawsuit said. The pro-Assad forces also threatened to rape his wife. He fled to the United States in 2014 and was granted asylum last year. He then began filing petitions seeking asylum for his wife and daughter. The petitions were being processed when Trump's first travel ban halted work on them.\n\nHe has since learned that the petitions have been approved and his family was set to be interviewed in Jordan before Trump issued the new order, the lawsuit said.\n\n___\n\nFollow Todd Richmond on Twitter at https://twitter.com/trichmond1", "authors": [], "publish_date": "2017-03-10", "source": "foxnews", "top_words": ["syrian", "travel", "challenges", "ban", "wife", "refugee", "court", "filed", "states", "trumps", "federal", "lawsuit", "order"], "summary": "A Syrian refugee trying to bring his family to Wisconsin renewed his challenge of President Donald Trump's travel ban in federal court Friday, arguing the new order is clearly anti-Muslim and just as illegal as the president's first travel ban.\nThe refugee filed the lawsuit anonymously to protect his family's safety.\nU.S. District Judge William Conley declared the lawsuit moot after a federal judge in Washington state blocked the ban.\nThe refugee filed a new complaint Friday, alleging his family won't be able to get visas by the ban's March 16 effective date.\nHawaii filed a lawsuit challenging the new ban Wednesday; other states with Democratic attorneys general plan to sue next week."}