{"url": "http://www.foxnews.com/us/2017/03/16/latest-trump-suffers-new-defeat-on-revised-travel-ban.html", "id": "340", "title": "The Latest: Trump suffers new defeat on revised travel ban", "text": "The Latest on federal court challenges to President Donald Trump's revised travel ban (all times local except where noted):\n\n7:45 a.m.\n\nA federal judge in Greenbelt, Maryland, has blocked President Donald Trump's revised travel ban targeting six predominantly Muslim countries.\n\nJudge Theodore Chuang ruled Thursday in a case brought near the nation's capital by the ACLU and other groups representing immigrants, refugees and their families. The groups argued that the underlying rationale of the ban was to discriminate against Muslims, making it unconstitutional. Chuang granted a preliminary injunction nationwide basis.\n\nIt was the latest ruling against Trump's revised travel ban.\n\nGovernment lawyers argued that the ban was substantially revised from an earlier version signed in January that was later blocked by a federal judge in Washington state. They said the ban was ordered in the interest of national security to protect the U.S. from \"radical Islamic terrorism.\"\n\nThe Maryland plaintiffs also argued the ban illegally reduces the number of refugees authorized to enter the U.S. this year.\n\nChuang granted a preliminary injunction nationwide basis pending further orders from this court. He declined to stay the ruling should an emergency appeal be filed.\n\n___\n\n1:40 a.m. EDT\n\nA federal judge blocked President Donald Trump's revised travel ban hours before it was to take effect, marking the second time courts have thwarted Trump's efforts to freeze immigration by refugees and citizens of some predominantly Muslim nations.\n\nThe ruling came from a judge in Hawaii who rejected the government's claims that the travel ban is about national security, not discrimination. U.S. District Judge Derrick Watson also said Hawaii would suffer financially if the executive order constricted the flow of students and tourists to the state, and that Hawaii was likely to succeed on a claim that the ban violates First Amendment protections against religious discrimination.\n\nWatson criticized what he called the \"illogic\" of the government's arguments and cited \"significant and unrebutted evidence of religious animus\" behind the travel ban. He also noted that while courts should not examine the \"veiled psyche\" and \"secret motives\" of government decision-makers, \"the remarkable facts at issue here require no such impermissible inquiry.\"", "authors": [], "publish_date": "2017-03-16", "source": "foxnews", "top_words": ["ruling", "travel", "hawaii", "revised", "suffers", "trump", "ban", "judge", "refugees", "trumps", "federal", "latest", "president", "defeat"], "summary": "The Latest on federal court challenges to President Donald Trump's revised travel ban (all times local except where noted):7:45 a.m.A federal judge in Greenbelt, Maryland, has blocked President Donald Trump's revised travel ban targeting six predominantly Muslim countries.\nIt was the latest ruling against Trump's revised travel ban.\nGovernment lawyers argued that the ban was substantially revised from an earlier version signed in January that was later blocked by a federal judge in Washington state.\nThe ruling came from a judge in Hawaii who rejected the government's claims that the travel ban is about national security, not discrimination.\nWatson criticized what he called the \"illogic\" of the government's arguments and cited \"significant and unrebutted evidence of religious animus\" behind the travel ban."}