{"url": "http://www.foxnews.com/us/2017/05/11/federal-judge-in-dc-delays-ruling-in-trump-travel-ban-case.html", "id": "374", "title": "Federal judge in DC delays ruling in Trump travel ban case", "text": "A federal judge in the nation's capital said Thursday she won't act on a request to block President Donald Trump's revised travel ban because two other judges have already stopped the executive order from going into effect.\n\nU.S. District Judge Tanya Chutkan said in an order that she is \"inclined to agree\" that Trump's effort to temporarily bar new visas for citizens of six predominantly Muslim countries is unlawful. But she said the best course of action is to delay proceedings until appeals from the rulings in Maryland and Hawaii are resolved.\n\nChutkan heard testimony last month from Iranian-American and Muslim groups that say Iranians have faced delays and disruptions in obtaining visas even after the ban was blocked. They had asked for a more sweeping injunction that would restore the normal visa application process.\n\nOrganizations challenging the ban in Washington, D.C., include the Pars Equality Center, the Iranian American Bar Association, the National Iranian American Council and the Public Affairs Alliance of Iranian Americans. The lawsuit claims the ban was driven by anti-Muslim sentiment and is harming students, business travelers and families.\n\nJustice Department lawyers insist the ban targets countries that pose terrorism risks and say courts should not second-guess the president's foreign policy decisions.\n\nChutkan was the first judge to allow witnesses to testify in court about the effects of the travel ban. She appeared sympathetic to the groups last month, and said Thursday that she is prepared to issue a ruling \"without delay\" if orders from courts in Maryland and Hawaii are overturned. Those judges blocked the vast majority of the ban, which would restrict immigration of people from Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nThe Trump administration is appealing both rulings. A federal appeals court in Richmond, Virginia, heard arguments in the Maryland case on Monday, while a federal appeals court in San Francisco will consider the Hawaii ruling next week.\n\nMeanwhile, Chutkan said the litigation on the merits of the case would continue and she ordered the parties to file legal briefs by the end of June.\n\nCyrus Mehri, a lawyer representing the challengers, said the groups would have a preferred a ruling, but are pleased with the judge's comments that the ban likely is illegal. He said his clients would continue to \"vigorously prosecute\" the case.\n\nThe revised travel ban issued in March is narrower than an earlier one from January that was blocked by a federal judge in Washington state. The new version removed language that would give priority to religious minorities and erased Iraq from the list of banned countries. It also made it clear the ban doesn't apply to those who already have valid visas.", "authors": [], "publish_date": "2017-05-11", "source": "foxnews", "top_words": ["ruling", "travel", "case", "judges", "trump", "hawaii", "ban", "visas", "judge", "maryland", "iranian", "delays", "federal", "dc"], "summary": "A federal judge in the nation's capital said Thursday she won't act on a request to block President Donald Trump's revised travel ban because two other judges have already stopped the executive order from going into effect.\nBut she said the best course of action is to delay proceedings until appeals from the rulings in Maryland and Hawaii are resolved.\nChutkan was the first judge to allow witnesses to testify in court about the effects of the travel ban.\nA federal appeals court in Richmond, Virginia, heard arguments in the Maryland case on Monday, while a federal appeals court in San Francisco will consider the Hawaii ruling next week.\nThe revised travel ban issued in March is narrower than an earlier one from January that was blocked by a federal judge in Washington state."}