{"url": "http://www.foxnews.com/us/2017/05/15/ap-news-guide-what-to-know-about-travel-ban-appeals.html", "id": "376", "title": "AP News Guide: What to know about travel ban appeals", "text": "Does federal law give President Donald Trump broad legal authority to freeze immigration by refugees and citizens of some predominantly Muslim nations?\n\nThat's the question before two federal appellate courts that have now heard arguments over Trump's revised travel ban and are being asked by Trump's opponents to use the president's own anti-Muslim campaign rhetoric against him. Federal courts in Hawaii and Maryland earlier this year blocked Trump's revised travel ban from taking effect. Trump wants those decisions reversed.\n\nOn Monday a three-judge panel of the 9th U.S. Circuit Court of Appeals in Seattle heard Hawaii's lawsuit challenging the ban, which would suspend the nation's refugee program and temporarily bar new visas for citizens of Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nLast week, judges on the 4th Circuit Court of Appeals in Richmond, Virginia, heard arguments over whether to affirm a Maryland judge's decision putting the ban on ice.\n\nWHAT DOES THE GOVERNMENT SAY?\n\nActing Solicitor General Jeffrey Wall told the appellate court judges the president's directive falls squarely within his duty to secure the nation's borders and that it does not discriminate against Muslims in its language or in its operation.\n\nPrevious presidents have blocked certain foreign nationals: Jimmy Carter used his authority to deny some Iranians entry to the U.S. during the hostage crisis, Ronald Reagan to bar Cubans who didn't already have relatives here; and President Barack Obama to keep out North Korean officials. On Monday Wall said the order doesn't say anything about religion. \"This order is aimed at aliens abroad, who themselves don't have constitutional rights,\" Wall said.\n\nWHAT DO STATES AND CIVIL RIGHTS GROUPS CHALLENGING THE BAN SAY?\n\nThey argue it violates the Constitution by disfavoring Islam and point to statements Trump made repeatedly as a candidate in which he said he would ban Muslims from entering the country. In issuing his decision blocking the ban in March, Judge Derrick Watson in Honolulu cited what he called \"significant and unrebutted evidence of religious animus\" in Trump's campaign statements. Speaking before the 9th Circuit judges on Monday, Neal Katyal, who represented Hawaii, also said Trump had repeatedly spoken of a Muslim ban during the campaign and after. \"This is a repeated pattern of the president,\" Katyal said.\n\nThey also argue that the while the president has broad authority over immigration, that power extends only as far as Congress has granted it. Because Congress has already adopted a scheme regarding when people may be excluded from the country for terror-related activities, the president cannot override that with his travel ban, they argue.\n\nWHAT POWER DOES THE PRESIDENT HAVE?\n\nIn 1952, with the nation fearful of communist infiltration, Congress gave the president the authority under the Immigration and Nationality Act to take action: \"Whenever the president finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may ... suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate,\" the law says. But a law subsequently passed by Congress bans discrimination on the basis of nationality when it comes to issuing immigrant visas. How those laws might authorize or constrain Trump's actions is a key aspect of the travel ban cases.\n\nWHAT'S HAPPENING NOW WITH IMMIGRATION?\n\nTrump's attempted travel bans have caused the number of refugees coming into the U.S. to plummet in the last two months, despite his executive orders largely being blocked in the courts. The number of refugees arriving in the U.S. dipped to 2,070 in March, which was a six-year low except for a period in 2013 when the federal government was shut down. The figure was slightly higher in April, at 3,200, but it was still much lower than the months preceding Trump's order. An executive order signed by Trump in January decreased the refugee limit from 110,000 to 50,000 this fiscal year, but the cap was not blocked in court until mid-March. That caused the State Department to tightly rein in monthly arrivals when the cap was in effect.\n\nEarlier this month, the State Department announced it wants to review social media, email addresses and phone numbers from some foreigners seeking U.S. visas, as part of the Trump administration's enhanced screening of potential immigrants and visitors.\n\nWHAT DID THE JUDGES IN HAWAII AND MARYLAND SAY?\n\nThe federal appellate judges are considering rulings by two federal judges against the travel ban. Neither U.S. District Judge Theodore Chuang in Maryland nor Watson in Hawaii bought the administration's reasoning that the ban is about national security. Watson criticized what he called the \"illogic\" of the government's arguments and cited \"significant and unrebutted evidence of religious animus\" behind the travel ban. He also noted that while courts should not examine the \"veiled psyche\" and \"secret motives\" of government decision-makers, \"the remarkable facts at issue here require no such impermissible inquiry.\" But the scope of the rulings differed. In a challenge brought by Hawaii, Watson blocked the federal government from enforcing its ban on travel from six mostly Muslim countries and its suspension of the nation's refugee program. Chuang only blocked the six-nation travel ban, saying it wasn't clear that the suspension of the refugee program was similarly motivated by religious bias.\n\nWHAT'S NEXT?\n\nThe appellate courts in Washington state and Virginia will issue their decisions, though exactly when they'll rule is uncertain. The travel ban cases are expected to reach the Supreme Court at any rate, but that would likely be cemented if the 4th and 9th Circuits reach differing conclusions about its legality.\n\nLast week, U.S. District Judge Tanya Chutkan in the nation's capital said she's \"inclined to agree\" that the travel ban is unlawful, but held off on a request to block it because of the pending appeals court cases. Hawaii Attorney General Douglas Chin said Monday that means even if the 4th and 9th Circuits side with the administration, the travel ban could be put on hold yet again.\n\n____\n\nAssociated Press reporter Meredith Hoffman in Austin, Texas, contributed to this report.", "authors": ["Gene Johnson"], "publish_date": "2017-05-15", "source": "foxnews", "top_words": ["ap", "travel", "judges", "trump", "hawaii", "ban", "appeals", "know", "court", "trumps", "guide", "federal", "blocked", "president"], "summary": "Federal courts in Hawaii and Maryland earlier this year blocked Trump's revised travel ban from taking effect.\nHow those laws might authorize or constrain Trump's actions is a key aspect of the travel ban cases.\nThe federal appellate judges are considering rulings by two federal judges against the travel ban.\nWatson criticized what he called the \"illogic\" of the government's arguments and cited \"significant and unrebutted evidence of religious animus\" behind the travel ban.\nChuang only blocked the six-nation travel ban, saying it wasn't clear that the suspension of the refugee program was similarly motivated by religious bias."}