{"url": "http://www.foxnews.com/us/2017/05/08/latest-13-judges-to-hear-revised-trump-travel-ban-case.html", "id": "370", "title": "The Latest: 13 judges to hear revised Trump travel ban case", "text": "The Latest on the legal challenges to President Donald Trump's revised travel ban targeting six-Muslim majority countries (all times local):\n\n10 a.m.\n\nA panel of 13 appeals court judges will hear a challenge to President Donald Trump's revised executive order targeting six predominantly Muslim countries.\n\nThe 4th U.S. Circuit Court of Appeals said Judge Allyson K. Duncan and Judge J. Harvie Wilkinson III will not hear arguments in the case Monday. Wilkinson's son-in-law is Acting Solicitor General Jeffrey Wall, who's arguing the case on behalf of Trump.\n\nIt was not immediately clear why Duncan isn't on the panel. Both judges were appointed to the court by Republican presidents.\n\nOf the 13 judges remaining, three are Republican appointees and nine are Democratic appointees. Chief Judge Roger Gregory was given a recess appointment to the court by President Bill Clinton and was reappointed by President George W. Bush.\n\n___\n\n3:20 a.m.\n\nPresident Donald Trump is hoping that a federal appeals court will approve his revised travel ban that targets six Muslim-majority countries.\n\nAttorneys for the Justice Department will defend Trump's immigration executive order before the 4th U.S. Circuit Court of Appeals on Monday. It's the first time an appeals court will hear arguments on the revised travel ban, which was issued in March.\n\nThe court in Richmond, Virginia, will examine a ruling that blocks the administration from suspending new visas for citizens of Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nThe revised travel ban has also been blocked by a judge in Hawaii. A three-judge panel of the 9th U.S. Circuit Court of Appeals will hear arguments in that case next week.", "authors": [], "publish_date": "2017-05-08", "source": "foxnews", "top_words": ["travel", "hear", "judges", "revised", "trump", "case", "ban", "appeals", "judge", "court", "13", "trumps", "latest", "president", "panel"], "summary": "The Latest on the legal challenges to President Donald Trump's revised travel ban targeting six-Muslim majority countries (all times local):10 a.m.A panel of 13 appeals court judges will hear a challenge to President Donald Trump's revised executive order targeting six predominantly Muslim countries.\nCircuit Court of Appeals said Judge Allyson K. Duncan and Judge J. Harvie Wilkinson III will not hear arguments in the case Monday.\n___3:20 a.m.President Donald Trump is hoping that a federal appeals court will approve his revised travel ban that targets six Muslim-majority countries.\nIt's the first time an appeals court will hear arguments on the revised travel ban, which was issued in March.\nThe revised travel ban has also been blocked by a judge in Hawaii."}