{"url": "http://www.foxnews.com/us/2017/03/29/latest-hearing-starts-on-extending-block-to-travel-ban.html", "id": "354", "title": "The Latest: Hearing starts on extending block to travel ban", "text": "The Latest on a hearing in federal court in Hawaii on President Donald Trump's travel ban (all times local):\n\n9:40 a.m.\n\nA hearing has started in federal court in Hawaii on whether a judge should extend his temporary order blocking President Donald Trump's travel ban until the state's lawsuit is resolved.\n\nU.S. District Judge Derrick Watson is listening to arguments Wednesday. Even if he doesn't issue a longer-lasting hold on the ban, his temporary block would stay in place until he rules otherwise.\n\nLegal experts say it's unlikely Watson would side with the Trump administration.\n\nThe state says the policy discriminates against Muslims, while the government says it falls within the president's power to protect national security.\n\nThis month, Watson prevented the federal government from suspending new visas for people from six Muslim-majority countries and freezing the nation's refugee program.\n\n___\n\n8:30 p.m.\n\nA federal judge in Hawaii is hearing arguments on whether to extend his temporary order blocking President Donald Trump's revised travel ban.\n\nA hearing in Honolulu is set for Wednesday. But even if U.S. District Judge Derrick Watson doesn't put the ban on hold until the state's lawsuit is resolved, his temporary block would remain until he rules otherwise.\n\nLegal experts say it's unlikely Watson would side with the Trump administration.\n\nGovernment attorneys say that if the judge issues a longer-lasting hold, he should narrow his ruling to cover only the part of the ban that suspends new visas for people from six Muslim-majority countries.\n\nThey say the lawsuit doesn't show how Hawaii would be harmed by other sections of the ban, including suspending the nation's refugee program.\n\nWatson also prevented that section from taking effect two weeks ago.", "authors": [], "publish_date": "2017-03-29", "source": "foxnews", "top_words": ["extending", "travel", "hawaii", "ban", "block", "judge", "starts", "trumps", "federal", "latest", "temporary", "hearing", "watson", "say"], "summary": "The Latest on a hearing in federal court in Hawaii on President Donald Trump's travel ban (all times local):9:40 a.m.A hearing has started in federal court in Hawaii on whether a judge should extend his temporary order blocking President Donald Trump's travel ban until the state's lawsuit is resolved.\nEven if he doesn't issue a longer-lasting hold on the ban, his temporary block would stay in place until he rules otherwise.\n___8:30 p.m.A federal judge in Hawaii is hearing arguments on whether to extend his temporary order blocking President Donald Trump's revised travel ban.\nBut even if U.S. District Judge Derrick Watson doesn't put the ban on hold until the state's lawsuit is resolved, his temporary block would remain until he rules otherwise.\nThey say the lawsuit doesn't show how Hawaii would be harmed by other sections of the ban, including suspending the nation's refugee program."}