{"url": "http://www.foxnews.com/us/2017/04/27/trump-repeats-criticism-court-that-halted-1st-travel-ban.html", "id": "367", "title": "Trump repeats criticism of court that halted 1st travel ban", "text": "President Donald Trump is once again taking aim at a federal appeals court district that covers Western states, saying he is considering breaking up a circuit that is a longtime target of Republicans and is where his first travel ban was halted.\n\nYet it would take congressional action to break up the 9th U.S. Circuit Court of Appeals. Republicans have introduced bills this year to do just that.\n\nAsked Wednesday during a White House interview by the Washington Examiner if he'd thought about proposals to break up the court, Trump replied, \"Absolutely, I have.\"\n\n\"There are many people that want to break up the 9th Circuit. It's outrageous,\" he told the Examiner. He accused critics of appealing to the 9th \"because they know that's like, semi-automatic.\"\n\nThe comments echoed his Twitter criticism of the court Wednesday morning.\n\nDemocratic Congressmen John Conyers, Jr. of Michigan and Jerrold Nadler of New York, members of the House Judiciary Committee, responded in a statement Thursday that Trump would \"rather attack the judiciary than defend his inhumane and unconstitutional executive orders.\"\n\n\"The Muslim ban is unconstitutional, the so-called 'sanctuary cities' order is unlawful, and the path forward on these issues does not involve recycling a tired proposal to dismantle the Ninth Circuit Court of Appeals,\" the congressmen said.\n\nTrump called U.S. District Judge William Orrick's preliminary injunction against his order stripping money from so-called sanctuary cities \"ridiculous\" on Twitter. He said he planned to take that case to the Supreme Court. However, an administration appeal of the district court's decision must go first to the 9th Circuit.\n\nRepublicans have talked for years about splitting the circuit into two appellate courts, but earlier legislative proposals have failed, most recently in 2005. Those battles have often pitted lawmakers from California against members from smaller, more conservative states.\n\nCritics say the court has a liberal slant, a high caseload and distances that are too far for judges to travel. The circuit is the largest of the federal appellate courts, representing 20 percent of the U.S. population. It includes California, Alaska, Hawaii, Washington, Oregon, Montana, Idaho, Nevada, Arizona, Guam and the Northern Mariana Islands.\n\nThe circuit has 29 judicial positions, many more than the 5th, which is the next largest circuit with 17. The 9th Circuit was created in 1891 when the American West was much less populated.\n\nDemocrats have opposed the split. Sen. Dianne Feinstein of California was a leading opponent in the 2005 push, which she said was politically motivated. She has suggested adding judges to the court instead.\n\nIn March, 9th Circuit judges appointed by both Democratic and Republican presidents told lawmakers that breaking up the court was a bad idea.\n\nThe 9th Circuit in February refused to immediately reinstate Trump's ban on travelers from seven predominantly Muslim nations, prompting the administration to release a new, narrower ban. That also has been held up by the courts.", "authors": [], "publish_date": "2017-04-27", "source": "foxnews", "top_words": ["travel", "break", "courts", "trump", "judges", "ban", "circuit", "1st", "repeats", "court", "9th", "criticism", "california", "halted", "district"], "summary": "Circuit Court of Appeals.\nAsked Wednesday during a White House interview by the Washington Examiner if he'd thought about proposals to break up the court, Trump replied, \"Absolutely, I have.\"\nThe 9th Circuit was created in 1891 when the American West was much less populated.\nIn March, 9th Circuit judges appointed by both Democratic and Republican presidents told lawmakers that breaking up the court was a bad idea.\nThe 9th Circuit in February refused to immediately reinstate Trump's ban on travelers from seven predominantly Muslim nations, prompting the administration to release a new, narrower ban."}