{"url": "http://www.foxnews.com/us/2017/03/07/experts-new-travel-ban-more-palatable-still-problematic.html", "id": "320", "title": "Experts: New travel ban more palatable, still problematic", "text": "More palatable, but still problematic: That's the judgment of some legal experts who have examined President Donald Trump's revised travel ban, issued after a month of legal wrangling over the original.\n\nThe version released Monday is much narrower and eases concerns about violating the due process rights of travelers.\n\nIt also attempts to erase the notion that it was designed to target Muslims by spelling out more of a national security rationale. But civil rights groups and Democratic lawmakers are not buying it.\n\nHere's a look at how the new executive order differs from the old, and how any legal challenges might play out:\n\n___\n\nWHAT'S DIFFERENT?\n\nMuch. The initial order came by surprise, on a Friday in late January, and immigration officials had little guidance about how to implement it.\n\nPeople who were legal residents of the U.S. or had already been vetted to travel here found themselves detained in airports or put on planes heading back. Chaos ensued as thousands of protesters crammed airports that weekend, and judges began barring the government from deporting certain passengers.\n\nA federal judge in Seattle ruled that the ban was likely illegal and ordered the government to stop enforcing it nationwide, a decision later upheld by the 9th U.S. Circuit Court of Appeals.\n\nThis time, Trump gave 10 days' notice before the order goes into effect on March 16. The new ban temporarily bars new visas for citizens of six predominantly Muslim countries — one fewer than the original, with Iraq removed from the list. It does not apply to travelers who already have visas.\n\nLike the first order, it suspends the U.S. refugee program for four months and cuts the number of refugees the country is willing to take in from 110,000 to 50,000.\n\n___\n\nIS IT REALLY ABOUT NATIONAL SECURITY?\n\nThe order says people from Somalia, Iran, Syria, Sudan, Libya and Yemen \"warrant additional scrutiny in connection with our immigration policies because the conditions in these countries present heightened threats.\"\n\nIntelligence analysts at the Department of Homeland Security have questioned that rationale, concluding that citizenship is an \"unlikely indicator\" of terrorist ties.\n\nWashington state and Minnesota argued in their successful legal case against the original order that it was motivated by Trump's desire — stated during the campaign — to ban Muslims.\n\nThe 9th Circuit ruling did not deal with the states' argument that the ban violated the First Amendment's separation of church and state by allegedly disfavoring Islam. But the judges said they would evaluate that issue after further briefing, and they called the claims serious and significant.\n\nThe question is likely to be central to any challenges of the new ban.\n\n___\n\nWILL IT HOLD UP?\n\nThe American Civil Liberties Union has promised to fight the new ban in court, and the attorneys general of Washington and Virginia have said they're evaluating their legal options.\n\nBut it will be \"much, much tougher\" for a federal judge to block because it's drafted much more carefully, New York immigration attorney Ted Ruthizer said.\n\nSince the order applies to a small portion of the world's Muslim population, courts might be hesitant to find it's discriminatory, he said. And judges have a history of upholding immigration laws that discriminate on the basis of race and nationality when national security is an issue, he said.\n\n\"There's still the argument that, when you take down all the window dressing, it's still a religion ban, but these are the kinds of nuances that the courts will look at,\" Ruthizer said.\n\nStephen Yale-Loehr, an immigration law professor at Cornell University Law School, said that even if the new order is on more solid legal footing, it \"will not quell litigation or concerns.\"\n\n\"U.S. relatives will still sue over the inability of their loved ones to join them in the United States,\" he said. \"U.S. companies may sue because they cannot hire needed workers from the six countries. And U.S. universities will worry about the impact of the order on international students' willingness to attend college in the United States.\"\n\n___\n\nWHAT'S THE REACTION?\n\nTop Republicans welcomed the changes. Sen. Orrin Hatch of Utah said the revised order makes significant progress toward what he called for after the first version: to avoid hindering innocent travelers or refugees fleeing violence and persecution.\n\nHouse Speaker Paul Ryan said the order \"advances our shared goal of protecting the homeland.\" Texas Attorney General Ken Paxton said the president had the authority to secure the nation's borders \"in light of the looming threat of terrorism.\"\n\nThe response abroad was more critical. The head of the U.N. refugee agency said it may compound the anguish of those fleeing strife or famine. Somalia's new president, Mohamed Abdullahi Mohamed, acknowledged his nation's security troubles but said Somalis \"have contributed to the U.S. economy and the U.S. society ... and we have to talk about what the Somali people have contributed rather than a few people who may cause a problem.\"\n\nIran reiterated that it would bar travelers from the U.S. in retaliation, and a Yemeni political analyst, Hassan Al-Wareeth, denounced the new ban as hypocritical. It doesn't affect some Gulf and Arab countries such as Saudi Arabia, which, he argued, have had many citizens involved in terror attacks.\n\n___\n\nJohnson reported from Seattle. Associated Press writers Steve Peoples in Washington, Brady McCombs in Salt Lake City and Matthew Barakat in McLean, Virginia, contributed to this report.", "authors": [], "publish_date": "2017-03-07", "source": "foxnews", "top_words": ["travel", "judges", "national", "ban", "immigration", "security", "travelers", "countries", "experts", "order", "president", "problematic", "palatable", "legal"], "summary": "More palatable, but still problematic: That's the judgment of some legal experts who have examined President Donald Trump's revised travel ban, issued after a month of legal wrangling over the original.\nIt also attempts to erase the notion that it was designed to target Muslims by spelling out more of a national security rationale.\nChaos ensued as thousands of protesters crammed airports that weekend, and judges began barring the government from deporting certain passengers.\n___IS IT REALLY ABOUT NATIONAL SECURITY?\nIran reiterated that it would bar travelers from the U.S. in retaliation, and a Yemeni political analyst, Hassan Al-Wareeth, denounced the new ban as hypocritical."}