{"url": "http://www.foxnews.com/us/2017/03/06/look-at-what-in-what-out-in-trump-new-travel-ban.html", "id": "315", "title": "A look at what's in, what's out in Trump's new travel ban", "text": "President Donald Trump's executive order temporarily barring all travelers from seven majority-Muslim nations was in place for just eight days before a federal judge blocked it. Nearly a month later, Trump has rolled out a new order aimed at overcoming the legal challenges but accomplishing the same stated goal: keeping would-be terrorists out of the United States.\n\nA look at how the new order compares with the previous one.\n\n___\n\nBANNED FOREIGNERS\n\nOld order: Three-month ban on citizens from seven Muslim-majority countries, including those who had valid visas but were outside the United States when the ban was signed.\n\nNew order: Three-month ban on issuing new visas for people from six Muslim-majority countries — Iraqi nationals are no longer banned — and exceptions for foreigners from the other six countries: Somalia, Iran, Syria, Sudan, Libya and Yemen. Citizens of those countries with valid visas will be admitted to the U.S.\n\n___\n\nSYRIANS\n\nOld order: Syrian visitors, immigrants and refugees were barred from the United States indefinitely.\n\nNew order: Syrians will be treated the same as citizens of the other five countries singled out in the order.\n\n___\n\nREFUGEES\n\nOld order: Four-month halt to refugees entering the United States.\n\nNew order: The refugee ban remains in place, though people already approved and on their way to the United States will be allowed in.\n\n___\n\nTIMING\n\nOld order: The Jan. 27 order was immediately put into place, causing chaos and panic at airports as the Homeland Security Department scrambled to figure out who the order covered and how it was to be implemented.\n\nNew order: The new order, signed Monday, won't be affective until March 16. It also revokes the previous edict.", "authors": [], "publish_date": "2017-03-06", "source": "foxnews", "top_words": ["travel", "citizens", "ban", "visas", "place", "united", "states", "trumps", "whats", "countries", "threemonth", "valid", "order", "look"], "summary": "Nearly a month later, Trump has rolled out a new order aimed at overcoming the legal challenges but accomplishing the same stated goal: keeping would-be terrorists out of the United States.\n___BANNED FOREIGNERSOld order: Three-month ban on citizens from seven Muslim-majority countries, including those who had valid visas but were outside the United States when the ban was signed.\nCitizens of those countries with valid visas will be admitted to the U.S.___SYRIANSOld order: Syrian visitors, immigrants and refugees were barred from the United States indefinitely.\n___REFUGEESOld order: Four-month halt to refugees entering the United States.\nNew order: The refugee ban remains in place, though people already approved and on their way to the United States will be allowed in."}