{"url": "http://www.foxnews.com/us/2017/03/31/16-states-dc-urge-court-to-continue-to-block-travel-ban.html", "id": "358", "title": "16 states, DC urge court to continue to block travel ban", "text": "Attorneys general from 16 states and the District of Columbia say letting President Donald Trump's revised travel ban go into effect would amplify \"the message of fear and intimidation\" sent to Muslims.\n\nIn a brief filed Friday in the 4th U.S. Circuit Court of Appeals, the states urged the judges to reject the administration's request to let the ban take effect while it considers its appeal.\n\nA judge in Hawaii has extended his previous block of Trump's travel ban. Even if the 4th Circuit approves the administration's request, it would remain blocked by the Hawaii ruling.\n\nThe attorney generals criticizing the travel ban are from: Virginia, Maryland, California, Oregon, Connecticut, New York, Delaware, North Carolina, Illinois, Rhode Island, Iowa, Vermont, Maine, Washington, Massachusetts, New Mexico and the District of Columbia.", "authors": [], "publish_date": "2017-03-31", "source": "foxnews", "top_words": ["travel", "urge", "hawaii", "ban", "circuit", "block", "court", "columbia", "trumps", "16", "effect", "continue", "states", "request", "dc", "district"], "summary": "Attorneys general from 16 states and the District of Columbia say letting President Donald Trump's revised travel ban go into effect would amplify \"the message of fear and intimidation\" sent to Muslims.\nCircuit Court of Appeals, the states urged the judges to reject the administration's request to let the ban take effect while it considers its appeal.\nA judge in Hawaii has extended his previous block of Trump's travel ban.\nEven if the 4th Circuit approves the administration's request, it would remain blocked by the Hawaii ruling.\nThe attorney generals criticizing the travel ban are from: Virginia, Maryland, California, Oregon, Connecticut, New York, Delaware, North Carolina, Illinois, Rhode Island, Iowa, Vermont, Maine, Washington, Massachusetts, New Mexico and the District of Columbia."}