{"url": "http://www.foxnews.com/us/2017/03/09/latest-state-officials-to-discuss-travel-ban-lawsuits.html", "id": "328", "title": "The Latest: State officials to discuss travel ban lawsuits", "text": "The Latest on Hawaii's lawsuit challenging the revised travel ban (all times local):\n\n7:40 a.m.\n\nOfficials from two states that have filed legal challenges against President Donald Trump's travel bans plan to discuss their lawsuits later Thursday.\n\nSeparate news conferences are planned Thursday by Hawaii Attorney General Douglas Chin in Honolulu and Washington Attorney General Bob Ferguson in Seattle.\n\nHawaii on Wednesday became the first state to sue the administration over its revised travel ban. The executive order, which goes into effect March 16, bars new visas for people from six predominantly Muslim countries and temporarily shuts down the U.S. refugee program. It doesn't apply to travelers who already have visas.\n\nHawaii says the order will harm its Muslim population, tourism and foreign students.\n\nA federal judge in Seattle issued a temporary restraining order halting Trump's initial travel ban order after Washington state and Minnesota sued. The 9th U.S. Circuit Court of Appeals upheld that decision.", "authors": [], "publish_date": "2017-03-09", "source": "foxnews", "top_words": ["travel", "revised", "lawsuits", "ban", "state", "discuss", "officials", "order", "trumps", "general", "attorney", "latest", "muslim", "washington"], "summary": "The Latest on Hawaii's lawsuit challenging the revised travel ban (all times local):7:40 a.m.Officials from two states that have filed legal challenges against President Donald Trump's travel bans plan to discuss their lawsuits later Thursday.\nSeparate news conferences are planned Thursday by Hawaii Attorney General Douglas Chin in Honolulu and Washington Attorney General Bob Ferguson in Seattle.\nHawaii on Wednesday became the first state to sue the administration over its revised travel ban.\nHawaii says the order will harm its Muslim population, tourism and foreign students.\nA federal judge in Seattle issued a temporary restraining order halting Trump's initial travel ban order after Washington state and Minnesota sued."}