{"url": "http://www.foxnews.com/us/2017/04/03/latest-court-sets-schedule-for-travel-ban-appeal.html", "id": "360", "title": "The Latest: Court sets schedule for travel ban appeal", "text": "The Latest on Hawaii's lawsuit against the Trump administration's revised travel ban (all times local):\n\n2:15 p.m.\n\nA federal appeals court is set to hear arguments next month in the Trump administration's challenge to a ruling by a judge in Hawaii that blocked its revised travel ban.\n\nThe 9th U.S. Circuit Court of Appeals on Monday granted the administration's request to expedite its appeal of U.S. District Judge Derrick Watson's ruling. The appeals court scheduled oral arguments for May, though it did not specify a date.\n\nWatson last month indefinitely blocked President Donald Trump's executive order to suspend new visas for people in six Muslim-majority countries and halt the U.S. refugee program.\n\nWatson said Hawaii has shown that the ban will harm the state's universities and tourism industry as well as the imam of a Honolulu mosque. The White House believes Trump's executive order is legal and necessary for national security.\n\n___\n\n1:30 p.m.\n\nU.S. government attorneys want Hawaii's lawsuit challenging President Donald Trump's travel ban paused while a ruling blocking key sections is appealed.\n\nThe Department of Justice filed a motion Monday asking U.S. District Judge Derrick Watson to pause proceedings in Hawaii's lawsuit pending resolution of the government's appeal.\n\nThe government is appealing Watson's ruling that put an indefinite hold on Trump's executive order to suspend new visas for people in six Muslim-majority countries and halt the U.S. refugee program.\n\nHawaii's attorney general office didn't immediately comment on the suspension request.\n\nAccording to the motion, it would be helpful to know the outcome of the appeal before proceeding in the lawsuit.\n\nThe government wants to suspend upcoming deadlines in the case, including a scheduling hearing set for April 18.", "authors": [], "publish_date": "2017-04-03", "source": "foxnews", "top_words": ["ruling", "executive", "travel", "suspend", "ban", "appeal", "sets", "judge", "court", "order", "hawaiis", "trumps", "schedule", "lawsuit", "latest"], "summary": "Circuit Court of Appeals on Monday granted the administration's request to expedite its appeal of U.S. District Judge Derrick Watson's ruling.\nWatson last month indefinitely blocked President Donald Trump's executive order to suspend new visas for people in six Muslim-majority countries and halt the U.S. refugee program.\nThe White House believes Trump's executive order is legal and necessary for national security.\n___1:30 p.m.U.S. government attorneys want Hawaii's lawsuit challenging President Donald Trump's travel ban paused while a ruling blocking key sections is appealed.\nThe Department of Justice filed a motion Monday asking U.S. District Judge Derrick Watson to pause proceedings in Hawaii's lawsuit pending resolution of the government's appeal."}