{"url": "http://www.foxnews.com/opinion/2017/06/28/trumps-travel-ban-dont-be-fooled-supreme-court-handed-president-big-victory-this-week.html", "id": "38", "title": "Trump's travel ban: Don't be fooled, the Supreme Court handed the president a big victory this week", "text": "There seems to be some debate over the extent of the victory that the Trump administration won on Monday when the Supreme Court stayed (or lifted) almost all of the injunctions issued against his revised executive order temporarily suspending entry of foreigners from six terrorist safe havens. But there is no doubt about it – this was a significant and substantial victory despite the fact that the Court left a small portion of the injunctions issued by the Fourth and Ninth Circuit Courts of Appeal in place.\n\nThe Court accepted the case for review, and oral arguments on the substantive merits of the claims will be heard when the Court starts its new term in October. Most importantly for the national security and safety of the nation, the Court slapped down the appeals courts by dissolving large portions of the injunctions issued against the executive order until the Court hears the case.\n\nThe March 6 executive order suspended for 90 days the entry of foreigners from six terrorist safe havens -- Syria, Libya, Iran, Yemen, Somalia, and Sudan -– while the government determines if it has the vetting procedures in place to prevent terrorists from getting into the country. The executive order applied a 120-day suspension to refugees for the same purpose, and capped the number of refugees allowed into the country at 50,000.\n\nThe Court lifted the injunctions on foreigners or refugees who have no connection to the U.S. According to the Court, the “interest in preserving national security is ‘an urgent objective of the highest order’” and to prevent the government from “pursuing that objective” by not allowing these restrictions“against foreign nationals unconnected to the United States would appreciably injure its interests, without alleviating obvious hardship to anyone else.”\n\nBut the Court left in place the portion of the injunctions that would apply to any foreigner “who can credibly claim a bona fide relationship with a person or entity in the United States.”\n\nRelated Image Expand / Collapse\n\nSome have painted this as setback to the administration, but that is also not true – it simply recognizes the procedures that the Trump administration had already put in place.\n\nAs the Court pointed out, the executive order “itself distinguishes between foreign nationals who have some connection to this country, and foreign nationals who do not, by establishing a case-by-case waiver system primarily for the benefit of individuals in the former category.” Section 3(c) of the executive order provides special consideration for foreigners who have “significant contacts,” “significant business or professional obligations,” or family in the U.S., or who are admitted students or have employment offers in the country.\n\nThis is not much different than what the Court outlines would satisfy the “bona fide relationship” standard. The Court says that for individuals, “a close familial relationship is required.” For entities, “the relationship must be formal, documented, and formed in the ordinary course rather than for the purpose of evading” the executive order.\n\nThus, students admitted to American universities and workers “who accepted an offer of employment from an American company or a lecturer invited to address an American audience” would qualify.\n\nNo doubt to the annoyance of the advocacy groups who have filed these challenges, those who enter into a relationship “simply to avoid” the executive order will not qualify. For example, according to the Court, a “nonprofit group devoted to immigration issues may not contact foreign nationals from the designated countries, add them to client lists, and then secure their entry by claiming injury from their exclusion.”\n\nThe other important detail to keep in mind is that this does not mean that foreigners who meet the “bona fide relationship” requirement must be automatically granted a visa and admitted. They just have to be considered despite the ban on entry of other foreigners. Thus, the government will still be able to deny entry due to individual security issues or other problems that are routinely considered.\n\nSomething else that seems to have gotten lost in the reporting: this was a “per curiam” decision. That means that all nine justices agreed to lift the injunctions. The fact that none of the justices disagreed is another sign of how far out-of-line the lower court decisions were.\n\nThe only partial dissent by Justice Clarence Thomas (joined by Justices Samuel Alito and Neil Gorsuch) was to tell the Courtthat it should have lifted the injunctions in their entirety. He warned that the “bona fide relationship” standard set up by the Court will “invite a flood of litigation until this case is finally resolved on the merits, as parties and courts struggle to determine what exactly constitutes a ‘bona fide relationship,’ who precisely has a ‘credible claim’ to that relationship, and whether the claimed relationship was formed ‘simply to avoid’” the executive order.\n\nThomas, Alito and Gorsuch may be right about the flood of litigation, but we might have seen a similar such floodcontesting the very similar standards in the waiver program outlined in Section 3(c) of the executive order.\n\nThe bottom line is that the Supreme Court in large part agreed with the president. The tenor of this decision shows that the challengers will have a very hard time in the Fall convincing the Court that the president acted outside his statutory and constitutional authority. Or that federal judges should substitute their judgment for that of the president when it comes to national security.\n\nHans A. von Spakovsky is a Senior Legal Fellow at The Heritage Foundation and former Justice Department official. He is coauthor of “Who’s Counting? How Fraudsters and Bureaucrats Put Your Vote at Risk”.", "authors": ["Hans Von Spakovsky"], "publish_date": "2017-06-28", "source": "foxnews", "top_words": ["executive", "foreigners", "travel", "relationship", "fide", "nationals", "injunctions", "supreme", "dont", "bona", "handed", "court", "week", "trumps", "victory", "entry", "fooled", "order", "president"], "summary": "The executive order applied a 120-day suspension to refugees for the same purpose, and capped the number of refugees allowed into the country at 50,000.\nThe Court lifted the injunctions on foreigners or refugees who have no connection to the U.S.\nThis is not much different than what the Court outlines would satisfy the “bona fide relationship” standard.\nNo doubt to the annoyance of the advocacy groups who have filed these challenges, those who enter into a relationship “simply to avoid” the executive order will not qualify.\nThe fact that none of the justices disagreed is another sign of how far out-of-line the lower court decisions were."}