{"url": "http://www.foxnews.com/us/2017/03/09/look-at-legal-issues-with-trump-revised-travel-ban.html", "id": "329", "title": "A look at legal issues with Trump's revised travel ban", "text": "Some of the states that helped derail President Trump's first travel ban are mounting efforts to block his second one, saying that while the new order applies to fewer people, it's infected with the same legal problems.\n\nHawaii on Wednesday launched the first lawsuit over the revised order after amending an earlier complaint filed against the old ban. Massachusetts, New York and Oregon say they will join in when Washington and Minnesota do the same on Monday.\n\nIn the meantime, Washington Attorney General Bob Ferguson asked a federal judge Thursday in Seattle to find that the temporary restraining order he issued halting the first travel ban applies to the second one as well. If the judge agrees, the government would not be able to put the new ban into effect Wednesday as scheduled, without further action from the court.\n\nWith more legal challenges still to come, here's a look at the hurdles Trump's new travel ban faces.\n\n___\n\nSAME AS THE OLD BAN?\n\nWashington and Hawaii have made similar claims, arguing that Trump's travel ban is an effort to carry out the Muslim ban he promised during his campaign and a violation of the First Amendment, which bars the government from officially favoring or disfavoring any religion. In this regard, they say, the new ban is no better than the old.\n\nThey point to statements by Trump's advisers, including former New York Mayor Rudy Giuliani, who said Trump asked him how to implement a Muslim ban legally, and more recently Stephen Miller, who said the revised order was designed to have \"the same basic policy outcome\" as the first.\n\nThe new ban applies to refugees who are not already on their way to the United States and to people seeking new visas. Under the original ban, even people with valid visas and legal U.S. residents from the listed countries were barred from entering the country.\n\n\"The revised executive order does narrow the scope of who's impacted,\" Ferguson told a news conference Thursday. \"That does not change the underlying constitutional problems: If you're acting in an unconstitutional way — this is effectively a Muslim ban — the fact that it's a smaller group of individuals who are harmed does not change the analysis.\"\n\nWhen the 9th U.S. Circuit Court of Appeals upheld U.S. District Judge James Robart's order blocking the first travel ban, it did not resolve the states' First Amendment claim. But the judges referred to the states' argument as serious and significant.\n\nSome legal scholars have questioned the strength of the government's case on this point, noting that the order does not apply to all Muslims or even all predominantly Muslim nations — a point 9th Circuit Judge Richard Clifton made during oral arguments in Washington's case.\n\n___\n\nISN'T IT THE PRESIDENT'S JOB TO PROTECT THE COUNTRY?\n\nIt is, and the administration has argued that the travel ban is not about discrimination but national security. The revised order specifies that people coming from the listed countries — Somalia, Iran, Syria, Sudan, Libya and Yemen — \"warrant additional scrutiny in connection with our immigration policies because the conditions in these countries present heightened threats.\"\n\nBut as Hawaii pointed out in its lawsuit, intelligence analysts at the Department of Homeland Security have questioned that rationale, concluding that citizenship is an \"unlikely indicator\" of terrorist ties. Their report noted that since 2011, 82 people were inspired by a foreign terrorist group to try to carry out attacks in the United States. Half were native-born U.S. citizens. The rest came from 26 countries, with the most coming from Pakistan, which is not on the travel ban list.\n\nThat would seem to undermine the rationale for the travel ban, critics say.\n\nIn addition, the states and civil liberties groups have alleged another flaw: U.S. immigration law generally prohibits the government from discriminating based on nationality when issuing immigrant visas. The president cannot rewrite that law by executive order, the states argue.\n\nMatt Adams, legal director of the Northwest Immigrant Rights Project, said his organization plans to file an amended class-action complaint in Seattle federal court on Friday to challenge the new ban. He said the administration must consider who people are — not where they come from — in deciding whether to issue visas.\n\n___\n\nALOHA, TOURISM\n\nSome legal scholars have questioned whether states have standing to bring their cases, citing limits the Supreme Court has placed on when states can sue the federal government.\n\nMichael McConnell, a constitutional law professor at Stanford Law School, said in an email Thursday that he remains \"highly skeptical that states have standing to sue over this.\"\n\nThe 9th Circuit panel, however, found that Washington and Minnesota did have standing, at least at that early stage of the litigation. The judges noted that some people would not enter state universities or join the faculty at those universities, causing real harm for the states.\n\nHawaii focuses on an additional aspect of harm: the loss of tourism, and thus tax dollars, in the heavily travel-dependent state.\n\n\"I don't think standing's a serious problem,\" said Rory Little, a former Supreme Court clerk who teaches at the University of California Hastings College of the Law. \"There's clearly harm to state budgets, harm to state universities.\"", "authors": [], "publish_date": "2017-03-09", "source": "foxnews", "top_words": ["travel", "revised", "ban", "issues", "judge", "order", "trumps", "states", "muslim", "law", "look", "legal"], "summary": "Hawaii on Wednesday launched the first lawsuit over the revised order after amending an earlier complaint filed against the old ban.\nWith more legal challenges still to come, here's a look at the hurdles Trump's new travel ban faces.\nIt is, and the administration has argued that the travel ban is not about discrimination but national security.\nThe rest came from 26 countries, with the most coming from Pakistan, which is not on the travel ban list.\nThat would seem to undermine the rationale for the travel ban, critics say."}