{"url": "http://www.foxnews.com/us/2017/02/16/trump-seeks-to-end-legal-fight-with-revised-travel-ban.html", "id": "305", "title": "Trump seeks to end legal fight with revised travel ban", "text": "President Donald Trump's administration said in court documents on Thursday it wants an end to the legal fight over its ban on travelers from seven predominantly Muslim nations and will issue a replacement ban as it strives to protect the nation.\n\nDetails of the new proposal were not provided in the filing or at a wide-ranging news conference by Trump. But lawyers for the administration said in the filing that a ban that focuses solely on foreigners who have never entered the U.S. — instead of green card holders already in the U.S. or who have traveled abroad and want to return — would pose no legal difficulties.\n\n\"In so doing, the president will clear the way for immediately protecting the country rather than pursuing further, potentially time-consuming litigation,\" the filing said.\n\nTrump said at the news conference that a new order would come next week.\n\n\"I will not back down from defending our country. I got elected on defense of our country,\" he said.\n\nThe administration asked the 9th U.S. Circuit Court of Appeals to hold off on making any more decisions related to the lawsuit filed by the states of Washington and Minnesota until the new order is issued and then toss out the decision keeping the ban on hold.\n\nWashington state Attorney General Bob Ferguson said the federal government was \"conceding defeat\" by saying it does not want a larger appellate panel to review the decision made last week by a three-judge panel of the 9th Circuit. The judges rejected the Trump administration's claim of presidential authority and questioned its motives in ordering the ban.\n\nThe administration attacked the decision in Thursday's court filing, saying the panel wrongly suggested some foreigners were entitled to constitutional protections and that courts could consider Trump's campaign statements about a ban.\n\nThe lawsuit says the ban unconstitutionally blocked entry to the U.S. on the basis of religion and harmed residents, universities and sales tax revenue in the two states. Eighteen other states, including California and New York, supported the challenge.\n\nThe appeals court had asked the Trump administration and Washington and Minnesota to file arguments by Thursday on whether a larger panel of 9th Circuit judges should rehear the case.\n\nIn his filing with the 9th Circuit, Washington state Solicitor General Noah Purcell said the ruling by the three-judge panel was consistent with previous U.S. Supreme Court decisions, so there was no basis for a review.\n\nPurcell said Trump had campaigned on the promise to ban Muslims from entering the U.S. and one week into office issued the order that \"radically changed immigration policy\" and \"unleashed chaos around the world.\"\n\nThe three-judge panel said the states had raised \"serious\" allegations that the ban targets Muslims, and the courts could consider statements Trump had made about shutting down Muslim immigration.\n\nThe judges also rejected the federal government's argument that courts do not have the authority to review the president's immigration and national security decisions.\n\nThey said the Trump administration presented no evidence that any foreigner from the seven countries — Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen — was responsible for a terrorist attack in the U.S.\n\n___\n\nAssociated Press writer Martha Bellisle in Seattle contributed to this report.", "authors": [], "publish_date": "2017-02-16", "source": "foxnews", "top_words": ["travel", "administration", "seeks", "revised", "trump", "fight", "ban", "filing", "circuit", "court", "9th", "end", "states", "washington", "panel", "legal"], "summary": "President Donald Trump's administration said in court documents on Thursday it wants an end to the legal fight over its ban on travelers from seven predominantly Muslim nations and will issue a replacement ban as it strives to protect the nation.\nDetails of the new proposal were not provided in the filing or at a wide-ranging news conference by Trump.\nThe judges rejected the Trump administration's claim of presidential authority and questioned its motives in ordering the ban.\nThe appeals court had asked the Trump administration and Washington and Minnesota to file arguments by Thursday on whether a larger panel of 9th Circuit judges should rehear the case.\nThe three-judge panel said the states had raised \"serious\" allegations that the ban targets Muslims, and the courts could consider statements Trump had made about shutting down Muslim immigration."}