{"url": "http://www.foxnews.com/opinion/2017/05/28/trump-travel-ban-decision-politics-not-law-in-4th-circuit.html", "id": "31", "title": "Trump travel ban decision: Politics, not the law, in the 4th Circuit", "text": "With its embarrassing opinion in International Refugee Assistance Project v. Trump, the Fourth Circuit Court of Appeals has now joined the ranks of the Ninth Circuit as one of the most out-of-control federal courts in the nation. Its May 25 decision upholding the injunction against President Trump’s executive order implementing a temporary halt to entry of aliens from six terrorist countries was a political decision, not a legal decision.\n\nThe bias and prejudice that poisons the majority’s political diatribe is encapsulated in an outrageous statement made right on page one. There, Judge Roger Gregory claims that the text of the executive order “speaks with vague words of national security” but “in context drips with religious intolerance, animus, and discrimination.” Then he makes the astounding claim that the executive order violates the First Amendment because it establishes “a religious orthodoxy” and favors “one religion over another.” The rest of the opinion resides in the same imaginary, Alice-in-Wonderland world that Gregory and his cohorts have created in their own minds about this issue.\n\nHow any judge could review the descriptions of these countries and dismiss them as “vague” can't really be explained – other than as judges substituting their judgment for that of the president, our intelligence agencies, the State Department, and the Pentagon when it comes to our national security.\n\nExecutive Order 13,780 is very straightforward. I defy any objective individual to read the order and conclude that it establishes a religious orthodoxy or “drips with religious intolerance, animus, and discrimination.” Further, there have been no statements made by any government officials, government agents, or elected individuals – including the president – during the term of this administration that provide any evidence of such an intent. (What may or may not have been said by individuals during a campaign when they were not government officials and had no governmental authority has no bearing on the legality and constitutionality of this order – particularly given the applicable Supreme Court precedent.)\n\nJudge Gregory erroneously asserts that there are only insufficiently “vague words of national security” concerns in the executive order. In fact, it explains why the president was attempting to suspend temporarily – for only 90 days – the entry of aliens from six countries (Iran, Libya, Somalia, Sudan, Syria, and Yemen) while the Department of Homeland Security determined whether its vetting procedures were sufficient to prevent the entry of terrorists into the United States.\n\nAs the text outlines, three of these countries have been designated as state sponsors of terrorism: Iran, Syria, and Sudan. The other three have failing governments and are safe havens for terrorists. The problems this causes range from an inability to trust any information or identity documents these countries provide, to the “illicit flow of weapons…and foreign terrorist fighters” through these counties. Each of them is “a state sponsor of terrorism, has been significantly compromised by terrorist organizations, or contains active conflict zones.” Any of “these circumstances diminishes the foreign government’s willingness or ability to share or validate important information about individuals seeking to travel to the United States.’\n\nHow any judge could review the descriptions of these countries in the executive order and cavalierly dismiss the U.S. government’s concerns as “vague” and not sufficient cannot really be explained – other than as judges substituting their judgment and policy preferences for that of the president and our intelligence agencies, the State Department, and the Pentagon when it comes to our national security and the terrorism threat. And this decision by the Fourth Circuit would make any rational person question their judgment (which should really be referred to as misjudgment).\n\nThe three dissenting judges in this case, let by Judge Paul Niemeyer, point out the mistakes and deliberate errors made by the majority. As to the original district court that issued the injunction, Niemeyer outlines how that court “refused to apply Kleindienst v. Mandel…which held that courts are precluded from ‘look[ing] behind’ ‘facially legitimate and bona fide’ exercises of executive discretion in the immigration context to discern other possible motives.”\n\nThe U.S. Constitution “commits the power to make foreign policy, including the decision to permit or forbid entry into the United States, to the President and Congress.” It does not give that power to the unelected judges of the Fourth or Ninth Circuit Court of Appeals.\n\nThe district court, they also point out, “seriously erred” by “fabricating a new proposition of law – indeed, a new rule – that provides for the consideration of campaign statements to recast a later-issued executive order” and “by radically extending Supreme Court Establishment Clause precedents.” This “approach is not only unprecedented, it is totally unworkable and inappropriate under any standard of analysis.”\n\nMandel is the 1972 Supreme Court decision that governs any actions by Congress and the executive branch affecting aliens outside of our border who are seeking admission. This binding precedent severely limited the ability of courts to second-guess such a decision, holding that when the executive branch has exercised its authority to exclude aliens “on the basis of a facially legitimate and bona fide reason,” the courts cannot “look behind the exercise of that discretion, nor test it by balancing its justification against First Amendment interests” of the plaintiffs.\n\nWhile the district court ignored the Mandel holding, the Fourth Circuit majority (according to Niemeyer) simply “reworked” the district court’s analysis by “applying Mandel, albeit contrary to its holding, to defer only to the facial legitimacy of the Order but not to its facial bona fides, despite the Mandel Court’s holding.” Further, “the majority, after violating Mandel, then adopts the same new rule of law adopted by the district court to consider candidate Trump’s campaign statements to find the Executive Order’s stated reasons ‘pretext[ual]’…and then to rewrite the Order to find it in violation of the Establishment Clause.” That “too is unprecedented and unworkable.”\n\nThe Fourth Circuit has engaged in the same type of misbehavior that the Ninth Circuit did, as explained in a scathing dissent written by Ninth Circuit judges Jay Bybee, Alex Kozinski, Consuelo Callahan, Carlos Bea and Sandra Ikuta. As those judges said in that case, the U.S. Constitution “commits the power to make foreign policy, including the decision to permit or forbid entry into the United States, to the President and Congress.” It does not give that power to the unelected judges of the Fourth or Ninth Circuit Court of Appeals.\n\nDespite what these courts say, the president’s executive order is lawful and fully within the constitutional authority delegated to him by Congress. It is not discriminatory and it does not violate the First Amendment. When all of these cases finally get to the Supreme Court, the Court will hopefully follow its own binding precedents and reverse all of these wrongly decided decisions. A contrary result would deeply damage our constitutional structure and endanger the safety of the nation.\n\nHans A. von Spakovsky is a Senior Legal Fellow at The Heritage Foundation and former Justice Department official. He is coauthor of “Who’s Counting? How Fraudsters and Bureaucrats Put Your Vote at Risk”.", "authors": ["Hans Von Spakovsky"], "publish_date": "2017-05-28", "source": "foxnews", "top_words": ["executive", "travel", "judges", "trump", "courts", "ban", "circuit", "fourth", "4th", "court", "countries", "order", "president", "politics", "law", "decision"], "summary": "With its embarrassing opinion in International Refugee Assistance Project v. Trump, the Fourth Circuit Court of Appeals has now joined the ranks of the Ninth Circuit as one of the most out-of-control federal courts in the nation.\nIts May 25 decision upholding the injunction against President Trump’s executive order implementing a temporary halt to entry of aliens from six terrorist countries was a political decision, not a legal decision.\nExecutive Order 13,780 is very straightforward.\nJudge Gregory erroneously asserts that there are only insufficiently “vague words of national security” concerns in the executive order.\nAnd this decision by the Fourth Circuit would make any rational person question their judgment (which should really be referred to as misjudgment)."}