{"url": "http://www.foxnews.com/us/2017/06/29/analysis-trumps-travel-ban-far-cry-from-original.html", "id": "431", "title": "Analysis: Trump's travel ban a far cry from original", "text": "With President Donald Trump's travel ban taking effect Thursday, the White House declared victory on the first major policy push of his presidency. But it could not have been the win Trump imagined.\n\nWhat was once described as a blanket ban on Muslims, then became a temporary ban on visitors from seven majority-Muslim countries, is now a list of confusing new visa restrictions. Trump's eye-popping campaign promise to deliver security by limiting entry into the U.S. has become the incredible shrinking travel ban, a plan rewritten, tweaked, watered down and litigated nearly beyond recognition.\n\nAll but lost in the five-month editing process and court fight is the president's stated aim: keeping dangerous people out of the U.S. Trump initially billed the temporary ban on visitors from certain countries and refugees as an urgent and necessary tool to keep out would-be terrorists while the government crafted new \"extreme vetting\" procedures. But five months and no ban later, the administration has made little effort to build a stronger case and offered scant new evidence to back up its claims.\n\nThe restrictions that took effect Thursday evening, reinstated temporarily by the Supreme Court, are a far cry from Trump's initial executive order, which sparked protests, chaos at airports and legal challenges in his administration's earliest days. That order was withdrawn after being replaced with a version that Trump himself described as \"watered down\" and \"politically correct.\"\n\n\"What the Supreme Court did was watered it down even further,\" Kari Hong, an immigration law expert at Boston College Law School, said of the version that took effect.\n\nThe justices' ruling exempts people if they can prove a \"bona fide relationship\" with a U.S. person or entity. Under State Department guidelines, visa applicants from six Muslim-majority countries for the next 90 days need to show close family or business ties to the United States. Citizens of Syria, Sudan, Somalia, Libya, Iran and Yemen with a parent, spouse, fiancé, child, adult son or daughter, son-in-law, daughter-in-law or sibling already in the United States could be allowed to enter.\n\nJournalists, students, workers or lecturers who have valid, formal invitations or employment contracts in the U.S. are exempt from the ban.\n\nThe same requirements, with some exceptions, apply for the next 120 days to refugees from all nations who are still awaiting approval.\n\nExperts aren't expecting large numbers of people to be immediately affected. Temple University law professor Peter Spiro, an immigration law expert, noted the numbers are difficult to predict because of likely legal challenges over the interpretation of the term \"bona fide,\" which the court did not define.\n\nWhile Trump declared the court ruling a \"win,\" his administration did not lay out a clear case for the national security merits of the plan.\n\nIn a conference call with reporters Thursday, only one of five administration officials — one representing the White House — couched the Supreme Court order as a step that will have a marked impact on improving national security. The other four officials, from the departments of State, Justice and Homeland Security, described the actions more narrowly.\n\nAsked specifically how the measures would improve security, a State Department official said only, \"The guidance we have from the president is to put a pause on certain travel while we review our security posture.\"\n\nThe officials all spoke on condition of anonymity despite describing a public executive order.\n\nThe White House sees the Supreme Court decision as a temporary measure, and is confident it will win on the merits when the court hears the case later this year.\n\nJohn Malcolm, a vice president at the conservative Heritage Foundation, said the Supreme Court's decision to allow parts of the ban to take effect and to hear the case was a good sign for those who support the ban.\n\n\"I think it sends a strong signal that the president is likely to prevail. As I think he should,\" Malcolm said, adding that he believed the court was allowing \"90 percent\" of what the president initially set out to do to take effect.\n\nBut it remains unclear whether even the original ban would have improved security.\n\nNational security experts have warned that the proposal alienated moderate Muslims and turned off allies who the U.S. relies on in the fight against extremist groups.\n\nThe Homeland Security Department's intelligence arm found in February that citizenship is an \"unlikely indicator\" for a terrorism threat to the United States. A draft report obtained by The Associated Press said few people from the six countries affected by the ban have carried out attacks or been involved in terrorism-related activities in the U.S. since the start of the Syrian civil war in 2011. The government said the draft report was \"from a single intelligence source versus an official, robust document\" and said it was incomplete.\n\nSpiro said the travel ban has been \"absurd from the get-go and it's no less absurd now.\" He argued that any national security ends could be accomplished with a much narrower focus on people who have historically posed a risk. \"It's all about politics. It has nothing to do with security and counter-terrorism activities,\" he said.\n\n___\n\nAP Diplomatic Writer Matthew Lee contributed to this report.\n\n__\n\nFollow Colvin and Caldwell on Twitter at https://twitter.com/colvinj and www.twitter.com/acaldwellap", "authors": ["Jill Colvin", "Alicia A. Caldwell"], "publish_date": "2017-06-29", "source": "foxnews", "top_words": ["original", "travel", "case", "trump", "ban", "supreme", "security", "analysis", "court", "cry", "trumps", "countries", "president", "far", "law"], "summary": "With President Donald Trump's travel ban taking effect Thursday, the White House declared victory on the first major policy push of his presidency.\nTrump's eye-popping campaign promise to deliver security by limiting entry into the U.S. has become the incredible shrinking travel ban, a plan rewritten, tweaked, watered down and litigated nearly beyond recognition.\nThe restrictions that took effect Thursday evening, reinstated temporarily by the Supreme Court, are a far cry from Trump's initial executive order, which sparked protests, chaos at airports and legal challenges in his administration's earliest days.\n\"What the Supreme Court did was watered it down even further,\" Kari Hong, an immigration law expert at Boston College Law School, said of the version that took effect.\nSpiro said the travel ban has been \"absurd from the get-go and it's no less absurd now.\""}