{"url": "http://www.foxnews.com/us/2017/06/05/latest-travel-ban-critics-say-trump-is-hurting-his-case.html", "id": "400", "title": "The Latest: Critics say Trump tweets may undercut legal case", "text": "The Latest on President Trump's proposed travel ban on certain countries (all times local):\n\n12:15 p.m.\n\nThe husband of senior White House adviser Kellyanne Conway is taking to Twitter to criticize President Donald Trump's tweets about the administration's travel ban that has been blocked by federal courts and is now in front of the Supreme Court.\n\nNew York lawyer George T. Conway III says Trump's Monday tweets taking aim at the Justice Department \"may make some ppl feel better,\" but won't help win a majority in the Supreme Court. Conway said the outcome at the high court \"is what actually matters.\"\n\nHe takes a page from Trump's playbook to brand the whole thing, \"Sad.\"\n\nGeorge Conway had been considered for at least two high-ranking Justice Department jobs, including Solicitor General. That's the lawyer who represents the president at the Supreme Court.\n\nKellyanne Conway on Monday condemned what she called the media's \"obsession with covering everything (Trump) says on Twitter and very little of what he does as president.\"\n\n___\n\n11 a.m.\n\nCritics of President Donald Trump's stalled travel ban say he may have undercut the government's defense of the measure when he bashed the Justice Department for asking the Supreme Court to review a \"watered-down\" version of the ban.\n\nIn a series of Monday morning tweets, Trump says the Justice Department \"should have stayed\" with his first executive order aimed at temporarily halting entry to the U.S. from a half-dozen Muslim majority countries.\n\nThe revised order narrowed the scope of the original, but both have been blocked by lower courts. The Trump administration asked the Supreme Court to reinstate the ban.\n\nAttorneys who sued are saying Trump's comments will help their case. Law professor Josh Blackman called Trump \"the worst client\" for the Justice Department's solicitor general.\n\nThe department declined comment.\n\n___\n\n6:50 a.m.\n\nPresident Donald Trump is criticizing his own Justice Department for asking the Supreme Court to review a \"watered down, politically correct version\" of the travel ban he signed in March.\n\nIn a series of morning tweets, Trump says the Justice Department \"should have stayed\" with the first travel ban executive order. Both orders, aimed at temporarily halting entry to the U.S. from a half-dozen Muslim-majority countries, have been blocked by the lower courts.\n\nThe March directive narrowed the scope of the original order, which was hastily unveiled during Trump's first week in office.\n\nTrump says the Justice Department should ask for an \"expedited hearing\" on the second ban and \"seek much tougher version!\"\n\nThe president has stepped up his calls for implementing the travel ban following the weekend attacks in London.", "authors": [], "publish_date": "2017-06-05", "source": "foxnews", "top_words": ["travel", "case", "trump", "tweets", "ban", "supreme", "conway", "court", "undercut", "say", "trumps", "justice", "latest", "president", "department", "critics", "legal"], "summary": "The Latest on President Trump's proposed travel ban on certain countries (all times local):12:15 p.m.\nGeorge Conway had been considered for at least two high-ranking Justice Department jobs, including Solicitor General.\nIn a series of morning tweets, Trump says the Justice Department \"should have stayed\" with the first travel ban executive order.\nTrump says the Justice Department should ask for an \"expedited hearing\" on the second ban and \"seek much tougher version!\"\nThe president has stepped up his calls for implementing the travel ban following the weekend attacks in London."}