{"url": "http://www.foxnews.com/politics/2017/01/29/protests-against-travel-ban-continue-for-second-straight-day.html", "id": "45", "title": "Protests against travel ban continue for second straight day", "text": "Demonstrators gathered at the White House and numerous airports around the country Sunday to protest President Trump’s executive order placing temporary travel restrictions on people coming from seven Muslim-majority countries and halting the acceptance of refugees.\n\nRep. Hakeem Jeffries, D-N.Y., called the executive order a “reckless, unconstitutional, unsavory, un-American effort.” He also questioned why some predominantly Muslim countries were listed but others were not.\n\n“If this order was really about trying to make America the safest country it can be, then why were some countries left off the order? Most notably Saudi Arabia?” Jeffries said during a news conference at JFK. “...Is it because the Trump organization exists in Saudi Arabia?”\n\nBOOKER ALLEGES EXECUTIVE ORDER IS A MUSLIM BAN\n\n\n\nJeffries was one of several members of Congress who descended upon American airports to join protesters in registering their displeasure with Trump’s actions. Sen. Cory Booker, D-N.J., earlier Sunday spoke to demonstrators at Dulles International Airport and said he would also go to Newark Airport. Senate Minority Leader Chuck Schumer, D-N.Y., held a press conference with some of those who had been temporarily detained at JFK Airport in New York.\n\n“The entire executive order is a farce,” Jeffries said. “It’s a smokescreen. It has nothing to do with trying to keep this country safe.”\n\nOutside the White House a large crowd gathered chanting “No hate, no fear, refugees are welcome here” and “no wall, no ban.” Some estimates placed the crowd size at at least 1,000 people.\n\nIn California, the San Francisco International Airport itself released a statement expressing “concerns” over Trump’s executive action.\n\n“We share these concerns deeply, as our highest obligation is to the millions of people from around the world whom we serve,” the statement said. “…We are also making supplies available to travelers affected by this Executive Order, as well as to the members of the public who have so bravely taken a stand against this action by speaking publicly in our facilities.”\n\nOther protests Sunday were occurring in Battery Park in Manhattan, in Boston and in Raleigh, N.C. Sen. Kirsten Gillibrand, D-N.Y., said on Twitter she would join the Battery Park protests.", "authors": [], "publish_date": "2017-01-29", "source": "foxnews", "top_words": ["executive", "protests", "travel", "airport", "second", "day", "ban", "straight", "trumps", "country", "countries", "jeffries", "continue", "order", "white", "trying", "dny"], "summary": "Demonstrators gathered at the White House and numerous airports around the country Sunday to protest President Trump’s executive order placing temporary travel restrictions on people coming from seven Muslim-majority countries and halting the acceptance of refugees.\nRep. Hakeem Jeffries, D-N.Y., called the executive order a “reckless, unconstitutional, unsavory, un-American effort.” He also questioned why some predominantly Muslim countries were listed but others were not.\n“If this order was really about trying to make America the safest country it can be, then why were some countries left off the order?\n“The entire executive order is a farce,” Jeffries said.\nIn California, the San Francisco International Airport itself released a statement expressing “concerns” over Trump’s executive action."}