{"url": "http://www.foxnews.com/world/2017/01/31/populist-geert-wilders-praises-donald-trump-travel-bans.html", "id": "468", "title": "Populist Geert Wilders praises Donald Trump's travel bans", "text": "Anti-Islam lawmaker Geert Wilders clashed in the Dutch Parliament Tuesday with the foreign minister over U.S. President Donald Trump's travel ban for people from seven Muslim nations.\n\nWilders — seen by many as a Dutch equivalent of Trump — paid tribute to the new U.S. leader, saying, \"Finally America has a president, finally a country in the West has a president, who not only lives up to his promises but who says 'the freedom of my citizens is more important than anything.'\"\n\nForeign Minister Bert Koenders hit back. \"If you want to fight terror, then the worst thing you can do is trample human rights,\" he said.\n\nThe heated debate foreshadows what is likely to be a highly charged campaign ahead of national elections on March 15. Wilders' Party for Freedom, which currently holds 12 seats in Parliament's lower house, is polling strongly ahead of the vote.\n\nWilders' party has long advocated banning migration to the Netherlands from Muslim nations and even called on Trump in a tweet over the weekend to extend his ban to Saudi Arabia.\n\n\"President Trump has, in two weeks, pursued an immigration policy that is more effective than your entire Cabinet for as long as you have existed,\" Wilders told Koenders.\n\nThe Dutch government, meanwhile, has been pushing back at some of Trump's policies since he took office. On Tuesday, Koenders also said he was suspending talks with the U.S. about placing American border checks at Amsterdam's Schiphol Airport.\n\nDutch authorities also updated their official travel advisory for the U.S. to warn of the effects of Trump's new policy on Dutch citizens who have dual nationality with one of the seven nations affected.\n\nIn another move, the government announced on Saturday it is putting 10 million euros ($10.7 million) into an international fund it has launched to finance access to birth control, abortion and sex education for women in developing nations after Trump cut U.S. funding for such services.", "authors": [], "publish_date": "2017-01-31", "source": "foxnews", "top_words": ["geert", "travel", "seven", "wilders", "trump", "praises", "donald", "dutch", "trumps", "nations", "populist", "party", "bans", "president", "policy"], "summary": "Anti-Islam lawmaker Geert Wilders clashed in the Dutch Parliament Tuesday with the foreign minister over U.S. President Donald Trump's travel ban for people from seven Muslim nations.\nWilders' Party for Freedom, which currently holds 12 seats in Parliament's lower house, is polling strongly ahead of the vote.\n\"President Trump has, in two weeks, pursued an immigration policy that is more effective than your entire Cabinet for as long as you have existed,\" Wilders told Koenders.\nThe Dutch government, meanwhile, has been pushing back at some of Trump's policies since he took office.\nDutch authorities also updated their official travel advisory for the U.S. to warn of the effects of Trump's new policy on Dutch citizens who have dual nationality with one of the seven nations affected."}