{"url": "http://www.foxnews.com/us/2017/06/30/latest-iran-top-diplomat-us-ban-targets-grandmothers.html", "id": "437", "title": "The Latest: Iran says US travel ban 'truly shameful'", "text": "The Latest on the Trump administration's revived travel ban for visitors from six mostly Muslim countries (all times local):\n\n5:55 a.m.\n\nIran's foreign minister has denounced the partial reinstatement of President Donald Trump's travel ban as a \"truly shameful exhibition of blind hostility to all Iranians\" — and a measure that will prevent Iranian grandmothers from seeing their grandchildren in America.\n\nFriday's remarks by Mohammad Javad Zarif came after the Trump administration set criteria for visa applicants from the six Muslim-majority nations and all refugees that require a \"close\" family or business tie to the United States.\n\nThe guidelines sent to U.S. embassies and consulates initially said applicants must prove a relationship with a parent, spouse, child, adult son or daughter, son-in-law, daughter-in-law or sibling in the U.S. Later, the State Department and the Homeland Security Department added \"fiancé\" to that definition of \"close familial relationship\" — but not grandparents or grandchildren.\n\nZarif, who has persistently assailed the travel ban, wrote on his Twitter account that the \"U.S. now bans Iranian grandmothers from seeing their grandchildren, in a truly shameful exhibition of blind hostility to all Iranians.\"\n\n___\n\n4:10 a.m.\n\nThe scaled-back version of President Donald Trump's travel ban is likely to generate a new round of court battles.\n\nThe new rules took effect Thursday evening but didn't spark the protests and chaos at airports around the world that marked the original order last January.\n\nInstead of an outright ban as once proposed, the new rules tighten already-tough visa policies affecting citizens from six Muslim-majority countries. Refugees are covered as well.\n\nCustoms and Border Protection spokesman Dan Hetlage says his agency expects business as usual at ports of entry, with all valid visa holders still being able to travel.\n\nNonetheless, immigration and refugee advocates are vowing to challenge the new requirements.\n\nThe Trump administration has struggled to explain how they immigration policy will make the United States safer.", "authors": [], "publish_date": "2017-06-30", "source": "foxnews", "top_words": ["iran", "travel", "trump", "ban", "visa", "rules", "united", "trumps", "shameful", "truly", "seeing", "latest"], "summary": "The Latest on the Trump administration's revived travel ban for visitors from six mostly Muslim countries (all times local):5:55 a.m.Iran's foreign minister has denounced the partial reinstatement of President Donald Trump's travel ban as a \"truly shameful exhibition of blind hostility to all Iranians\" — and a measure that will prevent Iranian grandmothers from seeing their grandchildren in America.\nZarif, who has persistently assailed the travel ban, wrote on his Twitter account that the \"U.S. now bans Iranian grandmothers from seeing their grandchildren, in a truly shameful exhibition of blind hostility to all Iranians.\"\nThe scaled-back version of President Donald Trump's travel ban is likely to generate a new round of court battles.\nInstead of an outright ban as once proposed, the new rules tighten already-tough visa policies affecting citizens from six Muslim-majority countries.\nThe Trump administration has struggled to explain how they immigration policy will make the United States safer."}