{"url": "http://www.foxnews.com/world/2017/01/30/ap-analysis-trump-travel-ban-risks-straining-mideast-ties.html", "id": "465", "title": "AP Analysis: Trump travel ban risks straining Mideast ties", "text": "Just two days after banning travelers from seven Muslim-majority nations, U.S. President Donald Trump invited the Saudi monarch, whose kingdom includes Islam's holiest sites, to fly to Washington.\n\nIt points to the delicate balancing act Trump faces as he tries to deliver on campaign promises to exterminate \"radical Islamic terrorism\" without endangering political and economic ties with U.S. allies in the region, including some where the Trump Organization has business interests.\n\nThe executive order could upend gains on the battlefields of Mosul, where U.S. forces aid Iraqi commandos, or scuttle billions of dollars' worth of American aircraft sales to Tehran. Trump has vigorously defended the ban, saying it is only \"about terror and keeping our country safe.\"\n\nTraditional American allies in the region have kept largely silent about the ban. Many welcome tougher action against Iran, one of the seven countries included in the executive order. But any move to expand the ban to other countries will undoubtedly inflame public opinion and could force them to respond in kind.\n\n\"Such selective and discriminatory acts will only serve to embolden the radical narratives of extremists and will provide further fuel to the advocates of violence and terrorism at a critical time,\" the Organization of Islamic Cooperation said Monday.\n\nThe 57-nation bloc urged the U.S. to reconsider the policy \"and maintain its moral obligation to provide leadership and hope at a time of great uncertainty and unrest in the world.\"\n\nThe warning came hours after Trump called Saudi King Salman and Abu Dhabi's powerful crown prince, Sheikh Mohamed bin Zayed Al Nahyan, the likely future president of the United Arab Emirates. King Salman also invited Trump to visit Saudi Arabia.\n\nOfficial regional government reaction has been muted to the 90-day ban on travel to the U.S. by citizens of Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen. The order also suspends refugee admissions for 120 days and indefinitely bars the processing of refugees from Syria.\n\nOPEC members Saudi Arabia and the UAE, the Arab world's largest economies, have bought billions of dollars' worth of weapons from the U.S., and thousands of U.S. troops remain stationed across the region.\n\nSeveral Arab allies of the U.S. have carried out airstrikes against the Islamic State group and, more vitally, allow access to air bases and seaports supporting the bombing, reconnaissance and refueling runs over Iraq and Syria.\n\nIraq, which is on the front lines in the fight against Islamic State group, is just over a third of the way through acquiring three dozen American-made F-16 fighters. It's unclear how the ban will affect the Iraqi pilots, who are trained in the U.S.\n\nThe Iraqi Air Force Commander, Lt. Gen. Anwar Hama Amin, said the military has yet to receive a \"clear response\" on whether the ban applies to members of the Iraqi security forces.\n\n\"I'm worried and surprised,\" he said. \"We are fighting terrorism and this order will affect the fighting. ... I hope this order will be reconsidered.\"\n\nThe U.S. Central Command did not respond to a request for comment.\n\nU.S. Sens. John McCain and Lindsey Graham, both Republicans and retired military officers, have warned Trump's immigration order could become \"a self-inflicted wound in the fight against terrorism.\"\n\nIntelligence-sharing and counterterrorism partnerships with Arab allies could also be threatened by a souring of relations.\n\nThe UAE, for example, hosts a digital communications center focused on countering IS propaganda, and in coordination with Saudi intelligence was instrumental in thwarting a 2010 plot to blow up two U.S.-bound cargo planes.\n\nThat tight relationship makes it easier for Trump to do business in a country like the UAE, a market his company has tried to break into for over a decade. A Trump-branded golf course is set to open soon in Dubai, and another is in the works.\n\nThe Trump Organization also sought business in Egypt, Qatar and Saudi Arabia before he became president. All but four of the Sept. 11 hijackers came from Saudi Arabia, while two came from the UAE. Turkey, which is home to the Trump Towers Istanbul, has been hit by a string of deadly attacks.\n\nBahrain and Kuwait have booked space in the new Trump International Hotel in Washington, while Trump Tower in New York collects rent from the tourist office of Abu Dhabi. Trump announced plans to separate himself from his company earlier this month, handing its management over to his two adult sons, but ethics experts have said conflicts of interest could remain.\n\nEven more is at stake when it comes to American jobs and investors. The Middle East is a major buyer of big-ticket, American goods, from fighter planes and missiles to turbines, cars and construction equipment. American exports to the United Arab Emirates alone topped $20 billion annually for the past five years.\n\nBoeing Co. has sealed billions of dollars' worth of deals with Middle Eastern airlines, including Dubai-based Emirates, the region's largest carrier.\n\nThe Chicago-based plane maker completed a $16.6 billion agreement for 80 jetliners with Iran last month, a deal made possible by the 2015 nuclear accord, which Trump has at times threated to scrap or renegotiate.\n\nThe Gulf states, which view Iran as their biggest regional rival, are unlikely to object to its inclusion in the travel ban. But any expansion of the visa restrictions to other countries could provoke a backlash.\n\nAbu Dhabi's state-owned The National newspaper has already objected to the immigration order, saying it is \"not just disrespectful to those who have given their lives, but it also weakens the very alliances needed to stop further attacks in the Middle East and in the U.S.\"\n\n___\n\nEDITOR'S NOTE: Adam Schreck, the Gulf news director for The Associated Press, has reported from across the Middle East since 2008. Jon Gambrell, an AP reporter since 2006, has covered the Mideast from Cairo and Dubai, United Arab Emirates, since 2013. Associated Press writer Qassim Abdul-Zahra in Baghdad contributed.\n\n___\n\nFollow Adam Schreck on Twitter at www.twitter.com/adamschreck . Follow Jon Gambrell on Twitter at www.twitter.com/jongambrellap .", "authors": [], "publish_date": "2017-01-30", "source": "foxnews", "top_words": ["ap", "travel", "middle", "iraqi", "trump", "ban", "analysis", "american", "straining", "ties", "risks", "arab", "uae", "order", "mideast", "islamic", "saudi"], "summary": "Trump has vigorously defended the ban, saying it is only \"about terror and keeping our country safe.\"\nBut any move to expand the ban to other countries will undoubtedly inflame public opinion and could force them to respond in kind.\nIt's unclear how the ban will affect the Iraqi pilots, who are trained in the U.S.\nThe Gulf states, which view Iran as their biggest regional rival, are unlikely to object to its inclusion in the travel ban.\nJon Gambrell, an AP reporter since 2006, has covered the Mideast from Cairo and Dubai, United Arab Emirates, since 2013."}