{"url": "http://www.foxnews.com/world/2017/01/30/premier-trump-ban-doesnt-affect-australia-passport-holders.html", "id": "467", "title": "Premier: Trump ban doesn't affect Australia passport holders", "text": "The White House had assured Australia that its passport holders won't be affected by President Donald Trump's executive order suspending immigration from seven Muslim-majority countries, the Australian prime minister said Tuesday as he resisted pressure to join other Western leaders in publicly denouncing the travel ban.\n\nPrime Minister Malcolm Turnbull made the announcement after 15-year-old Pouya Ghadirian said the U.S. Consulate in Melbourne refused him a visa Monday to go on a school trip to the United States because he had an Iranian passport as well as an Australian passport.\n\n\"Our ambassador has just called me to say that he's had assurances, confirmation from the White House, that Australian passport-holders — regardless of their place of birth or whether they are dual nationals or whether they hold another passport — will remain welcome to come and go to the United States in the usual way,\" Turnbull told Sky News television.\n\nTurnbull said the case of Ghadirian, who was born in Melbourne to Iranian parents, could be reconsidered by American authorities, although he was not familiar with the reasons behind the visa refusal.\n\nTrump signed an executive order last week banning immigration for citizens of seven Muslim-majority nations, including Iran, for 90 days.\n\nTurnbull has rejected calls from political opponents to condemn the order as leaders of Germany, Britain, France and Canada have done. Turnbull said he would not publicly comment on U.S. domestic policy.\n\n\"When I have frank advice to give to an American president, I give it privately, as good friends should, as wise prime ministers do when they want to ensure they are best able to protect Australians and Australia's national interest,\" Turnbull told reporters.\n\n\"Others can engage in commentary. My job is to stand up for Australia, Australian interests and deliver. That's what we've done today,\" he added, referring to the Australian exemption from the executive order.\n\nOpposition Leader Bill Shorten, who last May said \"Trump's views are just barking mad on some issues,\" told the National Press Club on Tuesday that Turnbull's silence could be interpreted as agreement.\n\n\"The job of prime minister is not worth having if you won't stand up for what you believe in,\" Shorten said.\n\nSome observers suspect Turnbull has held his tongue because he is grateful to Trump for agreeing last weekend to keep an Obama administration promise to resettle mostly Muslim refugees rejected by Australia.\n\nThe Obama administration had agreed to resettle an unspecified number of refugees held on the Pacific island nations of Nauru and Papua New Guinea. Australia refuses to resettle any refuge who comes by boat.\n\nThe agreement had seemed to be in doubt under the Republican administration because of Trump's comments about Muslim immigration.\n\nTurnbull on Tuesday described Trump agreeing to resettle the refugees — mostly from Africa, Asia and the Middle East — as \"a very good result.\"", "authors": [], "publish_date": "2017-01-30", "source": "foxnews", "top_words": ["australia", "trump", "ban", "holders", "passport", "affect", "turnbull", "resettle", "told", "order", "trumps", "prime", "refugees", "premier", "doesnt", "minister", "australian"], "summary": "The White House had assured Australia that its passport holders won't be affected by President Donald Trump's executive order suspending immigration from seven Muslim-majority countries, the Australian prime minister said Tuesday as he resisted pressure to join other Western leaders in publicly denouncing the travel ban.\nTrump signed an executive order last week banning immigration for citizens of seven Muslim-majority nations, including Iran, for 90 days.\n\"The job of prime minister is not worth having if you won't stand up for what you believe in,\" Shorten said.\nThe agreement had seemed to be in doubt under the Republican administration because of Trump's comments about Muslim immigration.\nTurnbull on Tuesday described Trump agreeing to resettle the refugees — mostly from Africa, Asia and the Middle East — as \"a very good result.\""}