{"url": "http://www.foxnews.com/us/2017/07/07/latest-appeals-court-wont-weigh-in-on-travel-ban-rules.html", "id": "447", "title": "The Latest: Appeals court won't weigh in on travel ban rules", "text": "The Latest on Hawaii appealing a federal judge's decision on Trump's travel ban rules (all times local):\n\n4:35 p.m.\n\nA federal appeals court has dismissed Hawaii's attempt to challenge Trump administration rules for a travel ban on citizens from six majority-Muslim countries.\n\nThe 9th U.S. Circuit Court of Appeals said Friday that it doesn't have jurisdiction to address the issue.\n\nHawaii objected to the government omitting grandparents, aunts and uncles, and other relatives of someone in the U.S. from the list of people who can still travel to the country.\n\nA federal judge denied Hawaii's request to clarify who is exempt, saying the question would be better posed to the Supreme Court. The state then appealed to the 9th Circuit.\n\nThe justices said a close family relationship or ties to a business in the U.S. was required to enter the country.\n\nThe Hawaii attorney general's office says it's reviewing the 9th Circuit's decision.\n\n___\n\n8:30 a.m.\n\nThe state of Hawaii is appealing a federal judge's decision to leave Trump administration rules in place for a travel ban on citizens from six majority-Muslim countries.\n\nHawaii filed documents Friday with the 9th U.S. Circuit Court of Appeals, hoping it will weigh in on who's exempt from the ban.\n\nThe state has objected to the administration omitting grandparents, aunts and uncles from the list of people who can still travel to the United States.\n\nHawaii asked U.S. District Court Judge Derrick Watson to clarify who is exempt. Watson denied the request Thursday, saying the question would be better posed to the Supreme Court.\n\nThe justices said in June that those with a credible claim of a \"bona fide relationship\" with a person or entity in the U.S. could enter.", "authors": [], "publish_date": "2017-07-07", "source": "foxnews", "top_words": ["travel", "hawaii", "exempt", "ban", "appeals", "state", "rules", "court", "9th", "federal", "wont", "latest", "weigh"], "summary": "The Latest on Hawaii appealing a federal judge's decision on Trump's travel ban rules (all times local):4:35 p.m.A federal appeals court has dismissed Hawaii's attempt to challenge Trump administration rules for a travel ban on citizens from six majority-Muslim countries.\nCircuit Court of Appeals said Friday that it doesn't have jurisdiction to address the issue.\nA federal judge denied Hawaii's request to clarify who is exempt, saying the question would be better posed to the Supreme Court.\nThe state of Hawaii is appealing a federal judge's decision to leave Trump administration rules in place for a travel ban on citizens from six majority-Muslim countries.\nCircuit Court of Appeals, hoping it will weigh in on who's exempt from the ban."}