{"url": "http://www.foxnews.com/politics/2017/01/29/protests-erupt-at-airports-around-u-s-following-trump-travel-ban.html", "id": "47", "title": "Protests erupt at airports around the U.S. following Trump travel ban", "text": "President Donald Trump's travel ban barring citizens of seven predominantly Muslim nations entry into the U.S. has sparked protests around the country.\n\n\n\nA federal judge in New York Saturday night issued an emergency order temporarily barring the U.S. from deporting people who arrived with valid visas or an approved refugee application. But Trump's immigration ban caused chaos earlier in the day.\n\nLawyers and advocates working at the airport said they didn't have a hard count on the number of people taken into custody after getting off their flights.\n\nMany took to Twitter to express their frustrations with the ban, including former Democratic nominee Hillary Clinton. Clinton said she stands with those across the nation, adding, “This is not who we are.”\n\nI stand with the people gathered across the country tonight defending our values & our Constitution. This is not who we are. — Hillary Clinton (@HillaryClinton) January 29, 2017\n\n“Today's actions have tarnished America’s standing as a beacon of hope for the free world, and there has been scant credible and confirmed information available throughout the day about the impact of the president's executive order or those detained.” Chicago’s Mayor Rahm Emanuel said in a statement. He added, “I am calling on the federal government to immediately produce a list of the names of anyone currently being detained at O'Hare or Midway Airports, and calling on those unjustly affected to immediately be released and allowed to access legal counsel.”\n\nThe order barred U.S. border agents from removing anyone who arrived in the U.S. with a valid visa from Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nTwo members of Congress, New York Democrats Jerrold Nadler and Nydia Velazquez, joined several hundred protesters who spent part of the day at Kennedy airport trying to win the release of about a dozen people they said had been detained.\n\nNadler (D-Manhattan) and Velazquez (D-Brooklyn) announced the number of refugees held at the airport. “This should not happen in America. We shouldn’t have to demand the release of refugees one by one,” the two members of Congress said in a statement.\n\nProtests around the country, ranged from a few dozen people to thousands of demonstrators.\n\nAt Los Angeles International Airport, lawyer Talia Inlender said an Iranian woman was detained after arriving on a flight from Amsterdam with her 1-year-old American son. Inlender said she had been approved to become an American citizen and was scheduled to take her naturalization oath in February.\n\nTrump said the goal of the temporary travel restriction was to keep out potential terrorists.\n\nHundreds of protesters blocked the street outside at San Francisco International Airport's international terminal to express their opposition to the barring of some people from Muslim-majority nations.\n\nPeople in the crowd at Kennedy airport chanted \"Let them in.\" Celebrities including \"Sex and the City\" actress Cynthia Nixon joined the demonstration.\n\nThe detainees in New York included two Iraqis who had previously been given permission to come to the U.S. because of their ties to the U.S. military.\n\nOne of them, Hameed Khalid Darweesh, who had worked as an interpreter for the U.S. Army after it invaded Iraq in 2003, emerged from custody to cheers from the crowd in the mid-afternoon.\n\nHe pronounced the U.S. \"the land of freedom\" home to \"the greatest people in the world\" upon his release, but also expressed dismay about having been initially held.\n\nNew York Gov. Andrew Cuomo, a Democrat, said he had directed state lawyers and the agency that controls Kennedy to \"explore all legal options\" to assist anyone detained at New York airports.\n\n\"I never thought I'd see the day when refugees, who have fled war-torn countries in search of a better life, would be turned away at our doorstep,\" Cuomo said. \"This is not who we are, and not who we should be.\"\n\nDemonstrators outside San Diego International Airport also protesting the ban chanted \"No hate, no fear, everyone is welcome here.\"\n\nThe Associated Press contributed to this report.", "authors": [], "publish_date": "2017-01-29", "source": "foxnews", "top_words": ["protests", "travel", "airport", "international", "trump", "airports", "ban", "release", "kennedy", "day", "order", "following", "refugees", "york", "detained", "erupt"], "summary": "President Donald Trump's travel ban barring citizens of seven predominantly Muslim nations entry into the U.S. has sparked protests around the country.\nAt Los Angeles International Airport, lawyer Talia Inlender said an Iranian woman was detained after arriving on a flight from Amsterdam with her 1-year-old American son.\nHundreds of protesters blocked the street outside at San Francisco International Airport's international terminal to express their opposition to the barring of some people from Muslim-majority nations.\nPeople in the crowd at Kennedy airport chanted \"Let them in.\"\nDemonstrators outside San Diego International Airport also protesting the ban chanted \"No hate, no fear, everyone is welcome here.\""}