{"url": "http://www.foxnews.com/us/2017/07/07/hawaii-wants-appeals-court-to-weigh-in-on-travel-ban-rules.html", "id": "446", "title": "Appeals court refuses to weigh in on Trump travel ban rules", "text": "A federal appeals court on Friday dismissed Hawaii's attempt to challenge the rules created by the Trump administration for its travel ban on citizens from six majority-Muslim countries.\n\nThe state asked the 9th U.S. Circuit Court of Appeals for an order saying the government could not omit grandparents, aunts and uncles, and other relatives of someone in the U.S. from the list of people who can still travel to the country.\n\nA three-judge panel said the 9th Circuit does not have jurisdiction to address the issue after the state appealed a federal judge's decision to leave the government's rules in place.\n\nU.S. District Judge Derrick Watson on Thursday denied Hawaii's request to clarify who is exempt, saying the question would be better posed to the U.S. Supreme Court.\n\nWatson put President Donald Trump's revised travel ban on hold in March, and the justices partially reinstated it last month.\n\n\"Every day that passes is a day when our government is turning away human beings — from newborn children to elderly grandparents — whom the injunction requires to be admitted,\" attorneys for Hawaii said in their filing with the 9th Circuit.\n\nThe 9th Circuit panel noted that Watson may not have authority to clarify the Supreme Court ruling. But he can interpret and enforce it. That appeared to give Hawaii an opportunity to reframe its request to Watson.\n\nIt wasn't immediately clear what Hawaii will do next. \"We appreciate the 9th Circuit for ruling so quickly and will comply,\" state Attorney General Doug Chin said in a statement.\n\nThe Supreme Court said the president's 90-day ban on visitors from Iran, Libya, Somalia, Sudan, Syria and Yemen could be enforced pending arguments set for October if a visitor lacks a \"credible claim of a bona fide relationship with a person or entity in the United States.\"\n\nThe court's majority said a close family relationship in the U.S. was required to enter the country and a spouse or mother-in-law would clearly be permitted.\n\nThe Trump administration has said the exemption would apply to parents, spouses, sons, daughters, sons-in-law, daughters-in-law, fiances or siblings.\n\nA U.S. Department of Justice spokeswoman said the agency declined to comment on the 9th Circuit's decision. The department said in a court filing that its list of people exempt from the ban \"hews closely\" to categories defined by Congress.\n\nThe Trump administration says the travel ban is necessary to keep Americans safe until it can review the vetting process for refugees and others.\n\n___\n\nAssociated Press writer Jennifer Sinco Kelleher contributed to this report from Honolulu.", "authors": [], "publish_date": "2017-07-07", "source": "foxnews", "top_words": ["travel", "hawaii", "trump", "ban", "appeals", "circuit", "refuses", "supreme", "rules", "court", "9th", "state", "weigh", "administration"], "summary": "A federal appeals court on Friday dismissed Hawaii's attempt to challenge the rules created by the Trump administration for its travel ban on citizens from six majority-Muslim countries.\nWatson put President Donald Trump's revised travel ban on hold in March, and the justices partially reinstated it last month.\nThe 9th Circuit panel noted that Watson may not have authority to clarify the Supreme Court ruling.\nThe Trump administration has said the exemption would apply to parents, spouses, sons, daughters, sons-in-law, daughters-in-law, fiances or siblings.\nThe Trump administration says the travel ban is necessary to keep Americans safe until it can review the vetting process for refugees and others."}