{"url": "http://www.foxnews.com/us/2017/06/25/options-for-supreme-court-on-trump-travel-ban.html", "id": "418", "title": "Options for Supreme Court on Trump travel ban", "text": "The Supreme Court is expected to decide within days whether the Trump administration can enforce a ban on visitors to the U.S. from six mostly Muslim countries.\n\nThe high-stakes legal fight has been going on since President Donald Trump rolled out a travel ban just a week after his inauguration. He casts it as critical to deterring terror attacks in the United States.\n\nTrump seeks to halt visits from residents of Iran, Libya, Somalia, Sudan, Syria and Yemen for 90 days so his administration can review the screening procedures for visa applicants from those countries.\n\nOpponents argue that the ban targets Muslims in violation of federal law and the Constitution, and that it stems from Trump's campaign pledge to halt the entry of all Muslims into the U.S.\n\nLower federal courts have so far agreed and blocked the travel ban. One court also has blocked a 120-day halt on refugee arrivals in the United States.\n\nA look at several ways the Supreme Court could decide what to do:\n\n___\n\nIMMEDIATE BAN ON TRAVEL\n\nWith the votes of five justices, the court could agree to the administration's request to immediately reinstate the travel ban, which Trump has said would go into effect 72 hours after a favorable court ruling. The administration has said the revised travel ban Trump issued in March would avoid the chaos and confusion at airports that followed the initial travel order in January. That's because the new policy does not apply to people already in the U.S. or with a valid visa at the time the ban takes effect, the administration has said. Opponents still worry people will be caught in legal limbo if the ban is enforced.\n\n___\n\nKEEP THE TRAVEL BAN ON HOLD\n\nThe court could side with opponents of the ban and refuse to let it take effect. But the administration could still conduct the 90-day review that Trump had tied to the travel ban and a revised executive order could follow. A new ban might include more countries or be made permanent, or both. A new policy almost certainly would lead to new legal challenges.\n\n___\n\nARGUMENT IN FRONT OF THE COURT\n\nWhether the court immediately allows the ban to take effect or keeps it blocked, the justices might schedule argument on the issue for the fall. But there is a fair prospect that the argument — if it even takes place — would be a sideshow. This week's court action is the main event. That's because the 90-day ban will have run its course before any argument takes place in the fall and, if the ban remains on hold, a new travel policy might be in place.\n\n___\n\nANY CHANCE OF ARGUMENT RIGHT AWAY?\n\nOpponents of the travel ban had suggested, under certain circumstances, that the court could hear argument and issue a decision almost immediately, before the justices leave town for the summer. That prospect always seemed remote, and is even more so during the final week of June, with the court scheduled to issue the term's final opinions on Monday. Also, the court has worked at such a fast pace only rarely and usually in the midst of political crises, including the dispute over the 2000 presidential election and President Richard Nixon's refusal to turn over the Watergate tapes in 1974.\n\n___\n\nDENYING THE ADMINISTRATION'S APPEAL\n\nThe court could effectively end the legal case by rejecting both the plea to enforce the ban and the administration's appeal of the lower court rulings. The White House could then prepare a new travel policy. The court might be reluctant to pursue this option because the justices, not lower courts, typically are the final word when a federal law or presidential action is struck down.\n\n___\n\nA FULL BENCH\n\nWith Justice Neil Gorsuch's confirmation in April, the court now is at full strength. Gorsuch is sure to take part in weighing the ban proposed by the president who nominated him. He was a federal judge, and had no involvement in the formulation or roll out of the travel policy. As a comparison, Justice Elena Kagan resisted calls to step aside from the high court's consideration of President Barack Obama's health care overhaul. Some opponents of the law said that Kagan did enough as a Justice Department official in preparing the administration's legal defense to sit out the case. Obama nominated her to the Supreme Court in 2010.\n\nJustice Ruth Bader Ginsburg also is expected to take part in the travel ban, despite criticism of Trump she made to The Associated Press and other news organizations last summer. She quickly apologized for her remarks.", "authors": ["Mark Sherman"], "publish_date": "2017-06-25", "source": "foxnews", "top_words": ["travel", "administration", "trump", "ban", "supreme", "options", "argument", "court", "president", "justices", "policy", "legal"], "summary": "The Supreme Court is expected to decide within days whether the Trump administration can enforce a ban on visitors to the U.S. from six mostly Muslim countries.\nThe high-stakes legal fight has been going on since President Donald Trump rolled out a travel ban just a week after his inauguration.\nThe administration has said the revised travel ban Trump issued in March would avoid the chaos and confusion at airports that followed the initial travel order in January.\n___KEEP THE TRAVEL BAN ON HOLDThe court could side with opponents of the ban and refuse to let it take effect.\nHe was a federal judge, and had no involvement in the formulation or roll out of the travel policy."}