{"url": "http://www.foxnews.com/us/2017/06/27/latest-iranians-brush-off-us-travel-ban.html", "id": "427", "title": "The Latest: Vetted refugees can come to US through July 6", "text": "The Latest on the U.S. Supreme Court's decision to partially reinstate President Donald Trump's travel ban (all times local):\n\n3:20 p.m.\n\nThe Supreme Court's decision to allow part of President Donald Trump's travel ban to go forward is likely to have only a minimal impact on refugees, for now.\n\nA State Department spokeswoman says refugees who have been vetted, approved for a move to the U.S., and scheduled to fly to the U.S. through July 6 will be allowed in.\n\nThe U.S. is expected to accept about 50,000 refugees during the budget year that ends in September. Since October about 48,800 refugees have allowed to move to the United States.\n\nThe State Department says after the 50,000 refugee cap is reached, new people hoping to come to the U.S. may be required to show a \"bona fide\" relationship with someone or some entity in the United States.\n\n__\n\n9 a.m.\n\nIran's foreign minister says the partial reinstatement of President Donald Trump's travel ban is \"disappointing\" and says the ban is more about politics than security.\n\nMohammad Javad Zarif on Tuesday called the ban \"misplaced and misguided,\" saying it \"had no basis in fact and it would not help fight terrorism, in fact it would be the greatest gift to extremist groups who would use it as a rallying cry.\"\n\nHe says that the ban \"doesn't increase anybody's security, unfortunately, and it's regrettable that ... the citizens of the countries on the list have never taken part in any act of terrorism against the United States.\"\n\nHe says \"the problem for some is terrorism and support for terrorism is measured by the amount of money they spend on buying arms from the U.S.\"\n\n___\n\n7:10 a.m.\n\nA prominent Iranian lawmaker has denounced the Supreme Court's partial reinstatement of President Donald Trump's travel ban, claiming that it's an \"obvious breach\" of the 2015 nuclear deal between Tehran and world powers, including the United States.\n\nHossein Naghavi Hosseini, spokesman of the parliament's committee on national security and foreign policy, says the ban's reinstatement is \"a new restriction in the post-nuclear-deal era that is considered an obvious breach of the deal.\"\n\nHosseini claimed that under the nuclear deal, countries that signed it are prohibited from imposing new restrictions or sanctions on Iranians. But he did not explain how that is connected or relevant to the travel ban.\n\nHis remarks were carried by the official IRNA news agency on Tuesday. Iran is one of the six mostly Muslim countries that are included in the travel ban.\n\n___\n\n6:30 a.m.\n\nEgyptian airport officials say six Yemenis, including some with American citizenship, were allowed to board a flight to New York despite the Supreme Court's partial reinstatement of President Donald Trump's travel ban.\n\nThe officials say the Yemenis were allowed to board EgyptAir flight 985 to John F. Kennedy airport early on Tuesday because Cairo airport authorities had yet to receive official instructions from the United States on how to implement the ban.\n\nThe officials spoke on condition of anonymity because they are not authorized to disclose the information.\n\nThe U.S. travel ban does not apply to Egypt but to Yemen and five other Muslim-majority countries — Iran, Libya, Syria, Somalia and Sudan. It exempts those with \"a bona fide relationship\" with a person or entity in the United States.\n\n—Brian Rohan in Cairo.\n\n___\n\n5:30 a.m.\n\nIranians at Tehran's international airport say they don't expect to encounter any difficulties traveling to the United States despite the Supreme Court's partial reinstatement of President Donald Trump's travel ban.\n\nThe Iranian government did not immediately comment on the ban, which would apply to Iran and five other Muslim-majority countries. The ban would exempt those with \"a bona fide relationship\" with a person or entity in the United States.\n\nHassan, a 25-year-old who was accepted to the University of Virginia and was heading to Cyprus on Tuesday for a visa interview, said he sees \"no reason to be worried\" since the ban would not apply to students.\n\nFereidoun and Hayedeh, who were bound for Los Angeles to visit their daughter and her husband, said they had visited the U.S. every two to three years for the last decade. They said there was \"no big change\" in the visa process when they applied at the U.S. Consulate in Armenia.\n\nAll three spoke on condition of anonymity, fearing repercussions that could negatively affect their entry process.\n\nIranians apply for U.S. visas in neighboring countries because Washington and Tehran have had no diplomatic relations since the 1979 revolution.\n\nIranian authorities criticized the ban when it was announced earlier this year before it was suspended by the courts.\n\n___\n\n3:45 a.m.\n\nThe Supreme Court's decision to partially reinstate President Donald Trump's temporary travel ban leaves the effort to keep some foreigners out of the country in a murky middle ground riddled with lingering questions and possibly more cumbersome litigation.\n\nA full hearing on the issue is set for October. For now, the administration can bar travelers from six majority-Muslim countries if they can't show a \"credible claim of a bona fide relationship\" with someone or some entity in the country.\n\nIt's unclear what will ultimately constitute a \"bona fide relationship\" though the ruling suggested that an American job, school enrollment or a close relative could meet that threshold.\n\nThe fate of refugees, who often don't have relatives or jobs waiting for them in the U.S., also hangs in the balance.", "authors": [], "publish_date": "2017-06-27", "source": "foxnews", "top_words": ["travel", "relationship", "courts", "come", "ban", "supreme", "united", "vetted", "trumps", "donald", "countries", "refugees", "president", "latest"], "summary": "The Latest on the U.S. Supreme Court's decision to partially reinstate President Donald Trump's travel ban (all times local):3:20 p.m.\nThe Supreme Court's decision to allow part of President Donald Trump's travel ban to go forward is likely to have only a minimal impact on refugees, for now.\n__9 a.m.Iran's foreign minister says the partial reinstatement of President Donald Trump's travel ban is \"disappointing\" and says the ban is more about politics than security.\nBut he did not explain how that is connected or relevant to the travel ban.\nIran is one of the six mostly Muslim countries that are included in the travel ban."}