{"url": "http://www.foxnews.com/world/2017/03/06/iraq-welcomes-removal-from-revised-us-travel-ban.html", "id": "481", "title": "Iraq welcomes removal from revised US travel ban", "text": "Iraq welcomed its removal from a revised U.S. travel ban on Monday, calling it a \"positive message\" at a time when American and Iraqi forces are battling the Islamic State group.\n\nIraq was among seven Muslim-majority countries whose nationals were temporarily banned from traveling to the United States in an earlier order issued by President Donald Trump in January, which was blocked by the courts.\n\nThe White House had said the earlier ban was needed to prevent terrorists from entering the country, but has now removed Iraq from the list under pressure from the State Department and the Defense Department, which had noted the close cooperation between the two countries in battling IS militants in the northern Iraqi city of Mosul.\n\nThe revised order is narrower and specifies that a 90-day ban on people from Sudan, Syria, Iran, Libya, Somalia, and Yemen does not apply to those who already have valid visas.\n\nIraqi government spokesman Saad al-Hadithi said the revision to the travel ban shows that the two countries have a \"real partnership.\" Foreign Ministry spokesman Ahmed Jamal said it \"reinforces the strategic alliance between Baghdad and Washington in many areas in the forefront in the fight against terrorism.\"\n\nThe original order angered many Iraqis, and prompted parliament to call for a reciprocal ban on Americans entering Iraq. Prime Minister Haider al-Abadi declined to impose such a measure.\n\nThousands of American forces are in Iraqi providing air support and logistical help for a massive operation to drive IS militants from Mosul, the country's second largest city. Smaller numbers of U.S. special operations forces are embedded with some Iraqi units.\n\nSupport from a U.S.-led coalition has been critical in the fight against IS, helping Iraqi forces to slowly roll back the militants over the past two and a half years. Iraqi forces are now in the midst of their toughest battle yet against IS as they push to retake Mosul's west after the eastern half of the city was declared \"full liberated\" in January.\n\nIraqi troops on the front lines welcomed the revision to the travel ban while still expressing anger over the original order.\n\n\"To be honest, (the original ban) made me upset and that will not change,\" said Sgt. Maj. Asad al-Asadi of Iraq's special forces, who has been away from home battling the IS group for nearly three years. \"I've lost three friends fighting terrorists and Trump calls me a terrorist.\"\n\n___\n\nAssociated Press writer Susannah George in Mosul, Iraq, contributed to this report.", "authors": [], "publish_date": "2017-03-06", "source": "foxnews", "top_words": ["original", "travel", "iraqi", "revised", "ban", "iraq", "militants", "removal", "welcomes", "countries", "city", "order", "forces"], "summary": "Iraq welcomed its removal from a revised U.S. travel ban on Monday, calling it a \"positive message\" at a time when American and Iraqi forces are battling the Islamic State group.\nIraqi government spokesman Saad al-Hadithi said the revision to the travel ban shows that the two countries have a \"real partnership.\"\nThe original order angered many Iraqis, and prompted parliament to call for a reciprocal ban on Americans entering Iraq.\nIraqi troops on the front lines welcomed the revision to the travel ban while still expressing anger over the original order.\n\"To be honest, (the original ban) made me upset and that will not change,\" said Sgt."}