{"url": "http://www.foxnews.com/us/2017/08/13/apnewsbreak-grandmother-in-travel-ban-lawsuit-arrives-in-us.html", "id": "457", "title": "APNewsBreak: Grandmother in travel ban lawsuit arrives in US", "text": "The Syrian grandmother at the center of Hawaii's lawsuit challenging President Donald Trump's travel ban on people from six mostly Muslim countries arrived in Honolulu.\n\nWafa Yahia received approval from the U.S. government several weeks ago, according to her son-in-law, Ismail Elshikh, the imam of a Honolulu mosque. She arrived Saturday night, after a 28-hour journey that began in Lebanon.\n\nTwo of Elshikh's five children have never met their grandmother, he said. She last visited her family in Hawaii in 2005.\n\n\"Without the lawsuit, we couldn't get the visa. Without this challenge, my children would not have been reunited with their grandma,\" he said. \"I still feel sadness for those who are still affected by the Muslim ban, who are not as lucky as my family.\"\n\nElshikh is a plaintiff in Hawaii's challenge to the travel ban. Yahia's immigrant visa approval would not affect Hawaii's lawsuit, Hawaii Attorney General Doug Chin said: \"So long as this discriminatory and illegal executive order is not struck down, the state of Hawaii and its residents are harmed.\"\n\nA federal appeals court in Seattle is scheduled to hear arguments later this month in the government's appeal of a ruling allowing grandmothers and other family members of those in the U.S. to enter the country.\n\nThe U.S. Supreme Court previously allowed a scaled-back version of the ban to go into effect before it hears the case in October. The justices exempted visa applicants from the ban if they can prove a \"bona fide\" relationship with a U.S. citizen or entity.\n\n\"The news that Dr. Elshikh's family is being reunited is one bright moment today when love trumped hate,\" Chin said in a statement. \"In America, no race should ever be excluded, no religion should ever be hated, and no family ever gets left behind.\"", "authors": [], "publish_date": "2017-08-13", "source": "foxnews", "top_words": ["travel", "hawaii", "reunited", "ban", "family", "hawaiis", "grandmother", "apnewsbreak", "lawsuit", "muslim", "arrives", "visa"], "summary": "The Syrian grandmother at the center of Hawaii's lawsuit challenging President Donald Trump's travel ban on people from six mostly Muslim countries arrived in Honolulu.\n\"I still feel sadness for those who are still affected by the Muslim ban, who are not as lucky as my family.\"\nElshikh is a plaintiff in Hawaii's challenge to the travel ban.\nYahia's immigrant visa approval would not affect Hawaii's lawsuit, Hawaii Attorney General Doug Chin said: \"So long as this discriminatory and illegal executive order is not struck down, the state of Hawaii and its residents are harmed.\"\nThe justices exempted visa applicants from the ban if they can prove a \"bona fide\" relationship with a U.S. citizen or entity."}