{"url": "http://www.foxnews.com/world/2017/01/29/syrian-musician-in-limbo-after-travel-ban.html", "id": "463", "title": "Syrian musician in limbo after travel ban", "text": "A Syrian musician who was allowed to legally immigrate to the United States on account of his \"extraordinary\" abilities, and who recently toured with famed cellist Yo-Yo Ma, is now wondering whether he can return to his Brooklyn home.\n\nKinan Azmeh, a clarinet player who has called the U.S. home for 16 years, said Sunday he does not have a \"plan B\" if he is not allowed to return.\n\nAzmeh, who flew to China three weeks ago to perform with Ma, was caught in travel limbo after President Donald Trump issued an order last Friday to refuse entry to citizens of Syria and six other Muslim-majority nations, including travelers holding valid visas and residency permits.\n\nHe was granted a green card three years ago through an EB-1 visa, for applicants who can demonstrate \"extraordinary ability\" in science, business, or art.\n\nThe 40-year-old is currently in Beirut on the last leg of his tour before he will attempt to return home later this week. He also performed with Ma in Denmark.\n\n\"I have my apartment. You know, 16 years is not a short time, you accumulate lots of stuff,\" he said. \"But what is not replaceable is all the friends who are incredibly supportive.\"\n\nHe said he was flooded with messages of support in the hours after the executive order, which is being challenged by civil rights attorneys in federal courts. Several judges have granted injunctions against the order, but lawyers say border control officers at several airports still have not granted them access to detained travelers. They say they are afraid the deportations will continue.\n\nAzmeh said he was \"positively surprised\" by the support shown by demonstrators at U.S airports.\n\n\"I am holding onto the optimist in me,\" he said.\n\nConfusion about cases such as Azmeh's remained, even though Trump's aides stressed during a round of Sunday show interviews that only a small portion of travelers had been affected by the order.\n\nThe aides said Sunday that citizens of the seven affected countries who hold permanent U.S. residency \"green cards\" will not be barred from re-entering the country, as officials had said the day before.\n\nAzmeh grew up in Damascus, Syria, before coming to the U.S. to pursue his doctorate in music. He stayed in the U.S. for years on a student visa, before applying for permanent immigration status three years ago.\n\n\"It seemed like the natural step,\" he said. \"New York is where I developed my musical skills, and where I grew as an artist.\"\n\nHe says he considers himself fortunate to be able to call two cities his home, the Syrian capital and New York, even though he has not been able to visit Damascus since Syria descended into war nearly six years ago. Neighbors in Damascus have told Azmeh that his apartment there has been looted twice.\n\nMillions of Syrians are not so lucky. Half the country's population has been displaced, according to the U.N., and an estimated 400,000 have been killed.\n\n\"I think of my countrymen and women, people who were forced out of their homes, and have to repeat that again — that is the worst case scenario,\" he said.", "authors": [], "publish_date": "2017-01-29", "source": "foxnews", "top_words": ["syrian", "travel", "limbo", "ma", "ban", "ago", "travelers", "visa", "syria", "musician", "damascus", "order", "york", "granted"], "summary": "He was granted a green card three years ago through an EB-1 visa, for applicants who can demonstrate \"extraordinary ability\" in science, business, or art.\nThe 40-year-old is currently in Beirut on the last leg of his tour before he will attempt to return home later this week.\nAzmeh grew up in Damascus, Syria, before coming to the U.S. to pursue his doctorate in music.\nHe stayed in the U.S. for years on a student visa, before applying for permanent immigration status three years ago.\nHalf the country's population has been displaced, according to the U.N., and an estimated 400,000 have been killed."}