{"url": "http://www.foxnews.com/us/2017/07/12/don-t-blame-travel-ban-on-iranian-cancer-doctor-being-detained-sent-back-border-patrol-says.html", "id": "451", "title": "Don’t blame travel ban on Iranian cancer doctor being detained, sent back, Border Patrol says", "text": "The Iranian cancer researcher who was detained at Boston's Logan International Airport along with his family and sent back to his home country on Tuesday was not a result of President Trump's travel ban, a spokeswoman from U.S. Customs and Border Partol said.\n\nStephanie Malin, the spokeswoman, said Moshen Dehnavi and his family were detained for “reasons unrelated” to Trump’s executive order. She said the stop was based on information discovered during the agency’s review. She did not elaborate.\n\nDehnavi was arriving in the U.S. to start work at a prominent Boston hospital.\n\nBoston Children’s Hospital said in a statement earlier Tuesday that Dehnavi was prevented from entering the country with his wife and three young children despite holding a J-1 visa for visiting scholars.\n\n“Boston Children’s hopes that this situation will be quickly resolved and Dr. Dehnavi and his family will be released and allowed to enter the U.S.,” hospital spokesman Rob Graham said in the statement. “\n\nBut Malin noted that visa applicants “bear the burden of proof” to meet all requirements and can be denied entry for a range of reasons, including health-related issues, criminality or security concerns.\n\nThe Supreme Court recently ruled the Trump administration could largely enforce its temporary ban on travelers from Iran, Libya, Somalia, Sudan, Syria and Yemen. But the court said the ban can’t block people with a “credible claim of a bona fide relationship with a person or entity in the United States.”\n\nSome advocacy groups, including the American Civil Liberties Union and the National Iranian American Council, suggested the detention might be a violation of the Supreme Court order.\n\n“The family is very worried,” said Shayan Modarres, a lawyer for the D.C.-based council, which has been in contact with the family. “If it is a minor paperwork issue, then something needs to be told to the family so they can resolve it.”\n\nAt the very least, the incident shows how the administration’s political priorities are leading to “overzealous enforcement” of immigration laws, said Gregory Romanovsky, chair of the New England chapter of the American Immigration Lawyer’s Association.\n\n“Exercising discretion is not what they’re comfortable doing anymore, especially if they’re dealing with someone from one of the six banned countries,” he said of local customs officials. “The travel ban and the whole anti-immigrant mood coming from the very top of this administration certainly affects their ability.”\n\nBoston Mayor Marty Walsh, a Democrat, told reporters he was waiting to hear more about the Dehnavis’ circumstances, but also suggested the case was an example of concerns with the travel ban.\n\n“Many people, doctors and nurses and people who are students working in the world-class institutions that we have are going to be boxed out or left out of the country,” he said.\n\nThe Associated Press contributed to this report", "authors": [], "publish_date": "2017-07-12", "source": "foxnews", "top_words": ["doctor", "travel", "blame", "dont", "patrol", "family", "ban", "visa", "court", "cancer", "iranian", "american", "trumps", "country", "border", "told", "detained", "dehnavi", "sent"], "summary": "The Iranian cancer researcher who was detained at Boston's Logan International Airport along with his family and sent back to his home country on Tuesday was not a result of President Trump's travel ban, a spokeswoman from U.S. Customs and Border Partol said.\nStephanie Malin, the spokeswoman, said Moshen Dehnavi and his family were detained for “reasons unrelated” to Trump’s executive order.\nThe Supreme Court recently ruled the Trump administration could largely enforce its temporary ban on travelers from Iran, Libya, Somalia, Sudan, Syria and Yemen.\n“The family is very worried,” said Shayan Modarres, a lawyer for the D.C.-based council, which has been in contact with the family.\n“The travel ban and the whole anti-immigrant mood coming from the very top of this administration certainly affects their ability.”Boston Mayor Marty Walsh, a Democrat, told reporters he was waiting to hear more about the Dehnavis’ circumstances, but also suggested the case was an example of concerns with the travel ban."}