{"url": "http://www.foxnews.com/us/2017/09/01/federal-authorities-travel-ban-deal-impacts-fewer-than-20.html", "id": "458", "title": "Federal authorities: Travel ban deal impacts fewer than 20", "text": "A settlement in a legal battle over President Donald Trump's first attempt at a travel ban will impact fewer than 20 people, federal authorities said Friday.\n\nUnder the deal announced Thursday in federal court in New York City, the government agreed to notify people who were denied entry into the United States under the ban that they could reapply for visas with the help of a Department of Justice liaison.\n\nCivil rights groups sued over the treatment of hundreds of travelers from seven Muslim-majority countries who were processed at U.S. airports over a chaotic weekend in January when the ban went into effect.\n\nThe DOJ said in a statement Friday that it will be contacting fewer than 20 people who tried to enter the U.S. but were turned away.\n\nAmerican Civil Liberties Union attorney Lee Gerlent said there's no way to verify that number.\n\n\"That's a huge problem,\" Gerlent said. \"Everyone, including the press, just has to trust the government.\"\n\nA federal judge blocked the initial ban in a ruling upheld by a circuit court. Rather than pursue an appeal, the administration said it would revise the policy.\n\nIn June, the Supreme Court found that the narrower order could be enforced if those visitors lack a \"credible claim of a bona fide relationship with a person or entity in the United States.\"", "authors": [], "publish_date": "2017-09-01", "source": "foxnews", "top_words": ["travel", "ban", "impacts", "deal", "fewer", "gerlent", "court", "united", "federal", "went", "states", "authorities", "york", "20"], "summary": "A settlement in a legal battle over President Donald Trump's first attempt at a travel ban will impact fewer than 20 people, federal authorities said Friday.\nUnder the deal announced Thursday in federal court in New York City, the government agreed to notify people who were denied entry into the United States under the ban that they could reapply for visas with the help of a Department of Justice liaison.\nCivil rights groups sued over the treatment of hundreds of travelers from seven Muslim-majority countries who were processed at U.S. airports over a chaotic weekend in January when the ban went into effect.\nThe DOJ said in a statement Friday that it will be contacting fewer than 20 people who tried to enter the U.S. but were turned away.\nA federal judge blocked the initial ban in a ruling upheld by a circuit court."}