{"url": "http://www.foxnews.com/us/2017/06/29/travel-ban-was-on-then-off-now-its-back-but-different.html", "id": "434", "title": "Travel ban was on, then off. Now it's back, but different", "text": "President Donald Trump's first, temporary ban on travelers from seven majority-Muslim nations was short-lived, but it sparked confusion, panic and anger that lasted through months of court rulings. The Supreme Court is now taking up the case in the fall. In the meantime, the government can enforce parts of a second version of Trump's order.\n\nSo what's new this time?\n\n___\n\nBANNED FOREIGNERS\n\nOld order: Three-month ban on citizens from seven Muslim-majority countries, including those who had valid visas but were outside the United States when the ban was signed.\n\nSupreme Court version: Iraq has been dropped from the ban.\n\nFor 90 days, the government can bar new visa applicants from Syria, Sudan, Somalia, Yemen, Iran and Libya who can't prove they have a \"bona fide relationship\" with close relatives or a business in the United States. The State Department says valid relationships include a parent, spouse, fiancé, child, adult son or daughter, son-in-law, daughter-in-law or sibling already in the United States. Journalists, students, workers or lecturers who have valid, formal invitations or employment contracts in the U.S. will also be welcome.\n\nRefugees hoping to come to the United States who aren't already approved for travel must now also prove one of these relationships. Otherwise, they'll be barred for 120 days.\n\n___\n\nSYRIANS\n\nOld order: Syrian visitors, immigrants and refugees were barred from the United States indefinitely.\n\nSupreme Court version: Syrians will be treated in the same manner as citizens of the other five designated countries.\n\n___\n\nREFUGEES\n\nOld order: Four-month halt to refugees entering the United States.\n\nSupreme Court version: The refugee ban will be in place for 120 days. But refugees already vetted and approved for travel through July 6 will be allowed to move to the United States. The \"bona fide relationship\" standard applies after a cap of 50,000 refugees that Trump set for the fiscal year is met. That is likely to happen soon. The new rules will likely affect refugees in the next fiscal year, which starts in October. The Supreme Court will hold a hearing on the ban that same month.\n\n___\n\nTIMING\n\nOld order: The Jan. 27 order was immediately put into place, causing chaos and panic at airports as the Homeland Security Department scrambled to figure out who was covered by the order and how it was to be implemented.\n\nSupreme Court version: It goes into effect about 8 p.m. Eastern time Thursday, more than 72 hours after the Supreme Court issued its opinion.", "authors": ["Alicia A. Caldwell"], "publish_date": "2017-06-29", "source": "foxnews", "top_words": ["travel", "different", "ban", "supreme", "court", "order", "united", "version", "refugees", "trumps", "valid", "states"], "summary": "___BANNED FOREIGNERSOld order: Three-month ban on citizens from seven Muslim-majority countries, including those who had valid visas but were outside the United States when the ban was signed.\nSupreme Court version: Iraq has been dropped from the ban.\nSupreme Court version: The refugee ban will be in place for 120 days.\nBut refugees already vetted and approved for travel through July 6 will be allowed to move to the United States.\nSupreme Court version: It goes into effect about 8 p.m. Eastern time Thursday, more than 72 hours after the Supreme Court issued its opinion."}