{"url": "http://www.foxnews.com/us/2017/07/17/latest-gorsuch-hears-about-travel-ban-at-conference.html", "id": "453", "title": "The Latest: Gorsuch encourages tolerance among new citizens", "text": "The Latest on Associate Justice Neil Gorsuch's appearance at a judicial conference in San Francisco (all times local):\n\n5:30 p.m.\n\nU.S. Supreme Court Associate Justice Neil Gorsuch encouraged a group of newly naturalized U.S. citizens to tolerate different points of view and respect people with whom they disagree.\n\nGorsuch welcomed the new citizens on Monday following a naturalization ceremony at the 9th Circuit Court's judicial conference in San Francisco. Gorsuch's visit comes as the Trump administration asks the high court to again weigh in on its ban on travelers from six mostly Muslim countries. Gorsuch was among three justices who said in June that the ban should be completely reinstated pending arguments before the high court.\n\nGorsuch told the new citizens that tolerance can be difficult, especially in polarizing times. But he said it was vital to democracy.\n\nGorsuch was a late fill-in at the conference for U.S. Supreme Court Justice Anthony Kennedy.\n\n___\n\n3:45 p.m.\n\nPresident Donald Trump's appointment to the U.S. Supreme Court, Associate Justice Neil Gorsuch, can't escape discussion of the president's travel ban during an appearance at a judicial conference in San Francisco.\n\nWith Gorsuch seated next to her, an Alaska high school student read her winning essay Monday at the 9th Circuit courts' conference. The topic was Japanese internment.\n\nFifteen-year-old Olivia Tafs compared the treatment of Muslims after the Sept. 11 attacks to that of Japanese Americans during World War II. She cited Trump's travel ban as an example of what she said was ethnic profiling.\n\nGorsuch was among three justices who argued in June in favor of completely reinstating the ban on travelers from six majority-Muslim countries.\n\nGorsuch shook Tafs' hand after her speech.\n\n___\n\n3 p.m.\n\nU.S. Supreme Court Associate Justice Neil Gorsuch says judges listen to each other and welcome different ideas when reaching decisions, and that's a good lesson for other branches of government.\n\nGorsuch spoke on a panel on Monday at the 9th Circuit courts' judicial conference in San Francisco. The panel focused on educating Americans about their system of government.\n\nAsked what he would like people to know about the judiciary, Gorsuch pointed out that the vast majority of legal disputes are resolved at the district court level and the U.S. Supreme Court often rules unanimously.\n\nGorsuch was a late fill-in at the conference for U.S. Supreme Court Justice Anthony Kennedy. Gorsuch is scheduled to speak to new U.S. citizens later in the day.\n\n___\n\n11:30 a.m.\n\nPresident Donald Trump's pick to the Supreme Court, Associate Justice Neil Gorsuch, is scheduled to welcome new U.S. citizens at a federal judicial conference in San Francisco.\n\nA district court judge will swear in the immigrants Monday at a naturalization ceremony at the annual meeting of the 9th Circuit courts. Ninth Circuit spokesman David Madden says Gorsuch will then speak to the new citizens.\n\nThe justice was a late fill-in for Supreme Court Justice Anthony Kennedy, who canceled his trip to the conference after his wife fractured her hip in Austria.\n\nGorsuch's visit comes as the Trump administration asks the high court to again weigh in on its ban on travelers from six mostly Muslim countries. Gorsuch was among three justices who said in June that the ban should be completely reinstated pending arguments before the high court.", "authors": [], "publish_date": "2017-07-17", "source": "foxnews", "top_words": ["high", "encourages", "citizens", "ban", "supreme", "san", "judicial", "neil", "court", "gorsuch", "justice", "latest", "tolerance", "conference"], "summary": "Gorsuch welcomed the new citizens on Monday following a naturalization ceremony at the 9th Circuit Court's judicial conference in San Francisco.\nGorsuch was among three justices who said in June that the ban should be completely reinstated pending arguments before the high court.\nGorsuch was a late fill-in at the conference for U.S. Supreme Court Justice Anthony Kennedy.\nGorsuch was a late fill-in at the conference for U.S. Supreme Court Justice Anthony Kennedy.\n___11:30 a.m.President Donald Trump's pick to the Supreme Court, Associate Justice Neil Gorsuch, is scheduled to welcome new U.S. citizens at a federal judicial conference in San Francisco."}