{"url": "http://www.foxnews.com/us/2017/06/30/morning-brief-trumps-travel-ban-begins-to-minimal-disruption.html", "id": "440", "title": "MORNING BRIEF: Trump's travel ban begins to minimal disruption", "text": "A scaled-down version of President Donald Trump’s travel ban took effect at 8 p.m. ET Thursday, with none of the dramatic scenes of protest and chaos that greeted the original version of Trump’s executive order five months ago.\n\nThe Departments of Homeland Security, State and Justice went ahead with the implementation after the Supreme Court partially restored the order earlier this week.\n\nTrump administration says ‘I do’ to adding fiances to travel ban exemptions\n\nWho does Trump's executive order block from entering the US?\n\n'TUCKER CARLSON TONIGHT'\n\nRadio host Dana Loesch defended a video ad she fronted on behalf of the National Rifle Association Thursday, saying that liberal critics' reaction to it was \"insane.\"\n\nLoesch told Fox News' \"Tucker Carlson Tonight\" that the ad, titled \"The Violence of Lies\" was recorded in April. It features images of violent protests against conservative speakers at the University of California at Berkeley and attacks on supporters of President Trump.\n\nGRETA FIRED\n\nGreta Van Susteren is out at MSNBC less than six months after she started at the cable channel.\n\nVan Susteren broke the news of her own ouster Thursday, tweeting \"I'm out at MSNBC\" shortly before the network issued its own announcement. Van Susteren's husband, John Coale, told CNNMoney, \"They let her go,\" and added that she and MSNBC were \"working out contract issues now.\"\n\nUNDOCUMENTED IMMIGRANT WINS SUIT\n\nA man from El Salvador in the U.S. illegally who sued San Francisco after police turned him over to immigration authorities in violation of the city's sanctuary law is set to be awarded $190,000, his attorney said Thursday.\n\nPedro Figueroa-Zarceno, 33, reached the settlement agreement with the city attorney's office, said Saira Hussain, a staff attorney at the Asian Law Caucus who represented Zarceno. The agreement must be approved by the Board of Supervisors.\n\nCOMING UP ON FOX NEWS CHANNEL\n\nTBA: President Trump and President Moon Jae-in make joint statements. Watch live on FoxNews.com.\n\n8;45 AM ET: Vice President Pence joins South Korean Pres Moon Jae-in to pay tribute to the veterans of the Korean War at a wreath-laying ceremony at the Korean War Veterans Memorial. Watch live on FoxNews.com\n\nCOMING UP ON FOX BUSINESS\n\n8:30 AM ET: Alan Greenspan, former Federal Reserve chairman, will be a guest on ‘Mornings with Maria’\n\n9 AM ET: - Sen. Pat Toomey will be on ‘Varney & Company’\n\n10 AM ET: Sebastian Gorka, will appear on ‘Varney & Company’\n\n10:30 AM ET: Secretary Ryan Zinke will be on ‘Varney & Company’\n\n5 PM ET: Anthony Scarramucci, Fmr Trump Transition Team Exec Cmte Member will appear on ‘Risk & Reward’", "authors": [], "publish_date": "2017-06-30", "source": "foxnews", "top_words": ["travel", "ban", "korean", "watch", "morning", "fox", "begins", "order", "minimal", "trumps", "et", "disruption", "msnbc", "brief", "president", "war", "varney"], "summary": "A scaled-down version of President Donald Trump’s travel ban took effect at 8 p.m.\nET Thursday, with none of the dramatic scenes of protest and chaos that greeted the original version of Trump’s executive order five months ago.\nTrump administration says ‘I do’ to adding fiances to travel ban exemptionsWho does Trump's executive order block from entering the US?\nCOMING UP ON FOX NEWS CHANNELTBA: President Trump and President Moon Jae-in make joint statements.\n8;45 AM ET: Vice President Pence joins South Korean Pres Moon Jae-in to pay tribute to the veterans of the Korean War at a wreath-laying ceremony at the Korean War Veterans Memorial."}