{"url": "http://www.foxnews.com/us/2017/06/27/lawyers-prepare-to-defend-travelers-to-us-at-airports.html", "id": "428", "title": "Lawyers prepare to defend travelers to US at airports", "text": "When the Trump administration's travel ban takes partial effect this week, immigrant-rights lawyers plan to head to the nation's major airports to make sure eligible foreigners are able to get into the country.\n\nBut attorneys say few people are likely to be affected, and they don't expect a repeat of the mass confusion that resulted earlier this year when President Donald Trump rolled out his original ban on travel from a group of mostly Muslim countries.\n\n\"Our hope is unlike the chaos that previously occurred, there will be a much smoother and much less traumatic result,\" said Caitlin Bellis, an attorney at Public Counsel in Los Angeles.\n\nThe Department of Homeland Security hasn't offered any guidance on how this week's Supreme Court ruling on the ban will be interpreted, so attorneys are preparing for anything and will monitor airports from Los Angeles to New York in case they are needed to assist foreigners held for questioning or denied entry by customs and border agents.\n\nAdvocates have a hotline and email addresses where relatives can seek help if family members get stuck. There's also an app that routes information about troubled travelers to lawyers monitoring the airports.\n\nOn Monday, the Supreme Court said it will hold a full hearing on the ban in October, but until then, the Trump administration can bar travelers from Syria, Sudan, Iran, Yemen, Libya and Somalia if they lack a \"credible claim of a bona fide relationship\" with someone or some institution in the U.S.\n\nImmigration lawyers said they believe that visas already issued to travelers from the six countries will probably still be considered valid for entry into the U.S. But for those who are seeking a visa from here on in, there are many unknowns.\n\nExactly what constitutes a \"bona fide relationship\" could become a matter of dispute, though the justices suggested that a close family member such as a spouse or a mother-in-law, a job in the U.S., a speaking invitation or enrollment at a university could qualify. Others, such as would-be tourists or some scholars, could find themselves shut out.\n\nThe partial ban is expected to take effect Thursday. When Trump's earlier, broader ban was announced in January, travelers found themselves detained for hours and in some cases sent back, prompting large demonstrations outside airports and a flurry of lawsuits.\n\nTrina Realmuto, litigation director for the National Lawyers Guild's national immigration project, said the government's guidance on how it plans to implement the order is key.\n\nHomeland Security said the order will be carried out \"professionally, with clear and sufficient public notice.\"\n\nNicky Smith, executive director of the International Rescue Committee's Seattle office, said she worries about refugee children traveling to the U.S. for medical care.\n\n\"If kids can't get into the country, some of the cases that we've had over the past few months, if they had been delayed by a week, they wouldn't have made it,\" she said.\n\nAt Dulles Airport outside Washington, lawyers are planning to be there to assist travelers as necessary and also show customs and border agents they are watching, said Sirine Shebaya, a board member with the Dulles Justice Coalition.\n\nShe said it's too early to know whether lawyers will be needed there long term.\n\n\"One of the best ways to know that is just to be there,\" she said.\n\n___\n\nTaxin reported from Santa Ana, California. Associated Press writers Deepti Hajela in New York and Matthew Barakat in McLean, Virginia, contributed to this report.", "authors": ["Colleen Long", "Amy Taxin"], "publish_date": "2017-06-27", "source": "foxnews", "top_words": ["travel", "lawyers", "trump", "airports", "ban", "supreme", "security", "travelers", "week", "prepare", "york", "defend"], "summary": "When the Trump administration's travel ban takes partial effect this week, immigrant-rights lawyers plan to head to the nation's major airports to make sure eligible foreigners are able to get into the country.\nThere's also an app that routes information about troubled travelers to lawyers monitoring the airports.\nWhen Trump's earlier, broader ban was announced in January, travelers found themselves detained for hours and in some cases sent back, prompting large demonstrations outside airports and a flurry of lawsuits.\nShe said it's too early to know whether lawyers will be needed there long term.\nAssociated Press writers Deepti Hajela in New York and Matthew Barakat in McLean, Virginia, contributed to this report."}