{"url": "http://www.foxnews.com/us/2017/06/28/latest-officials-finalizing-criteria-for-travel-ban.html", "id": "429", "title": "The Latest: US issues new visa criteria for 6 Muslim nations", "text": "The Latest on the Trump administration's revived travel ban for visitors from six mostly Muslim countries (all times local):\n\n9:25 p.m.\n\nThe Trump administration has set new criteria for visa applicants from six mainly Muslim nations and all refugees that require a \"close\" family or business tie to the United States. The move comes after the Supreme Court partially restored President Donald Trump's executive order that was widely criticized as a ban on Muslims.\n\nThe new guidelines sent to U.S. embassies and consulates on Wednesday say that applicants from the six countries must prove a relationship with a parent, spouse, child, adult son or daughter, son-in-law, daughter-in-law or sibling in the U.S.\n\nThis is according to a State Department cable obtained by the Associated Press.\n\nGrandparents, grandchildren, aunts, uncles, nieces, nephews, cousins, brothers-laws and sisters-in-law, fiancees or other extended family members are not considered to be close relationships.\n\n___\n\n12:06 p.m.\n\nSenior officials from the departments of State, Justice and Homeland Security are finalizing criteria that visitors from six mostly Muslim must meet to avoid the Trump administration's revived travel ban.\n\nThe White House deliberations come as U.S. embassies and consulates await instructions later Wednesday on how to implement this week's Supreme Court order that partially reinstated the ban after it was blocked by lower courts. The new measures are expected to be implemented Thursday.\n\nThe justices' opinion exempts applicants from the ban if they can prove a \"bona fide relationship\" with a U.S. person or entity. Government lawyers must determine how to define such a relationship. The court offered only broad guidelines — suggesting it would include a relative, job offer or invitation to lecture in the U.S.", "authors": [], "publish_date": "2017-06-28", "source": "foxnews", "top_words": ["applicants", "relationship", "travel", "trump", "visitors", "ban", "supreme", "issues", "state", "visa", "court", "criteria", "nations", "muslim", "latest"], "summary": "The Latest on the Trump administration's revived travel ban for visitors from six mostly Muslim countries (all times local):9:25 p.m.\nThe Trump administration has set new criteria for visa applicants from six mainly Muslim nations and all refugees that require a \"close\" family or business tie to the United States.\nThe move comes after the Supreme Court partially restored President Donald Trump's executive order that was widely criticized as a ban on Muslims.\n___12:06 p.m.Senior officials from the departments of State, Justice and Homeland Security are finalizing criteria that visitors from six mostly Muslim must meet to avoid the Trump administration's revived travel ban.\nThe court offered only broad guidelines — suggesting it would include a relative, job offer or invitation to lecture in the U.S."}