{"url": "http://www.foxnews.com/world/2017/06/26/trumps-indonesian-business-partner-slapped-with-travel-ban.html", "id": "487", "title": "Trump's Indonesian business partner slapped with travel ban", "text": "Authorities in Indonesia have issued a travel ban against the Indonesian business partner of U.S. President Donald Trump after he was accused of threatening a deputy attorney general, officials said Monday.\n\nBillionaire Hary Tanoesoedibjo has been barred from leaving Indonesia from June 22 to July 12 due to the case, which is under investigation by the National Police's criminal investigation unit, said Agung Sampurno, the Indonesian Immigration Office spokesman.\n\nHe said the travel ban could be extended upon a police request.\n\nTanoesoedibjo, 51, better known as Tanoe, is also an aspiring politician with ambitions to run for Indonesian president in 2019. His company plans to start building two resorts in Indonesia this year that Trump's business is associated with through management and licensing deals.\n\nNational police spokesman Rikwanto said Tanoe is accused of sending threats last year through text messages to Yulianto, a deputy attorney general for special crime who investigated a 2009 graft case related to Mobile-8 Telecom, a telecommunications company that Tanoe once owned. Police plan to question Tanoe next week.\n\nRikwanto said Yulianto reported Tanoe to police early last year after receiving threatening messages from the tycoon believed to be connected to tax restitution offenses against one of Tanoe's companies. Like many Indonesians, Rikwanto and Yulianto use only one name.\n\nUnder Indonesian law, using technology to threaten people is punishable by up to four years in prison.\n\nTanoe's lawyer, Hotman Paris Hutapea, denied the allegations, saying the messages sent from Tanoe's cellphone did not contain any threats to a particular person.\n\n\"My client has no intention to threaten any individual,\" Hutapea said, calling the case \"politically motivated.\"", "authors": [], "publish_date": "2017-06-26", "source": "foxnews", "top_words": ["travel", "case", "threaten", "partner", "ban", "tanoe", "indonesia", "threats", "threatening", "trumps", "yulianto", "indonesian", "slapped", "business", "messages"], "summary": "Authorities in Indonesia have issued a travel ban against the Indonesian business partner of U.S. President Donald Trump after he was accused of threatening a deputy attorney general, officials said Monday.\nHe said the travel ban could be extended upon a police request.\nTanoesoedibjo, 51, better known as Tanoe, is also an aspiring politician with ambitions to run for Indonesian president in 2019.\nHis company plans to start building two resorts in Indonesia this year that Trump's business is associated with through management and licensing deals.\nUnder Indonesian law, using technology to threaten people is punishable by up to four years in prison."}