{"url": "http://www.foxnews.com/us/2017/07/01/for-iranian-americans-trump-travel-ban-keeps-families-apart.html", "id": "443", "title": "For Iranian-Americans, Trump travel ban keeps families apart", "text": "Weddings have been moved and family visits delayed.\n\nThe Trump administration's travel ban, while a shadow of its original self, has dealt a harsh blow to the Iranian-American community, where family ties run strong and friends and loved ones regularly shuttle between Los Angeles and Tehran.\n\nBut it isn't the only immigration hurdle facing the community. Iranians allowed to seek visas to visit family in the United States may still have a hard time getting them with a screening process that can take months or longer, immigration lawyers said.\n\nIn the meantime, families are being kept apart. Iranian-American homemaker Mina Thrani, 38, had hoped to invite her aunt to visit her in Irvine over the Christmas holiday but can't because of the ban.\n\nXena Amirani, an 18-year-old college student from Los Angeles, said her family has been grieving since her grandmother died after being struck by a car while crossing the street. They traveled to Iran to bury her. Now, her uncle and his wife want to travel together to visit the family in California to help console them, but the travel ban is in the way.\n\n\"It is pointless,\" Amirani said.\n\nThe scaled-back version of President Donald Trump's policy that took effect this week places new limits on visa policies for citizens of six Muslim-majority countries, including Iran. The temporary ban requires people who want new visas to prove a close family relationship in the U.S. or an existing relationship with an entity like a school or business.\n\nThe U.S. has nearly 370,000 Iranian immigrants, according to U.S. Census Bureau estimates, far more than the other countries targeted by the order — Syria, Sudan, Somalia, Libya and Yemen.\n\nDespite a lengthy history of friction between Tehran and Washington, personal ties between residents of the two countries have held strong.\n\n\"Everyone is being hit by this because everyone has a relative in Iran, and there is quite a lot of travel in between,\" said Trita Parsi, president of the National Iranian American Council.\n\nBut travel isn't always easy, and the challenge predates the Trump administration. Because there is no U.S. embassy in Iran, Iranians must go to other countries for visa interviews, requiring time and money.\n\nAnd it can take longer to get visas approved for Iranians than for citizens of many other countries, immigration attorneys said, while U.S. officials conduct screenings.\n\n\"Even under Obama, it was very hard to get these visas and get the background checks cleared. But now, it is official policy,\" said Ally Bolour, an immigration attorney in Los Angeles.\n\nThe Department of Homeland Security said this week that the Supreme Court's decision to allow a partial reinstatement of the ban will help protect the U.S.\n\nBut that rings hollow to some Iranian-Americans who note that many in their community came to the U.S. seeking freedom following Iran's Islamic revolution of the 1970s and that the hijackers who carried out the 2001 terrorist attacks in the United States were from other countries not limited by the ban.\n\nTrump's initial travel ban in January was broader, affecting current and new visas, which sparked chaos at airports around the world.\n\nMina Jafari, a 28-year-old graphic designer in Washington, said that during that time, her fiancée's Iranian mother was in the process of obtaining a visa to travel to the couple's wedding, but it was revoked because of the ban.\n\nThat prompted Jafari to move the wedding to Iran so her soon-to-be mother-in-law could attend. The only problem is her elder sister can't go with her due to concerns about her political activism.\n\n\"I have family who is banned from Iran, family banned here,\" Jafari said. \"It is a really crazy situation.\"", "authors": ["Amy Taxin"], "publish_date": "2017-07-01", "source": "foxnews", "top_words": ["iran", "travel", "trump", "ban", "family", "visas", "immigration", "los", "families", "visit", "countries", "apart", "iranianamericans", "keeps", "visa"], "summary": "The Trump administration's travel ban, while a shadow of its original self, has dealt a harsh blow to the Iranian-American community, where family ties run strong and friends and loved ones regularly shuttle between Los Angeles and Tehran.\nNow, her uncle and his wife want to travel together to visit the family in California to help console them, but the travel ban is in the way.\nAnd it can take longer to get visas approved for Iranians than for citizens of many other countries, immigration attorneys said, while U.S. officials conduct screenings.\nTrump's initial travel ban in January was broader, affecting current and new visas, which sparked chaos at airports around the world.\n\"I have family who is banned from Iran, family banned here,\" Jafari said."}