{"url": "http://www.foxnews.com/us/2017/06/20/poll-courts-are-right-in-blocking-trumps-travel-ban.html", "id": "414", "title": "Poll: Courts are right in blocking Trump's travel ban", "text": "Most Americans say federal courts are acting properly in blocking President Donald Trump's travel ban, according to a new poll by The Associated Press-NORC Center for Public Affairs Research.\n\nTwo versions of the travel ban targeting Muslim-majority countries have been put on hold by federal courts. Trump says the ban is necessary to keep would-be terrorists from traveling to the United States. Opponents, including some state officials, argue that it is intended to keep Muslims out.\n\nFifty-seven percent of Americans say the courts have acted correctly by blocking the travel ban from taking effect, while 39 percent say the judges are wrongly interfering. The poll shows a sharp partisan divide: 82 percent of Democrats say the courts acted rightly, while 73 percent of Republicans say they're wrongly interfering.", "authors": ["Alicia A. Caldwell", "Emily Swanson"], "publish_date": "2017-06-20", "source": "foxnews", "top_words": ["travel", "courts", "right", "ban", "blocking", "poll", "trumps", "wrongly", "interfering", "federal", "americans", "say"], "summary": "Most Americans say federal courts are acting properly in blocking President Donald Trump's travel ban, according to a new poll by The Associated Press-NORC Center for Public Affairs Research.\nTwo versions of the travel ban targeting Muslim-majority countries have been put on hold by federal courts.\nTrump says the ban is necessary to keep would-be terrorists from traveling to the United States.\nFifty-seven percent of Americans say the courts have acted correctly by blocking the travel ban from taking effect, while 39 percent say the judges are wrongly interfering.\nThe poll shows a sharp partisan divide: 82 percent of Democrats say the courts acted rightly, while 73 percent of Republicans say they're wrongly interfering."}