{"url": "http://www.foxnews.com/world/2017/03/24/toronto-school-board-will-no-longer-have-us-trips-due-to-trump-travel-ban-fears.html", "id": "486", "title": "Toronto school board will no longer have US trips due to Trump travel ban fears", "text": "Canada's largest school board will no longer book any trips to the U.S. because of fears students might have trouble at the border due to travel restrictions enacted by President Donald Trump.\n\nThe Toronto District School Board cited the uncertainty of the new travel restrictions Wednesday. Director of Education John Malloy said students should not be placed into situations of potentially being turned away at the border. He said the board remains committed to fairness, equity, and inclusion.\n\n\"We just can't have trips going across the border and a student for no legitimate reason being denied entry to the U.S. We're obviously not going to leave that student and continue on,\" said Ryan Bird, a spokesman for the board.\n\nThe board is among the largest in North America with over 246,000 students and 584 schools. It books dozens of trips to the U.S. every year. Toronto is one of the most multicultural cities in the world.\n\nOther Canadian school boards have canceled or are considering canceling trips to the U.S. The Girl Guides of Canada have canceled all U.S. travel.\n\nThe Toronto District School board said that for now, it will move forward with the 25 U.S. trips involving about 900 students that have already been approved, but said the entire group will turn back if any students with appropriate documentation are turned away.\n\nMalloy said if Trump's executive order is fully implemented and students are prevented from crossing all trips will be canceled. Judges in the U.S. have ruled against Trump's revised travel ban against six Muslim-majority countries, temporarily blocking it from taking effect.\n\n\"It is my hope that our students, staff and parents will understand and support this difficult decision,\" Malloy, the board's director of education, said in a statement. \"We feel it strikes a balance between our equity and inclusion commitments as a school board, while not cancelling already-approved trips for which a financial loss would be incurred.\"\n\nBird said he was not aware of any students being turned away by U.S. officials.\n\nEssex County school board in southwestern Ontario decided last month to cancel a handful of trips over concerns of equity. And the Ottawa-Carleton District school board sent a letter to parents to confirm whether their children would participate in upcoming trips across the border to determine whether plans should go ahead.\n\nA Winnipeg junior high school canceled a trip by its track team to Minnesota in January because it wasn't certain all students would be able to cross the border. Students in the Pembina Trails School Division in Winnipeg, Manitoba, participate in many international trips, but superintendent Ted Fransen said the recent decision to cancel one was made easily.", "authors": [], "publish_date": "2017-03-24", "source": "foxnews", "top_words": ["toronto", "travel", "canceled", "trump", "ban", "turned", "board", "trips", "school", "longer", "border", "equity", "students", "fears"], "summary": "Canada's largest school board will no longer book any trips to the U.S. because of fears students might have trouble at the border due to travel restrictions enacted by President Donald Trump.\nThe Toronto District School Board cited the uncertainty of the new travel restrictions Wednesday.\n\"We feel it strikes a balance between our equity and inclusion commitments as a school board, while not cancelling already-approved trips for which a financial loss would be incurred.\"\nEssex County school board in southwestern Ontario decided last month to cancel a handful of trips over concerns of equity.\nAnd the Ottawa-Carleton District school board sent a letter to parents to confirm whether their children would participate in upcoming trips across the border to determine whether plans should go ahead."}