{"url": "http://www.foxnews.com/world/2017/02/05/iran-lifts-ban-on-u-s-wrestling-team.html", "id": "472", "title": "Iran lifts ban on U.S. wrestling team", "text": "Iranian media reported on Sunday that the country has lifted its ban on U.S. wrestlers, allowing them to participate in the Freestyle World Cup later this month.\n\nThe report by the semi-official Fars news agency quotes Foreign Ministry spokesman Bahram Ghasemi saying that the ban was lifted after the \"discriminative restrictions\" on Iranian nationals travelling to the U.S. was suspended by a federal judge.\n\nThe wrestlers were originally banned from the Feb. 16-17 competition after President Donald Trump temporarily suspended travel from seven Muslim-majority countries, including Iran.\n\nThe Trump administration is now appealing to reinstate the travel ban. On Sunday a federal appeals court denied the Justice Department's request for an immediate reinstatement of Trump's ban on accepting certain travelers and refugees. Formal arguments in the case will begin on Monday.\n\nThe wrestling competition will take place in the Iranian city of Kermanshah.\n\nThe Associated Press contributed to this report.", "authors": [], "publish_date": "2017-02-05", "source": "foxnews", "top_words": ["iran", "travel", "wrestling", "wrestlers", "ban", "trump", "suspended", "report", "competition", "lifts", "iranian", "federal", "lifted", "team"], "summary": "Iranian media reported on Sunday that the country has lifted its ban on U.S. wrestlers, allowing them to participate in the Freestyle World Cup later this month.\nThe wrestlers were originally banned from the Feb. 16-17 competition after President Donald Trump temporarily suspended travel from seven Muslim-majority countries, including Iran.\nThe Trump administration is now appealing to reinstate the travel ban.\nOn Sunday a federal appeals court denied the Justice Department's request for an immediate reinstatement of Trump's ban on accepting certain travelers and refugees.\nThe wrestling competition will take place in the Iranian city of Kermanshah."}