{"url": "http://www.foxnews.com/us/2017/07/08/hawaii-takes-another-shot-at-trumps-travel-ban.html", "id": "448", "title": "Hawaii takes another shot at Trump's travel ban", "text": "Hawaii has returned to federal court with a new motion in its challenge to Trump administration travel ban rules regarding citizens from six majority Muslim countries.\n\nIn the motion filed late Friday, Hawaii officials asked U.S. District Judge Derrick Watson to enforce or modify the injunction he issued in March blocking the ban altogether.\n\nOn Thursday, Watson denied a request to clarify who is exempt from the restrictions, saying that question was best for the U.S. Supreme Court, which has allowed parts of the ban to go into effect until it considers legal challenges.\n\nA panel of the 9th U.S. Circuit Court of Appeals said Friday it did not have jurisdiction to address or clarify the Supreme Court ruling, but Watson could interpret and enforce it. That appeared to give Hawaii an opportunity to reframe its request.\n\nHawaii contends the Trump rules improperly omit grandparents, aunts and uncles of U.S. citizens from the list of people who can travel to the U.S.", "authors": [], "publish_date": "2017-07-08", "source": "foxnews", "top_words": ["travel", "hawaii", "trump", "ban", "supreme", "rules", "shot", "court", "trumps", "takes", "watson", "enforce", "motion"], "summary": "Hawaii has returned to federal court with a new motion in its challenge to Trump administration travel ban rules regarding citizens from six majority Muslim countries.\nIn the motion filed late Friday, Hawaii officials asked U.S. District Judge Derrick Watson to enforce or modify the injunction he issued in March blocking the ban altogether.\nCircuit Court of Appeals said Friday it did not have jurisdiction to address or clarify the Supreme Court ruling, but Watson could interpret and enforce it.\nThat appeared to give Hawaii an opportunity to reframe its request.\nHawaii contends the Trump rules improperly omit grandparents, aunts and uncles of U.S. citizens from the list of people who can travel to the U.S."}