{"url": "http://www.foxnews.com/us/2017/06/13/justices-give-govt-time-to-address-second-travel-ban-ruling.html", "id": "407", "title": "Justices give gov't time to address second travel ban ruling", "text": "The Supreme Court on Tuesday gave the Trump administration more time to file legal papers in its bid to reinstate a ban on travelers from six mostly Muslim countries.\n\nThe justices agreed to a request from Acting U.S. Solicitor General Jeffrey Wall to address Monday's ruling from the federal appeals court in San Francisco. That ruling said the executive order violated federal immigration law. It was the second time a federal appeals court had refused to lift a hold on the revised travel ban.\n\nThe new briefing schedule lets the government submit its final brief on June 21, meaning the justices are not likely to act on the case until next week at the earliest. The state of Hawaii, which had challenged the ban, also gets a chance to submit additional briefs.\n\nEarlier this month, the government asked the high court to review a ruling from the federal appeals court in Richmond, Virginia, which said the 90-day ban unconstitutionally discriminated against Muslims.", "authors": [], "publish_date": "2017-06-13", "source": "foxnews", "top_words": ["ruling", "travel", "address", "second", "ban", "appeals", "wall", "court", "week", "govt", "federal", "submit", "justices", "virginia"], "summary": "The Supreme Court on Tuesday gave the Trump administration more time to file legal papers in its bid to reinstate a ban on travelers from six mostly Muslim countries.\nSolicitor General Jeffrey Wall to address Monday's ruling from the federal appeals court in San Francisco.\nIt was the second time a federal appeals court had refused to lift a hold on the revised travel ban.\nThe state of Hawaii, which had challenged the ban, also gets a chance to submit additional briefs.\nEarlier this month, the government asked the high court to review a ruling from the federal appeals court in Richmond, Virginia, which said the 90-day ban unconstitutionally discriminated against Muslims."}