{"url": "http://www.foxnews.com/us/2017/08/12/apnewsbreak-grandmother-in-travel-ban-flap-arriving-in-us.html", "id": "455", "title": "APNewsBreak: Grandmother in travel ban flap arriving in US", "text": "The Syrian grandmother at the center of Hawaii's lawsuit challenging President Donald Trump's travel ban on people from six mostly Muslim countries is expected to arrive in Honolulu Saturday.\n\nIsmail Elshikh, the imam of a Honolulu mosque, said his 52-year-old mother-in-law Wafa Yahia received approval from the U.S. government several weeks ago. She is scheduled to arrive at Honolulu's Daniel K. Inouye International Airport Saturday evening on a flight from San Francisco in a 28-hour journey that started in Lebanon, he said.\n\nElshikh is a plaintiff in Hawaii's challenge to the travel ban. The lawsuit argues that the ban prevented his Syrian mother-in-law from visiting.\n\nThe complex legal wrangling over the travel ban is ongoing. A federal appeals court in Seattle is scheduled to hear arguments later this month in the government's appeal of a judge's ruling in July that allows grandmothers and other family members of those in the U.S. who may enter the country.\n\nThe U.S. Supreme Court previously allowed a scaled-back version of the ban to go into effect before it hears the case in October. The justices exempted visa applicants from the ban if they can prove a \"bona fide\" relationship with a U.S. citizen or entity.\n\n\"The news that Dr. Elshikh's family is being reunited is one bright moment today when love trumped hate,\" Hawaii Attorney General Doug Chin said in a statement. \"In America, no race should ever be excluded, no religion should ever be hated, and no family ever gets left behind.\"\n\nYahia's immigrant visa approval would not affect Hawaii's lawsuit, Chin said: \"So long as this discriminatory and illegal executive order is not struck down, the state of Hawaii and its residents are harmed.\"\n\nTwo of Elshikh's five children have never met her, he said. She last visited her family in Hawaii in 2005.\n\n\"Without the lawsuit, we couldn't get the visa. Without this challenge, my children would not have been reunited with their grandma,\" he said. \"I still feel sadness for those who are still affected by the Muslim ban, who are not as lucky as my family.\"", "authors": [], "publish_date": "2017-08-12", "source": "foxnews", "top_words": ["syrian", "travel", "hawaii", "reunited", "ban", "family", "hawaiis", "grandmother", "arriving", "flap", "apnewsbreak", "scheduled", "lawsuit", "visa"], "summary": "The Syrian grandmother at the center of Hawaii's lawsuit challenging President Donald Trump's travel ban on people from six mostly Muslim countries is expected to arrive in Honolulu Saturday.\nElshikh is a plaintiff in Hawaii's challenge to the travel ban.\nThe complex legal wrangling over the travel ban is ongoing.\nThe justices exempted visa applicants from the ban if they can prove a \"bona fide\" relationship with a U.S. citizen or entity.\n\"I still feel sadness for those who are still affected by the Muslim ban, who are not as lucky as my family.\""}