{"url": "http://www.foxnews.com/world/2017/02/01/vatican-newspaper-calls-out-trump-travel-ban.html", "id": "469", "title": "Vatican newspaper calls out Trump's travel ban", "text": "The Vatican is criticizing U.S. President Donald Trump's immigration policy, with a senior official voicing concern and the Vatican newspaper saying Trump's recourse to walls and travel bans is counterproductive to America's economic interests.\n\nArchbishop Angelo Becciu, a top official in the Vatican's secretariat of state, was asked Wednesday about Trump's immigration policy, including the president's decision to keep citizens of seven mostly-Muslim countries from entering the U.S.\n\n\"Certainly there's concern. Because we are messengers of another culture, that of opening, but also about the capacity of integrating those who arrive in our society and our culture,\" Becciu told TG2000, the television of the Italian bishops' conference.\n\nThe Vatican newspaper L'Osservatore Romano headlined a front-page editorial Wednesday with the words, \"Closure isn't progress.\" The paper said protests by U.S. corporations to Trump's travel ban showed that \"closing doors to immigrants means depriving the country of potentially important resources.\"\n\nWhen asked last year about Trumps' campaign promise to have a wall built on the U.S.-Mexico border, Pope Francis declared that anyone who builds walls rather than bridges \"isn't Christian.\"\n\nNow that Trump is president, Francis has taken a wait-and-see attitude, although he has warned against the threats of electing populist \"saviors\" in times of crisis, likening their rise today to Adolf Hitler's rise in the 1930s Germany.\n\nCatholics in the U.S. and beyond have been particularly critical of Trump's travel ban, saying it violates the Gospel-mandated welcome and love owed to strangers and those in need. Some Catholic bishops in the Mideast have said it could further jeopardize Christians already at risk in the region.\n\nPatriarch Louis Raphael I Sako, the head of the Chaldean Church that encompasses most Iraqi Christians, said the preferential option proposed for Christian refugees \"is a trap\" for Mideast Christians.\n\n\"It gives ammunition to all the propaganda and prejudices that the Christian community faces in the Mideast, that we're a foreign body supported by western powers,\" he told the Fides missionary news agency. \"Those who are suffering and need help don't need to be divided among religious lines. And we don't want privileges.\"", "authors": [], "publish_date": "2017-02-01", "source": "foxnews", "top_words": ["travel", "newspaper", "ban", "told", "vatican", "trumps", "calls", "need", "rise", "president", "walls", "saying", "mideast"], "summary": "The Vatican is criticizing U.S. President Donald Trump's immigration policy, with a senior official voicing concern and the Vatican newspaper saying Trump's recourse to walls and travel bans is counterproductive to America's economic interests.\nThe Vatican newspaper L'Osservatore Romano headlined a front-page editorial Wednesday with the words, \"Closure isn't progress.\"\nThe paper said protests by U.S. corporations to Trump's travel ban showed that \"closing doors to immigrants means depriving the country of potentially important resources.\"\nCatholics in the U.S. and beyond have been particularly critical of Trump's travel ban, saying it violates the Gospel-mandated welcome and love owed to strangers and those in need.\n\"Those who are suffering and need help don't need to be divided among religious lines."}