{"url": "http://www.foxnews.com/world/2017/03/02/indonesians-shocked-by-trump-but-still-admire-us-values.html", "id": "480", "title": "Indonesians shocked by Trump, but still admire US values", "text": "Indonesians are by turns shocked and bemused by Donald Trump's volatile presidency, but many in the world's most populous Muslim nation say his personality and actions — including his controversial travel ban — haven't changed their positive view of the United States.\n\nThere is a reservoir of goodwill in Indonesia toward the U.S., which Indonesians often see as a beacon for values they hope will flourish in their own country. Perceptions were particularly positive during Barack Obama's administration because of Obama's personal links to Indonesia and his efforts to heal divisions with the Muslim world.\n\nThe U.S. is one of the largest foreign investors in Indonesia. Phoenix, Arizona-based Freeport-McMoRan Copper & Gold Inc. operates one of the world's largest copper mines and the world's largest gold mine in Indonesia's easternmost province of Papua.\n\nStill, Trump's attempt to ban travel from seven predominantly Muslim nations is deeply unpopular with Indonesians, who see it as an anti-Muslim measure that could affect them even though their country is not one of the seven being targeted. Indonesia's foreign ministry warned that Trump's policy could undermine the global fight against terrorism, but President Joko \"Jokowi\" Widodo was sanguine, telling his country there was nothing to worry about.\n\nIn fact, some say, Trump just needs to visit Indonesia and learn more about Islam.\n\nDespite the perceptions created by a vocal hard-line minority, Muslim Indonesians mainly practice a moderate faith and want their young but feisty democracy to remain headed by a secular government.\n\nAnd like the U.S., Indonesia is a former colony that struggled for its independence and a nation of remarkable diversity, with hundreds of languages and ethnic groups.\n\nA look at how some Indonesians view Trump:\n\n___\n\nRUDY MADANIR, an English teacher in Jakarta, the capital, who has visited the U.S. as a tourist and wants to travel there again, said he was shocked by Trump's election, having never imagined that \"this kind of man could be sitting in the White House.\"\n\nBut Madanir, 47, also said the protests against the travel ban showed there are many people in the U.S. who want to uphold values such as justice, freedom and nondiscrimination, and opened his eyes to how \"beautiful\" Americans are.\n\n\"Maybe tomorrow it will be Indonesia's turn (to be banned), who knows? With this weird and strange person sitting in the White House, anything can happen,\" he said. \"I wish Trump can visit Indonesia, the world most populous Muslim country, so he will experience firsthand how Muslims are here. We are not as scary as he might think.\"\n\n___\n\nTINGKA ADIATI, a 48-year-old housewife in Tangerang, a satellite city of Jakarta, said Trump's immigration policy did not change her image of America as a tolerant country open to people from around the world.\n\nTrump is experiencing the \"euphoria\" of his victory, and given time, rather than Trump changing America, it will be him who is changed, Adiati said. His polices will also have to take into account the interests of American businesses in countries around the world, including Indonesia, she added.\n\n\"I'm sure Trump, with his life and business experience, he'll learn and become aware that what he was saying and policies he made were not always right, and he'll learn from that strong reaction from international society and his own people,\" she said. \"He is bound to change. And do not forget, the U.S. also has a lot of interests in Indonesia. Surely he would not dare to issue such a ban to Indonesia.\"\n\n___\n\nLUKAS CHRISTIAN, who owns a coffee shop in Tangerang, has a son at Wesleyan University in Connecticut who is planning to work in the U.S. after graduating this year.\n\nChristian, 52, hopes his son's Indonesian nationality won't be a complicating factor. So far it hasn't, but the possibility still troubles him.\n\nIndonesians consider America to be a tolerant society, and the travel ban shows Trump's own dislike of immigrants and Islam, he said.\n\nChristian said Indonesia is \"totally different\" from the seven Muslim countries included in Trump's ban. \"Although Muslims are predominant here, we have (the state ideology) Pancasila and a secular constitution that protects diversity. I myself respect diversity,\" he said.\n\n\"As a coffee seller, I can say this: There are many varieties of coffee in Indonesia, from Aceh to Papua, and people enjoy its variety, and it is just like the way of Indonesian thinking — tolerant,\" he said.\n\n___\n\nMARIA KARTIKA SARI, a tour guide who lives in Jakarta, said she believes the majority of Americans disagree with Trump's travel ban. The 30-year-old said she has always considered the U.S. to be a tolerant nation of immigrants that is similar to Indonesia insofar as both countries have many different ethnic groups and religions.\n\n\"When I heard Trump banned the entry of nationals from seven Muslim nations, I considered it as his personal decision because Americans are not like that,\" she said.\n\nThe seven countries targeted by the ban are known as \"troublemakers,\" she said, but that reputation stems from the actions of a few people, and it's unjust to impose punitive measures against an entire country on that basis.\n\n\"I want to say to Trump, he is a president now, no longer a businessman,\" she said. \"I understand he's a stubborn old man, but it is good for him to know that today he leads the United States, not just a company. He should change.\"", "authors": [], "publish_date": "2017-03-02", "source": "foxnews", "top_words": ["seven", "values", "travel", "trump", "ban", "indonesia", "indonesians", "admire", "trumps", "country", "tolerant", "muslim", "shocked"], "summary": "Despite the perceptions created by a vocal hard-line minority, Muslim Indonesians mainly practice a moderate faith and want their young but feisty democracy to remain headed by a secular government.\n\"I wish Trump can visit Indonesia, the world most populous Muslim country, so he will experience firsthand how Muslims are here.\nIndonesians consider America to be a tolerant society, and the travel ban shows Trump's own dislike of immigrants and Islam, he said.\nChristian said Indonesia is \"totally different\" from the seven Muslim countries included in Trump's ban.\n___MARIA KARTIKA SARI, a tour guide who lives in Jakarta, said she believes the majority of Americans disagree with Trump's travel ban."}