{"url": "http://www.foxnews.com/us/2017/06/13/q-whats-next-in-legal-fight-over-travel-ban.html", "id": "408", "title": "Q&A: What's next in the legal fight over the travel ban", "text": "Another appeals court, another defeat for the Trump administration.\n\nThe San Francisco-based 9th U.S. Circuit Court of Appeals on Monday refused to reinstate President Donald Trump's executive order banning travelers from six mostly Muslim countries. A three-judge panel said the administration failed to show that blocking citizens from Iran, Libya, Somalia, Sudan, Syria and Yemen was needed to protect the U.S. The court also found that the president's order ran afoul of an immigration law that prohibits discrimination on the basis of nationality.\n\nAnother federal appeals court, the Virginia-based 4th Circuit, last month also refused to reinstate the travel ban, a decision Trump has already appealed to the Supreme Court. Here's a look at how the rulings compare and what might come next.\n\n___\n\nHOW DO THE RULINGS DIFFER?\n\nCritics of the ban have asserted that the president's order was motivated by anti-Muslim sentiment, in violation of the Constitution's separation of church and state. The 4th Circuit's ruling took that question head-on, agreeing that the ban officially disfavored Islam — as evidenced by Trump's campaign statements calling for a \"total and complete shutdown\" on Muslims entering the U.S. — and was thus unconstitutional.\n\nBut the 9th Circuit sidestepped that question, saying they didn't need to answer it because the legality of the travel ban could be decided on narrower grounds: It violated immigration law.\n\nWhile the president has broad authority over immigration, the judges said, to invoke that authority in this case, Trump would have to show the entry of citizens from the six countries would harm the U.S. He made no such showing, they said.\n\n\"National security is not a 'talismanic incantation' that, once invoked, can support any and all exercise of executive power,\" the judges wrote.\n\nBy avoiding the question of Trump's motive for banning the travelers, the 9th Circuit avoided a thorny issue about whether courts should consider the president's campaign-trail statements.\n\nThe 9th Circuit, however, did not completely ignore the president's statements. The judges pointed to a June 5 tweet by Trump saying the executive order was aimed at \"dangerous countries.\" That helped demonstrate that he was not assessing whether the roughly 180 million citizens of the six countries had ties to terrorism, they said.\n\n___\n\nWHAT ABOUT THE REFUGEES?\n\nIn addition to banning travelers from six mostly Muslim nations for 90 days, Trump's executive order called for a suspension of the nation's refugee program. In his March ruling striking down the travel ban, a federal judge in Hawaii also held that the suspension of the refugee program was unconstitutional.\n\nThe 9th Circuit rebuffed the administration's efforts to reinstate that part of the order as well. The court said the president was required to consult with Congress in setting the number of refugees that would be allowed into the country in a given year and could not decrease that number mid-year.\n\nThat issue wasn't before the 4th Circuit, because in the Maryland case it considered, the lower court judge had not struck down the refugee program's suspension.\n\n___\n\nWHAT COMES NEXT?\n\nAttorney General Jeff Sessions said after Monday's ruling that the ban was necessary to protect national security, and the president was within his lawful authority to enact it.\n\nWhite House Press Secretary Sean Spicer said the administration was confident that the travel ban would be upheld by the U.S. Supreme Court.\n\nThe administration has asked the Supreme Court to immediately reinstate the ban on travelers.\n\nAt the Supreme Court, anything is possible if you have five votes — a majority of the court. The justices have a range of options in front of them. They could order an unusual June argument and try to resolve the travel ban lawsuits before they leave town for the summer. They also could essentially do nothing, leaving the two appeals court rulings in place.\n\nOne reason the court might feel some responsibility to act — and sooner rather than later — is because the administration has asked for expedited review. The court typically also has the last word when a federal court strikes down a law or presidential order.\n\nThe 9th Circuit's more narrow focus on immigration law may appeal to conservative justices on the Supreme Court who might be loath to extend their review beyond the text of the executive order to include the president's campaign statements about a Muslim ban, said David Levine, a professor at the University of California, Hastings College of the Law.\n\n\"They don't need to psychoanalyze the president,\" he said. \"They don't need to go beyond the four corners of the order.\"\n\n___\n\nJohnson reported from Seattle. Associated Press writer Mark Sherman in Washington, D.C., contributed to this report.", "authors": ["Sudhin Thanawala", "Gene Johnson"], "publish_date": "2017-06-13", "source": "foxnews", "top_words": ["executive", "travel", "fight", "ban", "circuit", "supreme", "qa", "court", "9th", "whats", "order", "president", "presidents", "legal"], "summary": "Another federal appeals court, the Virginia-based 4th Circuit, last month also refused to reinstate the travel ban, a decision Trump has already appealed to the Supreme Court.\nThe judges pointed to a June 5 tweet by Trump saying the executive order was aimed at \"dangerous countries.\"\nIn his March ruling striking down the travel ban, a federal judge in Hawaii also held that the suspension of the refugee program was unconstitutional.\nWhite House Press Secretary Sean Spicer said the administration was confident that the travel ban would be upheld by the U.S. Supreme Court.\nThey could order an unusual June argument and try to resolve the travel ban lawsuits before they leave town for the summer."}