{"url": "http://www.foxnews.com/us/2017/06/19/poll-courts-are-right-in-blocking-trumps-travel-ban.html", "id": "412", "title": "Poll: Courts are right in blocking Trump's travel ban", "text": "Most Americans say federal courts are acting properly in blocking President Donald Trump's travel ban, according to a new poll by The Associated Press-NORC Center for Public Affairs Research.\n\nTwo versions of the travel ban targeting Muslim-majority countries have been put on hold by federal courts. Trump says the ban is necessary to keep would-be terrorists from traveling to the United States. Opponents, including some state officials, argue that it is intended to keep Muslims out.\n\nFifty-seven percent of Americans say the courts have acted correctly by blocking the travel ban from taking effect, while 39 percent say the judges are wrongly interfering. The poll shows a sharp partisan divide: 82 percent of Democrats say the courts acted rightly, while 73 percent of Republicans say they're wrongly interfering. Among independents, 56 percent agree with the courts.\n\n\"From the beginning President Trump said, even before the election, that he intended to ban Muslims, not that he intended to ban terrorists but Muslims,\" said Nick Hardy, 54, an independent voter who said he leans Democratic. \"That's just not right.\"\n\nTrump initially signed an executive order in late January that banned people from Iran, Iraq, Syria, Yemen, Sudan, Somalia and Libya from traveling to the United States. That included legal permanent residents. The order also blocked all refugees from being resettled in the United States. The order caused chaos and confusion at airports around the world. Some travelers arriving in the United States were detained before being sent home, and people overseas were blocked from boarding U.S.-bound flights.\n\nThe original order was blocked in federal court, and an appeals court later upheld that ruling. A second order that dropped Iraq from the list of affected countries also has been blocked. It also exempted legal U.S. residents from the ban.\n\nThe Trump administration has asked the Supreme Court to immediately reinstate the updated ban, saying the U.S. will be safer if it is in place.\n\nThe San Francisco-based 9th U.S. Circuit Court of Appeals this month refused to reinstate the executive order, and a three-judge panel said the administration failed to show that blocking citizens from the six nations was needed to protect the U.S. The court also found that the president's order violated an immigration law prohibiting discrimination based on nationality.\n\nAs a candidate, Trump pledged to block Muslims from traveling to the United States until American authorities could get a better handle on vetting visitors and immigrants. Those campaign remarks have been used as evidence of his intention by opponents of the order.\n\nThe 4th U.S. Circuit in Richmond, Virginia, also has called Trump's national security concerns an after-the-fact justification for an order \"steeped in animus and directed at a single religious group.\"\n\nSixty-two percent of responders did think trying to protect the United States from security threats was a major reason, while 26 percent thought it was a minor reason and 11 percent thought it was not a reason at all.\n\nOn the other hand, 50 percent of people who responded to the AP-NORC poll said they think a desire to prevent Muslims from entering the country was a major reason for the ban, while 20 percent said it was a minor reason. Twenty-eight percent thought it was not a reason.\n\nThose viewpoints also largely broke down along partisan lines. Sixty-four percent of Democrats, 46 percent of independents and 34 percent of Republicans say preventing Muslims from entering the country was a major reason for the travel ban. Eighty-seven percent of Republicans, 70 percent of independents and 41 percent of Democrats say protecting the country from security threats was a major reason.\n\nRebecca Miller, a 50-year-old pet care business owner from Tampa, Florida, said she doesn't agree with a lot of what Trump says but supports the travel ban and thinks the courts have wrongly interfered with it. Miller said she votes \"promises, not party\" and sees the travel ban as a safety issue.\n\n\"I think that they want to stop the travel ban based on people claiming a certain religion. I don't think it's about religion, it's about safety,\" Miller said. \"I'm very interested to see the ban put into effect and for a couple of years kind of monitor it and see how it goes.\"\n\nThe AP-NORC poll of 1,068 adults was conducted June 8-11 using a sample drawn from NORC's probability-based AmeriSpeak panel, which is designed to be representative of the U.S. population. The margin of sampling error for all respondents is plus or minus 4.1 percentage points.\n\nRespondents were first selected randomly using address-based sampling methods and later interviewed online or by phone.\n\n___\n\nFollow Alicia A. Caldwell on Twitter at www.twitter.com/acaldwell and Emily Swanson at www.twitter.com/EL_Swan\n\n___\n\nOnline:\n\nAP-NORC: http://www.apnorc.org/", "authors": ["Alicia A. Caldwell", "Emily Swanson"], "publish_date": "2017-06-19", "source": "foxnews", "top_words": ["travel", "courts", "right", "trump", "ban", "blocking", "poll", "united", "states", "trumps", "reason", "order", "muslims", "say"], "summary": "Most Americans say federal courts are acting properly in blocking President Donald Trump's travel ban, according to a new poll by The Associated Press-NORC Center for Public Affairs Research.\nTwo versions of the travel ban targeting Muslim-majority countries have been put on hold by federal courts.\nFifty-seven percent of Americans say the courts have acted correctly by blocking the travel ban from taking effect, while 39 percent say the judges are wrongly interfering.\nMiller said she votes \"promises, not party\" and sees the travel ban as a safety issue.\n\"I think that they want to stop the travel ban based on people claiming a certain religion."}