{"url": "http://www.foxnews.com/politics/2017/01/31/some-sept-11-families-speak-out-against-trumps-travel-ban.html", "id": "53", "title": "Some Sept. 11 families speak out against Trump's travel ban", "text": "Some families of those killed in the Sept. 11 attacks spoke out Tuesday against President Donald Trump's ban on travelers from seven majority-Muslim countries.\n\nIn announcing the temporary ban last week, Trump referenced the 2001 attacks and said the measure was about national security. But a group of those whose loved ones were killed say the ban, which also bars refugees, is wrong.\n\nTerry McGovern, whose mother, Ann, was killed at the World Trade Center, said she was \"sickened\" by Trump's reference to Sept. 11.\n\n\"I, for one, am really tired of the exploitation of 9/11 for agendas that have nothing to do with our loved ones,\" she said.\n\nTrump's executive order temporarily blocks immigrants and visitors from Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen. It does not include any of the countries where the 19 Sept. 11 hijackers were from — Saudi Arabia, United Arab Emirates, Egypt and Lebanon.\n\nOther Sept. 11 families support the ban. Debra Burlingame, who lost her brother Charles, said she thought it was smart to have scrutiny of anyone who wants to come to the United States.\n\n\"This is all for our protection,\" she said, adding that she didn't have a problem even with U.S. citizens and legal permanent residents undergoing scrutiny.\n\n\"I'm for more security, not for less,\" she said.", "authors": [], "publish_date": "2017-01-31", "source": "foxnews", "top_words": ["loved", "travel", "ban", "security", "11", "families", "united", "trumps", "speak", "killed", "ones", "sept"], "summary": "Some families of those killed in the Sept. 11 attacks spoke out Tuesday against President Donald Trump's ban on travelers from seven majority-Muslim countries.\nBut a group of those whose loved ones were killed say the ban, which also bars refugees, is wrong.\nTerry McGovern, whose mother, Ann, was killed at the World Trade Center, said she was \"sickened\" by Trump's reference to Sept. 11.\nIt does not include any of the countries where the 19 Sept. 11 hijackers were from — Saudi Arabia, United Arab Emirates, Egypt and Lebanon.\nOther Sept. 11 families support the ban."}