{"url": "http://www.foxnews.com/politics/2017/01/30/house-dems-reportedly-demand-meeting-with-dhs-chief-over-trump-travel-ban.html", "id": "50", "title": "House Dems demand meeting with DHS chief over Trump travel ban", "text": "Top House Democrats have demanded an emergency meeting with Homeland Security Secretary John Kelly to get clarification over President Donald Trump’s immigration restrictions, which have been a source of controversy since they were put into action late last week.\n\nDemocrats on the judiciary, homeland security and foreign affairs oversight committees wrote a joint letter to Kelly “to discuss the implementation and guidance concerning the Executive Order.\"\n\nJohn Conyers Jr., D-Mich., ranking member of the House Judiciary Committee, Bennie Thompson, D-Mass., ranking member of the Homeland Security Committee, Eliot Engle, D-N.Y., ranking member of the Foreign Affairs Committee, and Zoe Lofgren, D-Calif., the top Democrat on the Judiciary’s immigration panel, all signed off on the letter to Kelly.\n\nThe lawmakers hope to get a meeting with Kelly by Wednesday or sooner. The lawmaker said the order has already led to panic and chaos and they pin the blame on the lack of “clarity and guidance” provided after Trump signed the order.\n\n“We look forward to meeting with you in short order so that we can have an open and candid discussion about how the Trump administration arrived at this chaotic place, what you understand the meaning of the Executive Order to be, and what guidance you have offered to your employees and other stakeholders.”\n\nDemocrats, as well as a small number of Republicans have lashed out against Trump’s order since it was signed Friday. Several Democrats in Congress said they would be introducing legislation to stop the ban.\n\n\"You have an extreme vetting proposal that didn't get the vetting it should have had,\" said Sen. Rob Portman, R-Ohio, who urged the new president to \"slow down\" and work with lawmakers on how best to tighten screening for foreigners who enter the United States.\n\n\"In my view, we ought to all take a deep breath and come up with something that makes sense for our national security\" and reflects the fact that \"America's always been a welcoming home for refugees and immigrants,\" he said.\n\nKelly issued a statement Sunday saying that, absent information indicating a serious threat to public safety and welfare, residency would be a \"dispositive factor in our case-by-case determination.\" That means citizens of the seven countries who hold permanent U.S. residency \"green cards\" will not be barred from re-entering the U.S., as officials had previously said.\n\nEarlier in the day, Senate Minority Leader Chuck Schumer, D-N.Y., staged a press conference with some immigrant children and adults impacted by the bans and vowed to fight them on Capitol Hill “with every fiber of my being.”\n\nSen. Diane Feinstein, D-Calif., said that she would introduce two bills Monday. One of the bills would rescind Trump's order, while the other would give Congress greater oversight of the president's immigration authority.\n\nThe executive order Trump issued Friday imposes a 120-day suspension of the U.S. refugee program and a 90-day ban on travel to the United States by citizens of Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\n\nBut by Saturday evening, a federal judge in Brooklyn issued a temporary halt on the part of the executive order that allows the Trump administration to deport people from the largely-Muslim countries.\n\nFox News' Chad Pergram and the Associated Press contributed to this report", "authors": [], "publish_date": "2017-01-30", "source": "foxnews", "top_words": ["executive", "travel", "trump", "ban", "dems", "security", "demand", "chief", "meeting", "dhs", "trumps", "signed", "ranking", "order", "member", "house", "kelly"], "summary": "Democrats on the judiciary, homeland security and foreign affairs oversight committees wrote a joint letter to Kelly “to discuss the implementation and guidance concerning the Executive Order.\"\nThe lawmaker said the order has already led to panic and chaos and they pin the blame on the lack of “clarity and guidance” provided after Trump signed the order.\nOne of the bills would rescind Trump's order, while the other would give Congress greater oversight of the president's immigration authority.\nThe executive order Trump issued Friday imposes a 120-day suspension of the U.S. refugee program and a 90-day ban on travel to the United States by citizens of Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\nBut by Saturday evening, a federal judge in Brooklyn issued a temporary halt on the part of the executive order that allows the Trump administration to deport people from the largely-Muslim countries."}