{"url": "http://www.foxnews.com/politics/2017/01/30/some-muslim-american-activists-back-trumps-extreme-vetting.html", "id": "51", "title": "Some Muslim-American activists back Trump's extreme vetting", "text": "Not all Muslim-Americans reject President Trump's executive order restricting travel from seven troubled, Muslim-majority nations.\n\nAmid widespread protests and a federal lawsuit filed by the Council for American-Islamic Relations, a handful of Muslim activists say the president was right to order the sudden imposition of strict and targeted travel regulations.\n\n“It’s not a ban on Islam, or any religion,” Raheel Raza, a Pakistani-born Muslim human rights activist, told Fox News. “There is so much hysteria surrounding this order that it’s unfortunately barring reason and logic. Trump is not politically correct at all. (If he wanted to) he would say outright that it was a Muslim ban.”\n\nRaza has come out in support of the 120-day suspension of the refugee program and a 90-day moratorium on travel to the U.S. from citizens of seven terror hot spots, including Iraq, Syria, Somalia and Sudan. She said every country has a right to secure its borders, and that the temporary order is needed while Washington works on a better solution to combat extremism.\n\n“I’m not a fan of [Trump’s] terminology but he’s bringing a necessary conversation to the table,” she said. “They may not like talking about these issues, but you don’t have to like Trump to have this discussion.\n\nExpand / Contract Hundreds of people rally against a temporary travel ban signed by U.S. President Donald Trump in an executive order during a protest at Detroit Metropolitan airport in Romulus, Michigan, U.S., January 29, 2017. (REUTERS/Rebecca Cook )\n\n“But let’s not lose sight of the fact that the reason they are refugees is because radical Islamists, and horrible foreign governments, are killing them.”\n\nOthers in the Muslim community have come out in favor of the travel ban, as well.\n\n“In the cold war, we vetted against communism, for communist theory and ideology,” Dr. Zuhudi Jasser, founder and president of the American Islamic Forum for Democracy, said during an interview on Fox News' America’s Newsroom. “That was part of the immigration process. I hope we begin to engage reformist Muslims. We need to stop with identity politics.\n\n“There is nothing more pro-Muslim than vetting jihadists,” Jasser added.\n\nThe executive order was signed Friday and took immediate effect, and affects travel to the United States by citizens of Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen. The order also suspends refugee admissions for 120 days and indefinitely bars the processing of refugees from Syria.\n\n\"Such selective and discriminatory acts will only serve to embolden the radical narratives of extremists and will provide further fuel to the advocates of violence and terrorism at a critical time,\" the Organization of Islamic Cooperation, the world's largest body of Islamic nations, said in a statement \"The OIC calls upon the United States government to reconsider this blanket decision and maintain its moral obligation to provide leadership and hope at a time of great uncertainty and unrest in the world.\"\n\nTrump has vigorously defended the order, saying it \"is about terror and keeping our country safe\" and not \"a Muslim ban.\"\n\nThousands of people spent the past weekend protesting the order at many of the nation’s airports, including New York’s JFK, Chicago’s O’Hare and LAX in Los Angeles.\n\nOn Monday, CAIR announced it filed a federal lawsuit on behalf of over 20 individuals that challenges the constitutionality of Trump’s executive order.\n\n“The vulgar animosity that accounts for the existence of Executive Order entitled ‘Protecting the Nation from Terrorist Attacks by Foreign Nationals, issued the same day of this action, is plain to see, and the absence of the words Islam or Muslim does nothing to obscure it,” reads a line from the lawsuit that was filed in the Eastern District Court of Virginia.\n\nAs of Monday, protests have continued at airports around the nation.\n\n“To the people protesting – you feel for these people, that’s great. So do I,” Raza said. “But where were you a month ago, three months ago, a year ago?\n\n“Protesters are yelling in the streets over a few hundred refugees detained – but they were not shouting in the streets when half a million Syrians were being butchered?”", "authors": [], "publish_date": "2017-01-30", "source": "foxnews", "top_words": ["executive", "travel", "extreme", "trump", "activists", "vetting", "refugees", "muslimamerican", "president", "trumps", "lawsuit", "order", "muslim", "islamic"], "summary": "Not all Muslim-Americans reject President Trump's executive order restricting travel from seven troubled, Muslim-majority nations.\n“It’s not a ban on Islam, or any religion,” Raheel Raza, a Pakistani-born Muslim human rights activist, told Fox News.\n“I’m not a fan of [Trump’s] terminology but he’s bringing a necessary conversation to the table,” she said.\nThe executive order was signed Friday and took immediate effect, and affects travel to the United States by citizens of Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen.\nOn Monday, CAIR announced it filed a federal lawsuit on behalf of over 20 individuals that challenges the constitutionality of Trump’s executive order."}