{"url": "http://www.foxnews.com/politics/2017/02/05/appeals-court-denies-trump-request-to-immediately-reinstate-travel-ban.html", "id": "58", "title": "Appeals court denies Trump request to immediately reinstate travel ban", "text": "Early Sunday morning a federal appeals court denied the Justice Department's request for an immediate reinstatement of President Donald Trump's ban on accepting certain travelers and refugees.\n\nThe DOJ filed an appeal of a judge’s order temporarily stopping Trump’s travel ban on Saturday night, saying it’s the “sovereign prerogative\" of a president to admit or exclude aliens.\n\nThe 9th U.S. Circuit Court of Appeals in San Francisco instead asked for the Justice Department to file a counter-response by Monday afternoon.\n\nThe higher court's denial of an immediate stay means the legal battles will continue for days at least.\n\nThe appeal stated that the district court’s ruling “conflicts with the basic principle that an alien seeking initial admission to the United States requests a privilege and has no constitutional rights regarding his application.\"\n\nThe appeal also said the temporary order blocking Trump’s ban was an overreach of judicial authority. The order was issued by U.S. District Judge James Robart in Seattle.\n\n\"Judicial second-guessing of the President's national security determination in itself imposes substantial harm on the federal government and the nation at large,\" it said.\n\nActing Solicitor General Noel Francisco argued on Saturday night saying that the president has the power to decide who can enter or stay in the United States.\n\n\"The power to expel or exclude aliens is a fundamental sovereign attribute, delegated by Congress to the executive branch of government and largely immune from judicial control,\" the brief says.\n\nThe Justice Department asked that the federal judge's order be stayed pending resolution of the appeal, so that the ban can \"ensure that those approved for admission do not intend to harm Americans and that they have no ties to terrorism.\"\n\nTrump’s controversial executive order has caused unending confusion for many travelers trying to reach the U.S.\n\nDemonstrations took place outside the White House, in New York and near his estate in Palm Beach, Florida, where Trump was attending the annual American Red Cross fundraising gala.\n\n\"We'll win,\" Trump told reporters Saturday night. \"For the safety of the country, we'll win.\"\n\nThe department on Saturday advised refugee aid agencies that those set to travel before Trump signed his order will now be allowed in. A State Department official said in an email obtained by The Associated Press that the government was \"focusing on booking refugee travel\" through Feb. 17 and working to have arrivals resume as soon as Monday.\n\nThe Homeland Security Department no longer was directing airlines to prevent visa-holders affected by Trump's order from boarding U.S.-bound planes. The agency said it had \"suspended any and all actions\" related to putting in place Trump's order.\n\nHearings have also been held in court challenges nationwide. Washington state and Minnesota argued that the temporary ban and the global suspension of the U.S. refugee program harmed residents and effectively mandated discrimination.\n\nThe Associated Press contributed to this report.", "authors": [], "publish_date": "2017-02-05", "source": "foxnews", "top_words": ["travel", "denies", "trump", "immediately", "ban", "appeals", "appeal", "night", "refugee", "court", "trumps", "reinstate", "order", "president", "department", "request"], "summary": "Early Sunday morning a federal appeals court denied the Justice Department's request for an immediate reinstatement of President Donald Trump's ban on accepting certain travelers and refugees.\nCircuit Court of Appeals in San Francisco instead asked for the Justice Department to file a counter-response by Monday afternoon.\nThe appeal also said the temporary order blocking Trump’s ban was an overreach of judicial authority.\nThe Homeland Security Department no longer was directing airlines to prevent visa-holders affected by Trump's order from boarding U.S.-bound planes.\nThe agency said it had \"suspended any and all actions\" related to putting in place Trump's order."}