{"url": "http://www.foxnews.com/politics/2017/02/06/states-say-lifting-halt-on-trumps-travel-ban-would-unleash-chaos.html", "id": "64", "title": "States say lifting halt on Trump's travel ban would 'unleash chaos'", "text": "Lawyers for Minnesota and Washington state told a federal appellate court Monday that it would “unleash chaos” if it lifted an order temporarily halting President Trump’s ban on refugees and travelers from seven predominantly Muslims countries from entering the U.S.\n\nThe states said in briefs filed with the San Francisco-based 9th U.S. Circuit Court of Appeals that Trump’s travel ban harmed residents, businesses and universities and stated that the ban was unconstitutional.\n\nThe legal maneuvers by the two states were accompanied by briefs filed by the technology industry arguing that the travel ban would harm their companies by making it more difficult to recruit employees.\n\nTech giants Apple and Google, along with Uber, filed their arguments with the court late Sunday.\n\nA federal judge in Seattle imposed a temporary restraining order on Trump’s ban, in response to a case filed last week by Washington and Minnesota challenging Trump’s constitutional authority to unilaterally impose such a sweeping ban.\n\nOn Saturday night, a federal appeals court denied a Trump administration request to lift the restraining order and allow the immigration ban to continue.\n\nThat ruling prompted an ongoing Twitter rant by Trump, who dismissed U.S. District Court Judge James Robart as a \"so-called judge\" and his decision \"ridiculous.\"\n\nTrump renewed his Twitter attacks against Robart on Sunday. \"Just cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!\" He followed with another tweet saying he had instructed the Homeland Security Department to check people coming into the country but that \"the courts are making the job very difficult!\"\n\nVice President Mike Pence said Sunday in an interview on “Fox News Sunday” that the federal judge who halted Trump’s temporary immigration ban “made the wrong decision” and vowed to use “all legal means at our disposal” to protect Americans.\n\n“From the outset of his campaign and administration, the president of the United States has made it clear to put the safety of the American people first,” Pence said. “We are going to win this argument.”\n\nTrump signed an executive order on Jan. 27 that temporarily halted immigration from seven mostly Muslim nations and the United States’ Syrian refugee program. The order follows his steadfast argument that radical Islamic terrorism poses a major threat to Americans’ safety.\n\nThe order immediately caused confusion for many foreigners trying to reach the U.S., prompted nationwide airport protests and led to multiple court challenges.\n\nThe federal government has until later today to respond to the state's briefs.\n\nThe Associated Press contributed to this report.", "authors": [], "publish_date": "2017-02-06", "source": "foxnews", "top_words": ["travel", "lifting", "ban", "immigration", "judge", "chaos", "court", "order", "president", "trumps", "federal", "filed", "states", "halt", "unleash", "say"], "summary": "Lawyers for Minnesota and Washington state told a federal appellate court Monday that it would “unleash chaos” if it lifted an order temporarily halting President Trump’s ban on refugees and travelers from seven predominantly Muslims countries from entering the U.S.\nCircuit Court of Appeals that Trump’s travel ban harmed residents, businesses and universities and stated that the ban was unconstitutional.\nA federal judge in Seattle imposed a temporary restraining order on Trump’s ban, in response to a case filed last week by Washington and Minnesota challenging Trump’s constitutional authority to unilaterally impose such a sweeping ban.\nOn Saturday night, a federal appeals court denied a Trump administration request to lift the restraining order and allow the immigration ban to continue.\nThat ruling prompted an ongoing Twitter rant by Trump, who dismissed U.S. District Court Judge James Robart as a \"so-called judge\" and his decision \"ridiculous.\""}