{"url": "http://www.foxnews.com/politics/2017/02/07/justice-department-argues-for-restoration-trump-travel-ban.html", "id": "68", "title": "Justice Department argues for restoration of Trump travel ban", "text": "The Justice Department argued Tuesday that a federal appeals court should overturn a district court judge's order halting President Trump's executive action suspending travel to the U.S. from seven majority-Muslim nations.\n\nThe hearing before the San Francisco-based 9th Circuit Court of Appeals judges was the greatest legal challenge yet to the travel ban, which has upended travel to the U.S. for more than a week and tested the new administration's use of executive power.\n\nSeveral states have fought the ban on travelers from seven predominantly Muslim nations — Iran, Iraq, Libya, Somalia, Sudan, Syria, Yemen — and insisted that it is unconstitutional.\n\nJustice Department attorney August Flentje asked the court to restore Trump's order, contending that the president alone has the power to decide who can enter or stay in the United States, as well as suspend classes of aliens when their entry to the country is otherwise detrimental to national security.\n\n\"That's what the president did here,\" Flentje argued.\n\nThe government described the executive order as a \"90-day pause\" needed to ensure adequate standards were in place for visa screening, which Flentje called \"plainly constitutional.\"\n\nJudge Michelle T. Friedland, who was appointed by President Barack Obama, asked whether the government has any evidence connecting the seven nations to terrorism.\n\nFlentje cited a number of Somalis in the U.S. who, he said, had been connected to the al-Shabab terrorist group terror group after judges asked for evidence. Flentje added that the case was moving fast and the government had not yet included additional evidence to support the ban.\n\n\n\nFlentje also noted that the executive order was based in part on a determination made by the Obama administration and Congress over the past two years that labeled the countries in question as either having a significant presence by a foreign terrorist organization or being a state sponsor of terrorism.\n\n\n\nThe final minutes of the hearing were largely devoted to whether the travel ban was intended to discriminate against Muslims.\n\n\n\nJudge Richard Clifton, a George W. Bush nominee, asked an attorney representing Washington state and Minnesota, which are challenging the ban, what evidence he had that it was motivated by religion.\n\n\"I have trouble understanding why we're supposed to infer religious animus when in fact the vast majority of Muslims would not be affected.\"\n\nHe said only 15 percent of the world's Muslims were affected, according to his calculations, and said the \"concern for terrorism from those connected to radical Islamic sects is hard to deny.\"\n\nNoah Purcell, Washington state's solicitor general, cited public statements by Trump calling for a ban on the entry of Muslims to the U.S. He said the states did not have to show every Muslim is harmed, only that the ban was motivated by religious discrimination.\n\nUnder questioning from Clifton, Flentje did not dispute that Trump made the statements.\n\n\n\nWashington state, Minnesota and other states challenging the ban want the appellate court to allow a temporary restraining order blocking the travel ban — which also temporarily suspended the country's refugee program — to stand as their lawsuit moves through the legal system.\n\nPurcell said that restraining order has not harmed the U.S. government.\n\n\n\nInstead, he told the panel, the order had harmed Washington state residents by splitting up families, holding up students trying to travel for their studies and preventing people from visiting family abroad.\n\n\n\nClifton said he suspected that only a \"small fraction\" of the state's residents were affected.\n\n\n\nThe court adjourned with Friendland promising a ruling would come \"as soon as possible.\" Whatever the court eventually decides, either side could ask the Supreme Court to intervene.\n\nIt is also possible that the panel could make a ruling on a technical point, such as whether the lower court's order is properly classified as a temporary restraining order, rather than on the larger merits of the case.\n\nThe Associated Press contributed to this report.", "authors": [], "publish_date": "2017-02-07", "source": "foxnews", "top_words": ["executive", "travel", "argues", "trump", "ban", "state", "evidence", "restoration", "court", "states", "flentje", "justice", "order", "president", "department"], "summary": "The Justice Department argued Tuesday that a federal appeals court should overturn a district court judge's order halting President Trump's executive action suspending travel to the U.S. from seven majority-Muslim nations.\nThe government described the executive order as a \"90-day pause\" needed to ensure adequate standards were in place for visa screening, which Flentje called \"plainly constitutional.\"\nFlentje added that the case was moving fast and the government had not yet included additional evidence to support the ban.\nThe final minutes of the hearing were largely devoted to whether the travel ban was intended to discriminate against Muslims.\nNoah Purcell, Washington state's solicitor general, cited public statements by Trump calling for a ban on the entry of Muslims to the U.S."}