{"url": "http://www.foxnews.com/politics/2017/02/07/conway-travel-ban-part-trumps-responsibility-authority-and-duty.html", "id": "66", "title": "Conway: Travel ban part of Trump's 'responsibility,' 'authority' and 'duty'", "text": "Counselor to the President Kellyanne Conway defended President Donald Trump's executive order halting travel to the U.S. from seven majority-Muslim nations Monday, saying that Trump \"has a responsibility, the authority, and indeed, the duty to protect Americans.\"\n\nConway spoke to Fox News' \"Hannity\" hours after the Justice Department filed a brief with a federal appeals court seeking the ban's restoration three days after a federal judge in Washington state halted the order.\n\nJUSTICE DEPARTMENT ASKS APPEALS COURT TO RESTORE TRUMP'S TRAVEL BAN\n\nEchoing the Justice Department brief, Conway argued that Friday's decision by U.S. District Court Judge James Robart was \"overly broad.\"\n\n\"It’s a nationwide injunction,\" Conway said. \"He referenced religion where, in fact, that has nothing to do with the executive order.\"\n\n\"The fact is,\" she added. \"we don’t even know if these states that sued have standing. Individuals have standing and individuals usually need to show harm and damages.\"\n\nConway also argued that Robart was \"wrong from the bench\" when he stated that no one from the seven countries named in Trump's executive order — Iran, Iraq, Libya, Somalia, Syria, Sudan and Yemen — had been arrested on terror charges in the United States since 2001. An Associated Press report described Robart's statement as \"a step too far.\"\n\n\"This is the judge who … issued a nationwide injunction,\" Conway said, \"and was just wrong from the bench in what he said about what this type of extreme vetting would provide or would have prevented had it been in place earlier.\"", "authors": [], "publish_date": "2017-02-07", "source": "foxnews", "top_words": ["executive", "travel", "standing", "ban", "conway", "judge", "wrong", "court", "trumps", "responsibility", "states", "department", "authority", "duty"], "summary": "Counselor to the President Kellyanne Conway defended President Donald Trump's executive order halting travel to the U.S. from seven majority-Muslim nations Monday, saying that Trump \"has a responsibility, the authority, and indeed, the duty to protect Americans.\"\nConway spoke to Fox News' \"Hannity\" hours after the Justice Department filed a brief with a federal appeals court seeking the ban's restoration three days after a federal judge in Washington state halted the order.\nJUSTICE DEPARTMENT ASKS APPEALS COURT TO RESTORE TRUMP'S TRAVEL BANEchoing the Justice Department brief, Conway argued that Friday's decision by U.S. District Court Judge James Robart was \"overly broad.\"\n\"He referenced religion where, in fact, that has nothing to do with the executive order.\"\n\"we don’t even know if these states that sued have standing."}