{"url": "http://www.foxnews.com/politics/2017/02/09/stephen-miller-coverage-trump-travel-ban-dishonest-false-and-wrong.html", "id": "73", "title": "Stephen Miller: Coverage of Trump travel ban 'dishonest,' 'false,' and 'wrong'", "text": "White House policy director Stephen Miller ripped media coverage of President Donald Trump's travel and immigration ban Wednesday night, saying it's \"frankly contemptible the way that false statements have been made about the president’s lawful, necessary and fully constitutional action.\"\n\n\"This is the apex of presidential power, delegated to the president by Congress and the Constitution to suspend the entry of aliens into the United States,\"Miller told Fox News' Sean Hannity.\n\nWHITE HOUSE FIRES BACK AT IMMIGRATION ORDER CRITICS WITH LIST OF TERROR ARRESTS\n\nMiller spoke hours after the White House released a list of terrorism cases involving suspects who came to the U.S. from the seven countries mentioned in the order: Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\n\n\"We’ve seen example after example ... of individuals becoming radicalized and joining terrorist groups,\" Miller said. \"The reality ... is that it is a daily feature of life for law enforcement officials and federal investigators all across this country to be investigating, interdicting and preventing terrorist acts that are only being conceived of ... because we let these individuals into our country in the first place.\"\n\nMiller also slammed U.S. District Court Judge James Robart's decision last week to issue a temporary restraining order, which halted the enforcement of Trump's executive order, as \"judicial activism.\"\n\n\"An unelected judge does not have the right to remake the immigration laws and policies for the entire United States of America,\" Miller said. \"This was an issue put before 300 million American citizens and they voted ... to put in place new, tough vetting measures so that we don’t end up [spending] hundreds of billions of dollars long-term dealing with the effects of an immigration system that is not properly controlled.\"", "authors": [], "publish_date": "2017-02-09", "source": "foxnews", "top_words": ["list", "travel", "dishonest", "trump", "ban", "false", "immigration", "wrong", "terrorist", "coverage", "united", "trumps", "president", "stephen", "miller", "order", "white", "house"], "summary": "White House policy director Stephen Miller ripped media coverage of President Donald Trump's travel and immigration ban Wednesday night, saying it's \"frankly contemptible the way that false statements have been made about the president’s lawful, necessary and fully constitutional action.\"\nWHITE HOUSE FIRES BACK AT IMMIGRATION ORDER CRITICS WITH LIST OF TERROR ARRESTSMiller spoke hours after the White House released a list of terrorism cases involving suspects who came to the U.S. from the seven countries mentioned in the order: Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\n\"We’ve seen example after example ... of individuals becoming radicalized and joining terrorist groups,\" Miller said.\nMiller also slammed U.S. District Court Judge James Robart's decision last week to issue a temporary restraining order, which halted the enforcement of Trump's executive order, as \"judicial activism.\"\n\"An unelected judge does not have the right to remake the immigration laws and policies for the entire United States of America,\" Miller said."}