{"url": "http://www.foxbusiness.com/politics/2017/03/15/federal-judge-in-hawaii-puts-trump-travel-ban-on-hold.html", "id": "7", "title": "Trump's Revised Travel Ban Blocked by Hawaii Judge", "text": "A federal judge in Hawaii issued a nationwide temporary restraining order Wednesday that bars implementation of President Donald Trump's revised executive order on immigration and refugees, a significant legal blow to the president's renewed bid to restrict U.S. entry for people from six Muslim-majority countries.\n\nContinue Reading Below\n\nMr. Trump made several changes to his travel restrictions after courts last month faulted his original executive order, but U.S. District Judge Derrick Watson said none of the alterations fixed a central problem: Mr. Trump was likely engaged in unconstitutional religious discrimination, the judge said.\n\nJudge Watson said both executive orders were tainted because Mr. Trump as a candidate had called for a ban on the entry of Muslims into the U.S. Such statements \"betray the Executive Order's stated secular purpose,\" the judge wrote in a 43-page opinion. The administration said the measures were needed to protect the country from terrorist threats.\n\n\"The record before this Court is unique. It includes significant and unrebutted evidence of religious animus driving the promulgation of the Executive Order and its related predecessor,\" wrote Judge Watson, an appointee of former President Barack Obama.\n\nHe cited an array of past statements by Mr. Trump, including a March 2016 interview in which he said, \"I think Islam hates us.\" He also quoted a December 2015 Trump campaign press release that said, \"Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States.\"\n\nThe ruling, and the president's immediate and harsh response to it, highlighted the starkly different views of the immigration issue that have divided the country in recent years, intensifying in the recent campaign. They also showcased a striking friction between the president and the judiciary.\n\nContinue Reading Below ADVERTISEMENT\n\nMr. Trump, speaking in Nashville, Tenn., launched into a fiery 10-minute passage vowing to fight the judge's order \"all the way.\" He would pursue the issue to the Supreme Court if necessary, Mr. Trump said, saying he would win because he has the authority to take sweeping immigration-related steps to keep the country safe from terrorist actions by people from overseas.\n\nThe president said the judge's order \"makes us look weak\" and suggested it had been issued \"for political reasons.\"\n\n\"This is a watered down version of the first one, this is a watered down version,\" he said. \"And let me tell you something, I think we ought to go back to the first one and go all the way, which is what I wanted to do in the first place. The danger is clear, the law is clear, the need for my executive order is clear.\"\n\nSpeaking at a rally in Nashville, Tenn., on Wednesday evening, President Donald Trump vowed to fight the judge's order, up to the Supreme Court if necessary.\n\nSpeaking at a rally in Nashville, Tenn., on Wednesday evening, President Donald Trump vowed to fight the judge's order, up to the Supreme Court if necessary. Photo: Jonathan Ernst/Reuters\n\nThe Justice Department said it strongly disagrees with the federal district court's ruling, which it called \"flawed both in reasoning and in scope.\"\n\nHawaii Attorney General Doug Chin, responding to Mr. Trump's comments at a press conference, said that rather than looking weak, \"What you're actually seeing is you're seeing the strength of the American system.\" He added, \"They were trying even harder to mask what was a religious animus.\"\n\nThe ruling came just hours before the new ban was slated to take effect at 12:01 a.m. Thursday. Mr. Trump had made several significant concessions in his revised ban after his original effort from Jan. 27 was derailed in the courts.\n\nAt least initially, those changes didn't prove enough to get over legal hurdles.\n\nTwo other judges, in Maryland and Washington state, were also considering possible rulings in travel-ban cases that could come at any time.\n\nThe revised travel ban, signed March 6 by Mr. Trump, sought to temporarily bar U.S. entry for travelers from Iran, Libya, Somalia, Sudan, Syria and Yemen. The revised order also sought to temporarily suspend the admission of refugees into the U.S.\n\nThe original order, which produced chaos around the country, barred travel from Iraq as well as the other six countries and applied to a broader class of people, including visa holders and green-card recipients, who previously had permission to be in the U.S.\n\nCourts in the first round of litigation said the original order raised major due process concerns because it didn't give people advance notice of the policy or allow them the chance to argue that they should be allowed to travel.\n\nThe White House took several steps in its revised order to address those due process concerns, and as a result the latest legal fight has focused on whether the travel ban violated the Constitution's Establishment Clause, which prohibits the government from disfavoring particular religions.\n\nJudge Watson, ruling in a challenge brought by the state of Hawaii, ruled it likely did.\n\nThe ruling isn't a final determination of the executive order's underlying legality, but rather a finding that the challengers are likely to ultimately prevail in the courts. The judge found the challengers would be harmed if the order wasn't halted now, so he suspended it while the underlying litigation continues.\n\nAny government appeal would go back to the Ninth U.S. Circuit Court of Appeals, the same court that dealt the final blow to Mr. Trump's original executive order. The president chose to rewrite that order rather than continue to fight for it in court.\n\nHawaii State Attorney General Douglas Chin speaking at a news conference in Honolulu on Wednesday.\n\nHawaii State Attorney General Douglas Chin speaking at a news conference in Honolulu on Wednesday. Photo: Kent Nishimura/Agence France-Presse/Getty Images\n\nThe Hawaii ruling came after a day of legal jousting in courtrooms around the country, as judges and lawyers raced against the clock before the ban took effect. Judge Watson in Hawaii and U.S. District Judge Theodore D. Chuang in Greenbelt, Md., both asked tough questions of both sides.\n\nRefugee-assistance groups and others, represented by the American Civil Liberties Union, brought the Maryland case, saying immigrants and refugees would face immediate harm if the executive order was allowed to go live.\n\nWhile the advocacy groups in Maryland pressed their arguments that the travel restrictions amounted to unlawful discrimination against Muslims, Judge Chuang asked how he should view the new national-security justifications Mr. Trump provided when issuing the new ban.\n\n\"Generally courts defer, at least to some degree,\" to those type of national-security determinations, Judge Chuang said.\n\nThe judge noted that the Trump administration had altered the travel ban in a number of ways since Mr. Trump's original effort was halted by courts, and \"they have offered additional information\" in support of the executive order.\n\nACLU lawyer Omar Jadwat said the president's revised order, like the first one, wasn't motivated by an actual imminent threat of terrorist attack. Adding new national-security language to the order \"doesn't divorce it from its original purpose,\" he said, which was to implement a ban on Muslim immigrants as Mr. Trump promised during the presidential campaign.\n\nIn a sign of the high stakes, the Justice Department sent its top lawyers to the Maryland court.\n\nJeffrey Wall, the administration's new acting solicitor general, said the harms claimed by the challengers from the travel restrictions were speculative, and that wasn't enough to give them a right to sue the president. \"The plaintiffs have run into court too soon,\" he said.\n\nWhen the judge cited Mr. Trump's previous campaign statements in support of a Muslim ban, Mr. Wall said circumstances were different now that he had taken the oath of office. He noted that the president's new executive order made no mention at all of religion, and that Mr. Trump issued the new policy after consulting with three cabinet-level officials \"whose motives have not been impugned.\"\n\nA third judge, James Robart in Seattle, also held a hearing Wednesday on Mr. Trump's revised executive order. He is presiding over multiple cases, including a challenge brought by several Democratic-led states.\n\nJudge Robart previously issued a major ruling that blocked the first executive order.", "authors": [], "publish_date": "2017-03-15", "source": "foxnews", "top_words": ["executive", "ruling", "travel", "hawaii", "revised", "trump", "ban", "judge", "trumps", "blocked", "order", "president", "mr"], "summary": "Mr. Trump had made several significant concessions in his revised ban after his original effort from Jan. 27 was derailed in the courts.\nThe revised travel ban, signed March 6 by Mr. Trump, sought to temporarily bar U.S. entry for travelers from Iran, Libya, Somalia, Sudan, Syria and Yemen.\nACLU lawyer Omar Jadwat said the president's revised order, like the first one, wasn't motivated by an actual imminent threat of terrorist attack.\nWhen the judge cited Mr. Trump's previous campaign statements in support of a Muslim ban, Mr. Wall said circumstances were different now that he had taken the oath of office.\nA third judge, James Robart in Seattle, also held a hearing Wednesday on Mr. Trump's revised executive order."}