{"url": "http://www.foxnews.com/politics/2017/02/10/conway-says-court-ruling-on-trump-travel-ban-does-not-affect-merits-at-all.html", "id": "74", "title": "Conway says court ruling on Trump travel ban 'does not affect the merits at all'", "text": "A top adviser to President Trump said Thursday in an exclusive interview on \"The First 100 Days\" that the White House is \"fully confident\" it will get its day in court in the wake of the decision by a federal appeals court to uphold the suspension of the controversial executive order on immigration.\n\nKellyanne Conway told Fox News' Martha MacCallum that Trump's reaction to the ruling is not just a promise he made as a candidate, but his duty as president.\n\n\"This ruling does not affect the merits at all,\" Conway said. \"It is an interim ruling, and we are fully confident now that we will get our day in court, and have the opportunity to argue on the merits, that we will prevail.\"\n\nConway told MacCallum she could not comment on whether Trump would take the case to the Supreme Court, but that there were \"different options\" the White House had to work with.\n\nShe also addressed the recent dust up regarding Trump's Supreme Court pick Neil Gorsuch after Sen. Richard Blumenthal, D-Conn., leaked alleged details of a conversation he had with the nominee. Blumenthal on Wednesday told reporters that Gorsuch said previous comments made by Trump about a federal judge were “demoralizing” and “disheartening.”\n\nConway said Trump \"has full confidence in his Supreme Court nominee,\" and that members of the judiciary \"have a right to speak out.\"\n\n\"This is something that is done on occasion but I think we should we should look at the mutual respect these two men have for each other,\" she said.", "authors": [], "publish_date": "2017-02-10", "source": "foxnews", "top_words": ["ruling", "merits", "travel", "does", "nominee", "trump", "maccallum", "ban", "supreme", "affect", "conway", "told", "court", "trumps", "white"], "summary": "Kellyanne Conway told Fox News' Martha MacCallum that Trump's reaction to the ruling is not just a promise he made as a candidate, but his duty as president.\n\"This ruling does not affect the merits at all,\" Conway said.\n\"It is an interim ruling, and we are fully confident now that we will get our day in court, and have the opportunity to argue on the merits, that we will prevail.\"\nConway told MacCallum she could not comment on whether Trump would take the case to the Supreme Court, but that there were \"different options\" the White House had to work with.\nShe also addressed the recent dust up regarding Trump's Supreme Court pick Neil Gorsuch after Sen. Richard Blumenthal, D-Conn., leaked alleged details of a conversation he had with the nominee."}