{"url": "http://www.foxnews.com/politics/2017/02/08/white-house-fires-back-at-immigration-order-critics-with-list-terror-arrests.html", "id": "71", "title": "White House fires back at immigration order critics with list of terror arrests", "text": "The White House moved Wednesday to counter critics who claim President Trump’s travel ban goes too far, circulating a list of terror cases involving suspects who came to the U.S. from the seven countries in question.\n\nThe list, obtained by Fox News, gave 24 examples of refugees and other immigrants from Somalia, Sudan, Iraq, Iran, Yemen, Syria and Libya who have been arrested on terror-related charges; most have been convicted.\n\nThose seven, mostly Muslim countries were singled out in Trump's executive order, which suspended immigration for 90 days from those nations.\n\nThe document of terror arrests appears to be, in part, a rebuke to Seattle U.S. District Judge James Robart who, in questioning a Justice Department lawyer last week about the number of post-9/11 arrests of foreign nationals from those countries, incorrectly asserted: “Let me tell you … The answer to that is none, as best I can tell.”\n\nRobart halted the rollout of the executive order. The case is now before the San Francisco-based 9th Circuit Court of Appeals, where Justice Department lawyers are arguing for the restoration of the measure.\n\nThe White House document itself names 10 individuals from Somalia, six from Iraq, one from Yemen, two from Sudan, two from Iran, two from Libya and one from Syria. The cases span the last eight years, and include most recently a case in June in which two Somali refugees were jailed for conspiring to commit murder in Syria on behalf of ISIS.\n\nIt also includes a case from March of last year, where a Yemeni native who became a U.S. citizen was sentenced to 22 years in prison for attempting to provide “material support” to ISIS and planning to shoot and kill members of the U.S. military who had returned from Iraq.\n\nThe dossier also cited a case from January 2016, in which a Palestinian who was born in Iraq and came to the U.S. as a refugee allegedly tried to provide material support to terror groups abroad. The dossier cites media reports that he told his wife, “I want to blow myself up … I am against America.”\n\nEarlier in the day, Trump defended his order at a meeting with local police chiefs and sheriffs in Washington, D.C., and hinted that he thought the court case was being politicized.\n\n\"I don't ever want to call a court biased, so I won’t call it biased and we haven’t had a decision yet, but courts seem to be so political,\" he said. “It would be so great for our justice system if they were able to read a statement and do what’s right and that’s to do with the security of our nation, which is so important.”\n\nHe warned that until the issue was resolved, the nation's security would be at risk.\n\n\"I think it's sad, I think it's a sad day,\" he said. \"I think our security is at risk today and it will be at risk until such time as ... we get what we are entitled to as citizens of this country.\"\n\nWhile the rollout of Trump's order, signed just days into his presidency, was marred by confusion over its application to green-card holders and others, critics have argued more broadly that it amounts to a discriminatory \"Muslim\" ban.\n\nWashington state Solicitor General Noah Purcell argued in a court hearing that Trump campaign statements reveal \"shocking evidence\" of intent to discriminate.\n\nFox News’ John Roberts and Adam Shaw contributed to this report.", "authors": [], "publish_date": "2017-02-08", "source": "foxnews", "top_words": ["list", "case", "justice", "immigration", "security", "iraq", "court", "think", "house", "trumps", "syria", "fires", "order", "terror", "white", "arrests", "critics"], "summary": "The White House moved Wednesday to counter critics who claim President Trump’s travel ban goes too far, circulating a list of terror cases involving suspects who came to the U.S. from the seven countries in question.\nThose seven, mostly Muslim countries were singled out in Trump's executive order, which suspended immigration for 90 days from those nations.\nThe case is now before the San Francisco-based 9th Circuit Court of Appeals, where Justice Department lawyers are arguing for the restoration of the measure.\nWhile the rollout of Trump's order, signed just days into his presidency, was marred by confusion over its application to green-card holders and others, critics have argued more broadly that it amounts to a discriminatory \"Muslim\" ban.\nWashington state Solicitor General Noah Purcell argued in a court hearing that Trump campaign statements reveal \"shocking evidence\" of intent to discriminate."}