{"url": "http://www.foxnews.com/politics/2017/03/01/trump-administration-pushes-back-signing-new-travel-ban-official-says.html", "id": "98", "title": "Trump administration pushes back signing new travel ban, official says", "text": "President Trump will not sign a new travel ban until later in the week, a senior administration official told Fox News.\n\nTrump was expected to sign a new refugee and immigration executive order Wednesday, one day after addressing lawmakers at a joint session of Congress, a senior administration official said.\n\nTrump initially planned to sign the new order last week, but spokesman Sean Spicer said the president was holding off \"to make sure that when we execute this, it's done in a manner that's flawless.\"\n\nTRUMP REJECTS DHS INTELLIGENCE REPORT ON TRAVEL BAN\n\nFormer CIA Director John Brennan said Sunday in a televised interview that President Trump’s proposed executive order banning travel from seven predominantly Muslim nations was not going to help fight terrorism in “any significant way.”\n\n“I don’t think the travel ban is going to help in any significant way,” Brennan said on CBS News’ “Face the Nation.”\n\nBrennan added that it would be more important to focus on terror recruitment online rather than taking a person’s country of origin into account when deciding how to bar potential terrorists from the U.S.\n\n“I do think that report puts its finger on it by saying that citizenship is not the indicator of a potential terrorist action,” Brennan said. “The vetting process that needs to go on has to take into account multiple factors, not just countries of origin or where they may be departing from.”\n\nFox News' Serafin Gomez contributed to this report", "authors": [], "publish_date": "2017-03-01", "source": "foxnews", "top_words": ["travel", "official", "significant", "trump", "pushes", "ban", "brennan", "report", "senior", "think", "week", "signing", "sign", "order", "president", "administration"], "summary": "President Trump will not sign a new travel ban until later in the week, a senior administration official told Fox News.\nTrump was expected to sign a new refugee and immigration executive order Wednesday, one day after addressing lawmakers at a joint session of Congress, a senior administration official said.\nTrump initially planned to sign the new order last week, but spokesman Sean Spicer said the president was holding off \"to make sure that when we execute this, it's done in a manner that's flawless.\"\nTRUMP REJECTS DHS INTELLIGENCE REPORT ON TRAVEL BANFormer CIA Director John Brennan said Sunday in a televised interview that President Trump’s proposed executive order banning travel from seven predominantly Muslim nations was not going to help fight terrorism in “any significant way.”“I don’t think the travel ban is going to help in any significant way,” Brennan said on CBS News’ “Face the Nation.”Brennan added that it would be more important to focus on terror recruitment online rather than taking a person’s country of origin into account when deciding how to bar potential terrorists from the U.S.“I do think that report puts its finger on it by saying that citizenship is not the indicator of a potential terrorist action,” Brennan said.\n“The vetting process that needs to go on has to take into account multiple factors, not just countries of origin or where they may be departing from.”Fox News' Serafin Gomez contributed to this report"}