{"url": "http://www.foxnews.com/politics/2017/02/25/trump-rejects-dhs-intelligence-report-on-travel-ban.html", "id": "95", "title": "Trump rejects DHS intelligence report on travel ban", "text": "Officials in President Trump’s administration Friday downplayed an intelligence report by the Homeland Security Department that contradicts the White House’s main arguement for implementing a travel ban on seven predominantly Muslim countries.\n\nThe report, which was viewed by The Wall Street Journal and Associated Press, determined that the \"country of citizenship is unlikely to be a reliable indicator of potential terrorist activity.\"\n\nThe Trump administration has taken the position that immigrants from seven Muslim-majority countries should be blocked from the U.S. due to their terror risk. Trump used terrorism a primary justification when he announced the now court-blocked travel ban in late January.\n\nThe intelligence report found that in the past six years, foreign-born individuals who were “inspired” to strike in the U.S. came from 26 different countries.\n\nVIDEO: DERSHOWITZ ON WHAT HE EXPECTS NEXT FOR TRUMP'S TRAVEL BAN\n\nSenior White House Policy Adviser Stephen Miller told Fox News' \"First 100 Days\" Tuesday that a revised version of the travel ban would \"have the same basic policy outcome.\"\n\nA senior administration official told The Wall Street Journal that the DHS report’s assessment overlooked key information and the finished product that the White House requested has not been completed. The White House called the report politically motivated. Officials said it overlooked some information that supported the ban.\n\n“The president asked for an intelligence assessment,” the official said. “This is not the intelligence assessment the president asked for.”\n\nVIDEO: DEMOCRAT FINDS ELEMENTS TO SUPPORT IN TRUMP'S TRAVEL BAN\n\nThe draft report determined that few people from the countries Trump listed in his travel ban have carried out attacks or been involved in terrorism-related activities in the U.S. since Syria's civil war started in 2011.\n\nGillian Christensen, a DHS spokeswoman, does not dispute the report's authenticity, but says it was not a final comprehensive review of the government's intelligence.\n\n“It is clear on its face that it is an incomplete product that fails to find evidence of terrorism by simply refusing to look at all the available evidence,” she said, according to The Journal. “Any suggestion by opponents of the president’s policies that senior (homeland security) intelligence officials would politicize this process or a report’s final conclusions is absurd and not factually accurate. The dispute with this product was over sources and quality, not politics.”\n\nThe Associated Press contributed to this report\n\nEdmund DeMarche is a news editor for FoxNews.com. Follow him on Twitter @EDeMarche.\n\n", "authors": ["Edmund Demarche"], "publish_date": "2017-02-25", "source": "foxnews", "top_words": ["product", "travel", "intelligence", "trump", "ban", "report", "reports", "trumps", "dhs", "rejects", "president", "white"], "summary": "Officials in President Trump’s administration Friday downplayed an intelligence report by the Homeland Security Department that contradicts the White House’s main arguement for implementing a travel ban on seven predominantly Muslim countries.\nTrump used terrorism a primary justification when he announced the now court-blocked travel ban in late January.\nThe intelligence report found that in the past six years, foreign-born individuals who were “inspired” to strike in the U.S. came from 26 different countries.\nVIDEO: DERSHOWITZ ON WHAT HE EXPECTS NEXT FOR TRUMP'S TRAVEL BANSenior White House Policy Adviser Stephen Miller told Fox News' \"First 100 Days\" Tuesday that a revised version of the travel ban would \"have the same basic policy outcome.\"\nGillian Christensen, a DHS spokeswoman, does not dispute the report's authenticity, but says it was not a final comprehensive review of the government's intelligence."}