{"url": "https://www.nytimes.com/2017/02/03/world/europe/kjell-magne-bondevik-norway-dulles.html?mcubz=0", "id": "194", "title": "Norwegian Ex-Premier Is Stopped at Dulles Airport Over Iran Visit", "text": "Mr. Bondevik’s wait at the airport, which was first reported by the Washington-area news outlet WJLA, has gotten widespread attention in the wake of Mr. Trump’s travel policy. It was actually Mr. Trump’s predecessor, Barack Obama, who signed a 2015 law imposing tighter visa restrictions on foreigners who have traveled to Iran, Iraq, Syria and Sudan within the last five years.\n\nBut the policy, which took effect in January 2016, includes exceptions for people who have visited those countries for business, government, humanitarian or journalistic reasons, so it is not clear why Mr. Bondevik was stopped.\n\nMr. Bondevik said he could understand the need for safety precautions, but he was dismayed at the length of his wait. He notified the Norwegian ambassador in Washington of his concerns.\n\n“The explanation alone should be more than enough to let me pass,” he said. “Surely they can’t seriously believe that a former prime minister of Norway has sinister intentions” or is “planning to perform misdeeds in the U.S.”\n\nA spokesman for the Norwegian Ministry of Foreign Affairs in Oslo confirmed that Mr. Bondevik holds a diplomatic passport and that Mr. Bondevik had been in touch with the ministry about this matter, but he declined to comment further on the incident.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Bondevik, in the interview, said he had traveled to the United States in January 2016, with the Iranian visa in his passport, without incident.\n\n“I do not wish to dramatize this event, or cause unnecessary harm to relations between Norway and the U.S., but I did react to the manner in which this was conducted,” he said. In an interview with Norwegian television, he urged the American government not to damage the image of the United States, and he described Mr. Trump’s travel ban as overly broad and as frightening.\n\nNorway, the home of the Nobel Peace Prize, has a long history of protecting refugees, and Mr. Trump’s 120-day ban on refugee admissions — and an indefinite ban on Syrian refugees — has been widely criticized in Norway.\n\nAdvertisement Continue reading the main story\n\n“I am concerned about the signals from the Trump administration,” the Norwegian minister of foreign affairs, Borge Brende, told the newspaper VG this week. “Norway’s position is clear, refugees must be treated equal regardless of religion, nationality and the color of their skin.”\n\nIn comments on the website of the newspaper VG, Norwegians expressed shock at the treatment of Mr. Bondevik.\n\n“How can it take an hour to ask some questions?” asked Morten Milsem. Henning Kilseth said it was “totally ridiculous to be suspicious of a former Norwegian prime minister.”\n\nOle Edvard Antonsen noted Mr. Bondevik’s work as a Christian minister and asked whether the United States had become “a nation built on fear.”\n\nMr. Bondevik was prime minister from 1997 to 2000 and again from 2001 to 2005. Along with the conference associated with the National Prayer Breakfast, he was in Washington for other meetings. As a result of the questioning, he said, he ran late.", "authors": ["Henrik Pryser Libell"], "publish_date": "2017-02-03", "source": "nytimes", "top_words": ["stopped", "iran", "dulles", "expremier", "airport", "bondevik", "ban", "visit", "refugees", "united", "trumps", "prime", "states", "norwegian", "mr", "minister"], "summary": "Mr. Bondevik’s wait at the airport, which was first reported by the Washington-area news outlet WJLA, has gotten widespread attention in the wake of Mr. Trump’s travel policy.\nIt was actually Mr. Trump’s predecessor, Barack Obama, who signed a 2015 law imposing tighter visa restrictions on foreigners who have traveled to Iran, Iraq, Syria and Sudan within the last five years.\nMr. Bondevik said he could understand the need for safety precautions, but he was dismayed at the length of his wait.\nMr. Bondevik, in the interview, said he had traveled to the United States in January 2016, with the Iranian visa in his passport, without incident.\nAdvertisement Continue reading the main story“I am concerned about the signals from the Trump administration,” the Norwegian minister of foreign affairs, Borge Brende, told the newspaper VG this week."}