{"url": "https://www.nytimes.com/2017/02/02/technology/uber-ceo-travis-kalanick-trump-advisory-council.html?mcubz=0", "id": "179", "title": "Uber C.E.O. to Leave Trump Advisory Council After Criticism", "text": "Mr. Kalanick’s exit from the advisory council underscores the tricky calculus facing many Silicon Valley corporate chieftains who try to work with the new administration. On one hand, many tech executives have openly tried to engage with the president, a path that is typically good for business. Yet Mr. Trump’s immigration order has been so unpopular with so many tech workers — many of whom are immigrants themselves and who advocate globalization — that they are now exerting pressure on their chief executives to push back forcefully against the administration.\n\nThirty miles south of Uber’s headquarters, for example, Facebook employees have voiced frustration that Peter Thiel, the billionaire tech investor and adviser to Mr. Trump, still has a seat on the social network’s board. At Google, employees have staged protests against the immigration order. At Twitter’s headquarters, some employees have said they are uneasy about the president’s heavy reliance on their service to send divisive messages.\n\nThe tension over continuing to work with Mr. Trump reached a breaking point at Uber because Mr. Kalanick was, until Thursday, one of the most vocal proponents among tech chiefs of engaging with the president. As recently as Saturday, Mr. Kalanick had publicly said in a blog post that the best route forward was to have “a seat at the table.” He had added, “We partner around the world optimistically in the belief that by speaking up and engaging we can make a difference.”\n\nOutside of the internal pressure, Uber faced other fallout from Mr. Kalanick’s stance. More than 200,000 customers had deleted their accounts.\n\nIn addition, Uber rivals had seized the moment to attack the company and bolster their own businesses. The New York Taxi Workers Alliance sent emails to the news media calling attention to Uber’s ties to Mr. Trump, and organized a protest at Uber’s New York office for Thursday. Lyft, another ride-hailing service, pledged to donate $1 million to the American Civil Liberties Union and has seen its app shoot toward the top of the download charts.\n\nUber drivers, many of them immigrants who work for the ride-hailing company on a freelance basis, were also upset.\n\n“There would be no Uber without immigrants,” said Jim Conigliaro Jr., founder of the Independent Drivers Guild, an organization that represents and advocates protections for nearly 50,000 Uber drivers serving New York City. “As a company whose success is built on a foundation of hard work by immigrant workers, Uber can and should do better to stand up for immigrants and their workers.”\n\nAdvertisement Continue reading the main story\n\nUber has set aside $3 million for a legal-defense fund to support drivers, offering help with translation services and round-the-clock telephone access to legal aid.\n\nFor Mr. Kalanick, the moment was especially fraught. Other corporate chiefs, including Elon Musk of Tesla and SpaceX, and Mary Barra of General Motors, are also on the president’s economic advisory team. Mr. Musk said on Twitter this week that the group of economic advisers planned to come to some sort of “consensus” on immigration, and to influence Mr. Trump by engaging directly with him rather than cutting off ties completely.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“Travis and the other C.E.O.s are on that (presidential) board for one simple reason: To advance their business interests,” said Dan O’Sullivan, a writer from the Chicago area who helped to spread the #DeleteUber campaign on social media.\n\nInternally, Uber staff members also began piling on the pressure. According to nearly a dozen current and former Uber engineers and product managers who attended or were briefed on the Tuesday all-hands meeting, employees said they were concerned that Mr. Kalanick’s willingness to work with Mr. Trump after the immigration order would color Uber as a soulless company that cared only about its bottom line.\n\nSome told Mr. Kalanick that they had suffered a personal cost — a stigma, they said — of working at Uber. One staff member asked him to present the benefits of working at Uber that could outweigh that personal cost.\n\nMr. Kalanick replied that he believed that change could be best effected through engagement, and through the work they did every single day.\n\nMany employees were not satisfied with his answer. On Wednesday, Uber staff members followed up by circulating a 25-page Google document titled “Letters to Travis” to tell the chief executive how and why his willingness to engage with the administration had affected them.\n\nBy Thursday morning, Mr. Kalanick had reversed his position on engaging with Mr. Trump. His participation in the economic advisory council had created what he called a “perception-reality gap between who people think we are, and who we actually are.”\n\nIn his email to employees, he said his participation was being interpreted as a sign that he had endorsed the president and the administration’s agenda. In fact, Mr. Kalanick said, the immigration order was hurting many people across America.\n\nAdvertisement Continue reading the main story\n\n“Immigration and openness to refugees is an important part of our country’s success and quite honestly to Uber’s,” he wrote.\n\nMr. Kalanick said he had spoken briefly with Mr. Trump to let him know he was withdrawing from the advisory council.\n\n“Please know, your questions and stories on Tuesday, along with what I heard from drivers, have kept me resilient and reminded me of one of our most essential cultural values, Be Yourself,” Mr. Kalanick wrote.", "authors": ["Mike Isaac"], "publish_date": "2017-02-02", "source": "nytimes", "top_words": ["council", "advisory", "trump", "immigration", "kalanick", "leave", "employees", "uber", "ceo", "work", "ubers", "drivers", "york", "criticism", "mr"], "summary": "The tension over continuing to work with Mr. Trump reached a breaking point at Uber because Mr. Kalanick was, until Thursday, one of the most vocal proponents among tech chiefs of engaging with the president.\nUber drivers, many of them immigrants who work for the ride-hailing company on a freelance basis, were also upset.\nSome told Mr. Kalanick that they had suffered a personal cost — a stigma, they said — of working at Uber.\nBy Thursday morning, Mr. Kalanick had reversed his position on engaging with Mr. Trump.\nMr. Kalanick said he had spoken briefly with Mr. Trump to let him know he was withdrawing from the advisory council."}