{"url": "https://www.nytimes.com/2017/01/30/us/california-today-airport-protests.html?mcubz=0", "id": "137", "title": "California Today: Airports a Flashpoint in Immigration Protests", "text": "Ms. Harris said that Customs and Border Protection officials throughout the state were continuing to detain legal permanent residents and visa holders, while not letting them speak to lawyers.\n\n“I hope you will agree that one of the fundamental rights that distinguish our country from dictatorships and despotic regimes in the world is that we believe in fundamental fairness and due process — a key aspect of which permitting legal representation,” she wrote.\n\nMr. Becerra said the executive order “tramples on centuries of American tradition,” adding in a statement, “We will use every tool within our authority to offer victims of the Trump administration’s overreach a fighting chance to overcome but another cruel barrier to their flight to freedom.”\n\nOn Sunday, Mr. Becerra joined attorneys general from 15 other states, including Pennsylvania, Iowa and Illinois, condemning the order and promising to help minimize its impact.\n\nMs. Feinstein said she would introduce legislation that would rescind the executive order and another that would limit executive authority and prevent the president from unilaterally banning groups of immigrants.\n\nBy the end of the day Sunday, the Trump administration appeared to walk back some of the restrictions, saying that people from the seven countries who have green cards will not be stopped from re-entering the United States. But as confusion reigned throughout the country Sunday, it remained unclear how the order will continue to affect travel worldwide.\n\nCalifornia Online\n\n(Please note: We regularly highlight articles on news sites that have limited access for nonsubscribers.)\n\nPhoto\n\n• An editorial calls for a buffer zone between homes and oil drilling operations in Los Angeles. [The New York Times]\n\nAdvertisement Continue reading the main story\n\n• The Los Angeles County child protection agency has missed hundreds of payments to foster families because of computer glitches. [Los Angeles Times]\n\n• Gov. Jerry Brown will undergo radiation treatment for prostate cancer that he first had treated in 2012. [The Associated Press]\n\n• A new “hate map” from the Southern Poverty Law Center lists 30 groups in Southern California. [Orange County Register]\n\n• A sporting-equipment company based in Carlsbad is hoping its single-length irons will revolutionize golfing. [The New York Times]\n\nPhoto\n\n• The Seasteading Institute, a California nonprofit, has raised $2.5 million from more than 1,000 donors to build a city of floating islands in the South Pacific. [The New York Times]\n\n• California has its sights set on a legal marijuana economy that could be worth up to $7 billion. [The Associated Press]\n\n• Opposition to Mr. Trump’s policies was center stage at the Screen Actors Guild Awards in Los Angeles. [The New York Times]\n\nPhoto\n\n• Arthur H. Rosenfeld, a physicist whose work laid the foundation for energy-saving requirements for appliances and buildings, died in Berkeley on Friday. [The New York Times]\n\nAdvertisement Continue reading the main story\n\n• The otter population is reaching new highs on the Central Coast, but elsewhere, the animal is struggling against a deadly foe: the great white shark. [San Jose Mercury News]\n\n• Hollywood’s use of trained animals came under attack in the weeks before “A Dog’s Purpose” was released, but the film performed well at the box office this weekend. [The New York Times]\n\nComing Up This Week\n\n• On Tuesday, Apple will announce its earnings for the first quarter of the fiscal year.\n\n• The Santa Barbara International Film Festival begins on Wednesday. Denzel Washington and Jeff Bridges will be among those honored.\n\n• On Friday, Southern California’s air quality agency is scheduled to vote on a plan that could reduce emissions cuts from ports, rail yards and warehouses.\n\n• On Saturday, Representative Tom McClintock, a Republican from the Fourth District, holds a town-hall meeting in Roseville.\n\nAnd Finally ...\n\nPhoto\n\nIt was on Jan. 30, 1931, that Charlie Chaplin’s “City Lights” had a gala premiere at the Los Angeles Theater. One of the great movie palaces, the theater had just been built, and Chaplin himself reportedly helped finance the construction so it would be finished in time for opening night.\n\nThe silent film, released after the movie industry had already begun to embrace talkies, is now regarded as not only one of Chaplin’s best films, but one of the best films ever made.\n\nAdvertisement Continue reading the main story\n\nAfter its Los Angeles premiere, Chaplin showed the film in New York a few days later, where it earned praise from a New York Times reviewer. “Many of the spectators either rocking in their seats with mirth, mumbling as their sides ached, ‘Oh, dear, oh, dear,’ or they were stilled with sighs and furtive tears,” Mordaunt Hall wrote.\n\nCalifornia Today goes live at 6 a.m. Pacific time weekdays. Tell us what you want to see: CAtoday@nytimes.com.\n\nThe California Today columnist, Mike McPhate, is a third-generation Californian — born outside Sacramento and raised in San Juan Capistrano. He lives in Davis. Follow him on Twitter.\n\nCalifornia Today is edited by Julie Bloom, who grew up in Los Angeles and attended U.C. Berkeley.", "authors": ["Erin Mccann", "California Today"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["protests", "film", "airports", "los", "immigration", "order", "times", "angeles", "continue", "today", "flashpoint", "york", "southern", "california"], "summary": "[Los Angeles Times]• Gov.\n[The Associated Press]• A new “hate map” from the Southern Poverty Law Center lists 30 groups in Southern California.\n[The New York Times]• California has its sights set on a legal marijuana economy that could be worth up to $7 billion.\nThe California Today columnist, Mike McPhate, is a third-generation Californian — born outside Sacramento and raised in San Juan Capistrano.\nCalifornia Today is edited by Julie Bloom, who grew up in Los Angeles and attended U.C."}