{"url": "https://www.nytimes.com/2017/02/03/world/asia/travel-ban-drives-wedge-between-iraqi-soldiers-and-americans.html?mcubz=0", "id": "193", "title": "Travel Ban Drives Wedge Between Iraqi Soldiers and Americans", "text": "The American and Iraqi militaries have negotiated an often tenuous and strained relationship over the years. But few episodes have so blindsided the current generation of Iraqi soldiers, who are accustomed to viewing the United States as their partner in a shared struggle to defeat insurgents and build a viable nation.\n\nThe timing of the order hit the Iraqi military in Mosul like an incoming rocket. Iraqi forces have reached a pivotal moment, seizing half of Mosul and preparing to assault the remaining half — supported by American advisers, Special Operations forces and airstrikes by the United States-led coalition.\n\nWhy, some soldiers asked, had Mr. Trump chosen this moment to lump together all Iraqis as mortal threats to America — soldiers, civilians and terrorists alike?\n\n“This decision by Trump blows up our liberation efforts of cooperation and coordination with American forces,” said Brig. Gen. Mizhir Khalid al-Mashhadani, a counterterrorism force commander in Mosul.\n\nAstounded by the announcement, General Mashhadani, who speaks English, said he asked his American counterparts about the president’s order. He said several told him they considered the decision hasty and its consequences poorly considered.\n\nThe travel ban was all the more perplexing to those Iraqi troops who had heard Mr. Trump vow as a candidate to wipe out the Islamic State, also known as ISIS, ISIL or Daesh. Some also heard the president promise, when issuing the order, to keep “radical Islamic terrorists” out of the United States.\n\nFor some soldiers, those comments seemed to equate Iraqi soldiers — by virtue of their nationality and religion — with the very terrorists they were fighting.\n\nPhoto\n\nPresident Trump was “unjust and not right,” said Maj. Sabah al-Aloosi, 37, another counterterrorism force officer in Mosul. It is Iraqi soldiers, he said, “who are fighting terrorism on behalf of the world and sacrificing themselves.”\n\nAdvertisement Continue reading the main story\n\nCol. John L. Dorrian, the spokesman in Baghdad for the American-led operation against the Islamic State, emphasized that the president’s order was temporary, calling it “a pause.”\n\nTold of critical comments by Iraqi soldiers and officers, Colonel Dorrian said: “For our part, we continue to do every single day what we’ve been doing all along in the campaign to defeat Daesh.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nColonel Dorrian said those efforts included continuing to train and advise Iraqi security forces, and providing intelligence, artillery and airstrikes in support of Iraqi troops. “None of these things are affected,” he added.\n\nOne counterterrorism soldier, Ismail Khalid, said the president’s ban on Iraqis did not affect his will to fight the Islamic State – or his survival instincts. “I’ve been fighting terrorism for months and what matters to me is to return home,” he said.\n\nThe counterterrorism force soldiers spoke before the American Embassy in Baghdad on Thursday cleared the way to enter the United States for former interpreters and other Iraqis who had assisted the American government or military.\n\nThe interpreters and their families had been issued special immigrant visas because of their service to the United States. The ban on so-called S.I.V. holders was lifted after the Pentagon recommended that the White House exempt Iraqis who have tangibly demonstrated their commitment to supporting United States forces, a Pentagon spokesman said.\n\nBut Iraqis who hold valid refugee visas, some because their association with Americans exposes them to danger in Iraq, remained barred from entry to the United States.\n\nBefore the Jan. 27 ban was announced, two counterterrorism force officers in Mosul said they had begun making plans to visit the United States after the battle for Iraq’s second-largest city.\n\nAdvertisement Continue reading the main story\n\nCaptain Musawe, who had hoped to vacation in the United States, said he was not making any travel plans at the moment. “The decision by Trump has wasted my dreams,” he said.\n\nMajor Aloosi said he even asked his American counterparts for advice about the visa process for Iraqi soldiers seeking to visit the “wonderful sights and tourism” he had seen on American TV programs. “But all that has vaporized because of the decision by Trump,” he said.\n\nGeneral Mashhadani said that despite bitter feelings among many of the soldiers he commands, he continues to work closely, if under trying circumstances, with his American counterparts.\n\n“My American friends who are officers promised to let me in their country in case I decide to go there — even if they have to use illegal ways,” he said.", "authors": ["David Zucchino"], "publish_date": "2017-02-03", "source": "nytimes", "top_words": ["travel", "iraqi", "trump", "counterterrorism", "ban", "iraqis", "order", "united", "drives", "soldiers", "wedge", "states", "americans", "american", "forces"], "summary": "“This decision by Trump blows up our liberation efforts of cooperation and coordination with American forces,” said Brig.\nSome also heard the president promise, when issuing the order, to keep “radical Islamic terrorists” out of the United States.\nFor some soldiers, those comments seemed to equate Iraqi soldiers — by virtue of their nationality and religion — with the very terrorists they were fighting.\nThe interpreters and their families had been issued special immigrant visas because of their service to the United States.\nAdvertisement Continue reading the main storyCaptain Musawe, who had hoped to vacation in the United States, said he was not making any travel plans at the moment."}