{"url": "https://cn.nytimes.com/usa/20170613/trump-travel-ban-court-of-appeals/en-us/?mcubz=0", "id": "13", "title": "Trump Loses Travel Ban Ruling in Appeals Court", "text": "WASHINGTON — A second U.S. appeals court has ruled against President Donald Trump’s revised travel ban, delivering on Monday the latest in a string of defeats for the administration’s efforts to limit travel from several predominantly Muslim countries.\n\nThe administration has already sought a Supreme Court review of a similar decision issued last month by the U.S. Court of Appeals for the 4th Circuit, in Richmond, Virginia. Monday’s decision came from the U.S. Court of Appeals for the 9th Circuit, in San Francisco.\n\nThe two courts employed different reasoning to arrive at the same basic conclusion. The 4th Circuit said the revised executive order violated the First Amendment’s prohibition of government establishment of religion.\n\nThe 9th Circuit, by contrast, rested its conclusions on statutory grounds. It said Trump had exceeded the authority Congress granted him in making national security judgments in the realm of immigration without adequate justification.\n\n广告\n\n“The order does not offer a sufficient justification to suspend the entry of more than 180 million people on the basis of nationality,” the 9th Circuit’s opinion said. “National security is not a ‘talismanic incantation’ that, once invoked, can support any and all exercise of executive power.”\n\nThe decision, from a three-judge panel, was unanimous. It was issued jointly by Judges Michael Daly Hawkins, Ronald M. Gould and Richard A. Paez. All three were appointed by President Bill Clinton.\n\nThe ruling affirmed most of a March decision from Judge Derrick K. Watson, of the U.S. District Court in Hawaii. But the appeals court narrowed the injunction issued by Watson in a significant way.\n\nThe appeals court said Watson had erred in barring the administration from conducting internal reviews of its vetting procedures while the case moved forward.\n\nThat may turn out to be important as the Supreme Court considers how to address the two cases.\n\nThe key part of the executive order suspended travel from six predominantly Muslim countries for 90 days to give the administration time to conduct a review of its vetting procedures. If that review can soon be completed, the justices may decide that the case will soon be moot.\n\nIn briefs filed Monday in the Supreme Court, lawyers challenging the revised executive order urged the court not to hear the Trump administration’s appeal of the 4th Circuit’s decision or to stay the injunctions entered in the two cases.\n\n广告\n\nThey said the cases might be moot as soon as Wednesday.", "authors": ["Adam Liptak"], "publish_date": "2017-06-13", "source": "nytimes", "top_words": ["ruling", "executive", "travel", "trump", "ban", "appeals", "circuit", "supreme", "soon", "court", "order", "loses", "decision", "watson"], "summary": "WASHINGTON — A second U.S. appeals court has ruled against President Donald Trump’s revised travel ban, delivering on Monday the latest in a string of defeats for the administration’s efforts to limit travel from several predominantly Muslim countries.\nThe administration has already sought a Supreme Court review of a similar decision issued last month by the U.S. Court of Appeals for the 4th Circuit, in Richmond, Virginia.\nBut the appeals court narrowed the injunction issued by Watson in a significant way.\nThe appeals court said Watson had erred in barring the administration from conducting internal reviews of its vetting procedures while the case moved forward.\nThat may turn out to be important as the Supreme Court considers how to address the two cases."}