{"url": "https://www.nytimes.com/2017/02/03/arts/design/moma-protests-trump-entry-ban-with-work-by-artists-from-muslim-nations.html?mcubz=0", "id": "185", "title": "MoMA Protests Trump Entry Ban by Rehanging Work by Artists from Muslim Nations", "text": "Photo\n\nIn one of the strongest protests yet by a major cultural institution against President Trump’s executive order on immigration, the Museum of Modern Art has rehung part of its permanent collection with works by artists from some of the majority-Muslim nations whose citizens are blocked from entering the United States.\n\nPhoto\n\nSeven works by artists such as the Sudanese painter Ibrahim el-Salahi, the Iraqi-born architect Zaha Hadid, and the Los Angeles-based Iranian video artist Tala Madani, were installed Thursday night in MoMA’s fifth-floor galleries, replacing seven works by Picasso, Matisse and Picabia, among other Western artists. Alongside each work is a wall text that plainly states the museum’s intentions: “This work is by an artist from a nation whose citizens are being denied entry into the United States, according to a presidential executive order issued on Jan. 27, 2017. This is one of several such artworks from the Museum’s collection installed throughout the fifth-floor galleries to affirm the ideals of welcome and freedom as vital to this Museum as they are to the United States.”\n\nPhoto\n\nExcept for Hadid and Mr. el-Salahi, the other artists are all Iranian by birth or heritage. They are Ms. Madani; the sculptor Parviz Tanavoli; the draftsman Charles Hossein Zenderoudi; the photographer Shirana Shahbazi; and the painter Marcos Grigorian. In addition, a large sculpture of aluminum and steel by Siah Armajani, an American artist born in Iran, was placed in the glass-walled lobby courtyard overlooking the garden.\n\nPhoto\n\nThe fifth-floor additions rupture the museum’s traditional narrative of Western modernism before 1945. Only very rarely has MoMA interrupted its succession of art from Post-Impressionism to Cubism, Dadaism, and after — which still reflects the modernist vision of its first director, Alfred Barr — with works of postwar and contemporary art. Further additions are planned for the weeks ahead.\n\nThe Museum of Modern Art has also scheduled four screenings later this month of films by directors subject to the travel ban. They include “Al-Yazerli” (1974), an experimental feature by the Iraqi-born German director Kais al-Zubaidi, and “Stars in Broad Daylight” (1988), by Oussama Mohammad, a Syrian filmmaker exiled in Paris.", "authors": ["Jason Farago"], "publish_date": "2017-02-03", "source": "nytimes", "top_words": ["moma", "protests", "art", "trump", "ban", "works", "fifthfloor", "rehanging", "united", "work", "museum", "entry", "western", "artist", "nations", "muslim", "artists", "museums"], "summary": "PhotoSeven works by artists such as the Sudanese painter Ibrahim el-Salahi, the Iraqi-born architect Zaha Hadid, and the Los Angeles-based Iranian video artist Tala Madani, were installed Thursday night in MoMA’s fifth-floor galleries, replacing seven works by Picasso, Matisse and Picabia, among other Western artists.\nThey are Ms. Madani; the sculptor Parviz Tanavoli; the draftsman Charles Hossein Zenderoudi; the photographer Shirana Shahbazi; and the painter Marcos Grigorian.\nPhotoThe fifth-floor additions rupture the museum’s traditional narrative of Western modernism before 1945.\nThe Museum of Modern Art has also scheduled four screenings later this month of films by directors subject to the travel ban.\nThey include “Al-Yazerli” (1974), an experimental feature by the Iraqi-born German director Kais al-Zubaidi, and “Stars in Broad Daylight” (1988), by Oussama Mohammad, a Syrian filmmaker exiled in Paris."}