{"url": "https://www.nytimes.com/2017/01/30/world/australia/trump-us-refugee-manus-nauru.html?mcubz=0", "id": "149", "title": "Australia Says Trump Will Honor One-Time Deal to Accept Refugees", "text": "Video\n\nSYDNEY, Australia — President Trump confirmed that his administration would honor a refugee resettlement deal for the United States to accept migrants Australia has detained on the Pacific islands of Nauru and Manus, the Australian prime minister said on Monday.\n\nMr. Trump agreed to maintain the agreement, reached under the Obama administration, during a 25-minute telephone call on Sunday, said the prime minister, Malcolm Turnbull. The election of Mr. Trump, whose harsh talk about immigration was central to his campaign, left the deal in doubt, and its future was considered an early test for relations between the United States and Australia.\n\n“I thank President Trump for his commitment to honor that existing agreement,” Mr. Turnbull said during a news conference on Monday in Canberra, the Australian capital. Mr. Turnbull did not provide details on how many refugees, who have been banished to Nauru and Manus by Australia after being intercepted at sea trying to reach its shores, would be going to the United States under the one-time agreement or when they were likely to be resettled. Hundreds of people are housed in offshore detention facilities on the islands in what rights groups describe as inhumane conditions.\n\nThe deal had been under negotiation for months before being announced in mid-November, shortly after Mr. Trump was elected. As a presidential candidate, he pressed for a temporary ban on all Muslim immigration, though his campaign later said that the ban would apply only to migrants from “terror-prone regions.” His executive order on immigration, enacted on Friday, banned immediate entry into the United States by people from several predominantly Muslim countries, and it further fueled speculation that the deal with Australia might be derailed.\n\nAdvertisement Continue reading the main story\n\nDougal Robinson, a research fellow at the United States Studies Center at the University of Sydney, estimated that fewer than 2,000 detainees would be sent to the United States. “They’ve already had significant vetting by Australian authorities and any refugees that will be settled in the U.S. will be subject to ‘extreme vetting’ by Department of Homeland Security,” Mr. Robinson said. “If the Trump administration at any point is going to accept refugees then these refugees are probably better placed than most others.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Trump’s order closed the nation to refugees and people from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen. The majority of refugees on Manus and Nauru are from Iran and Iraq, and it is unclear whether a proven refugee on Nauru and Manus who is from those countries and had been successfully vetted by the Homeland Security Department would receive the same treatment as a refugee not from those countries. “We don’t have a clear indication of the mechanics of the deal and how it will work,” Mr. Robinson said.\n\nThe Australian government has pledged never to accept migrants who attempt to come to the country by boat. Those who are intercepted at sea are housed indefinitely on offshore islands, which the government says is necessary to deter human traffickers who often pack migrants into boats for the long journeys.", "authors": ["Jacqueline Williams"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["australia", "accept", "trump", "nauru", "deal", "onetime", "manus", "united", "states", "migrants", "refugees", "honor", "mr", "australian"], "summary": "VideoSYDNEY, Australia — President Trump confirmed that his administration would honor a refugee resettlement deal for the United States to accept migrants Australia has detained on the Pacific islands of Nauru and Manus, the Australian prime minister said on Monday.\nMr. Trump agreed to maintain the agreement, reached under the Obama administration, during a 25-minute telephone call on Sunday, said the prime minister, Malcolm Turnbull.\nThe election of Mr. Trump, whose harsh talk about immigration was central to his campaign, left the deal in doubt, and its future was considered an early test for relations between the United States and Australia.\nThe deal had been under negotiation for months before being announced in mid-November, shortly after Mr. Trump was elected.\nAdvertisement Continue reading the main storyDougal Robinson, a research fellow at the United States Studies Center at the University of Sydney, estimated that fewer than 2,000 detainees would be sent to the United States."}