{"url": "https://www.nytimes.com/2017/01/30/opinion/no-trump-not-on-our-watch.html?mcubz=0", "id": "130", "title": "No, Trump, Not on Our Watch", "text": "Photo\n\nWhen Barack Obama was in office — remember the good old days, just over a week ago, when we didn’t wake up every morning and wonder what new atrocity was emanating from the White House — Republicans were apoplectic about his use of executive orders. They called them “unilateral edicts” and “power grabs.” As Iowa Senator Charles Grassley once said in a floor speech: “The president looks more and more like a king that the Constitution was designed to replace.”\n\nWhat a difference a week makes.\n\nNow many of those Republicans are as quiet as church mice as Donald Trump pumps out executive orders at a fevered pitch, doing exactly what he said he’d do during the campaign, for all of those who were paying attention: advancing a white nationalist agenda and vision of America, whether that be by demonizing blacks in the “inner city,” Mexicans at the border or Muslims from the Middle East.\n\nTrump’s America is not America: not today’s or tomorrow’s, but yesterday’s.\n\nTrump’s America is brutal, perverse, regressive, insular and afraid. There is no hope in it; there is no light in it. It is a vast expanse of darkness and desolation.\n\nAnd that is a vision of America that most of the people in this country cannot and will not abide. That is a vision of America that has galvanized ordinary American citizens in opposition in a way that is almost without precedent. We are inching toward anarchy as both the people and the president refuse to back down.\n\nAdvertisement Continue reading the main story\n\nNot only is Trump a literacy-lite, conspiracy-chasing, compulsively lying bigot, he is also a narcissistic workaholic who now wields the power of the presidency. You could not have conceived of a more dangerous combination of characteristics. He is the paragon of the clueless and an idol of the Ku Kluxers. Already, people feel deluged by a never-ending flood of national damage and despair. But Americans are not prone to suffering in silence. America’s period of mourning has ended; the time of anger and active opposition has dawned. The greatest two motivators of electoral activism in this country are a desire for change and durable fear: In Trump, those two are wed.", "authors": ["Charles M. Blow"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["america", "trump", "orders", "watch", "republicans", "week", "opposition", "president", "white", "power", "vision"], "summary": "Trump’s America is not America: not today’s or tomorrow’s, but yesterday’s.\nAnd that is a vision of America that most of the people in this country cannot and will not abide.\nThat is a vision of America that has galvanized ordinary American citizens in opposition in a way that is almost without precedent.\nAdvertisement Continue reading the main storyNot only is Trump a literacy-lite, conspiracy-chasing, compulsively lying bigot, he is also a narcissistic workaholic who now wields the power of the presidency.\nThe greatest two motivators of electoral activism in this country are a desire for change and durable fear: In Trump, those two are wed."}