{"url": "https://www.nytimes.com/2017/01/29/us/politics/republicans-congress-trump-refugees.html?mcubz=0", "id": "118", "title": "Growing Number of G.O.P. Lawmakers Criticize Trump’s Refugee Policy", "text": "Mr. McCain also said the plan was carried out without proper consultation of United States allies and that it mistakenly lumped together the country’s adversaries, like Iran, with allies, like Iraq.\n\nRepublicans have largely supported Mr. Trump’s aggressive agenda, but in his first major decision on national security, he is finding uncharacteristic opposition from his party in the blush of his early days in office.\n\nMr. Trump did not take well to the input, singling out Mr. McCain and Mr. Graham on Twitter as “sadly weak on immigration.”\n\nBut as the day went on, they were not alone in their criticisms. Senator Bob Corker of Tennessee, the chairman of the Foreign Relations Committee, said that while he supported stronger screening, the order had been “poorly implemented,” especially for green card holders. “The administration should immediately make appropriate revisions, and it is my hope that following a thorough review and implementation of security enhancements that many of these programs will be improved and reinstated,” Mr. Corker said.\n\nIndeed, the administration moved to ease some of those concerns late Sunday, when the Department of Homeland Security announced that lawful permanent residents would be exempt from the ban.\n\nSenator Cory Gardner of Colorado, the chairman of the National Republican Senatorial Committee, likewise said the order was “overly broad” and that the blanket travel ban “goes too far.” Senator Lamar Alexander of Tennessee seemed to echo those criticisms, adding that “while not explicitly a religious test, it comes close to one, which is inconsistent with our American character.”\n\nSenator Rob Portman, Republican of Ohio, went further, questioning the hastiness of the order’s rollout and calling for a re-evaluation of the White House’s unilateral effort. “In my view, we ought to all take a deep breath and come up with something that makes sense for our national security and again for this notion that America has always been a welcoming home for refugees and immigrants,” Mr. Portman said on CNN’s “State of the Union.”\n\nAdvertisement Continue reading the main story\n\nSimilar concerns were voiced by some Republicans in the House. Most prominent among them was Representative Michael McCaul, the chairman of the Homeland Security Committee, who said that “it was clear” that adjustments were needed to the order, but defended it in principle. Representative Will Hurd of Texas, a former undercover C.I.A. officer, called the measure “the ultimate display of mistrust” that would “erode our allies’ willingness to fight with us” and put Americans at risk.\n\nA handful of other Republicans, including Senator Orrin Hatch of Utah, Senator Ben Sasse of Nebraska and Senator Susan Collins of Maine, also offered criticism, though more cautious, on Saturday.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe Republican leadership — and senior members of the House — have either supported Mr. Trump or been largely silent about the order. Senator Mitch McConnell of Kentucky, the majority leader, said that the United States did not make policy based on religion, though his criticism was muted compared with his colleagues’.\n\nSpeaker Paul D. Ryan released a statement on Friday praising the order, but his aides repeatedly declined requests for further comment.\n\nMr. McConnell cautioned against vilifying Muslims who are key allies in the American war on terror. The country, he said, needed to “be careful” with how the order is carried out. “I don’t want to criticize them for improving vetting,” Mr. McConnell said on ABC’s “This Week.” “I think we need to be careful. We don’t have religious tests in this country.”\n\nAs tensions mount, Mr. Trump’s actions will be debated on Capitol Hill this week. Democrats pledged on Sunday to introduce legislation undoing them and limiting Mr. Trump’s executive authority. And the measure could add pressure to Mr. Trump’s nominees to lead the Justice and State Departments, who will probably be asked to offer their positions on the ban.\n\nSome Republicans compared the order to a measure that overwhelmingly passed the House in 2015 not long after the deadly terrorist attacks in Paris. But that bill was far less broad than Mr. Trump’s order, focusing narrowly on the screening process for Syrians and Iraqis who entered the United States as refugees. That bill was blocked by Democrats in the Senate, who argued that it too closely mirrored Mr. Trump’s campaign talk of a Muslim ban, and congressional Republicans largely put off the issue during the rest of the campaign.\n\nMr. Trump’s order, which was enacted on Friday, halted the entry into the United States of all refugees for 120 days, barred the entry of Syrian refugees indefinitely and suspended for 90 days the entry of citizens of Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen — all predominantly Muslim countries. It prompted chaos across the globe as the United States’ borders were sealed off to the affected groups and the Department of Homeland Security rushed to apply uneven enforcement. By Saturday night, judges in at least two states had issued stays preventing the government from deporting certain arrivals caught in the rollout of the order.\n\nDemocrats were nearly united in their condemnation of Mr. Trump’s policy, with several of them rushing to airports to speak out in defense of people who had been detained and even those representing states that Mr. Trump won voicing dissent.\n\nAdvertisement Continue reading the main story\n\nSenator Chuck Schumer of New York, the Democratic leader, called on Mr. Trump to immediately reverse the action on Sunday, saying it made the country “less humanitarian, less safe, less American.”\n\n“It must be reversed immediately, and Democrats are going to introduce legislation to overturn it,” Mr. Schumer told reporters gathered for a news conference in New York.\n\nRepublicans who spoke out were more measured, directing their criticism at the planning for the policy and its carrying out, though their disagreement with Mr. Trump was still clear. Senator Jeff Flake, Republican of Arizona, wrote on the website Medium that the president “and his administration are right to be concerned about national security, but it’s unacceptable when even legal permanent residents are being detained or turned away at airports and ports of entry.”\n\nMr. Sasse said Mr. Trump was right to focus on border security but disagreed with how he was carrying out the policy.\n\nAnd Representative Barbara Comstock, a Republican whose Northern Virginia district includes a large Muslim population, said that Mr. Trump’s action had gone “beyond the increased vetting actions the Congress has supported.”", "authors": ["Nicholas Fandos"], "publish_date": "2017-01-29", "source": "nytimes", "top_words": ["republican", "mr", "trump", "gop", "supported", "security", "growing", "refugee", "united", "states", "trumps", "number", "lawmakers", "senator", "order", "criticize", "policy"], "summary": "The Republican leadership — and senior members of the House — have either supported Mr. Trump or been largely silent about the order.\nWe don’t have religious tests in this country.”As tensions mount, Mr. Trump’s actions will be debated on Capitol Hill this week.\nDemocrats pledged on Sunday to introduce legislation undoing them and limiting Mr. Trump’s executive authority.\nBut that bill was far less broad than Mr. Trump’s order, focusing narrowly on the screening process for Syrians and Iraqis who entered the United States as refugees.\nRepublicans who spoke out were more measured, directing their criticism at the planning for the policy and its carrying out, though their disagreement with Mr. Trump was still clear."}