{"url": "https://www.nytimes.com/2017/01/29/us/protests-airports-donald-trump-immigration-executive-order-muslims.html?mcubz=0", "id": "121", "title": "Demonstrators in Streets, and at Airports, Protest Immigration Order", "text": "Matt Nosanchuk, who served as the White House’s liaison to the Jewish community under President Barack Obama from 2013 to 2016, said on Sunday that he had been in touch with several former colleagues as they made plans to attend the hastily arranged protest and ran into others in the crowd.\n\n“What Trump may not realize is you have a whole cadre of Obama appointees who are really good organizers, who have been activated and who are not going to stand by,” he said.\n\nSecurity fencing and reviewing stands still in place from Inauguration Day kept crowds at a distance from the White House but did not stop the numbers from swelling through the afternoon, when the protesters left to march to Capitol Hill.\n\nAs marchers passed the Trump International Hotel in Washington, boos and profanities filled Pennsylvania Avenue. Elsewhere in the city, protesters carrying signs and candles marched up the sidewalk opposite the vice president’s house, most walking silently and many with children.\n\nAt a rally in Battery Park in Lower Manhattan, thousands gathered in protest as nearby ferries shuttled visitors to the Statue of Liberty and Ellis Island.\n\nAsma Shuaib, 22, a student from Jackson Heights, Queens, and a Muslim, said she had come to resist the president’s executive order.\n\nThrough tears, she disavowed violence in the name of Islam and paraphrased the Prophet Muhammad: “If you see something that you believe in your heart is wrong, you must speak out, and then act.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nFor over an hour, speakers including Senators Chuck Schumer and Kirsten E. Gillibrand of New York, Senator Cory Booker of New Jersey, Mayor Bill de Blasio and immigrant activists addressed the peaceful crowd amid chants of “No ban, no wall,” “Let them in” and “Impeach.”\n\nAdvertisement Continue reading the main story\n\nAs they did elsewhere in the country, lawyers stood in the international arrivals terminal of San Francisco International Airport, holding up signs offering free assistance to those awaiting the arrival of family members from countries affected by the Trump administration’s order.\n\nSeveral thousand protesters, accompanied by a brass band and drummers, paraded past check-in counters, chanting, “Say it loud, say it clear, refugees are welcome here!”\n\nIn Arizona, which has taken more Syrian refugees than any other state, a few hundred protesters greeted travelers arriving at the busiest terminal at Phoenix Sky Harbor International Airport, their signs facing the street, visible to anyone who drove in. Many motorists honked, some to the beat of whatever slogan the crowd was chanting at the time.\n\nWith a megaphone, Orlando Arenas, 33, kept everyone going. “Tell me what community looks like,” he said, and the protesters answered, “This is what community looks like.”", "authors": ["Niraj Chokshi", "Nicholas Fandos"], "publish_date": "2017-01-29", "source": "nytimes", "top_words": ["streets", "international", "trump", "airports", "immigration", "signs", "community", "protest", "white", "terminal", "sign", "demonstrators", "order", "protesters", "york", "say"], "summary": "As marchers passed the Trump International Hotel in Washington, boos and profanities filled Pennsylvania Avenue.\nElsewhere in the city, protesters carrying signs and candles marched up the sidewalk opposite the vice president’s house, most walking silently and many with children.\nAsma Shuaib, 22, a student from Jackson Heights, Queens, and a Muslim, said she had come to resist the president’s executive order.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\n“Tell me what community looks like,” he said, and the protesters answered, “This is what community looks like.”"}