{"url": "https://www.nytimes.com/2017/01/30/business/dealbook/wall-street-trump-muslim-ban.html?mcubz=0", "id": "127", "title": "Wall Street Reassures Employees, Without Wholly Rejecting Travel Ban", "text": "And Wall Street, perhaps more than any other industry except the technology business, has prided itself on hiring top job candidates from anywhere in the world. That said, some banking executives said it was unclear how much the still-evolving contours of the travel ban would affect their staffs, with some saying relatively few employees appeared to have been affected thus far.\n\nStill, the finance sector has had to confront growing nationalist sentiment in the United States and Britain, where the vote to leave the European Union, widely known as Brexit, has threatened to drive out much of that country’s financial industry, which could limit global trade and the flow of both money and qualified employees.\n\n“I think it would probably hurt them because they do tend to rely on the best international talent, regardless of where they’re from,” said Charles Geisst, a professor at Manhattan College who has studied Wall Street.\n\nBut the finance industry has largely been cautious in moving into political controversy outside its focus on regulation.\n\nMr. Blankfein has long been somewhat of an outlier in his willingness to be an outspoken backer of Hillary Clinton, as well as same-sex marriage and other social issues.\n\nSo perhaps it was unsurprising that Mr. Blankfein used a voice mail message sent to employees on Sunday — a time-honored Wall Street way of delivering firmwide messages — to criticize the travel ban and note that parts of the executive order had been at least temporarily suspended.\n\nIn his message, Mr. Blankfein cited Goldman’s business principles, which included the line “Being diverse is not optional; it is what we must be.”\n\nAdvertisement Continue reading the main story\n\nCitigroup’s chief executive, Mike Corbat, told employees in an internal memorandum on Monday that the firm was “concerned about the message the executive order sends,” and he encouraged finding “the right balance between protecting the country and its longstanding role as an open and welcoming society.”\n\nAnd top officials at the asset-management giant BlackRock, which oversees $5 trillion in investments and counts big Middle Eastern countries as clients, said that while they recognized the need to keep the United States safe, any approach needed to respect the law.\n\n“We, of course, all want to promote security and combat terrorism, but we believe it needs to be done with respect for due process, individual rights and the principle of inclusion,” the executives, including Laurence D. Fink, a founder and the chief executive, wrote.\n\nStill, other firms took a more cautious approach, refraining from outright criticism of Mr. Trump’s actions. Most companies that issued statements said they intended to focus on helping any affected employees.\n\nIn an internal memo, JPMorgan Chase’s top executives said that they were both “grateful” for efforts to keep the United States safe and supportive of diversity. Wells Fargo also posted a statement on its employee website saying that it was still assessing what the executive order meant for its business and employees but that it was “committed to fostering a culture of diversity.”\n\nBank of America said in a message from its chief executive, Brian Moynihan, that it was working to ensure it had the most accurate information to best help affected employees.\n\nThe chief executive of Morgan Stanley, James P. Gorman, wrote to his employees, “Continuing to draw on talent from across the globe is a key element of Morgan Stanley’s culture and ultimately to our success in serving our clients.”\n\nOther firms, such as Blackstone and TPG, had declined to comment.\n\nHere are the various responses that major financial firms have sent to their employees regarding the executive order. (Some have been edited to remove internal company phone numbers.) We’ll update the list with more responses as we collect them.\n\nPhoto\n\nGoldman Sachs\n\nThis is Lloyd. The president has issued an executive order that, generally, bans individuals from seven different countries from entering the United States and freezes the broader refugee program. This is not a policy we support, and I would note that it has already been challenged in federal court, and some of the order has been enjoined at least temporarily.\n\nAdvertisement Continue reading the main story\n\nIf the order were to become or remain effective, I recognize that there is potential for disruption to the firm, and especially to some of our people and their families. I want to assure all of you that we will work to minimize such disruption to the extent we can within the law and are focused on supporting our colleagues and their families who may be affected.\n\nLet me close by quoting from our business principles: “For us to be successful, our men and women must reflect the diversity of the communities and cultures in which we operate. That means we must attract, retain and motivate people from many backgrounds and perspectives. Being diverse is not optional; it is what we must be.” Now is a fitting time to reflect on those words and the principles that underlie them.\n\nPhoto\n\nMorgan Stanley\n\nTo: All Employees\n\nFrom: James Gorman\n\nWe are closely monitoring developments around the new United States travel restrictions imposed this weekend. While no individual employees were impacted in their travel to date, we are concerned for those individuals and their families who could be impacted and will provide them support as needed.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nAny employee who has questions about upcoming travel should contact the Global Travel and Security teams.\n\nWe value immensely the contribution of all our employees from all over the world. Continuing to draw on talent from across the globe is a key element of Morgan Stanley’s culture and ultimately to our success in serving our clients.\n\nJPMorgan Chase\n\nIn light of recent executive orders in the United States regarding immigration policy, we want every one of you to know of our unwavering commitment to the dedicated people working here at JPMorgan Chase. This includes a number of our outstanding employees — all of whom have adhered to our country’s immigration and employment processes — who have come to the United States to serve our company, clients and communities.\n\nOver the weekend, we have worked to reach out to all JPMorgan Chase employees on sponsored visas who are potentially impacted by the recent orders. We understand the situation is evolving quickly, so if you have any concerns about your own situation and have not been contacted, please reach out to your local immigration specialist or human resources team.\n\nWith more than 140,000 employees in the United States alone, we are grateful for the hard work and sacrifices made to keep our country safe. At the same time, we understand that our country, economy and well-being are strengthened by the rich diversity of the world around us, where we are dedicated to serving customers and communities in more than 100 countries every day.\n\nAdvertisement Continue reading the main story\n\nThank you.\n\nCitigroup\n\nDear Colleagues,\n\nSince the weekend, we have been reviewing the executive order on immigration, as well as statements by administration officials, to assess its impact. As a United States company and the world’s most global financial institution, we are concerned about the message the executive order sends, as well as the impact immigration policies could have on our ability to serve our clients and contribute to growth. We have been advising colleagues who could be affected and will continue to support them and their families.\n\nWe are proud of Citi’s diversity and the fact that we hail from over 100 countries. We encourage the leaders of the United States to find the right balance between protecting the country and its longstanding role as an open and welcoming society.\n\nPhoto\n\nBlackRock\n\nDear colleagues,\n\nSince Friday, we have been in touch with many colleagues, clients and friends worldwide concerned about the United States executive order restricting travel from seven countries in the Middle East and Africa.\n\nAs a truly global company, we are proud of the diversity at BlackRock and proud of the diversity of our client relationships. We have long had valued colleagues and clients in Muslim nations, and, from the earliest days of our company, we have worked hard to build an inclusive culture that welcomes and values the contributions of people from all parts of the world.\n\nBlackRock will continue to embrace our values and culture, notwithstanding the challenges created by this order. Indeed, we believe that it is more important than ever that we promote our principles, which we established at the founding of our company 29 years ago, including our commitment to inclusion. We, of course, all want to promote security and combat terrorism, but we believe it needs to be done with respect for due process, individual rights and the principle of inclusion.\n\nIn addition to the broader implications of this order, we have been working to assess the impact it may have on travel for BlackRock’s employees. At this time, we believe there are relatively few individuals whose travel will be directly impacted, but of course the full implications are still being assessed. We also are closely monitoring the repercussions for United States citizens traveling abroad.\n\nAs you have likely already seen in news reports, there are protests at many United States airports. Anyone traveling either internationally or domestically should anticipate longer delays getting to or from airports and passing through immigration. If you have any questions or concerns about your travel, please call the Corporate Security hotline 24 hours a day. We will continue to keep you posted as the situation evolves.\n\nBlackRock always has and will continue to engage with and welcome people in all parts of the world. That is at the root of who we are and always will be.\n\nAdvertisement Continue reading the main story\n\nLarry Fink, chairman and C.E.O.\n\nRob Kapito, president\n\nJeff Smith, global head of human resources\n\nWells Fargo\n\nOn Friday, President Trump signed an executive order on immigration that includes a provision blocking citizens of seven countries from entering the United States for 90 days — these countries are Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\n\nThe company is currently reviewing the executive order and its implications to determine whether it has any direct effect on team members or our business.\n\n“While we are still assessing what this change means for Wells Fargo, we know that it may have deeply personal implications for team members who may have friends or family affected by it,” says chief administrative officer Hope Hardison. “As always, Wells Fargo is committed to fostering a culture of diversity and inclusion where our team members are encouraged to value and respect others for their differences. These values will continue to be of great importance as we support team members who have been affected by this executive order.”\n\nPhoto\n\nBank of America\n\nBelow is a message from C.E.O. Brian Moynihan.\n\nAs a global company, we depend upon the diverse sources of talent that our teammates represent. In view of this, we are closely monitoring the recent refugee- and immigration-related executive order in the United States, and subsequent developments.\n\nWe are connecting with teammates who may be affected, in response to questions. We also are working to ensure we have the most accurate and timely information to best assist potentially impacted teammates. We will share information and provide updates as the situation continues to develop.", "authors": ["Michael J. De La Merced"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["executive", "travel", "wholly", "ban", "immigration", "wall", "order", "street", "united", "company", "reassures", "diversity", "rejecting", "continue", "states", "employees"], "summary": "Here are the various responses that major financial firms have sent to their employees regarding the executive order.\nPhotoMorgan StanleyTo: All EmployeesFrom: James GormanWe are closely monitoring developments around the new United States travel restrictions imposed this weekend.\nWe also are closely monitoring the repercussions for United States citizens traveling abroad.\nAs you have likely already seen in news reports, there are protests at many United States airports.\nIn view of this, we are closely monitoring the recent refugee- and immigration-related executive order in the United States, and subsequent developments."}