{"url": "https://www.nytimes.com/2017/02/02/opinion/jared-kushners-silence-on-muslim-refugees.html?mcubz=0", "id": "177", "title": "Jared Kushner’s Silence on Muslim Refugees", "text": "Photo\n\nTo the Editor:\n\nRe “Trashing America’s Ideals and Security” (editorial, Jan. 30): Where was Jared Kushner, President Trump’s son-in-law and influential adviser, when Mr. Trump issued his executive order that, as you say, excludes “Muslims while giving government officials the discretion to admit people of other faiths”?\n\nMr. Kushner is the grandson of Holocaust survivors. His grandmother’s family in Poland fled the Nazis and she did not go to the United States till several years later because at the time admission was denied to most Jews.\n\nYou correctly point out that Secretary of Defense Jim Mattis’s “silence now is alarming.” Mr. Kushner’s silence, and possible acquiescence, in this new policy, given his influence — he is supposed to be the “moderating” voice in the White House — is also troubling.\n\nSEYMOUR D. REICH\n\nNew York\n\nThe writer is a former chairman of the Conference of Presidents of Major American Jewish Organizations.", "authors": [], "publish_date": "2017-02-02", "source": "nytimes", "top_words": ["jared", "trump", "silence", "voice", "kushner", "writer", "united", "trumps", "yorkthe", "refugees", "muslim", "white", "kushners", "mr"], "summary": "PhotoTo the Editor:Re “Trashing America’s Ideals and Security” (editorial, Jan. 30): Where was Jared Kushner, President Trump’s son-in-law and influential adviser, when Mr. Trump issued his executive order that, as you say, excludes “Muslims while giving government officials the discretion to admit people of other faiths”?\nMr. Kushner is the grandson of Holocaust survivors.\nHis grandmother’s family in Poland fled the Nazis and she did not go to the United States till several years later because at the time admission was denied to most Jews.\nYou correctly point out that Secretary of Defense Jim Mattis’s “silence now is alarming.” Mr. Kushner’s silence, and possible acquiescence, in this new policy, given his influence — he is supposed to be the “moderating” voice in the White House — is also troubling.\nSEYMOUR D. REICHNew YorkThe writer is a former chairman of the Conference of Presidents of Major American Jewish Organizations."}