{"url": "https://www.nytimes.com/2017/01/30/us/migrants-documents-travel-ban.html?mcubz=0", "id": "142", "title": "Migrants Were Told to Sign Away Right to Enter U.S., Lawyers Say", "text": "After visiting her parents in Austria, Sara Yarjani, an Iranian, flew back to California, where she is a master’s degree student.\n\nAt Los Angeles International Airport, she said, she was questioned repeatedly, searched and ordered to remove her shoelaces, shawl and jewelry. She spent 23 hours in detention and said she could hear immigration officers debating the policy, uncertain of what to do. Finally, she said, an officer said she could not enter the country because her student visa was no longer valid, though he would not explain why. Her lawyers said the officer was wrong.\n\nMs. Yarjani, 35, said the officer told her, “Either you comply and agree to leave voluntarily, by signing a document, or if you do not comply we will have to forcibly deport you, which will face you with a re-entry ban to the United States of one to five years or longer.”\n\n“It was very traumatizing and scary,” said Ms. Yarjani, who is studying holistic health. “It felt surreal and hard to believe that was actually happening.”\n\nOn Saturday night, as armed officers walked her to a flight to Austria, she saw that a judge had halted deportations. She alerted the officers, but they ignored her and put her on the plane.\n\nAffected by Trump’s order? Are you affected by President Trump’s executive order on immigration, or do you know someone who is? If you have information, please contact us at immigration@nytimes.com.\n\nSaba, an Iranian graduate student, rented an apartment in Manhattan last year and bought furniture and dishes for it. On Saturday, when she returned from a trip to Europe, an immigration officer at Kennedy International Airport told her that she could not enter.\n\n“I was crying. I couldn’t even talk,” said Saba, who did not want her surname used for fear that publicity might harm her chances of re-entering the United States, but showed The New York Times her student visa, with a 2018 expiration date.\n\nAdvertisement Continue reading the main story\n\nAt an officer’s direction, she said, she signed a small electronic window, like the ones used for credit card purchases, without knowing what she was signing. Then the officer gave her a copy of the form and told her that she had voluntarily withdrawn her application to enter the country.\n\n“I said: ‘No, it’s you telling me to leave. I’m not willing to!’” she said. “He said: ‘It’s better this way, ma’am. Otherwise I have to force you.’”\n\nShe was put on a flight to Switzerland, her visa stamped in big red letters: “Canceled — N.Y.C. application withdrawn.”\n\nHesam, an Iranian-born American citizen, helped his ailing parents, who do not speak English, get immigrant visas, and they arrived on Saturday in Abu Dhabi for a connecting flight to Los Angeles. He said the American immigration agents there enlisted a translator, who spoke an unfamiliar dialect and told them they would benefit from signing a form they could not read.\n\nThey did, and on Sunday they were flown back to Tehran.\n\n“They said, ‘Well, the way they presented it, we thought it’s a normal process, we have to do this,’” said Hesam, who did not want his surname used because he feared jeopardizing his parents’ case. It should have been “the best day of my life,” he said, but instead, “it turns out to be one of the worst days of our lives.”\n\nTwo brothers from Yemen, a country racked by civil war, were detained at Dulles International Airport in Virginia on Saturday, and put on a flight to Ethiopia hours later, according to a federal lawsuit filed on Monday. After years of effort, the brothers, Tareq Aqel Mohammed Aziz, 21, and Ammar Aqel Mohammed Aziz, 19, had obtained immigrant visas to join their father, an American citizen.\n\n“They were told falsely that there would be all these negative consequences if they chose not to sign the forms in front of them, like being barred from coming back for five years,” said Simon Y. Sandoval-Moshenberg of the Legal Aid Justice Center, one of the lawyers who filed the suit.\n\nAdministration officials at first said even legal permanent residents of the United States could not return, but later said they could. There is still confusion about whether the order applies to people with temporary visas.\n\n“They want you to sign so they can say they didn’t deport you, you left voluntarily,” said Becca Heller, director of the International Refugee Assistance Project, one of the groups that obtained a court order.\n\nAdvertisement Continue reading the main story\n\n“One of the plaintiffs in our lawsuit, they kept telling one of them, ‘Just sign this and you can go,’ and he didn’t know what it was because he only spoke Arabic,” she said. The man refused to sign, and was later released.", "authors": ["Richard Pérez-Peña", "Benjamin Mueller", "Nicholas Kulish"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["international", "lawyers", "right", "officers", "enter", "away", "told", "officer", "immigration", "yarjani", "voluntarily", "flight", "sign", "migrants", "visa", "say"], "summary": "At Los Angeles International Airport, she said, she was questioned repeatedly, searched and ordered to remove her shoelaces, shawl and jewelry.\nShe spent 23 hours in detention and said she could hear immigration officers debating the policy, uncertain of what to do.\nFinally, she said, an officer said she could not enter the country because her student visa was no longer valid, though he would not explain why.\nOn Saturday, when she returned from a trip to Europe, an immigration officer at Kennedy International Airport told her that she could not enter.\nThen the officer gave her a copy of the form and told her that she had voluntarily withdrawn her application to enter the country."}