{"url": "https://www.nytimes.com/2017/02/02/us/foreigners-trapped-in-the-united-states-by-new-policy.html?mcubz=0", "id": "180", "title": "Foreigners Trapped in the United States by New Policy", "text": "Following Mr. Trump’s order, the State Department went even further than prohibiting those outside the country from entering: It issued an internal memorandum revoking the visas of all nationals from those countries, without notifying them, even those who are legally studying, working and living in the United States.\n\n“They aren’t just seeking to prevent people from entering,” said Greg Chen, director of advocacy for the American Immigration Lawyers Association. “They are excluding people who have been here for a long time once they leave.”\n\nSome immigration lawyers said they feared that the State Department’s cancellation of visas could expose immigrants and other legal foreign residents to deportation, but officials at the State Department and the Department of Homeland Security said those in the United States were not affected.\n\n“This does not apply to individuals who were in the country on a valid visa at the time the order was signed,” said Gillian Christensen, a spokeswoman for the Department of Homeland Security.\n\nOnly a case-by-case exemption deemed in the national interest “on the basis of a determination made by the secretaries of state and homeland security,” restore the visas while the policy remained in place, the department said. The visas were revoked “provisionally,” according to the memo, and could be reinstated once a new policy is formulated.\n\nBut for now, the loss of their visas means that anyone from those countries who leaves the United States — even for funerals or family health emergencies — would be unable to return without getting a new visa, a lengthy process that cannot begin until the Trump administration has completed its review of the visa program.\n\nUnlike the refugee ban, which was announced with much fanfare, the canceled visas came to light only as a result of court filings by government lawyers defending the ban on travelers from the seven countries against litigation.\n\nAdvertisement Continue reading the main story\n\nTrump administration officials said they had chosen those seven countries based on concerns expressed by Obama administration officials, who in 2016 required anyone passing through the seven countries to get a visa. But those involved in the Obama administration effort said that the countries had largely been chosen by Congress as part of immigration legislation passed in 2015 and that the visa reviews were intended to catch Islamic State fighters and not to ban or inconvenience all of those countries’ citizens.\n\n“My parents still live in Iran,” said Mahsa Rouhi, an Iranian who holds a green card and is a research fellow at the Belfer Center for Science and International Affairs at Harvard’s Kennedy School. “My dad is 82, and if my parents are in need of urgent care, I could face a choice of my job and my life here and caring for my parents. I was advised — most universities and institutions are advising people in my situation — not to travel, not to take the risk.”\n\nPhoto\n\nSean Spicer, the White House press secretary, said on Wednesday that legal permanent residents from the seven countries, also known as green card holders, would be able to enter the United States without getting special waivers. That was a change from the first days after the issuance of Mr. Trump’s executive order, when even green card holders from the seven countries were detained at airports, told to leave the United States or forbidden to get on planes to the United States.\n\nYet even after the change, green card holders can be turned away at the border at the discretion of Customs and Border Protection officers, as only United States citizens have an irrevocable right to enter the country.\n\nJust last year, the State Department issued 31,804 immigrant visas to people from the seven countries, according to a State Department tally. Thousands more were granted student and other visas last year, and those have also been revoked. The letter excepted only a few classes of visa holders, mainly diplomats and NATO military personnel, leaving au pairs and businesspeople, athletes and artists, even victims of human trafficking without exemptions.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“Basically, they are trapped without some other measures they would have to take, another application process they would have to go through,” said Doris Meissner, senior fellow and director of the United States immigration program at the Migration Policy Institute and a former commissioner of the Immigration and Naturalization Service.\n\nMr. Trump’s travel ban led to chaos at American airports, left would-be immigrants stranded at airports around the world and shut refugees out of a country that had already issued them visas.\n\n“The gathering of the appropriate officials to actually make this order operational did not even happen until after the order was signed,” Senator Claire McCaskill of Missouri, the top Democrat on the Homeland Security and Governmental Affairs Committee, said in a statement on Wednesday after a closed-door briefing by Homeland Security officials. “No wonder it was chaotic and rocky.”\n\nAli Hamandi, a Ph.D. candidate at Harvard in health policy, said he had just returned from speaking with university officials about whether the policies could affect him. A Canadian citizen born in Iraq, he said he had found so much contradictory information online that he felt his only option was to cancel his travel plans and stay put.\n\nAdvertisement Continue reading the main story\n\n“There are layers of misinformation,” Mr. Hamandi said. “Emotionally it’s quite devastating.”\n\nIn the hours after the executive order was signed, border officials detained or turned away anyone who was born in or had a passport from one of the seven countries, even those who also had citizenship in countries other than the targeted seven. But after the intervention of British and Canadian diplomats, Trump administration officials agreed to exempt dual-passport holders who presented passports from other countries. Under the new rules, dual citizens can now legally re-enter the United States if they leave, officials said.\n\nAdding to the concern, several green card holders, including Ms. Rouhi, said they had received unexpected notification this week that their Global Entry Trusted Traveler Network status had been revoked.\n\nA spokesman for Customs and Border Protection declined to address the canceled Global Entry memberships but said that enrollees in the program, which allows approved, low-risk travelers expedited clearance into the United States when they arrive, can be kicked out for a number of reasons, including being inadmissible to the United States under immigration regulations.\n\nAli Vaez, a senior analyst for Iran at the International Crisis Group, a nonprofit organization, said he had learned that his membership in Global Entry was abruptly cut off on Tuesday when he received a message stating, “You do not meet program eligibility requirements.” Mr. Vaez said that although he had a green card, the sudden revocation of his Global Entry status had caused him to reconsider traveling outside the United States.\n\n“I thought because permanent residents were exempted from this, it was fine, but because my Global Entry status was revoked, I have new concerns,” he said.\n\n“The rules and regulations are changing by the hour, by the day. There’s a huge amount of uncertainty,” Mr. Vaez said. With a wife and a house in Washington, he added, “I just can’t risk it.”\n\nMr. Vaez noted that his green card had been granted under the national-interest provision of immigration law and that he has been allowed inside the Pentagon and even the White House Situation Room as part of his work.\n\n“What has not been vetted properly is not people like me, it’s this new executive order,” he said. “That’s really the problem.”", "authors": ["Nicholas Kulish", "Gardiner Harris", "Ron Nixon"], "publish_date": "2017-02-02", "source": "nytimes", "top_words": ["foreigners", "seven", "visas", "state", "immigration", "trapped", "order", "officials", "united", "countries", "green", "states", "policy"], "summary": "That was a change from the first days after the issuance of Mr. Trump’s executive order, when even green card holders from the seven countries were detained at airports, told to leave the United States or forbidden to get on planes to the United States.\nJust last year, the State Department issued 31,804 immigrant visas to people from the seven countries, according to a State Department tally.\n“Basically, they are trapped without some other measures they would have to take, another application process they would have to go through,” said Doris Meissner, senior fellow and director of the United States immigration program at the Migration Policy Institute and a former commissioner of the Immigration and Naturalization Service.\nUnder the new rules, dual citizens can now legally re-enter the United States if they leave, officials said.\nA spokesman for Customs and Border Protection declined to address the canceled Global Entry memberships but said that enrollees in the program, which allows approved, low-risk travelers expedited clearance into the United States when they arrive, can be kicked out for a number of reasons, including being inadmissible to the United States under immigration regulations."}