{"url": "https://www.nytimes.com/2017/02/03/business/immigration-order-business-iran-iraq.html?mcubz=0", "id": "186", "title": "Immigration Order Complicates U.S. Businesses’ Plans in the Middle East", "text": "“I have a visa but they may not let me into the country in retaliation to Trump’s travel ban,” he said. “I’m not going over there for nothing. It’s a very bad situation.”\n\nFor American companies exploring business with Iran, the immigration order is just one new complication.\n\nThe Treasury on Friday imposed economic sanctions on individuals and companies that it said were connected to Iran’s test of a new ballistic missile last weekend. The new measures do not add to the many existing sanctions that already limit American business deals in Iran, but they will increase concerns at companies like Boeing and General Electric that efforts to reopen trade there may be caught in the crossfire.\n\nThe biggest deal that could be at risk over time is Boeing’s plan to sell $16.6 billion in commercial airplanes. The company, which announced the deal in December, has tried to tiptoe around Mr. Trump’s calls for a tougher stance toward Iran by emphasizing that the plane sales would support thousands of American jobs.\n\nThe deal was made possible when President Barack Obama lifted an earlier round of sanctions after Iran agreed to an accord that curtailed its nuclear activities. Mr. Trump has criticized the nuclear agreement as weak, and he wrote on Twitter on Friday that Iran was “playing with fire” with the missile test. Iran’s leaders “don’t appreciate how ‘kind’ President Obama was to them,” he added. “Not me!”\n\nG.E., which would supply some of the aircraft engines under the Boeing deal, and AT&T are among other big companies seeking stronger business ties in Iran.\n\nG.E.’s oil and gas and power generation divisions are active in Iran, and the company also has substantial deals in Iraq, as do most of America’s largest military contractors.\n\nAdvertisement Continue reading the main story\n\nLoren B. Thompson, an analyst at the Lexington Institute, a research group financed by Boeing and other military contractors, said that given how closely Iraq was working with the Pentagon, it was hard to believe that the strain caused by Mr. Trump’s immigration ban would threaten any contracts to provide Iraq with military equipment.\n\nThe tensions with Iran, he said, could actually prompt even bigger American arms sales to countries like Saudi Arabia and Bahrain that also are worried about Iran.\n\nPhoto\n\nThe Trump administration has said the order is meant to keep terrorists from slipping into the United States, but it set off widespread protests over concerns that it was blocking legitimate refugees and travelers.\n\nBesides Iran and Iraq, the countries named in the ban are Libya, Somalia, Sudan, Syria and Yemen.\n\nThe biggest business and strategic partners of the United States in the region, like Egypt, Pakistan and Saudi Arabia, are not affected by the order, though they have had problems combating terrorism within their borders.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe United States lists Iran, Sudan and Syria as countries where the government supports terrorism and has banned arms sales to them, and American oil companies have suspended activities in those countries in recent years.\n\nExxon Mobil has operations in Iraq and Yemen, among the countries covered by the immigration order; ConocoPhillips, Hess and Marathon are in Libya; and Chevron has operations in the Kurdistan region of Iraq.\n\nMost active across the region are service companies, like Halliburton and Weatherford, which offer technical services and training.\n\nHalliburton has an office in the southern Iraqi city of Basra, while Weatherford has three offices in Iraq and is active in Libya and Yemen. Weatherford announced on Thursday, however, that it would sell its Middle East rig-drilling division as part of a broader effort to shrink its business operations and stabilize its finances.\n\nMichael Dynan, vice president for portfolio and strategic development at Schramm, a manufacturer based in West Chester, Pa., that has supplied rigs to companies working in more than 100 countries including Iraq, said that tensions over the immigration order could affect American business beyond the seven countries.\n\nAdvertisement Continue reading the main story\n\n“My concern is retaliation, and that is just going to open things up for competitors like the Chinese,” he said, noting that Schramm workers move in and out of Iraq, as well as neighboring countries, and that their freedom to travel could be obstructed.\n\n“What I am scared of is there could be a backlash in other Muslim countries or in general against America,” Mr. Dynan added. “We’ve always opened our borders and been the leader in trade and exports. It’s our brand.”\n\nSchramm has delivered rigs in recent years to Oman and Kuwait, and has shown interest in doing business in Iran.\n\nIn December 2015, only weeks before the nuclear sanctions against Iran were lifted, Schramm was represented at a seminar on investing in the country at a conference in London sponsored by London Business Conferences, a producer of such events. Schramm was hardly the only American company there.\n\nThe producer’s website features testimonials from many international companies that attended the conference either in person or by live stream, including Chevron and Baker Hughes, prominent companies in the American oil business.\n\nAlso on hand were representatives of the engineering and construction giants Bechtel and Jacobs and the power generation and engine company Cummins. In the end, Schramm decided to wait and follow bigger companies into Iran.\n\nSince the lifting of the nuclear sanctions, many major European and Asian oil companies, including Royal Dutch Shell and Schlumberger, have entered into agreements with the Iranians to develop or service their oil fields. Many have been approved to take part in auctions to drill in some of the country’s richest oil and natural gas fields over the next few months.\n\nBut American companies, even if they have an eye toward an eventual thaw in relations, have not made a move because of other sanctions that prohibit doing business with Iran without authorization from the Treasury, as Boeing received.", "authors": ["Christopher Drew", "Clifford Krauss"], "publish_date": "2017-02-03", "source": "nytimes", "top_words": ["iran", "companies", "middle", "plans", "immigration", "complicates", "businesses", "iraq", "sanctions", "schramm", "countries", "east", "order", "american", "business", "oil"], "summary": "It’s a very bad situation.”For American companies exploring business with Iran, the immigration order is just one new complication.\nThe biggest deal that could be at risk over time is Boeing’s plan to sell $16.6 billion in commercial airplanes.\nBesides Iran and Iraq, the countries named in the ban are Libya, Somalia, Sudan, Syria and Yemen.\nIt’s our brand.”Schramm has delivered rigs in recent years to Oman and Kuwait, and has shown interest in doing business in Iran.\nThe producer’s website features testimonials from many international companies that attended the conference either in person or by live stream, including Chevron and Baker Hughes, prominent companies in the American oil business."}