{"url": "https://www.nytimes.com/2017/01/29/technology/silicon-valleys-ambivalence-toward-trump-turns-to-anger.html?mcubz=0", "id": "111", "title": "Silicon Valley’s Ambivalence Toward Trump Turns to Anger", "text": "“I’m here because I’m a refugee,” Mr. Brin said, according to a Twitter post by the Forbes writer Ryan Mac.\n\nThe tech companies’ reaction was more forceful than that of other industries. Just about everyone in Silicon Valley came from somewhere else or is a son or daughter of someone who did or is married to someone who did.\n\nThat list starts with the most famous Silicon Valley citizen of all: Steve Jobs, the Apple co-founder, whose biological father immigrated from Syria in 1954. Mr. Trump’s order proclaimed that “the entry of nationals of Syria as refugees is detrimental to the interests of the United States” and would be suspended indefinitely.\n\nMark Zuckerberg, Facebook’s chief executive, said that his great-grandparents had come from Germany, Austria and Poland and that the parents of his wife, Priscilla Chan, were refugees from China and Vietnam.\n\n“Like many of you, I'm concerned about the impact of the recent executive orders signed by President Trump,” Mr. Zuckerberg wrote on Facebook on Friday.\n\nEven some of those working closely with the Trump administration were critical. Elon Musk, the chief executive of Tesla and SpaceX, who sits on two of Mr. Trump’s advisory committees, wrote on Twitter that the ban was “not the best way to address the country’s challenges.” Mr. Musk was born in South Africa.\n\nAaron Levie, chief executive of the data storage company Box, wrote on Twitter that “on every level — moral, humanitarian, economic, logical, etc. — this ban is wrong and is completely antithetical to the principles of America.”\n\nAdvertisement Continue reading the main story\n\nOver all, Mr. Levie said in an interview, “there was a pretty resounding response from the tech industry showing how unacceptable this is.”\n\nBeyond family heritage and employment, he noted, Silicon Valley cares about immigration because its companies strive to operate everywhere in the world.\n\n“Almost every company’s products — Google, Apple, Airbnb — has a global customer base,” Mr. Levie said. “These policy decisions have real implications to our partners, our customers, our competitors.”\n\nThe Trump administration is little more than a week old, but its relationship with Silicon Valley is already complicated. The tech industry did not like Mr. Trump the presidential candidate, despite his embrace of Twitter, and he returned the sentiment with caustic posts on the platform. Stephen K. Bannon, his chief strategist, said in 2015 that “two-thirds or three-quarters of the C.E.O.s in Silicon Valley are from South Asia or from Asia,” an incorrect statement that many in Silicon Valley perceived as racist.\n\nYet a much-promoted December meeting between the incoming administration and numerous tech chieftains was decidedly upbeat. “We’re going to be there for you,” Mr. Trump promised to a room that included the leaders of Apple, Microsoft and Amazon.\n\nBy early last week, the companies sensed trouble.\n\nMurtadha al-Tameemi, 24, an Iraqi-born software engineer at Facebook, was told by a company lawyer on Tuesday that he needed to cut short a visit to Canada and return to the United States. The company feared that he would not be readmitted to the country because the president was expected to sign an executive order that would keep him out.\n\n“It may be my naïveté about how politics and industries interact, but I don’t interpret the tech community’s opposition to the president as a political stance,” Mr. Tameemi said. “It seemed more like a matter of values and a matter that impacts them.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe larger tech companies tended to be less forceful in their reactions to the executive order than the smaller ones. Google said it was “concerned.” Apple said, “It is not a policy we support.” Amazon said only that it was committed to diversity. Oracle did not respond to requests for comment.\n\nOn the other hand, Microsoft became more forceful as the weekend went on. On Saturday, its executives talked mostly about the virtues of immigration. On Sunday night, the company issued a statement calling the executive order “misguided and a fundamental step backwards” and said it would create “collateral damage to the country’s reputation and values.”\n\nAdvertisement Continue reading the main story\n\nMicrosoft was not the only company to become bolder in a few hours. Around 10 a.m. on Saturday, Mr. Chesky of Airbnb posted a vague message on Twitter saying “open doors bring all of US together.” By 6 p.m., he was advocating open protest. Early Sunday morning, he wrote a memo to employees warning that Mr. Trump’s new policy was “a direct obstacle to our mission.”\n\nIt was a long, dizzying day for an industry that is struggling to find its footing under the new president. “It feels like the air itself has changed, like when a storm comes,” said Shervin Pishevar, a founder of Sherpa Capital and Hyperloop One.\n\nEven before the executive order, pressure had been building on companies to speak out against measures being endorsed by Mr. Trump. Some of that impetus came from employees, and some from activists.\n\nEngineers and product managers at several tech companies spoke to The New York Times on the condition of anonymity. They have signed nondisclosure agreements at their companies and are generally not authorized to speak to the news media.\n\nAt Twitter, a number of workers felt frustrated with the disconnect between their company’s product — a platform for free speech — and the extent to which Mr. Trump has used it to attack those who question him and proclaim outright falsehoods to the American public. On Saturday, Jack Dorsey, Twitter’s chief executive, posted and reposted numerous messages denouncing the travel ban.\n\nAt Facebook, employees felt a similar sense of discord. Some complained about how long it took Mr. Zuckerberg and Sheryl Sandberg, the chief operating officer, to speak out. Others were upset at the continued presence of Peter Thiel, a venture capitalist and a longtime confidant of Mr. Zuckerberg’s, as a director on Facebook’s board. Mr. Thiel was a donor to Mr. Trump's campaign and has since become an adviser, and he issued a statement on Saturday evening that reaffirmed his support for the president.\n\nUber is under one of the brightest spotlights. Travis Kalanick, its chief executive, is part of Mr. Trump’s economic advisory team.\n\nThat has made Uber a target of protesters, some of whom shut down access to its headquarters on Inauguration Day.\n\nAdvertisement Continue reading the main story\n\nIn an email to employees on Saturday titled “Standing up for what’s right,” Mr. Kalanick stressed the importance of pushing for change by working to have a seat at the table and discussing any differences. He said he would be seeing Mr. Trump on Friday.\n\nAs protesters at Kennedy International Airport in New York multiplied on Saturday night, cabdrivers — largely immigrants — began a one-hour work stoppage at the airport as a form of protest against the executive order.\n\nUber did not follow suit. Instead, it posted on Twitter that it was suspending surge pricing at Kennedy Airport. That prompted accusations that it was trying to break the strike, which the company awkwardly denied in another Twitter post.\n\nOn Sunday morning, its competitor Lyft said it was donating $1 million to the American Civil Liberties Union over the next four years “to defend our Constitution.” On Sunday afternoon, Uber sharpened its criticism of the ban, calling it “wrong and unjust.”\n\nSam Altman, who runs Y Combinator, Silicon Valley’s most prominent start-up incubator, said things were changing so fast that it was hard to predict what was going to happen.\n\n“After the election, a lot of people here said give Trump a chance in good faith, and after he started, a lot of people said give him a chance in good faith,” Mr. Altman said. “Now they are looking at his policies and saying he is a risk to the republic. Saturday was a good beginning, and I think there is more to come.”\n\nMr. Altman spoke as he was arriving at the airport in San Francisco on Saturday at 10:30 p.m. The protest was continuing, and he intended to join.", "authors": ["David Streitfeld", "Mike Isaac", "Katie Benner"], "publish_date": "2017-01-29", "source": "nytimes", "top_words": ["executive", "companies", "trump", "tech", "valleys", "anger", "valley", "twitter", "company", "chief", "turns", "silicon", "mr", "ambivalence"], "summary": "Just about everyone in Silicon Valley came from somewhere else or is a son or daughter of someone who did or is married to someone who did.\nThat list starts with the most famous Silicon Valley citizen of all: Steve Jobs, the Apple co-founder, whose biological father immigrated from Syria in 1954.\nStephen K. Bannon, his chief strategist, said in 2015 that “two-thirds or three-quarters of the C.E.O.s in Silicon Valley are from South Asia or from Asia,” an incorrect statement that many in Silicon Valley perceived as racist.\n“We’re going to be there for you,” Mr. Trump promised to a room that included the leaders of Apple, Microsoft and Amazon.\nEngineers and product managers at several tech companies spoke to The New York Times on the condition of anonymity."}