{"url": "https://www.nytimes.com/2017/02/02/opinion/an-apology-to-muslims-for-president-trump.html?mcubz=0", "id": "174", "title": "Opinion | An Apology to Muslims for President Trump", "text": "Nicholas Kristof An Apology to Muslims for President Trump Image Outside a home in Avondale Estates, Ga., on Monday. Credit Erik S. Lesser/European Pressphoto Agency\n\nWhenever an extremist in the Muslim world does something crazy, people demand that moderate Muslims step forward to condemn the extremism. So let’s take our own advice: We Americans should now condemn our own extremist.\n\nIn that spirit, I hereby apologize to Muslims. The mindlessness and heartlessness of the travel ban should humiliate us, not you. Understand this: President Trump is not America!\n\nI apologize to Nadia Murad, the brave young Yazidi woman from Iraq who was made a sex slave — but since escaping, has campaigned around the world against ISIS and sexual slavery. She has been nominated for a Nobel Peace Prize, yet is now barred from the United States.\n\nI apologize to Edna Adan, a heroic Somali woman who has battled for decades for women’s health and led the fight against female genital mutilation. Edna speaks at American universities, champions girls’ education and defies extremists — and she’s one of those inspiring me to do the same.\n\nImage A Muslim man and a rabbi holding their children during a protest Monday at O’Hare International Airport, in Chicago. Credit Nuccio DiNuzzo/Chicago Tribune\n\nI don’t want to take Trump-as-an-extremist too far: He’s not beheading anyone, and the security challenge is real. Nobody has a problem with improving safety, and Presidents George W. Bush and Barack Obama both oversaw improvements in vetting. Yet Trump tackled the issue in a way that bolsters the ISIS narrative and thus makes us less safe.\n\nIn effect, Trump took a real problem, inflated it with hysteria, handled it with incompetence and created an unjust policy that targets seven mostly impoverished Muslim countries that haven’t produced a single person involved in a lethal terrorist attack in America since before 9/11. Islamophobia swirls through the order, and Rudy Giuliani has helpfully explained that Trump asked him to devise a way to create a Muslim ban and “do it legally.”\n\nThere’s a certain symmetry here.\n\nI’ve sat down in mosques in Pakistan, Afghanistan and Yemen and heard jihadists justify intolerance. Those men (always men!) “otherize” infidels as fundamentally different, as threats who must be confronted; Trump “otherizes” Muslims in a similar way.\n\nTrump’s national security adviser, Mike Flynn, has referred to Islam as a “cancer” and has shared a video asserting that Islam “wants 80 percent of humanity enslaved or exterminated.” That’s the mirror image of the bigotry I hear from jihadists who tell me that Jews were behind the 9/11 attacks.\n\nThe real chasm is not between Muslims and others, but between the moderates and the extremists of whatever religion.\n\nA Reuters poll found that many Americans approve of Trump’s travel ban, but that’s not surprising. The same was true of barring Jewish refugees in the 1930s, and of interning Japanese-Americans in 1942. When we’re fearful, we’re vulnerable to politicians who play on our fears and scapegoat immigrants; in the fullness of time, we come to regret our xenophobic behavior and to appreciate the immigrants.\n\nSo I apologize to Muslims. I have seen the worst of Islam, but also the best.\n\nThe newly chosen Rhodes scholars include a Somali refugee, Ahmed Ahmed, who was born in a Kenya refugee camp and was admitted to the U.S. as a 1-year-old. Raised by a struggling single mom, sometimes showing up at high school at 5:30 a.m. to study, he attended Cornell and won the university’s outstanding student award. Such people don’t threaten us, but enrich us.\n\nIf we need an inspiring example of how moderates can successfully challenge extremists, consider an extraordinary Somali gynecologist, Dr. Hawa Abdi, who ran a displaced persons camp in Somalia, including a 400-bed hospital (and a jail for men who beat their wives). Islamic militants, enraged that a woman was running such an important enterprise, ordered her to hand it over. When she refused, 750 armed militants from the Party of Islam attacked the camp and ordered Dr. Abdi to run it under their direction. She refused.\n\nYet Dr. Abdi’s camp, serving 90,000 people, was just about the only thing working properly in Somalia, and Somalis at home and around the world united to denounce the militants and speak up for her. The pressure on the gunmen grew. Finally, they slunk off.\n\nIf Somalis can stand up to extremists, we can, too.\n\nIndeed, that is happening. When Japanese-Americans were rounded up, other Americans were silent. Today, it is heartwarming to see Americans of all creeds standing up against similar bigotry. In Victoria, Tex., after a mysterious fire destroyed the only mosque just hours after Trump announced his travel ban, local Jewish leaders gave Muslims a key to their synagogue. Four churches also offered their space for as long as needed, and in just a few days, people of all faiths contributed $1 million to build a new mosque.\n\nAt an airport protest, one much-shared photo showed a Jewish man and a Muslim man protesting side by side, each with a child on his shoulders.\n\nMy dream is of the day when Jews protest Islamophobia, Muslims denounce the persecution of Christians and Christians stand against anti-Semitism. That’s why I apologize to Muslims, and it’s why ALL of us, not just Muslims, should stand up to condemn extremism in our midst.\n\nSign up for the Opinion Today newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, The Times editorial board and contributing writers from around the world. SEE SAMPLE Please verify you’re not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. * Required field You agree to receive occasional updates and special offers for The New York Times products and services. * Required field Thank you for subscribing. View all New York Times newsletters. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. Sign Up", "authors": ["Nicholas Kristof"], "publish_date": "2017-02-02", "source": "nytimes", "top_words": ["muslim", "camp", "world", "trump", "apologize", "ban", "apology", "opinion", "times", "islam", "extremists", "president", "muslims"], "summary": "Nicholas Kristof An Apology to Muslims for President Trump Image Outside a home in Avondale Estates, Ga., on Monday.\nCredit Erik S. Lesser/European Pressphoto AgencyWhenever an extremist in the Muslim world does something crazy, people demand that moderate Muslims step forward to condemn the extremism.\n“otherize” infidels as fundamentally different, as threats who must be confronted; Trump “otherizes” Muslims in a similar way.\nThe real chasm is not between Muslims and others, but between the moderates and the extremists of whatever religion.\nThat’s why I apologize to Muslims, and it’s why ALL of us, not just Muslims, should stand up to condemn extremism in our midst."}