{"url": "https://www.nytimes.com/2017/02/01/world/trump-immigration-ban-un.html?mcubz=0", "id": "172", "title": "U.N. Leader Says Trump Visa Bans ‘Violate Our Basic Principles’", "text": "Mr. Guterres is under enormous pressure. On the one hand, he must speak out against discrimination, in keeping with the rules enshrined in international conventions. On the other, he needs to avoid alienating the president of the United States, which is the United Nations’ biggest financial backer.\n\nMr. Guterres declined to comment about the White House’s reported threats to cut financial support to the United Nations, saying he did not want to prejudge what has not yet been announced. “When you talk too much about things that have not happened, you trigger the happening of those things,” he said.\n\nHe said he had held “a very constructive discussion” with the new United States ambassador to the United Nations, Nikki R. Haley.\n\n“What I am doing is to do everything I can to prove the added value of the U.N., to recognize the U.N. needs reforms, to be totally committed to those reforms,” Mr. Guterres said.\n\nThat, he argued, is “the best way to get, indeed, the support of all member states, including the United States of America and the new administration.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Guterres had been more restrained in his criticism of the Trump administration’s travel ban than some others at the United Nations. The organization’s top human rights official, Zeid Ra’ad al-Hussein, said in a Twitter post this week that Mr. Trump’s order flouted international law.\n\nOn Wednesday, five independent human rights experts for the United Nations also criticized the Trump administration in a statement that described the new American policy as a discriminatory action that had stigmatized Muslim communities.\n\nThe countries affected by Mr. Trump’s order are Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\n\nAdvertisement Continue reading the main story\n\nMr. Guterres, in his comments on Wednesday, also warned of a backlash.\n\n“When we adopt measures that spread anxiety and anger,” he said, “we help trigger the kind of recruitment mechanism that these organizations are doing everywhere in the world.”\n\nLegal experts say the executive order could collide with international law. It is already facing numerous legal challenges in American courts.\n\nNo country is legally obliged to provide resettlement to refugees, and every country has the sovereign right to decide who is admitted into its territory. But the International Covenant on Civil and Political Rights, a treaty that came into force in 1976, prohibits a country from passing laws that discriminate on the basis of religion or national origin. James C. Hathaway, a University of Michigan law professor, argued that the United States therefore cannot limit resettlement based on religion or national origin.\n\nAdditionally, laws governing the rights of refugees prohibit sending people back to countries where they could face persecution.\n\nIn a post on the legal site Just Security, Mr. Hathaway called Mr. Trump’s executive order “willfully blind” to the United States’ obligation under that law.", "authors": ["Somini Sengupta"], "publish_date": "2017-02-01", "source": "nytimes", "top_words": ["principles", "international", "trump", "violate", "order", "united", "states", "nations", "trumps", "rights", "law", "leader", "bans", "guterres", "basic", "mr", "visa"], "summary": "On the other, he needs to avoid alienating the president of the United States, which is the United Nations’ biggest financial backer.\nHe said he had held “a very constructive discussion” with the new United States ambassador to the United Nations, Nikki R. Haley.\nMr. Guterres had been more restrained in his criticism of the Trump administration’s travel ban than some others at the United Nations.\nThe organization’s top human rights official, Zeid Ra’ad al-Hussein, said in a Twitter post this week that Mr. Trump’s order flouted international law.\nThe countries affected by Mr. Trump’s order are Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen."}