{"url": "https://www.nytimes.com/2017/01/31/us/politics/donald-trump-administration.html?mcubz=0", "id": "155", "title": "It’s ‘The Apprentice, Supreme Court Edition,’ as Trump Summons Finalists to White House", "text": "Mr. Trump has given conflicting signals about which way he is leaning. Judge Hardiman has been recommended by Mr. Trump’s sister, Maryanne Trump Barry, who is a federal judge. But Judge Gorsuch has strong supporters.\n\nThe Trump administration is also mindful of making a choice that would be seen as moderate enough that Justice Anthony Kennedy, an appointee of President Ronald Reagan, could feel comfortable with retiring in the next few years, opening up another seat for the current president to fill.\n\nJudge Gorsuch was a clerk for Mr. Kennedy.\n\nAnd here are your contenders. To mix our reality television show metaphors, who will end up with the rose?\n\nTrump wants a big show for his Supreme Court rollout. Networks oblige\n\nThe major broadcast networks are set to carry President Trump’s Supreme Court announcement live on Tuesday evening, cutting into regular prime-time programming.\n\nThe coverage by ABC, CBS, NBC, and Fox broadcast affiliates is likely to significantly expand the television audience for the president’s announcement, which has taken on the air of a reality television special. Mr. Trump has used his Twitter account to encourage Americans to tune in for the event.\n\nTypically, the introduction of a Supreme Court nominee occurs during the daytime, when viewership is relatively lower. The major cable-news networks also plan to carry tonight’s announcement live.\n\nThe border patrol gets a new chief\n\nThe Customs and Border Protection agency announced on Tuesday that Ronald Vitiello, an executive assistant commissioner and long-time insider at the agency, has been named the new chief of the Border Patrol.\n\nAdvertisement Continue reading the main story\n\nMr. Vitiello’s elevation to head the 93-year old agency comes nearly a week days after Mark Morgan, who had been chief since October 2016, was asked to step down by the Trump administration.\n\nMr. Morgan’s last day was Tuesday. Mr. Morgan, a former F.B.I. agent, was appointed chief in June and took over in October. He was the first chief in the agency’s history that had never worked as a border patrol agent. He had led the internal affairs office at Customs and Border Protection before taking over the Border Patrol.\n\nHis appointment drew criticism from the National Border Patrol Council, the union for Border Patrol workers, which said an insider should have been appointed to head the agency.\n\nThe union endorsed Mr. Trump during the election, and the union’s president, Brandon Judd, also served on Mr. Trump’s transition team.\n\nTrump greets drug makers with a carrot and a stick\n\nPresident Trump, who just weeks ago accused the pharmaceutical industry of “getting away with murder,” demanded on Tuesday that major drug companies lower their prices and return operations to the United States. But he vowed to help them by shredding regulations and leveling the playing field with foreign countries.\n\nMr. Trump gathered the heads of pharmaceutical companies in the Roosevelt Room for what has become a regular feature of his first days in the White House: a meeting with corporate leaders, at which the president holds forth on an pet issue for the television cameras.\n\nOn drug pricing, the president has aligned himself with Democrats, who have long argued that the government should be allowed to bargain for lower drug prices for Medicare and Medicaid, a position fought tooth and nail by Republicans. But Mr. Trump was diplomatic, at least for the cameras.\n\n“The U.S. drug companies have produced extraordinary results for our country, but the pricing has been astronomical,” Mr. Trump said. “We have to get prices down for a lot of reasons.”\n\nAdvertisement Continue reading the main story\n\n“We’re also going to be streamlining the process, so that, from your standpoint, when you have a drug, you can actually get it approved if it works, instead of waiting for many, many years,” he added.\n\nMuch of his message had to do with luring corporate investment back to the United States. He promised that the Food and Drug Administration would speed its approval of new drugs. And he said the United States would end “foreign freeloading,” which he described as countries devaluing their currencies to undercut the competitiveness of the American market.\n\n“Because our country has been run so badly, we know nothing about devaluation,” he said. “You look at what China’s doing, you look at what Japan has done over the years. They play the money market, they play the devaluation market, while we sit here like a bunch of dummies.”\n\nChina’s currency has actually been appreciating of late, and Japan has not intentionally manipulated its currency values for several years.\n\nAmid executive branch chaos, Trump calls Democrats ‘a mess’\n\nThe acting attorney general has been fired, protests are rocking the nation’s largest airports, and a constitutional clash is brewing between the executive and judicial branches, but Mr. Trump thinks the Democrats are a real mess because their audio equipment malfunctions, as do their tear ducts.\n\nThe rally he was referring to was surprisingly large for what amounted to a political event on the steps of the Supreme Court. But what is really sticking in the president’s craw is the glacial pace of confirmations in the Senate — which is intentional. His choice for transportation secretary, Elaine Chao, is likely to be confirmed on Tuesday afternoon, and his nominee for secretary of state, Rex W. Tillerson, will probably get a vote on Wednesday. Committee votes are expected today for his nominees for attorney general, Jeff Sessions and small business administrator, Linda McMahon. The Senate Education Committee voted out the nomination of Betsy DeVos as education secretary on a party-line vote.\n\nBut Democrats are deliberately slowing the process as they demand more answers to questions about ethics and the nominees’ views on Mr. Trump’s temporary immigration ban from citizens of seven predominantly Muslim nations.\n\nMr. Trump’s tweets only gave Democratic leaders the opportunity to grab the high ground. Drew Hammill, a spokesman for Ms. Pelosi, the House minority leader, responded:\n\n“The mic briefly didn’t work, but this thin-skinned President clearly heard the voices of the more than 250 Members of Congress and thousands of others who gathered outside the Supreme Court last night. The President’s immoral executive order is clearly unconstitutional – no matter how many times he tweets or how many Administration officials he fires.”\n\nSo did Mr. Schumer’s spokesman, Matt House:\n\n“President Trump should learn that name calling is not going to solve the many problems this administration has already brought upon itself. He ought to repeal this un-American, poorly put-together, and rushed executive order that makes America less safe and figure out a real way to stop terrorism.”\n\nDemocrats boycott committee vote to slow Trump nominees\n\nDemocrats on the Senate Finance Committee sought to stall the confirmations of Steven Mnuchin and Tom Price, Mr. Trump’s picks for Treasury secretary and secretary of health and human Services, refusing to attend scheduled votes on Tuesday.\n\nAdvertisement Continue reading the main story\n\nSenator Ron Wyden of Oregon, the ranking Democrat on the committee, said that recent news reports suggested that Mr. Mnuchin and Mr. Price had given false statements in their nomination hearings and that the committee members needed more information before making judgments about the nominees.\n\n“We have made clear that we need additional information,” Mr. Wyden said outside of his office, explaining the reason for the boycott.\n\nRepublicans expressed dismay at the delay. But with a Supreme Court vacancy nearing its 12-month point after an unprecedented blockade by Republicans, Democrats weren’t exactly feeling the heat, at least not yet.\n\nShowdown at Justice Dept. raises heat on Senate\n\nThe late-night firing of the acting attorney general, Sally Q. Yates, over her refusal to defend Mr. Trump’s executive order banning refugees, immigrants and visitors from seven predominantly Muslim countries has put a lot of people in a sticky position: senators.\n\nDemocrats now have every reason to drag out the confirmation fight over Mr. Sessions as long as possible, leaving Mr. Trump’s order defended by a Justice Department rived by dissent against a growing list of opponents.\n\nMr. Trump seems to understand this.\n\nBut what about Republican senators like John McCain of Arizona, Lindsey Graham of South Carolina, Ben Sasse of Nebraska and Cory Gardner of Colorado?\n\nThey have leverage to demand changes before they seat Mr. Sessions at the Justice Department. But as the fight drags on, so does the lag in warrants. The pressure will only intensify.\n\nAt her confirmation hearings to be deputy attorney general, Ms. Yates faced a grilling from Republicans who were furious about former President Barack Obama’s order liberalizing immigration policy.\n\nAdvertisement Continue reading the main story\n\nThe question: Would Ms. Yates be willing to stand up to the president?\n\nHer inquisitor? Senator Jeff Sessions, Republican of Alabama, and now Mr. Trump’s nominee for attorney general.\n\n“If the views the president wants to execute are unlawful, should the attorney general or the deputy attorney general say ‘No?’” Mr. Sessions asked.\n\n“I believe the attorney general or deputy attorney general has an obligation to follow the law and Constitution and give their independent legal advice to the president,” Ms. Yates replied.\n\nEuropean Union official sees Trump as a threat\n\nThe European Union negotiator on Britain’s exit from the European Union returned from the United States and declared that a united Europe now faces three threats: Islamist terrorism, President Vladimir V. Putin of Russia and Mr. Trump.\n\n“I have just come back from U.S., and my view is that we have a third front that is undermining the E.U., and that is Donald Trump,” the negotiator, Guy Verhofstadt, said in a speech at Chatham House, a think tank in London, according to a German newspaper.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“Trump spoke very favorably of the fact that also other countries will want to break away from the European Union, and that he hoped for a disintegration of the European Union,” he added.\n\nAnd speaking of Europe...\n\nPresident Trump and his administration have enraged Mexico, bewildered Japan, incensed China and angered much of the Muslim world. So what’s wrong with tweaking the Germans?\n\nPeter Navarro, the director of Mr. Trump’s new National Trade Council, told The Financial Times that Germany was using a “grossly undervalued” euro to “exploit” the United States and its European Union partners.\n\nThat did not sit well with Germany’s chancellor, Angela Merkel.\n\n“Germany is a country that has always called for the European Central Bank to pursue an independent policy, just as the Bundesbank did that before the euro existed,” Ms. Merkel told a news conference with Stefan Lofven, the prime minister of Sweden, according to Reuters. “Because of that we will not influence the behavior of the E.C.B. And as a result, I cannot and do not want to change the situation as it is,” she added.", "authors": ["Maggie Haberman", "Michael M. Grynbaum", "Ron Nixon"], "publish_date": "2017-01-31", "source": "nytimes", "top_words": ["trump", "summons", "supreme", "edition", "union", "drug", "court", "united", "president", "trumps", "finalists", "attorney", "general", "border", "white", "house", "mr", "apprentice"], "summary": "Mr. Trump has given conflicting signals about which way he is leaning.\nNetworks obligeThe major broadcast networks are set to carry President Trump’s Supreme Court announcement live on Tuesday evening, cutting into regular prime-time programming.\nMr. Trump has used his Twitter account to encourage Americans to tune in for the event.\nThe union endorsed Mr. Trump during the election, and the union’s president, Brandon Judd, also served on Mr. Trump’s transition team.\n“If the views the president wants to execute are unlawful, should the attorney general or the deputy attorney general say ‘No?’” Mr."}