{"url": "https://www.nytimes.com/2017/01/28/world/middleeast/trump-middle-east-refugees-ban.html?mcubz=0", "id": "101", "title": "‘Dreams Die’ for Refugees on Verge of Coming to U.S. as Trump Closes Door", "text": "“We don’t want them here,” he said at the Pentagon. “We want to ensure that we are not admitting into our country the very threats our soldiers are fighting overseas.”\n\nThe executive order calls for the United States’ annual refugee quota to be cut to a maximum of 50,000, compared with 85,000 allowed in during the fiscal year ending in September 2016.\n\nEven last year’s figure was dwarfed by the historically high number of displaced people in the world, 65 million, or by the more than 1.5 million migrants and refugees arriving in European countries since 2014.\n\nMr. Trump’s order also suspends the entry of all Syrian refugees indefinitely, calling their arrival “detrimental to the interests of the United States.” Beyond that, it suspends visas to people from Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen for 90 days.\n\nAsked about Mr. Trump’s refugee ban, Stéphane Dujarric, the United Nations spokesman, said he hoped “it’s a temporary one.” He noted that more people were displaced around the world than ever before.\n\nAdvertisement Continue reading the main story\n\n“The U.S. resettlement program is one of the most important resettlement programs the U.N. works with,” he said.\n\nMr. Trump’s action was the latest closed door in a world that has become increasingly unwelcome to refugees, amid rising concerns and hostility in many resettlement countries in Europe, and in countries of first refuge like Turkey and Lebanon.\n\nAffected by Trump’s order? Are you affected by President Trump’s executive order on immigration, or do you know someone who is? If you have information, please contact us at immigration@nytimes.com.\n\nFor those refugees, in particular, who thought that their asylum process was over and that they would be accepted in the United States, the dismay was overwhelming this past week.\n\nFaten Diab, 34, a former charity worker from Syria, said she had been told that she and her family would be among a relatively small number of Syrians allowed into the United States. Last year, only 10,000 had been granted that privilege, compared with 40,000 in Canada.\n\nMs. Diab and her husband said she fled to Turkey and applied for asylum in the United States in summer 2015, along with close friends who applied at the same time. They said the friends had received a final decision just over a week ago and had flown to America. The Diabs had reason to hope that their own number would come up any day.\n\nNow, that may never happen. Reached by telephone in their tiny apartment in Turkey, Ms. Diab sounded distraught, as the couple’s 2-year-old daughter could be heard playing in the background.\n\n“We are so, so, so sad,” Ms. Diab said, complaining that Mr. Trump’s claim that terrorists were slipping in as refugees was overblown. “The process of resettlement is long and difficult. You can say he is wrong. Because he didn’t live the application steps in all its difficulties.”\n\nStrictly speaking, America does not actually owe anything to the Diabs from Syria or the Abdullahs from Darfur; they are just reacting to its historical promise to take the world’s “huddled masses yearning to breathe free.”\n\nAdvertisement Continue reading the main story\n\nBut in other countries, like Iraq, citizens who worked for the American military, government and companies were promised preferential treatment for resettlement. Many thought that the risks they took on behalf of the United States would be repaid one day with a safe haven when they needed it. Now Iraqis are also on Mr. Trump’s proscribed list.\n\nPhoto\n\nLaith al-Samari, 37, was one of many who could not believe it. A former interpreter for the United States military, he was wounded twice in battle, in the leg and stomach, and now lives in fear of retaliation from anti-American militants in his Baghdad community. He was not ashamed to beg.\n\n“Please Mr. President, you are the president of one of the biggest states in the world,” he said. “Don’t be hasty in taking this decision. Be fair with us.”\n\nMustafa, the 28-year-old Iraqi, is a Shiite Muslim who worked on construction crews on American bases, mostly on fortifications. As he put it: “I made homes for them that kept them safe. I felt I was doing something good for humanity.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut anti-Shiite militias in his neighborhood discovered what his job had been and accused him of treason. “I was beaten and shot and knifed and eventually came to Lebanon two years ago,” he said, during an interview arranged in Beirut by the International Refugee Assistance Project, a New York-based legal aid group.\n\nAfter years of interviews and investigation, Mustafa said he was finally told to take his medical examination and now only needed to be given the date for his flight, to California. To get ready, Mustafa splurged at a high-end Beirut store to buy the clothes he would wear into his new life: dark green pants, a vest, a checked shirt in four colors. “I would wear the best clothes I have, and I wouldn’t take anything else with me, not even my memories,” he said.\n\nMustafa still has some hope that somehow exceptions will be made, which is why — like most of the refugees interviewed for this article — he did not want his full name published.\n\n“If I do get rejected,” he said, “I’d regret ever having shaken hands with an American.” He struggled not to weep.\n\nSardar Hussain, 16, an ethnic Hazara boy from central Afghanistan, was rocked by disbelief.\n\nHe said that when he was 13, his father, mother and younger sister were killed when a bomb blew up a taxi that was taking his mother to a hospital. After paying a smuggling network $7,000 to get him to Australia, he was marooned en route, on the Indonesian island of Java, when Australia cracked down on boats bringing refugees there. For seven weeks, he slept on the sidewalk behind the United Nations offices in Jakarta, Indonesia. Now, after more than two years, he said, his flight to America was scheduled for Monday.\n\nAdvertisement Continue reading the main story\n\n“We were given a commitment to go there,” he said, speaking softly in English at a coffee house in Jakarta, just after completing his final medical exam.\n\nFiras al-Swiha, 23, a Syrian refugee in Turkey, went out with friends on Wednesday night to drink away his disappointment. He was a university student and opposition activist in Syria before fleeing his hometown, Raqqa, now the Islamic State’s de facto capital.\n\nHe was still looking for answers.\n\n“Is Trump trying to fight the terrorists by giving up on the victims of the very same terrorists?” he asked. “ISIS wants to destroy our lives, and now Trump declined to give us one.”\n\nSara, 31, a former television presenter who fled to Indonesia from Afghanistan after death threats — the Taliban and other cultural conservatives despise seeing Afghan women in public at all, let alone on television — was trying to arrive at answers of her own.\n\n“You just wait,” she said. “You see how the years pass. You get older, you cannot make any plans. You watch your dreams die with every second you spend waiting.”\n\nAfter three years and four months, she thought that the waiting was finally over, and that she would soon have a date when she was allowed to fly.\n\nNow her life has been suspended for at least four more months, with no guarantee that she will still be included in the Trump administration’s much-reduced refugee quota once the visa moratorium is lifted.\n\n“The bitter truth,” she said, “is that your whole life is dependent on a single decision of someone who doesn’t have even the slightest idea what it’s like to live as a refugee.”", "authors": ["Rod Nordland", "Joe Cochrane", "Patrick Kingsley"], "publish_date": "2017-01-28", "source": "nytimes", "top_words": ["dreams", "verge", "world", "trump", "coming", "refugee", "turkey", "die", "united", "door", "states", "trumps", "resettlement", "syria", "reading", "refugees", "closes"], "summary": "For those refugees, in particular, who thought that their asylum process was over and that they would be accepted in the United States, the dismay was overwhelming this past week.\n“We are so, so, so sad,” Ms. Diab said, complaining that Mr. Trump’s claim that terrorists were slipping in as refugees was overblown.\nMany thought that the risks they took on behalf of the United States would be repaid one day with a safe haven when they needed it.\nA former interpreter for the United States military, he was wounded twice in battle, in the leg and stomach, and now lives in fear of retaliation from anti-American militants in his Baghdad community.\nFiras al-Swiha, 23, a Syrian refugee in Turkey, went out with friends on Wednesday night to drink away his disappointment."}