{"url": "https://cn.nytimes.com/usa/20170526/trump-travel-ban-blocked/en-us/?mcubz=0", "id": "12", "title": "Appeals Court Will Not Reinstate Trump’s Revised Travel Ban", "text": "WASHINGTON — A federal appeals court refused Thursday to reinstate President Donald Trump’s revised travel ban, saying it “drips with religious intolerance, animus and discrimination.”\n\nThe decision, from the 4th U.S. Circuit Court of Appeals, in Richmond, Virginia, was a fresh setback for the administration’s efforts to limit travel from several predominantly Muslim countries.\n\nAttorney General Jeff Sessions said the administration would appeal the decision to the Supreme Court.\n\n“This Department of Justice will continue to vigorously defend the power and duty of the executive branch to protect the people of this country from danger, and will seek review of this case in the United States Supreme Court,” Sessions said in a statement.\n\n广告\n\nThe court’s vote was 10-3. The court divided along ideological lines, with the three Republican appointees in dissent.\n\nWriting for the majority, Chief Judge Roger L. Gregory said Trump’s statements on the campaign trail concerning Muslims showed that the revised order was the product of religious hostility. Such discrimination, he wrote, violates the First Amendment’s ban on government establishment of religion.\n\n“Then-candidate Trump’s campaign statements reveal that on numerous occasions, he expressed anti-Muslim sentiment, as well as his intent, if elected, to ban Muslims from the United States,” Gregory wrote. He cited, as an example, a 2015 statement calling for “a total and complete shutdown of Muslims entering the United States until our representatives can figure out what is going on.”\n\nThe Trump administration had urged the appeals court to ignore the statements as loose language made before the president assumed office. But Gregory said the court could take account of the comments.\n\n“The campaign statements here are probative of purpose because they are closely related in time, attributable to the primary decisionmaker, and specific and easily connected to the challenged action,” Gregory wrote.\n\nThe administration had argued that consideration of campaign rhetoric would chill political speech protected by the First Amendment. That was not a problem, Gregory said.\n\n“To the extent that our review chills campaign promises to condemn and exclude entire religious groups, we think that a welcome restraint,” he wrote.", "authors": ["Adam Liptak"], "publish_date": "2017-05-26", "source": "nytimes", "top_words": ["travel", "wrote", "revised", "ban", "appeals", "court", "united", "trumps", "gregory", "reinstate", "statements", "religious", "states", "muslims", "campaign"], "summary": "WASHINGTON — A federal appeals court refused Thursday to reinstate President Donald Trump’s revised travel ban, saying it “drips with religious intolerance, animus and discrimination.”The decision, from the 4th U.S.\nCircuit Court of Appeals, in Richmond, Virginia, was a fresh setback for the administration’s efforts to limit travel from several predominantly Muslim countries.\nWriting for the majority, Chief Judge Roger L. Gregory said Trump’s statements on the campaign trail concerning Muslims showed that the revised order was the product of religious hostility.\n“Then-candidate Trump’s campaign statements reveal that on numerous occasions, he expressed anti-Muslim sentiment, as well as his intent, if elected, to ban Muslims from the United States,” Gregory wrote.\n“The campaign statements here are probative of purpose because they are closely related in time, attributable to the primary decisionmaker, and specific and easily connected to the challenged action,” Gregory wrote."}