{"url": "https://www.nytimes.com/2017/01/29/us/christian-leaders-denounce-trumps-plan-to-favor-christian-immigrants.html?mcubz=0", "id": "113", "title": "Christian Leaders Denounce Trump’s Plan to Favor Christian Refugees", "text": "But if Mr. Trump had hoped for Christian leaders to break out in cheers, that is, for the most part, not what he has heard so far.\n\nA broad array of clergy members has strongly denounced Mr. Trump’s order as discriminatory, misguided and inhumane. Outrage has also come from some of the evangelical, Roman Catholic and mainline Protestant leaders who represent the churches most active in trying to aid persecuted Christians.\n\nBy giving preference to Christians over Muslims, religious leaders have said the executive order pits one faith against another. By barring any refugees from entering the United States for nearly four months, it leaves people to suffer longer in camps, and prevents families from reuniting.\n\nAlso, many religious leaders have said that putting an indefinite freeze on refugees from Syria, and cutting the total number of refugees admitted this year by 60,000, shuts the door to those most in need.\n\n“We believe in assisting all, regardless of their religious beliefs,” said Bishop Joe S. Vásquez, the chairman of the committee on migration for the United States Conference of Catholic Bishops.\n\nJen Smyers, the director of policy and advocacy for the immigration and refugee program of Church World Service, a ministry affiliated with dozens of Christian denominations, called Friday a “shameful day” in United States history.\n\nIt remains to be seen whether Mr. Trump’s executive order will find more support in the pews.\n\nDuring the campaign, Mr. Trump successfully mined many voters’ concern about national security and fear of Muslims. He earned the votes of four out of every five white evangelical Christians, and a majority of white Catholics, exit polls showed.\n\nAdvertisement Continue reading the main story\n\nIn interviews on Sunday, churchgoers in several cities were sharply divided on the issue, including on whether Christian teachings supported giving priority to Christians.\n\n“Love thy neighbor” was cited more than once, and by both sides: It was seen as both a commandment to embrace all peoples and to defend one’s actual neighbors from harm.\n\n“You look at a city like Mosul, which is one of the oldest Christian populations in the world,” said Mark Tanner, 52, a worshiper at Buckhead Church, an evangelical church in Atlanta, referring to the besieged Iraqi city. “There’s a remnant there that want to stay there to be a Christian witness.”\n\n“So yeah,” he continued. “We should reach out to everyone, but we have to be real about it and as far as who you let come into the country.”\n\nNmachi Abengowe, 62, a native of Nigeria who attends Oak Cliff Bible Fellowship in Dallas, cited Muslim-on-Christian violence in Africa in defending Mr. Trump’s preference for Christian refugees.\n\n“They believe in jihad,” he said of Muslims. “They don’t have peace. Peace comes from Jesus Christ.”\n\nPhoto\n\nThat was not the view of Makeisha Robey, 39, who was at the Atlanta church. “I think that is just completely opposite what it means to be a Christian,” she said. “God’s love was not for you specifically. It’s actually for everyone, and it’s our job as Christians to kind of enforce that on this planet, to bring God’s love to everyone.”\n\nJohn and Noreen Yarwood, who attended Mass at the Co-Cathedral of St. Joseph, a Catholic church in Brooklyn, said they feared that a policy of preference for Christians could in practice become a preference for certain denominations of Christianity over others.\n\nAdvertisement Continue reading the main story\n\n“What does this administration mean by Christian?” Mr. Yarwood, 37, asked. He said that refugees are deserving of help and mercy “because of desperation and poverty,” not because of their religion.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“This is not grace,” he said of the president’s order. “It doesn’t follow Christian teachings.”\n\nChristian leaders who defended Mr. Trump’s executive order were rare this weekend.\n\nOne of the few was the Rev. Franklin Graham, the son of the evangelist Billy Graham and the president of Samaritan’s Purse, an evangelical aid organization.\n\nMr. Graham has long denounced Islam as “evil,” and in July 2015 proposed a ban on Muslims entering the United States as a solution to domestic terrorism, months before Mr. Trump made his first call for the same.\n\nIn a statement on Saturday, Mr. Graham said of refugees, “We need to be sure their philosophies related to freedom and liberty are in line with ours.”\n\nHe added that those who followed Sharia law — a set of beliefs at the core of Islam — hold notions “ultimately incompatible with the Constitution of this nation.”\n\nJim Jacobson, the president of Christian Freedom International, which advocates for persecuted Christians, applauded the executive order and said, “The Trump administration has given hope to persecuted Christians that their cases will finally be considered.”\n\nAmong the claims Mr. Trump made at his campaign rallies was that the Obama administration had denied refugee status to Christians, and had given preference to Muslims.\n\n“How unfair is that? How bad is that?” he told supporters at a rally in St. Clairsville, Ohio, interlaced with boasts about his “tremendous evangelical support.”\n\nAdvertisement Continue reading the main story\n\nThe contention was consistent with the conspiracy theories held by some conservative Christians that Mr. Obama was secretly a Muslim, and that he was turning a blind eye to the suffering of Christians while using the reins of government to increase the Muslim population of the United States.\n\nBut the claim is simply untrue. In 2016, the United States admitted almost as many Christian refugees (37,521) as Muslim refugees (38,901), according to the Pew Research Center.\n\nWhile only about one percent of the refugees from Syria resettled in the United States last year were Christian, the population of that country is 93 percent Muslim and only 5 percent Christian, according to Pew.\n\nAnd leaders of several refugee resettlement organizations said during interviews that it took 18 months to three years for most refugees to go through the vetting process to get into the United States.\n\nMany Syrian Christians got into the pipeline more recently.\n\n“We have no evidence that would support a belief that the Obama administration was discriminating against Christian populations,” said the Rev. Scott Arbeiter, the president of World Relief, the humanitarian arm of National Association of Evangelicals.\n\nHis organization has resettled thousands of Muslim refugees, with the help of a network of 1,200 evangelical churches.\n\nMr. Arbeiter said that World Relief is opposed to “any measure that would discriminate against the most vulnerable people in the world based on ethnicity, country of origin, religion, gender or gender identity. Our commitment is to serve vulnerable people without regard to those factors, or any others.”\n\nHe said that World Relief had already gathered 12,000 signatures from evangelical Christians for a petition opposing Mr. Trump’s executive order.\n\n“We’re going to call out to our network, the 1,200 churches that are actively involved,” he said, “and ask them to use their voices to change the narrative, to challenge the facts that drive the fear so high that people would accept this executive order.”", "authors": ["Laurie Goodstein"], "publish_date": "2017-01-29", "source": "nytimes", "top_words": ["evangelical", "mr", "world", "plan", "order", "united", "states", "trumps", "christians", "refugees", "denounce", "leaders", "christian", "favor"], "summary": "But if Mr. Trump had hoped for Christian leaders to break out in cheers, that is, for the most part, not what he has heard so far.\nHe earned the votes of four out of every five white evangelical Christians, and a majority of white Catholics, exit polls showed.\nAdvertisement Continue reading the main story“What does this administration mean by Christian?” Mr. Yarwood, 37, asked.\n“It doesn’t follow Christian teachings.”Christian leaders who defended Mr. Trump’s executive order were rare this weekend.\nIn 2016, the United States admitted almost as many Christian refugees (37,521) as Muslim refugees (38,901), according to the Pew Research Center."}