{"url": "https://www.nytimes.com/2017/02/03/us/politics/russia-election-hacking-white-house-doctor.html?mcubz=0", "id": "190", "title": "Trump Responds to Louvre Attack in Paris, Urging U.S. to ‘Get Smart’", "text": "For their part, Europeans aren’t taking well to the new American president.\n\nPresident François Hollande of France, in a defense of the European Union that Mr. Trump has disparaged, said on Friday that European countries that wanted to forge bilateral ties with the United States had to “understand that there is no future with Trump if it is not defined in common.”\n\nThen there are the Germans:\n\nThe Bowling Green massacre sets off a new Trump-Clinton war\n\nWhen Kellyanne Conway, the White House senior adviser, cited the “Bowling Green massacre” to justify President Trump’s halt to visas from seven predominantly Muslim countries, America was left scratching its collective head.\n\nAnd social media lit up with delight over the “massacre” that time forgot.\n\nThis has not sat well with Ms. Conway, who after all did have a small kernel of truth to back her up, though no killings happened in Bowling Green, Ky., and a “massacre” does not appear to have ever occurred anywhere.\n\nIn 2013, the State Department imposed a six-month freeze on processing Iraqi refugees after two Qaeda members were discovered in Iraq setting roadside bombs targeting American troops. They had been admitted to the United States in 2009 and lived in Bowling Green before they returned to Iraq.\n\nThe fingerprint that nailed them was on a cellphone detonator tied to a bomb that had not exploded. So “massacre”? No. In Bowling Green? No. Refugees? Well, yes, sort of.\n\nMs. Conway now says she misspoke.\n\nBut things got really hot when a Clinton jumped into the fray — Chelsea Clinton.\n\nWhich only stoked old campaign feuds, and a reminder of the exaggerated claim from Hillary Clinton that, as first lady, she once landed in war-torn Bosnia under fire from hostile Serbs.\n\nIt never ends.\n\nTrump to Uber: Well, we can’t print it.\n\nPresident Trump has taken some heat for his phone manners since it emerged that he pretty much chewed out Prime Minister Malcolm Turnbull of Australia before hanging up on him. Apparently Mr. Trump is unrepentant.\n\nAdvertisement Continue reading the main story\n\nAccording to the new online newsletter Axios, Mr. Trump had an unpleasant conversation with the chief executive of Uber, Travis Kalanick, after the brash entrepreneur quit the president’s business council in protest of his executive order banning some foreigners from entering the country.\n\nSome in Mr. Trump’s “inner circle” suggested that Mr. Kalanick was cutting off his access to the White House. Mr. Kalanick might be a little more concerned with all the smartphone users’ dropping their Uber app in favor of Lyft, a competitor that was first to protest Mr. Trump’s immigration policies.\n\nSenate up early for DeVos\n\nIn an unusual early morning session, the Senate on Friday cleared an important procedural hurdle to approving Betsy DeVos, Mr. Trump’s nominee for education secretary, setting up a final, nail-biting confirmation vote next week.\n\nThe Senate’s 52-to-48 vote along party lines to limit further debate on her nomination is deceptive. Two Republican senators, Susan Collins of Maine and Lisa Murkowski of Alaska, went along with the procedural vote, but they say they will oppose her on the final vote, expected on Tuesday.\n\nCallers have overwhelmed the Capitol’s phone system, many of them expressing angry opposition to Ms. DeVos’s nomination. Senators have heard from all manner of educators in their home states opposing her confirmation — and not just teachers’ unions.\n\nPhoto\n\nThe opposition from Ms. Collins and Ms. Murkowski raises the prospects of a 50-to-50 tie that Vice President Mike Pence, as president of the Senate, would have to settle.\n\nAfter convening at 6:30 a.m., one of the earliest starts in recent memory, Senator Chuck Schumer of New York, the Democratic leader, urged his colleagues to take stock of their positions on Ms. DeVos’s nomination over the weekend. ”Sometimes loyalty to a president demands a bit too much,” he said on the floor.\n\nAdvertisement Continue reading the main story\n\nWhy so early? Under Senate rules, a set amount of time had to elapse between the first procedural actions, which took place Wednesday afternoon, and Friday’s vote.\n\nSenators start bipartisan inquiry into Russian election meddling\n\nRemember Russia? The country that intelligence officials believe interfered in the 2016 presidential election on Mr. Trump’s behalf?\n\nTwo weeks into Mr. Trump’s presidency, talk of the foreign power’s apparent role has somewhat faded from view, at least temporarily, in the daily avalanche of White House exploits and misadventures.\n\nBut Capitol Hill will have its say. Two senators are convening an investigation into Russia’s election interference, joining other efforts in Congress to examine what happened.\n\nSenators Lindsey Graham, Republican of South Carolina, and Sheldon Whitehouse, Democrat of Rhode Island, said their investigation would focus on Russian interference both in the United States’ election and in other elections around the world. (Mr. Graham is the chairman and Mr. Whitehouse is the ranking member of a subcommittee of the Senate Judiciary Committee that is focused on crime and terrorism.)\n\n“Our goal is simple,” the senators said in a joint statement. “To the fullest extent possible we want to shine a light on Russian activities to undermine democracy.”\n\nThere are already multiple Senate committee examinations into Russia’s role, as well as an inquiry by the House.\n\nTrump will keep Obama’s White House doctor\n\nDr. Harold N. Bornstein has been President Trump’s personal doctor for more than 35 years. He prescribed Mr. Trump the prostate-related drug that keeps the presidential mane flowing, and declared him the healthiest man to hold the highest office in the land.\n\nAdvertisement Continue reading the main story\n\nBut for now, Mr. Trump will keep the same White House doctor who cared for Barack Obama, Ronny Jackson, a rear admiral in the Navy.\n\nThe decision, first reported by the online medical journal Stat, raised the possibility that voters might actually get some reliable information on the health of their commander in chief.\n\nC.E.O. meeting at White House could be heating up\n\nThe meeting of big-shot chief executives at the White House on Friday — people like Jamie Dimon of JPMorgan Chase and Stephen A. Schwarzman of Blackstone — was supposed to prove the bona fides of the new, business-focused businessman-turned-president.\n\nBut Mr. Trump’s temporary ban on visas from seven predominantly Muslim countries has complicated the discussion considerably.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nTravis Kalanick, Uber’s chief executive, told employees he was dropping off Mr. Trump’s economic advisory council in protest of his immigration policies, given the number of immigrant Uber drivers. Bob Iger of Disney is not attending.\n\nAnd Elon Musk let it be known on Twitter that he would object to the ban to the president’s face.", "authors": ["Jonathan Weisman", "Emmarie Huetteman", "Matt Flegenheimer"], "publish_date": "2017-02-03", "source": "nytimes", "top_words": ["smart", "responds", "trump", "paris", "senate", "president", "trumps", "louvre", "urging", "ms", "massacre", "green", "house", "white", "mr", "attack"], "summary": "Apparently Mr. Trump is unrepentant.\nSome in Mr. Trump’s “inner circle” suggested that Mr. Kalanick was cutting off his access to the White House.\nTrump will keep Obama’s White House doctorDr. Harold N. Bornstein has been President Trump’s personal doctor for more than 35 years.\nHe prescribed Mr. Trump the prostate-related drug that keeps the presidential mane flowing, and declared him the healthiest man to hold the highest office in the land.\nBut Mr. Trump’s temporary ban on visas from seven predominantly Muslim countries has complicated the discussion considerably."}