{"url": "https://www.nytimes.com/2017/02/03/opinion/a-real-and-present-danger-lawyers-protest-against-trump.html?mcubz=0", "id": "188", "title": "‘A Real and Present Danger’: Lawyers Protest Against Trump", "text": "Photo\n\nTo the Editor:\n\nAs a lawyer, I write in response to President Trump’s Muslim travel ban and the retaliatory firing of Acting Attorney General Sally Q. Yates for expressing her legal opinion. These actions by the president warn us that the next four years will present a real and present danger to our Constitution and the rule of law.\n\nThat view is not mine alone, but also that of dozens of former federal judges, prosecutors and defense lawyers who have spoken out against these actions.\n\nIn just the last few days, two letters were circulated by dozens of lawyers, including former high-ranking officials from United States Attorney’s Offices and the Justice Department, renouncing the president’s order as unconstitutional in violation of the First Amendment’s Establishment Clause and the 14th Amendment’s right to equal protection under the law.\n\nIn addition, and more dangerously, President Trump’s scorched-earth dismissal of Ms. Yates for “betraying” her office represents a direct attack on the future independence of the Justice Department.\n\nAdvertisement Continue reading the main story\n\nPresident Trump has now made clear that Justice Department officials will be evaluated not on their ability to defend the Constitution but on their fealty to him. The former United States attorneys’ letter condemning Mr. Trump’s threat to an independent Justice Department calls on remaining high-level department officials to voice their support of Ms. Yates and to express their own reasoned opinions about the unconstitutional and unjust Muslim ban directed by the president.\n\nAs Archibald Cox, the special Watergate prosecutor who was fired by President Richard M. Nixon, previously warned, “Whether ours shall continue to be a government of laws and not of men is now for … the American people” to decide.", "authors": [], "publish_date": "2017-02-03", "source": "nytimes", "top_words": ["unconstitutional", "lawyers", "trump", "real", "present", "officials", "united", "protest", "yates", "trumps", "danger", "justice", "states", "president", "department"], "summary": "PhotoTo the Editor:As a lawyer, I write in response to President Trump’s Muslim travel ban and the retaliatory firing of Acting Attorney General Sally Q. Yates for expressing her legal opinion.\nThese actions by the president warn us that the next four years will present a real and present danger to our Constitution and the rule of law.\nThat view is not mine alone, but also that of dozens of former federal judges, prosecutors and defense lawyers who have spoken out against these actions.\nIn addition, and more dangerously, President Trump’s scorched-earth dismissal of Ms. Yates for “betraying” her office represents a direct attack on the future independence of the Justice Department.\nAdvertisement Continue reading the main storyPresident Trump has now made clear that Justice Department officials will be evaluated not on their ability to defend the Constitution but on their fealty to him."}