{"url": "https://www.nytimes.com/2017/01/30/us/aclu-fund-raising-trump-travel-ban.html?mcubz=0", "id": "136", "title": "Donations to A.C.L.U. and Other Organizations Surge After Trump’s Order", "text": "“Clearly, this executive order has hit a live nerve with the American people,” Mr. Romero said.\n\nThousands of protesters flooded airports across the country and took to the streets as word spread that immigrants and refugees were being blocked from entering the country, detained for hours by customs officials or taken off planes during the weekend, after Mr. Trump signed the executive order at 4:42 p.m. on Friday.\n\nThe order, coming off a campaign promise, suspends the entry of all refugees for 120 days, bars Syrian refugees indefinitely, and prevents citizens of Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen from entering the United States for 90 days.\n\nCritics noted that the order for “extreme vetting” was in effect a ban on Muslims, and did not target countries in which Mr. Trump has had business interests. The move stunned the global community, drawing criticism from business leaders, European heads of state and Christian leaders, though many Trump fans were unfazed.\n\nBesides the A.C.L.U., other groups have seen a rise in donations. The National Immigration Law Center, which joined the A.C.L.U. in a suit on behalf of two Iraqi refugees detained on Saturday, has raised $269,000 since the Trump order was signed, its executive director, Marielena Hincapie, said.\n\nMs. Hincapie said donations had increased “across the board” and were now larger, more frequent and coming from more individual donors than her group had ever seen. A surge of individual donations after the election in November also boosted the law center’s annual budget to $7.5 million from $5.5 million, she added.\n\nFund-raising for her organization was usually “slow and tedious work,” but not anymore, she said.\n\n“Trump’s election completely changed that and set us on a new path and has allowed us to be a stronger and more nimble organization,” Ms. Hincapie said.\n\nAdvertisement Continue reading the main story\n\nHumanitarian groups have seen a boost in donations, as well. Kal Penn, an actor and a former official in the White House Office of Public Engagement under President Barack Obama, started an online fund-raising appeal for the International Rescue Committee, which works in conflict and disaster zones around the world.\n\nMr. Penn said the fund-raising had been inspired by an internet “troll” who told him he didn’t belong in the United States.\n\n“To the dude who said I don’t belong in America, I started a fund-raising page for Syrian refugees in your name,” Mr. Penn wrote on Twitter. That tweet was shared more than 35,000 times, and by Sunday, the site had raised over $390,000.\n\nThe I.R.C. began its own fund-raising effort on Sunday with the goal of bringing in $5 million to help the organization respond to the needs of refugees in the United States. The group said it was the first time it had launched an appeal for people in the United States.\n\nThe fund-raising efforts were promoted by at least one actress during the Screen Actors Guild Awards on Sunday night, Sarah Paulson, who urged people to donate to the A.C.L.U. “to protect the rights and liberties of people across this country.”\n\nMany of the winners, including Julia Louis-Dreyfus of TV’s “Veep” and Mahershala Ali of the film “Moonlight,” used their acceptance speeches to denounce the policies of Mr. Trump.\n\nThe A.C.L.U. sees itself as a leader in the opposition to Mr. Trump’s agenda. It lead the charge on Saturday with the lawsuit in New York that resulted in an emergency ruling by a federal judge blocking the deportation of detainees who had already landed here.\n\nThe court order was the second legal action filed by the group against the Trump administration, which is little more than one week old.\n\nEven before Mr. Trump’s executive order on immigration, the A.C.L.U. had received more than $47 million from 400,000 donors, Mr. Romero said. The organization used the money — the largest surge in donations in its 97 year history, he said — to hire 200 staff members, primarily lawyers.\n\nAdvertisement Continue reading the main story\n\n“That is the Trump Effect,” Mr. Romero said. “Those 400,000 people, who donated to us, I did not go after them; they came to us. In fact, our website crashed we had so many donations, we could not handle it.”", "authors": ["Liam Stack"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["organizations", "trump", "fundraising", "refugees", "united", "trumps", "organization", "aclu", "donations", "million", "order", "mr", "surge"], "summary": "Critics noted that the order for “extreme vetting” was in effect a ban on Muslims, and did not target countries in which Mr. Trump has had business interests.\nin a suit on behalf of two Iraqi refugees detained on Saturday, has raised $269,000 since the Trump order was signed, its executive director, Marielena Hincapie, said.\nA surge of individual donations after the election in November also boosted the law center’s annual budget to $7.5 million from $5.5 million, she added.\nEven before Mr. Trump’s executive order on immigration, the A.C.L.U.\nThe organization used the money — the largest surge in donations in its 97 year history, he said — to hire 200 staff members, primarily lawyers."}