{"url": "https://www.nytimes.com/2017/01/30/upshot/republicans-have-one-big-incentive-to-stick-with-trump.html?mcubz=0", "id": "135", "title": "Republicans Have One Big Incentive to Stick With Trump", "text": "Despite the growing protests against President Trump’s executive action on refugees and other people from seven predominantly Muslim countries, relatively few members of his party have spoken out against the policy — a familiar pattern since the election. To date, no congressional Republicans have consistently resisted Mr. Trump or his agenda even though his approval ratings are already historically low for a new president.\n\nAlthough some Republicans may fear a voter backlash in the midterm election, the greatest threat to re-election for most G.O.P. members of Congress is still a primary challenge. That’s what many legislators probably fear they will get if they oppose Mr. Trump, who is viewed overwhelmingly favorably among their partisan base, according to polling data.\n\nThere have been several Trump policies once opposed by top Republicans that many now support or at least will not actively resist. House Speaker Paul Ryan said in 2015 that a proposed Muslim ban “is not what this party stands for, and more importantly, this is not what this country stands for.” He now backs the current executive order; all seven affected countries have Muslim majorities.\n\nHow Voters View Donald Trump Republican voters have a decidedly positive view of President Trump, giving G.O.P. politicians a strong incentive to back him. Democratic districts Republican districts Favorable Don't know Unfavorable Favorable Don't know Unfavorable Democrats Independents Republicans 15% 5 79 35 8 56 81 3 16 Democrats Independents Republicans 18% 4 78 46 8 46 86 12 In Democratic districts In Republican districts Favorable Unfavorable Favorable Unfavorable Democrats Independents Republicans 15% 79 35 8 56 81 16 Democrats Independents Republicans 18% 78 46 8 46 86 12\n\nBefore Mr. Trump’s move Friday, Republicans went to great lengths to change the subject to avoid commenting on the president. To help deflect questions from reporters last week, Senator Thom Tillis even brandished a puppy. This pattern continued over the weekend. On Saturday, reporters noted that G.O.P. congressional Twitter feeds had gone quiet and that numerous top officials were not answering press inquiries.\n\nAdvertisement Continue reading the main story\n\nWhile many Republicans face risks if they publicly oppose the president, relatively few have to worry about being defeated in a general election. In the House of Representatives, for instance, only a small number of party members represent districts won by Hillary Clinton. For most of them, a primary challenge is a far greater threat — one that several anti-Trump Republicans are already anticipating. Republicans are also heavily insulated from public opinion in 2018 Senate races, which feature only two G.O.P. incumbents who are seen as potentially vulnerable in the general election.", "authors": ["Kyle Dropp", "Brendan Nyhan"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["trump", "gop", "big", "republicans", "election", "democrats", "stick", "unfavorable", "independents", "districts", "president", "favorable", "incentive"], "summary": "To date, no congressional Republicans have consistently resisted Mr. Trump or his agenda even though his approval ratings are already historically low for a new president.\nAlthough some Republicans may fear a voter backlash in the midterm election, the greatest threat to re-election for most G.O.P.\nThere have been several Trump policies once opposed by top Republicans that many now support or at least will not actively resist.\nHow Voters View Donald Trump Republican voters have a decidedly positive view of President Trump, giving G.O.P.\nDemocratic districts Republican districts Favorable Don't know Unfavorable Favorable Don't know Unfavorable Democrats Independents Republicans 15% 5 79 35 8 56 81 3 16 Democrats Independents Republicans 18% 4 78 46 8 46 86 12 In Democratic districts In Republican districts Favorable Unfavorable Favorable Unfavorable Democrats Independents Republicans 15% 79 35 8 56 81 16 Democrats Independents Republicans 18% 78 46 8 46 86 12Before Mr. Trump’s move Friday, Republicans went to great lengths to change the subject to avoid commenting on the president."}