{"url": "https://www.nytimes.com/2017/01/29/opinion/who-hasnt-trump-banned-people-from-places-where-hes-made-money.html?mcubz=0", "id": "110", "title": "Who Hasn’t Trump Banned? People From Places Where He’s Done Business", "text": "President Trump’s executive order banning travel to the United States from seven predominantly Muslim countries is being rightly challenged in the courts for, among other things, its unconstitutional interference with free exercise of religion and denial of due process. Overlooked in the furor is another troubling aspect of the situation: President Trump omitted from his ban a number of other predominantly Muslim nations where his company has done business. This adds further illegitimacy to one of the most arbitrary executive actions in our recent history, and raises significant constitutional questions.\n\nThe seven countries whose citizens are subject to the ban are relatively poor. Some, such as Syria, are torn by civil war; others are only now emerging from war. One thing these countries have in common is that they are places where the Trump organization does little to no business.\n\nBy contrast, other neighboring Muslim countries are not on the list, even though some of their citizens pose just as great a risk — if not greater — of exporting terrorism to the United States. Among them are Saudi Arabia, the United Arab Emirates and Egypt. A vast majority of people living in these countries, like the people living in the seven subject to the immigration ban, are peaceful and law abiding. But these three countries have exported terror to the United States in the past. They accounted for 18 of the 19 terrorists who perpetrated the Sept. 11 attack on American soil (an attack which was directed by another Saudi, Osama Bin Laden, with the assistance of an Egyptian, Ayman al-Zawahri).\n\nThese countries, unlike those subject to the ban, are ones where Donald Trump has done business. In Saudi Arabia, his most recent government financial disclosure revealed several limited liability Trump corporations. In Egypt, he had two Trump companies registered. In the United Arab Emirates, he had licensed his name to a Dubai golf resort and a luxury residential development and spa. Some of these entities have since been closed, and others remain active.\n\nAdvertisement Continue reading the main story\n\nA look at other nations with large Muslim populations only reinforces this troubling pattern. Turkey, India and the Philippines could all pose similar risks as the banned countries of origin that concern the president. Yet Mr. Trump has done business in all three places. They, too, are omitted from his list.\n\nPhoto\n\nOur point is not, of course, that any of these other countries should be added. A country-specific ban, which experts say is an ineffective way to combat terrorism, should not exist. Our government should instead screen all immigrants for potential links to crime or terrorism, as it has long done. Discrimination based on national origin is a thinly veiled attempt to discriminate on the basis of religion. And indeed, President Trump has admitted that he wants to prioritize the settling of Christian refugees.", "authors": ["Richard W. Painter", "Norman L. Eisen"], "publish_date": "2017-01-29", "source": "nytimes", "top_words": ["hes", "seven", "trump", "ban", "subject", "united", "states", "countries", "banned", "terrorism", "president", "muslim", "business", "places"], "summary": "Overlooked in the furor is another troubling aspect of the situation: President Trump omitted from his ban a number of other predominantly Muslim nations where his company has done business.\nThe seven countries whose citizens are subject to the ban are relatively poor.\nOne thing these countries have in common is that they are places where the Trump organization does little to no business.\nThese countries, unlike those subject to the ban, are ones where Donald Trump has done business.\nAnd indeed, President Trump has admitted that he wants to prioritize the settling of Christian refugees."}