{"url": "https://www.nytimes.com/2017/01/29/nyregion/donald-trump-refugee-ban-american-legacy.html?mcubz=0", "id": "106", "title": "Refugee Ban Endangers ‘Part of American Legacy’", "text": "Among those who died that morning was Mohammad Salman Hamdani, 23, born in Pakistan and raised in the United States. He was working in Midtown Manhattan. Having served on ambulance corps and as a police cadet, Mr. Hamdani, a Muslim, rushed to the trade center and became part of the human bridge that led survivors to refuge.\n\n“Trump is doing this in my son’s name,” said Talat Hamdani, the mother of Mr. Hamdani. “That he signed this executive order on the day of Holocaust Remembrance is very poignant. It is a Muslim ban. It is a faith-based ban.”\n\nUnder screening procedures put in place during the administration of President Barack Obama, Syrian refugees went through two years or more of vetting before being permitted into the United States. Mr. Trump had denounced the process as inadequate during the presidential campaign, and said persecuted Christians had “no chance” of coming to the United States. That is untrue. Last year, 37,521 Christian refugees came to the United States, as well as 38,901 Muslim refugees, according to the Pew Research Center.\n\nMany Christian and Catholic leaders have strongly criticized the executive orders. In New York City, Cardinal Timothy M. Dolan, who read from Scripture at Mr. Trump’s inauguration, did not mention them during Sunday Mass. Later, speaking with reporters, he said he had not had time to consult with experts on the implications. “At first blush it causes us some apprehensions,” Cardinal Dolan said.\n\nMsgr. Kevin Sullivan, the executive director of the Catholic Charities of the Archdiocese of New York, one of the leading organizations in refugee resettlement, bluntly called the executive orders “incredibly troubling.” He was concerned, he said, both by the details and the sentiments expressed in them.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“They’re incredibly problematic,” Monsignor Sullivan said. “They move in a direction, and in a tone, and in an attitude, that we think is not the right tone. When we think of immigrants and refugees, we think of opportunities. We think of assets. Some of the tenor of these orders first seemed to think of threats. They first seemed to think of liabilities. No. We see human beings as opportunities, as assets.”\n\nThe United States has had a complex history with refugees during wars, turning away 1,937 refugees, most of them Jewish, fleeing the Nazis aboard the S.S. St. Louis in 1939.\n\nIn 1943, during World War II, Treasury Department officials, including the secretary, Henry Morgenthau Jr., pushed President Franklin D. Roosevelt to find ways to rescue Jews in Europe, who were being exterminated by the Nazis. With Executive Order 9417, Roosevelt created the War Refugee Board. When the war ended, Morgenthau pressured President Harry S. Truman to continue the relief efforts, according to Morgenthau’s son, Robert M. Morgenthau, the former district attorney of Manhattan.\n\nAdvertisement Continue reading the main story\n\nRobert Morgenthau, 97, served in the Navy during the war, seeing combat in the Mediterranean and the Pacific.\n\n“It’s part of the American legacy, to look after refugees,” he said on Sunday. He called the Trump administration policy a “disgrace.”\n\nMr. Morgenthau served on three destroyers. One was hit by a kamikaze attack in the Pacific. A torpedo passed through the bow of another but did not detonate. A third was blown in half near Algiers.\n\n“At one point, we were based in the Brooklyn Navy Yard, and we would come in from the stormy North Atlantic,” Mr. Morgenthau said. “The weather was as big an enemy as the Germans.\n\n“In the quiet of the Narrows, and the bay, you saw the Statue of Liberty,” he continued. “I hate to be overly sentimental. But that really meant something. We’ve lost our way. Let’s hope we can get back on track. I’ve always had confidence in the good judgment of the American people. This whole business, I must say, scares the hell out of me.”", "authors": ["Jim Dwyer", "About New York"], "publish_date": "2017-01-29", "source": "nytimes", "top_words": ["executive", "mr", "ban", "hamdani", "refugee", "think", "united", "states", "war", "legacy", "refugees", "morgenthau", "york", "endangers", "american"], "summary": "Among those who died that morning was Mohammad Salman Hamdani, 23, born in Pakistan and raised in the United States.\n“Trump is doing this in my son’s name,” said Talat Hamdani, the mother of Mr. Hamdani.\nMr. Trump had denounced the process as inadequate during the presidential campaign, and said persecuted Christians had “no chance” of coming to the United States.\nLast year, 37,521 Christian refugees came to the United States, as well as 38,901 Muslim refugees, according to the Pew Research Center.\n“At one point, we were based in the Brooklyn Navy Yard, and we would come in from the stormy North Atlantic,” Mr. Morgenthau said."}