{"url": "https://www.nytimes.com/2017/01/31/travel/expedia-dara-khosrowshahi-lawsuit-against-trump-immigration-ban.html?mcubz=0", "id": "154", "title": "Expedia Supports Lawsuit Against Trump’s Immigration Ban", "text": "In a telephone interview on Tuesday, Mr. Khosrowshahi, who is a member of the board of directors of The New York Times, spoke about the declaration. Edited excerpts are below.\n\nQ. How did Expedia get involved with the lawsuit?\n\nA. The State of Washington let us know on Sunday that the suit was something they were considering and asked for our support. We are generally not aggressive against issues that do not relate to our company, but this is travel, our soul and spirit, and we felt we had to respond. Honestly, it was not a debate whether we should we be involved.\n\nHow will a temporary restraining order against the ban, as requested by the State of Washington, help Expedia?\n\nThe declaration is about helping our employees and the 1,000 or so Expedia travelers who are currently affected by the ban. Internally, the order has raised a fair amount of anxiety among our employees about where they can travel. We are a United States-based company but a global brand, and we have people flying to Asia, Europe and other parts of the world to do their jobs. Also, although we recruit talent from the United States to join Expedia, we also look for talent from around the world, and the ban makes it more difficult to recruit employees from the seven countries that are part of the ban.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nCan you explain what it entails to help the 1,000 Expedia customers who are affected by the ban and what the financial cost is to do so?\n\nWe do not have a financial estimate at this point, but we are trying to help them by contacting them and getting clarity on their situation. If they can’t or don’t want to complete their travel, we help them make alternate plans and incur the costs of those plans. We have seen the travel industry come together on this ban — all of our supply partners have been as flexible as they can be to help those impacted.\n\nOf the seven countries included in the ban, Iran, where you are from, has become a more popular tourist destination for United States citizens in the last year. Given the ban, do you expect that will change?\n\nI think it is bound to have an impact on the Iranian tourism industry. I have not been back to Iran since my family left in 1978, but I have a cousin who recently went with his family, and I can tell you that it is a wonderful place to visit with welcoming people and great food.\n\nAdvertisement Continue reading the main story\n\nExpedia aside, how will the ban hurt the travel industry as a whole?\n\nI think, in general, uncertain times such as terrorist attacks and wars hurt travel, so travel may become more subdued. But, on the other hand, people want to travel and explore different cultures, so it will ultimately come back.\n\nDo you think that the ban will affect international tourism to the United States?\n\nThat certainly is a danger. As the perception of the United States as a welcoming place for all changes among travelers globally, the country’s tourism market, which is a huge revenue generator for the economy, could get hurt.\n\nIn your opinion, will United States passport holders be subject to greater scrutiny as they travel globally?\n\nI think it is tough to tell. Having a United States passport has been an incredible asset, and I hope that will continue to be the case.", "authors": ["Shivani Vora"], "publish_date": "2017-01-31", "source": "nytimes", "top_words": ["travel", "ban", "immigration", "tourism", "think", "united", "trumps", "expedia", "supports", "times", "lawsuit", "states", "york", "help"], "summary": "In a telephone interview on Tuesday, Mr. Khosrowshahi, who is a member of the board of directors of The New York Times, spoke about the declaration.\nHow will a temporary restraining order against the ban, as requested by the State of Washington, help Expedia?\nThe declaration is about helping our employees and the 1,000 or so Expedia travelers who are currently affected by the ban.\nIn your opinion, will United States passport holders be subject to greater scrutiny as they travel globally?\nHaving a United States passport has been an incredible asset, and I hope that will continue to be the case."}