{"url": "http://www.nytimes.com/2017/05/24/us/sally-yates-trump-travel-ban-harvard-law.html?mcubz=0", "id": "1", "title": "Sally Yates Tells Harvard Students Why She Defied Trump", "text": "She was on her way to the airport to catch a flight home to Atlanta on a Friday in January, she said, when she heard news reports that the president had signed an executive order restricting travel from seven predominantly Muslim countries.\n\n“This was the first we had even heard of it,” Ms. Yates said of the ban. Within hours, the Justice Department was going to have to defend the executive order in courts around the country. By Monday, she realized that she had to take a position on the order’s constitutionality.\n\n“I do think it’s illustrative of an unexpected moment where the law and conscience intersected,” she said.\n\nAdvertisement Continue reading the main story\n\nThe Justice Department normally defends presidential action by default, and the department’s Office of Legal Counsel declared the ban legal. But Ms. Yates said that narrow analysis did not consider the president’s own words, which described the ban explicitly in terms of religion. She told Congress this month that she saw no honest argument to make in defense of the ban.\n\nShe said she grappled with whether to resign, as some have argued that she should have done. She told colleagues that quitting would only punt a difficult decision to her successor.\n\n“I believed then, and believe now, that resigning would have protected my personal integrity, but it would not have protected the integrity of the Department of Justice,” she said. The department is not “just another law firm, and this wasn’t just any legal issue.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMs. Yates, speaking on the lawn in front of the law school library, said she had wanted the words in her speech to be “commensurate with the occasion.”\n\nShe said she was mindful that it was the bicentennial of the school’s founding and that for 200 years its graduates — including her former boss, Loretta E. Lynch, attorney general in the Obama administration — had been changing the trajectory of the country and the world.\n\nTaking a risk “means that you have to be willing to be wrong,” she said. “And that can sometimes be a lonely place to be. But I’m hoping that fear of being wrong won’t keep you from acting.”\n\n“Because inaction, doing nothing, or simply going along, that’s a decision, too. and it seems the times in my life that I haven’t acted that’s when I’ve regretted it the most.”\n\nShe advised the graduates not to take the safe course. In what seemed to be a veiled swipe at her former boss, the president, she said: “Doing your job means you are not simply a reflection of someone else’s talents or opinions. You’re the person to whom a leader turns when he or she needs to hear the truth.”\n\nPresident Trump fired Ms. Yates 10 days into his administration after she ordered Justice Department lawyers not to defend his first immigration order suspending entry to the United States for citizens of seven Muslim-majority countries as well as for refugees.\n\nMs. Yates’s order was a remarkable rebuke by a government official of a sitting president and came at the end of a turbulent three days that began with Mr. Trump’s signing of his executive order. The action stranded travelers around the world, led to protests around the country and created alarm inside the bureaucracy.\n\nAdvertisement Continue reading the main story\n\nMs. Yates said her determination in deciding not to defend the order included questions not only about the order’s lawfulness, but also of whether it was a “wise or just” policy.", "authors": ["Anemona Hartocollis"], "publish_date": "2017-05-24", "source": "nytimes", "top_words": ["main", "trump", "defied", "sally", "tells", "harvard", "justice", "department", "ms", "reading", "yates", "order", "president", "students", "law", "legal"], "summary": "“This was the first we had even heard of it,” Ms. Yates said of the ban.\nWithin hours, the Justice Department was going to have to defend the executive order in courts around the country.\n“I do think it’s illustrative of an unexpected moment where the law and conscience intersected,” she said.\nAdvertisement Continue reading the main storyThe Justice Department normally defends presidential action by default, and the department’s Office of Legal Counsel declared the ban legal.\nBut Ms. Yates said that narrow analysis did not consider the president’s own words, which described the ban explicitly in terms of religion."}