{"url": "https://www.nytimes.com/2017/01/31/business/trump-news-media.html?mcubz=0", "id": "151", "title": "In Trump’s Early Days, News Media Finds Competing Narratives", "text": "During his first 11 days in office, President Trump has provided news outlets with plenty of material, at all hours of the morning and night. But his maelstrom of activity — the bold executive orders, the fiery Twitter posts, the brazen speeches — has also exposed, and perhaps exacerbated, ideological differences.\n\nFor those devouring news about the administration, the choice of narratives has become starker, with brighter lines drawn around the content. For the readers and viewers, it’s follow the narrative of your choice, and be wary of the great chasm between.\n\nOver the weekend, as protesters descended on airports across the country in response to Mr. Trump’s immigration ban, fissures began to emerge even among right-wing news organizations. On Monday, the divide only widened. And not everyone behaved predictably.\n\nO’Reilly Tempers His Message\n\nBill O’Reilly, the outspoken Fox News host, expressed skepticism about the rollout of Mr. Trump’s plan and called it “a mistake” to rush it. While he did make some effort to defend Mr. Trump, he was also somewhat moderate in one segment.\n\nPhoto\n\n“It is certainly responsible and logical for a new president to institute updated protections for this country by ordering specific temporary immigration actions,” Mr. O’Reilly said. “However, it’s also responsible for a federal judge to order that foreigners with the proper credentials already issued not be punished. There should be room for case-by-case decision making.”\n\nAdvertisement Continue reading the main story\n\nHe even invoked the Statue of Liberty to make his point.\n\nSome of Mr. O’Reilly’s guests were also critical. Karl Rove said of Mr. Trump that “the controversy is hurting him more than the controversy is helping him.” Brit Hume said it was handled “very clumsily.” And Charles Krauthammer said it was introduced in the “most amateurish, botched way.”", "authors": ["Sydney Ember"], "publish_date": "2017-01-31", "source": "nytimes", "top_words": ["responsible", "narratives", "trump", "early", "days", "finds", "competing", "immigration", "controversy", "oreilly", "trumps", "country", "choice", "media", "president", "mr"], "summary": "During his first 11 days in office, President Trump has provided news outlets with plenty of material, at all hours of the morning and night.\nFor those devouring news about the administration, the choice of narratives has become starker, with brighter lines drawn around the content.\nOver the weekend, as protesters descended on airports across the country in response to Mr. Trump’s immigration ban, fissures began to emerge even among right-wing news organizations.\nO’Reilly Tempers His MessageBill O’Reilly, the outspoken Fox News host, expressed skepticism about the rollout of Mr. Trump’s plan and called it “a mistake” to rush it.\nWhile he did make some effort to defend Mr. Trump, he was also somewhat moderate in one segment."}