{"url": "https://www.nytimes.com/2017/01/30/us/politics/obama-trump-immigration-ban.html?mcubz=0", "id": "145", "title": "Obama, Out of Office 10 Days, Speaks Out Against Immigration Ban", "text": "Mr. Obama’s statement and the articles and letters from his former top advisers were a break with past custom. Outgoing presidents and their staffs usually grant an informal grace period of sorts to a new administration, staying quiet publicly about policy differences.\n\nAffected by Trump’s order? Are you affected by President Trump’s executive order on immigration, or do you know someone who is? If you have information, please contact us at immigration@nytimes.com.\n\nDays before leaving the White House, Mr. Obama told reporters that he would only speak out if he felt the nation’s ideals were under threat.\n\n“I want to be quiet a little bit and not hear myself talk so darn much,” he said at his final news conference on Jan. 18. “But there’s a difference between that normal functioning of politics and certain issues or certain moments where I think our core values may be at stake. I put in that category, if I saw systematic discrimination being ratified in some fashion.”\n\nMr. Obama was still on vacation with his wife in Palm Springs, Calif., on Monday and was not available for an interview, Mr. Lewis said. But after a weekend of watching chaos at airports as green card holders and many others were detained, aides said the former president felt it was vital to express his views.\n\nMr. Obama was also determined, they added, to push back against the argument — made by Mr. Trump’s advisers as they defended the order — that it had been Mr. Obama’s idea to bar entrants from certain predominantly Muslim countries.\n\nMr. Obama’s comments came with a reminder that he had in the past spoken out against the kind of tactics Mr. Trump employed on Friday, when he ordered a temporary halt to admitting people from Iran, Iraq, Libya, Syria, Somalia, Sudan or Yemen and a freeze on the United States refugee program, which he said should give priority to Christians in the future.\n\nAdvertisement Continue reading the main story\n\nAlong with Mr. Obama’s statement, Mr. Lewis appended a section of remarks the former president delivered in November 2015 at a summit in Antalya, Turkey, when he spoke out against a Muslim ban that Mr. Trump, then a candidate for president, had proposed.\n\n“When I hear folks say that, well, maybe we should just admit the Christians but not the Muslims; when I hear political leaders suggesting that there would be a religious test for which a person who’s fleeing from a war-torn country is admitted, when some of those folks themselves come from families who benefited from protection when they were fleeing political persecution — that’s shameful,” Mr. Obama said then. “That’s not American. That’s not who we are. We don’t have religious tests to our compassion.”\n\nMr. Trump and his aides have contended that the immigration order is not a Muslim ban because it does not affect several predominantly Muslim countries. They have also argued that it is similar to actions Mr. Obama took, including a six-month ban on refugees from Iraq he instituted in 2011, and a requirement his administration added in 2015 that travelers from the same seven countries have visas for entering the United States.\n\nBut the 2011 action, which only affected one country, was in response to specific threat information about Iraqis seeking to use the refugee program to enter the United States and carry out terrorist acts. And while it tightened visa requirements for people entering from the seven countries, the Obama administration never sought to bar them.", "authors": ["Julie Hirschfeld Davis"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["thats", "trump", "office", "ban", "days", "immigration", "obamas", "order", "united", "obama", "trumps", "speaks", "president", "muslim", "mr"], "summary": "Mr. Obama’s statement and the articles and letters from his former top advisers were a break with past custom.\nAffected by Trump’s order?\nAre you affected by President Trump’s executive order on immigration, or do you know someone who is?\nDays before leaving the White House, Mr. Obama told reporters that he would only speak out if he felt the nation’s ideals were under threat.\nAnd while it tightened visa requirements for people entering from the seven countries, the Obama administration never sought to bar them."}