{"url": "https://www.nytimes.com/2017/01/29/movies/trump-immigration-oscars-iranian-director-asghar-farhadi.html?mcubz=0", "id": "104", "title": "Iranian Director Asghar Farhadi Won’t Attend Oscar Ceremony", "text": "TEHRAN — The Iranian director Asghar Farhadi, whose film “The Salesman” is nominated for an Academy Award for best foreign-language movie, said on Sunday that he would not attend the Oscars ceremony next month even if he were granted an exception to President Trump’s visa ban for citizens from Iran and several other predominantly Muslim countries.\n\nMr. Farhadi said he had planned to attend the Feb. 26 ceremony in Los Angeles and while there bring attention to a decision he called “unjust.” But the executive order signed by President Trump on Friday presented “ifs and buts which are in no way acceptable to me even if exceptions were to be made for my trip,” he said in a statement to The New York Times.\n\nThe executive order blocked entry into the United States for 90 days for citizens of Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen. It also suspended entry of all refugees for 120 days and barred Syrian refugees indefinitely.\n\nHere is Mr. Farhadi’s statement:\n\nI regret to announce via this statement that I have decided to not attend the Academy Awards Ceremony alongside my fellow members of the cinematic community.\n\nOver the course of the past few days and despite the unjust circumstances which have risen for the immigrants and travelers of several countries to the United States, my decision had remained the same: to attend this ceremony and to express my opinions about these circumstances in the press surrounding the event. I neither had the intention to not attend nor did I want to boycott the event as a show of objection, for I know that many in the American film industry and the Academy of Motion Picture Arts and Sciences are opposed to the fanaticism and extremism which are today taking place more than ever. Just as I had stated to my distributor in the United States on the day the nominees were announced, that I would be attending this ceremony along with my cinematographer, I continued to believe that I would be present at this great cultural event.\n\nHowever, it now seems that the possibility of this presence is being accompanied by ifs and buts which are in no way acceptable to me even if exceptions were to be made for my trip. I would therefore like to convey via this statement what I would have expressed to the press were I to travel to the United States. Hard-liners, despite their nationalities, political arguments and wars, regard and understand the world in very much the same way. In order to understand the world, they have no choice but to regard it via an “us and them” mentality, which they use to create a fearful image of “them” and inflict fear in the people of their own countries.\n\nThis is not just limited to the United States; in my country hardliners are the same. For years on both sides of the ocean, groups of hardliners have tried to present to their people unrealistic and fearful images of various nations and cultures in order to turn their differences into disagreements, their disagreements into enmities and their enmities into fears. Instilling fear in the people is an important tool used to justify extremist and fanatic behavior by narrow-minded individuals.\n\nHowever, I believe that the similarities among the human beings on this earth and its various lands, and among its cultures and its faiths, far outweigh their differences. I believe that the root cause of many of the hostilities among nations in the world today must be searched for in their reciprocal humiliation carried out in its past and no doubt the current humiliation of other nations are the seeds of tomorrow’s hostilities. To humiliate one nation with the pretext of guarding the security of another is not a new phenomenon in history and has always laid the groundwork for the creation of future divide and enmity. I hereby express my condemnation of the unjust conditions forced upon some of my compatriots and the citizens of the other six countries trying to legally enter the United States of America and hope that the current situation will not give rise to further divide between nations.\n\nAsghar Farhadi, Iran", "authors": ["Thomas Erdbrink", "Rachel Donadio"], "publish_date": "2017-01-29", "source": "nytimes", "top_words": ["world", "unjust", "statement", "farhadi", "attend", "iranian", "oscar", "united", "order", "nations", "director", "wont", "states", "ceremony", "asghar", "way"], "summary": "The executive order blocked entry into the United States for 90 days for citizens of Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\nHere is Mr. Farhadi’s statement:I regret to announce via this statement that I have decided to not attend the Academy Awards Ceremony alongside my fellow members of the cinematic community.\nI would therefore like to convey via this statement what I would have expressed to the press were I to travel to the United States.\nHard-liners, despite their nationalities, political arguments and wars, regard and understand the world in very much the same way.\nThis is not just limited to the United States; in my country hardliners are the same."}