{"url": "https://www.nytimes.com/2017/01/31/world/travelers-stranded-abroad.html?mcubz=0", "id": "162", "title": "Unable to Enter U.S., and Still Stranded Abroad", "text": "A 38-year-old Syrian man said that he had been blocked from flying from Abu Dhabi, in the United Arab Emirates, to the United States, where he had a research position lined up at a university in North Dakota. He said Mr. Trump’s order would affect his career.\n\nIn an email to The New York Times, he shared a copy of his United States visa — the word CANCELED was written over it — but asked that his name not be used because he did not want to jeopardize his residency status in the United Arab Emirates.\n\nIn Addis Ababa, Ethiopia, a group of Somali refugees remained at an airport on Tuesday. Ethiopian officials ejected a journalist who tried to speak with them, citing unspecified national security concerns.\n\nThe seven Iranians stuck in Amsterdam were pulled aside on Saturday by United States agents stationed at the airport. They could not leave the airport because they did not have European visas. Mr. Paragomi likened their plight to that of the character played by Tom Hanks in the 2004 film “The Terminal,” about a man stuck at an airport for nearly a year after a coup in his country made it impossible for him to fly back home.\n\nAmong the Iranians stuck there were Esaghi Abolghasem and his wife, Kobra Alizadeh, who had left Iran on the same flight as Mr. Paragomi. They were heading for Washington to visit their daughter, whom they had not seen in five years. “My heart was filled with joy,” Mr. Abolghasem said.\n\nHe was stunned when he heard the news that he could not travel to the United States because of Mr. Trump’s order.\n\n“I thought I would get a heart attack,” Mr. Abolghasem said.\n\nFrom Amsterdam, Mr. Paragomi, the medical student, called his cousin in California, who was fast asleep.\n\nAdvertisement Continue reading the main story\n\n“He didn’t believe it,” Mr. Paragomi recalled. “He thought I had made a mistake with my papers. He said: ‘Such things don’t happen in the United States. Of course you can travel.’”\n\nNobody knew what to do with the stranded Iranians. After hours of wandering through the immense airport, they met at a transfer point. All had cash, as Iranians generally do not possess international credit cards.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“We sat there,” Mr. Abolghasem said. “Nobody did anything.”\n\nAfter a day they started looking for places to showers, but the two airport hotels were expensive. One man in the group went to pray at the airport’s meditation center, where he met an airport official who introduced the group to a Dutch pastor who offered to help.\n\n“It’s a very sad situation,” said the pastor, Nico Sarot. “We should be uniting people. Some are building walls, where we should be tearing them down. I’m trying to help them out with the airlines and with lawyers, and also just to be there to listen to their stories, but there is just not so much we can do.”\n\nNight after night, they slept in the chairs at the airport. “It was cold, we had no blankets,” Mrs. Alizadeh said. “I felt so sad to suddenly be in this situation.”\n\nBut there was hope, too. When they saw on the news that across the United States people had started to gather at airports in protest, they told each other to wait.\n\n“I was hoping there would be people outside of Amsterdam airport too,” Mr. Paragomi said. “We thought if we stick it out, maybe we can travel to the U.S. as well.”\n\nBy the time a federal judge in Brooklyn blocked part of Mr. Trump’s order on Saturday night, other Iranians had already given up and flown back home. But the group of seven decided to stay, hoping to be admitted.\n\n“Dutch immigration officers started coming over, asking what our plans were,” Mr. Paragomi recalled. “Airline representatives spoke to us, warning that if we didn’t go back, our tickets would become invalid.”\n\nAdvertisement Continue reading the main story\n\nOn Monday they were all taken to a business class lounge to have showers. They were given food, too. Lawyers from the United States got in touch with them by WhatsApp and email to help out.\n\nBut by Tuesday afternoon, their resistance had started to crumble. A KLM flight heading for Tehran was leaving, and Mr. Paragomi said on Tuesday morning that he did not know what to do.\n\n“I worked so hard for this,” he said of his research post in Pittsburgh. “If there is a slight chance I can go and study in the U.S., I will stay.”\n\nEventually, Mr. Paragomi and four other Iranians took a plane back to Tehran, while two Iranians stayed behind, having received help from an American lawyer based in the Netherlands.\n\nAs he gathered his belongings for the flight home, Mr. Paragomi asked: “I’m only a student. What did I do wrong?”", "authors": ["Thomas Erdbrink"], "publish_date": "2017-01-31", "source": "nytimes", "top_words": ["airport", "abroad", "unable", "paragomi", "enter", "started", "stranded", "united", "iranians", "abolghasem", "group", "states", "york", "mr"], "summary": "From Amsterdam, Mr. Paragomi, the medical student, called his cousin in California, who was fast asleep.\nAdvertisement Continue reading the main story“He didn’t believe it,” Mr. Paragomi recalled.\nLawyers from the United States got in touch with them by WhatsApp and email to help out.\nA KLM flight heading for Tehran was leaving, and Mr. Paragomi said on Tuesday morning that he did not know what to do.\nAs he gathered his belongings for the flight home, Mr. Paragomi asked: “I’m only a student."}