{"url": "https://www.nytimes.com/2017/02/01/us/politics/donald-trump-islam.html?mcubz=0", "id": "169", "title": "Trump Pushes Dark View of Islam to Center of U.S. Policy-Making", "text": "Those espousing such views present Islam as an inherently hostile ideology whose adherents are enemies of Christianity and Judaism and seek to conquer nonbelievers either by violence or through a sort of stealthy brainwashing.\n\nThe executive order on immigration that Mr. Trump signed on Friday might be viewed as the first major victory for this geopolitical school. And a second action, which would designate the Muslim Brotherhood, the Islamist political movement in the Middle East, as a terrorist organization, is now under discussion at the White House, administration officials say.\n\nPhoto\n\nBeyond the restrictions the order imposed on refugees and visitors from seven predominantly Muslim countries, it declared that the United States should keep out those with “hostile attitudes toward it and its founding principles” and “those who would place violent ideologies over American law,” clearly a reference to Shariah.\n\nRejected by most serious scholars of religion and shunned by Presidents George W. Bush and Barack Obama, this dark view of Islam has nonetheless flourished on the fringes of the American right since before the Sept. 11, 2001, terrorist attacks. With Mr. Trump’s election, it has now moved to the center of American decision-making on security and law, alarming many Muslims.\n\nMr. Trump has insisted that the executive order is not a “Muslim ban,” and his supporters say it is a sensible precaution to safeguard Americans. Asked about the seeming antipathy to Islam that appeared to inform the order, the White House pointed to Mr. Trump’s comments in the August speech and on another occasion that signaled support for reform-minded Muslims. His administration, Mr. Trump said in August, “will be a friend to all moderate Muslim reformers in the Middle East, and will amplify their voice.”\n\nJames Jay Carafano, a security expert at the Heritage Foundation who advised the Trump transition at the Department of Homeland Security and the State Department, said the executive order was simply “trying to get ahead of the threat.” As pressure increases on the Islamic State in Iraq and Syria, he said, “tens of thousands of foreign fighters” will flee. Some could try to reach America, perhaps posing as refugees, he said, so stronger vetting of those entering the country is crucial.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut critics see the order as a clumsy show of toughness against foreign Muslims to impress Mr. Trump’s base, one shaped by advisers with distorted ideas about Islam.\n\nAdvertisement Continue reading the main story\n\n“They’re tapping into the climate of fear and suspicion since 9/11,” said Asma Afsaruddin, a professor of Islamic studies at Indiana University and chairwoman of the Center for the Study of Islam and Democracy. “It’s a master narrative that pits the Muslim world against the West,” appealing to Trump supporters who know nothing of Muslims or Islam beyond news reports of terrorist attacks, she said.\n\nThe executive order, she said, will backfire by reinforcing the jihadist line that the United States is at war with Islam. “The White House is a huge soapbox,” she said. “The demonization of Muslims and Islam will become even more widespread.”\n\nThose in the administration with long records of criticizing Islam begin with Mr. Bannon and Mr. Flynn. Mr. Flynn last February tweeted a link to an anti-Muslim video and wrote, “Fear of Muslims is RATIONAL.” In an interview, he said that “Islam is not necessarily a religion but a political system that has a religious doctrine behind it.”\n\nVideo\n\nMr. Bannon has spoken passionately about the economic and security dangers of immigration and took the lead role in shaping the immigration order. In a 2014 talk to a meeting at the Vatican, he said the “Judeo-Christian West” is at war with Islam.\n\n“There is a major war brewing, a war that’s already global,” he said. “Every day that we refuse to look at this as what it is, and the scale of it, and really the viciousness of it, will be a day where you will rue that we didn’t act.” Elsewhere, on his radio show for Breitbart News, Mr. Bannon said, “Islam is not a religion of peace — Islam is a religion of submission,” and he warned of Muslim influence in Europe: “To be brutally frank, Christianity is dying in Europe and Islam is on the rise.”\n\nOthers with similar views of Islam include Sebastian Gorka, who taught at the National Defense University and is a deputy national security adviser. Mr. Gorka’s wife, Katharine, who headed think tanks that focused on the dangers of Islam, now works at the Department of Homeland Security. Tera Dahl, who was an aide to former Representative Michele Bachmann, Republican of Minnesota, is a National Security Council official. Walid Phares, a Lebanese American Christian who has advised politicians on counterterrorism, advised Mr. Trump’s campaign but does not currently have a government post. All four have written for Breitbart News, the right-wing website previously run by Mr. Bannon.\n\nThey all reflect the hard-line opinions of what some have described as the Islamophobia industry, a network of researchers who have warned for many years of the dangers of Islam and were thrilled by Mr. Trump’s election.\n\nPhoto\n\nThey warn about the danger to American freedoms supposedly posed by Islamic law, and have persuaded several state legislatures to prohibit Shariah’s use. It is a claim that draws eye rolls from most Muslims and scholars of Islam, since Muslims make up about 1 percent of the United States population and are hardly in a position to dictate to the other 99 percent.\n\nAdvertisement Continue reading the main story\n\n“The majority of Muslims don’t interpret the Quran literally,” said Shadi Hamid of the Brookings Institution. “You can have five Muslims who all say we think this is God’s exact words, but they all disagree with each other on what that means in practice.”\n\nAmong the most outspoken of those warning about Islam are Pamela Geller, of Stop Islamization of America, Robert Spencer, of Jihad Watch, and Frank Gaffney Jr., of the Center for Security Policy.\n\nAll three were hosted by Mr. Bannon on his Breitbart radio program before he became chief executive of the Trump campaign in August. Mr. Gaffney appeared at least 34 times. His work has often been cited in speeches by Mr. Flynn. Kellyanne Conway, now counselor to Mr. Trump, did polling for Mr. Gaffney’s center. Last year, the center gave Senator Jeff Sessions, who has warned of the “totalitarian threat” posed by radical Islam and is Mr. Trump’s nominee for attorney general, its annual “Keeper of the Flame” award.", "authors": ["Scott Shane", "Matthew Rosenberg", "Eric Lipton"], "publish_date": "2017-02-01", "source": "nytimes", "top_words": ["executive", "trump", "pushes", "policymaking", "dark", "security", "trumps", "view", "islam", "order", "muslim", "muslims", "mr", "center"], "summary": "The executive order on immigration that Mr. Trump signed on Friday might be viewed as the first major victory for this geopolitical school.\nWith Mr. Trump’s election, it has now moved to the center of American decision-making on security and law, alarming many Muslims.\nMr. Trump has insisted that the executive order is not a “Muslim ban,” and his supporters say it is a sensible precaution to safeguard Americans.\nThe executive order, she said, will backfire by reinforcing the jihadist line that the United States is at war with Islam.\nKellyanne Conway, now counselor to Mr. Trump, did polling for Mr. Gaffney’s center."}