{"url": "https://www.nytimes.com/2017/02/01/opinion/how-populism-stumbles.html?mcubz=0", "id": "164", "title": "How Populism Stumbles", "text": "None of this is to minimize the cruelty involved in narrowing the doorway for refugees. But foreign policy is a realm of cruel choices, and it is not clear that the suffering caused by a narrower gate for refugees is obviously worse than the suffering caused by drone strikes and bombing runs and “kinetic military actions,” all policies that consistently command bipartisan support.\n\nSo why the weekend frenzy, the screaming headlines, the surge of protest? Because of several features inherent to populism, which tend to undermine its attempts to govern no matter the on-paper popularity of its ideas.\n\nFirst, populism finds its voice by pushing against the boundaries of acceptable opinion. But in the process it often embraces bigotries and extremisms that in turn color the reception of its policies.\n\nIn this case, it’s Trump’s original “Muslim ban” forays (and the clash-of-civilizations rhetoric of his inner circle) that has shaped how his freeze has been received. His defenders may protest that most Islamic-majority countries are not affected, that any counterterrorism policy will disproportionately affect Muslims, and that the White House order draws on a list of countries that President Obama targeted for (much more modest) visa restrictions. All of this is true, but still … Donald Trump ran for president calling for a temporary ban on Muslims. Once he crossed that line (and many others), it became inevitable that any move like this would be seen as a second-best path to religious discrimination, and resisted fiercely and understandably on those grounds.\n\nSecond, having campaigned against elites and experts and all their pomps and works, populists imagine that their zeal can carry all before it, that proceduralism and institutional knowledge are for losers and toadies and men with soft hands, and that a few guys in the White House can execute a major overhaul of a delicate system without bureaucratic patience or rhetorical finesse.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThis assumption is deeply mistaken, for reasons evident this weekend — in the chaotic scenes at airports, the spectacle of people already in transit being turned away, the crazy attempt to apply the ban to permanent residents, the absence of obvious carve-outs and exceptions, the failure to get adequate buy-in or advice from cabinet officials, and the blowback from Trump’s political allies as well as his opponents.\n\nAdvertisement Continue reading the main story\n\nThen, finally, because populism thrives on its willingness to shatter norms, it tends to treat this chaos and blowback as a kind of vindication — a sign that it’s on the right track, that its boldness is meeting inevitable resistance from the failed orthodoxies of the past, and so on through a self-comforting litany. That makes it hard for populists to course correct, because they get stuck in a “the worse the better” loop, reassuring themselves that they’re making progress when actually they’re cratering.\n\nMeanwhile, on the other side of the divide, the ascent of populism also creates an unusual level of solidarity among elites, who feel moved to resist on a scale that they wouldn’t if similar policies were pursued by normal political actors. Thus Trump, not even two weeks into his presidency, has already faced unusual pushback from the intelligence community, the Justice Department, the State Department and other regions of the bureaucracy, even as the media-entertainment complex unites against him on a scale unseen even in previous Republican administrations, and the Democratic Party is pressured into scorched-earth opposition before policy negotiations are even joined. These tensions ratcheted up over the weekend; it’s difficult to see how they ratchet down.\n\nThe great fear among Trump-fearers is that he will deal with this elite opposition by effectively crushing it — purging the deep state, taming the media, remaking the judiciary as his pawn, and routing or co-opting the Democrats. This is the scenario where a surging populism, its progress balked through normal channels, turns authoritarian and dictatorial, ending in the sort of American Putinism that David Frum describes darkly in the latest issue of The Atlantic.\n\nBut nothing about Trumpian populism to date suggests that it has either the political skill or the popularity required to grind its opposition down. In which case, instead of Putin, the more relevant case study might be former President Mohamed Morsi of Egypt, the Muslim Brotherhood leader whose brief tenure was defined both by chronic self-sabotage and by the active resistance of the Egyptian bureaucracy and intelligentsia, which rendered governance effectively impossible.\n\nThe Egyptian deep state’s sabotage of Morsi culminated in a coup. This is not my prediction for the Trump era. But what we’ve watched unfold with refugee policy suggests that chaos and incompetence are much more likely to define this administration than any kind of ruthless strength.", "authors": ["Ross Douthat"], "publish_date": "2017-02-01", "source": "nytimes", "top_words": ["case", "weekend", "trump", "political", "ban", "populism", "sign", "opposition", "president", "policy", "stumbles"], "summary": "Because of several features inherent to populism, which tend to undermine its attempts to govern no matter the on-paper popularity of its ideas.\nFirst, populism finds its voice by pushing against the boundaries of acceptable opinion.\nBut in the process it often embraces bigotries and extremisms that in turn color the reception of its policies.\nAll of this is true, but still … Donald Trump ran for president calling for a temporary ban on Muslims.\nBut nothing about Trumpian populism to date suggests that it has either the political skill or the popularity required to grind its opposition down."}