{"url": "https://www.nytimes.com/2017/01/31/world/middleeast/trump-immigration-ban-children.html?mcubz=0", "id": "161", "title": "Trump’s Immigration Ban Blocks Children Most in Need of Aid", "text": "Photo\n\nThe children around the world who need emergency international assistance the most come mainly from the countries singled out in President Trump’s order barring entry to the United States, according to a United Nations assessment.\n\nFive of the seven countries where children are most imperiled are on Mr. Trump’s list of nations where visas are suspended: Iraq, Somalia, Sudan, Syria and Yemen.\n\nThe children most at risk are Syrian, whether they have fled as refugees or are still in their country, according to Unicef, the United Nations’ children’s agency. All Syrians have been barred indefinitely from entering the United States under Mr. Trump’s executive order.\n\nOther countries where Unicef says children are imperiled include the Democratic Republic of Congo, Ethiopia, Nigeria and South Sudan. They are not part of Mr. Trump’s temporary ban on visas — though the order also bars all refugees, regardless of where they come from, for 120 days.\n\n“This shows who the ban really impacts: the world’s most vulnerable, women and children who are fleeing terror,” said Jennifer Sime, a senior vice president at the International Rescue Committee, a humanitarian organization focused on refugees. “America is turning away from its leadership role on refugee resettlement, and it is refugees who are paying the price.”\n\nAdvertisement Continue reading the main story\n\nThe United Nations compiled the assessment weeks before Mr. Trump signed the executive order and published it on Tuesday.", "authors": ["Russell Goldman"], "publish_date": "2017-01-31", "source": "nytimes", "top_words": ["blocks", "aid", "unicef", "ban", "visas", "immigration", "order", "united", "nations", "trumps", "need", "countries", "children", "refugees", "mr"], "summary": "PhotoThe children around the world who need emergency international assistance the most come mainly from the countries singled out in President Trump’s order barring entry to the United States, according to a United Nations assessment.\nFive of the seven countries where children are most imperiled are on Mr. Trump’s list of nations where visas are suspended: Iraq, Somalia, Sudan, Syria and Yemen.\nAll Syrians have been barred indefinitely from entering the United States under Mr. Trump’s executive order.\nOther countries where Unicef says children are imperiled include the Democratic Republic of Congo, Ethiopia, Nigeria and South Sudan.\nThey are not part of Mr. Trump’s temporary ban on visas — though the order also bars all refugees, regardless of where they come from, for 120 days."}