{"url": "https://www.nytimes.com/2017/01/29/us/politics/trump-immigration-refugee-order.html?mcubz=0", "id": "119", "title": "Rulings on Trump’s Immigration Order Are First Step on a Long Legal Path", "text": "In a statement issued early Sunday, the Department of Homeland Security said it would comply with the court orders. But the department added that little had changed.\n\n“The president’s executive orders remain in place — prohibited travel will remain prohibited, and the U.S. government retains its right to revoke visas at any time if required for national security or public safety,” the statement said. “No foreign national in a foreign land, without ties to the United States, has any unfettered right to demand entry into the United States or to demand immigration benefits in the United States.”\n\nThe four cases — in Boston, Brooklyn, Seattle and Alexandria, Va. — will move forward in the coming weeks, with briefs and hearings over whether to make the bans on removing the travelers more permanent. At the same time, the Trump administration may appeal the orders to federal appellate courts.\n\nDavid Cole, the A.C.L.U.’s legal director, said the order from Judge Ann M. Donnelly of the Federal District Court in Brooklyn, which issued a nationwide injunction, was an important first step.\n\n“Making it stick will require both making sure that it’s being followed at borders around the country and upholding it on appeal,” he said.\n\nWhile the government has released some plaintiffs in the four cases, others are being held while the cases move forward.\n\nOn Sunday, there were widespread reports that government officials at airports were not complying with aspects of the orders. That may have been a product of confusion and miscommunication, but some feared it was an early sign of a potential constitutional showdown.\n\nAdvertisement Continue reading the main story\n\n“The scariest scenario,” said Peter J. Spiro, a law professor at Temple University, “is one in which the Department of Homeland Security simply ignores the court orders. That would have been close to unimaginable in prior administrations. In this one, unfortunately, it would almost be unsurprising.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe New York attorney general, Eric T. Schneiderman, sent a letter to federal officials Sunday demanding information about those held at John F. Kennedy International Airport after receiving what he called “alarming reports” that the federal government was planning to violate the court order.\n\nIn an interview, Mr. Schneiderman said that the executive order was unconstitutional and that he and other attorneys general were exploring the possibility of legal action. “There may be grounds for a claim that this does damage to a state, if they’re damaging our state institutions” like universities and hospitals, he said.\n\nThe president has broad power to control immigration. A federal law allows him to “suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants” if he determines that their entry “would be detrimental to the interests of the United States.”\n\nBut another law appears to limit that power, saying that “no person shall receive any preference or priority or be discriminated against in the issuance of an immigrant visa because of the person’s race, sex, nationality, place of birth or place of residence.”\n\nSaturday’s court orders, issued in haste, contained little reasoning. Judge Donnelly, in Brooklyn, wrote that there was a strong likelihood that the two plaintiffs in the case, who seek to represent a class of refugees, visa holders and others, could establish that their removal would violate the Constitution’s due process and equal protection guarantees.\n\nBased on that conclusion and the “irreparable injury” the plaintiffs would suffer, Judge Donnelly issued a temporary nationwide injunction barring their removal. She did not order their release.\n\nThe order in Boston, from Judge Allison D. Burroughs of the Federal District Court there, was in one sense broader and in another narrower. It limited border screening practices to those in place before Mr. Trump’s executive order, and it barred not only removal but also detention. But it seemed to be limited to people arriving or held at Logan International Airport there.\n\nThe order from Judge Leonie M. Brinkema of the Federal District Court in Alexandria applied only to legal permanent residents being held at Dulles International Airport. The order in Seattle, from Judge Thomas S. Zilly of the Federal District Court there, applied to two plaintiffs.\n\nAdvertisement Continue reading the main story\n\nIt is possible that one of the four cases will definitively resolve an important aspect of the legality of Mr. Trump’s order. But the cases were filed very quickly, and civil rights litigators generally like to locate ideal plaintiffs and hone their legal theories before filing test cases that could turn into legal landmarks.\n\nThe Brooklyn case, for instance, did not make a claim based on the First Amendment’s prohibition of government establishment of religion, though some lawyers said that was the executive order’s central flaw.\n\n“The smoking gun they put in the executive order is the idea that they would grant exceptions for minority religions,” Mr. Romero said. Mr. Trump has said that was meant to favor Christians over Muslims.\n\nBut opening such a challenge requires preparation, Mr. Cole said.\n\n“The one thing you can’t do under the establishment clause is denomination favoritism,” he said. “That’s a very promising claim, but it requires the right plaintiff.”", "authors": ["Adam Liptak"], "publish_date": "2017-01-29", "source": "nytimes", "top_words": ["long", "executive", "rulings", "path", "orders", "cases", "immigration", "judge", "court", "united", "trumps", "step", "federal", "order", "mr", "legal"], "summary": "In a statement issued early Sunday, the Department of Homeland Security said it would comply with the court orders.\nDavid Cole, the A.C.L.U.’s legal director, said the order from Judge Ann M. Donnelly of the Federal District Court in Brooklyn, which issued a nationwide injunction, was an important first step.\nIn an interview, Mr. Schneiderman said that the executive order was unconstitutional and that he and other attorneys general were exploring the possibility of legal action.\nIt limited border screening practices to those in place before Mr. Trump’s executive order, and it barred not only removal but also detention.\n“The smoking gun they put in the executive order is the idea that they would grant exceptions for minority religions,” Mr. Romero said."}