{"url": "https://www.nytimes.com/2017/02/04/us/james-robart-judge-trump-ban-seattle.html?mcubz=0", "id": "198", "title": "‘So-Called’ Judge Criticized by Trump Is Known as a Mainstream Republican", "text": "“The cream rises to the top,” Mr. McKay said.\n\nJenny A. Durkan, another former United States attorney, who served during the Obama administration, described Judge Robart as “a very strict federal judge who believes in the rule of law.”\n\n“I think he truly believes in the independence of the judiciary, to the marrow of his bones,” she said.\n\nShe added that Judge Robart, who earned his law degree at Georgetown University, needed to be seen in the context of the moderate Republican traditions of the Pacific Northwest.\n\nOne of Judge Robart’s highest-profile cases in recent years has been his oversight of a federal decree that requires the Seattle Police Department to address allegations of excessive force and bias. During an oversight hearing last year, he cited the high number of deaths of African-Americans in officer-involved shootings. “Black lives matter,” the judge told the courtroom emphatically.\n\nMr. McKay and Ms. Durkan were the leaders of a bipartisan selection committee that vetted Mr. Robart and recommended to the Bush administration in 2003 that he be appointed. He was confirmed the next year in the Senate by a vote of 99 to 0.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe vetting committee, which includes an equal number of Republicans and Democrats, is peculiar to Washington State and was set up in the mid-1990s, when President Bill Clinton was in the White House and Congress was under Republican control.\n\nAdvertisement Continue reading the main story\n\nThe Washington senators at the time — Patty Murray, a Democrat, and Slade Gorton, a Republican — established the committee as a bipartisan compromise.\n\n“We could essentially live with any of the names put forward,” Mr. Gorton, who retired from the Senate in 2001, said in an interview on Saturday. “Both Patty Murray and I felt that we were getting good judges. We weren’t getting judges who were personal enemies or who were personally obnoxious to us.”\n\nThe system has worked well for two decades, he said, but he added that he was “not sure” whether it would continue under Mr. Trump.\n\nMr. Robart was one of Seattle’s leading trial lawyers and the head of the law firm Lane Powell when he was selected to join the federal bench. While in private practice, he was admitted to the American College of Trial Lawyers, a prestigious, invitation-only group known for its rigorous vetting.\n\n“He was a person who valued the opinions of his colleagues,” said Chuck Riley, the current head of Lane Powell, who worked with Judge Robart there for more than a decade. “He had an open door.”\n\nDuring Senate confirmation proceedings, Mr. Robart was praised for his “exceptional qualifications” by Senator Orrin G. Hatch, Republican of Utah, then the chairman of the Senate Judiciary Committee.\n\n“He brings a wealth of trial experience to the federal bench,” said Mr. Hatch, who added that Mr. Robart had helped represent “the disadvantaged” and had helped Southeast Asian refugees.", "authors": ["Thomas Fuller"], "publish_date": "2017-02-04", "source": "nytimes", "top_words": ["socalled", "republican", "known", "added", "trump", "judge", "criticized", "mainstream", "committee", "federal", "trial", "senate", "robart", "mr", "continue"], "summary": "Jenny A. Durkan, another former United States attorney, who served during the Obama administration, described Judge Robart as “a very strict federal judge who believes in the rule of law.”“I think he truly believes in the independence of the judiciary, to the marrow of his bones,” she said.\nShe added that Judge Robart, who earned his law degree at Georgetown University, needed to be seen in the context of the moderate Republican traditions of the Pacific Northwest.\nMr. McKay and Ms. Durkan were the leaders of a bipartisan selection committee that vetted Mr. Robart and recommended to the Bush administration in 2003 that he be appointed.\n“He was a person who valued the opinions of his colleagues,” said Chuck Riley, the current head of Lane Powell, who worked with Judge Robart there for more than a decade.\n“He had an open door.”During Senate confirmation proceedings, Mr. Robart was praised for his “exceptional qualifications” by Senator Orrin G. Hatch, Republican of Utah, then the chairman of the Senate Judiciary Committee."}