{"url": "https://www.nytimes.com/2017/01/29/opinion/the-outcry-over-trumps-refugee-ban.html?mcubz=0", "id": "109", "title": "The Outcry Over Trump’s Refugee Ban", "text": "Photo\n\nTo the Editor:\n\nRe “Judge Blocks Trump Order on Refugees” (front page, Jan. 29):\n\nAlbert Einstein. Elie Wiesel. Madeleine Albright. Sergey Brin. Vladimir Nabokov. Wyclef Jean. These refugees have enriched America through their contributions to science, culture, politics, business and the arts. Every day, refugees and their families make America a better place.\n\nOn Friday, International Holocaust Remembrance Day, the most powerful country in the world shut its doors to those most in need. Through our cruelty and barbaric ignorance, we condemn innocent people to horror, persecution and, in many cases, certain death. In doing so, we betray our ideals and make America a less safe, less wealthy and less compassionate nation.\n\nWe rob ourselves not only of their contributions, but also of our own humanity.\n\nJASON HOCHMAN\n\nNew York\n\nTo the Editor:\n\nI may have been born in the United States but this country has become foreign to me. This land is not my land. I no longer share its beliefs, I do not countenance its actions, I do not even recognize its methods.\n\nI am not an American, not this America.\n\nThe country I lived in did not treat human beings with such utter contempt, did not display a depraved indifference to others’ welfare, did not inflict such needless pain and suffering.\n\nAdvertisement Continue reading the main story\n\nThere are no words that can fully describe my alienation from the unconscionable mandate that now brands millions of people as unworthy of entry upon our shores. The very heart of this nation is being torn out.", "authors": [], "publish_date": "2017-01-29", "source": "nytimes", "top_words": ["america", "world", "day", "ban", "contributions", "refugee", "trumps", "outcry", "country", "wyclef", "words", "refugees", "yorkto", "land"], "summary": "These refugees have enriched America through their contributions to science, culture, politics, business and the arts.\nEvery day, refugees and their families make America a better place.\nOn Friday, International Holocaust Remembrance Day, the most powerful country in the world shut its doors to those most in need.\nIn doing so, we betray our ideals and make America a less safe, less wealthy and less compassionate nation.\nJASON HOCHMANNew YorkTo the Editor:I may have been born in the United States but this country has become foreign to me."}