{"url": "https://www.nytimes.com/2017/01/30/us/immigration-ban-locations.html?mcubz=0", "id": "138", "title": "Where Immigrants From Banned Nations Live in the U.S.", "text": "Country of Origin: Somalia. Location: Minneapolis area.\n\nNaima Ali, a Somali-American caseworker, folds up her hijab to look like a hat while driving with her young daughter. “I don’t want to be harassed,” she said.\n\nResidents of the Cedar-Riverside neighborhood here, at the center of a Somali-American diaspora, have long battled public mistrust as their youth have been targeted by the Shabab and then ISIS, insisting that the actions of a few do not represent many. There were 24,476 foreign-born Somalis in the Minneapolis metro area in 2015, according to census figures.\n\nThe Somali-Americans here claimed a major victory this month when one of their own, Ilhan Omar, took office as a state representative, becoming the nation’s first Somali-American legislator. But the political landscape under President Trump has them feeling threatened anew, they say, bringing more than 1,000 people to a rally on Sunday led by Ms. Omar at the Brian Coyle Center to protest the president’s travel ban.\n\nAffected by Trump’s order? Are you affected by President Trump’s executive order on immigration, or do you know someone who is? If you have information, please contact us at immigration@nytimes.com.\n\n“It’s been traumatizing,” said Amano Dube, director of the bustling community center, where discarded protest signs were stacked on Monday behind the front desk.\n\nTwo 6-year-old girls — one in a pink hijab, the other in a purple hijab — laughed as they jumped rope side by side in the gym that housed the Trump protest. The community center provides a variety of programming, including tutoring, after-school care, diabetes workshops, college-prep training and a food pantry.\n\nAdvertisement Continue reading the main story\n\n“It’s like home,” said Ms. Ali, 31. Families are desperately seeking support under the new president, said Ms. Ali, whose cousin lives in Minnesota with two young children, now separated from her husband in Somalia. “Families are being ripped apart. It’s heartbreaking.”\n\nChristina Capecchi\n\n_____\n\nCountry of Origin: Iraq. Location: San Diego area.\n\nIn El Cajon, a city about 15 miles east of downtown San Diego, local businesses offer an efficient overview of how the community has changed since becoming an Iraqi refugee hub. Liquor stores, markets and barber shops with Arabic letters have sprouted around the Starbucks, gun shops and car dealerships.\n\nIn the San Diego area, there were 27,827 immigrants born in Iraq, according to census figures, which are among the highest concentrations in the country. Most are in the eastern part of the county, and the vast majority are Chaldean, a type of Christian. Many of them resettled in and around inland El Cajon, because San Diego’s high cost of living makes it difficult for them to live in pricier coastal neighborhoods.\n\nMany arrived during the Iraq War, and another wave came as ISIS persecuted Christians in Iraq.\n\nIn November, part of the city, along with much of San Diego’s inland, rural and conservative East County, voted for Mr. Trump. A cluster in the center of El Cajon voted for Mrs. Clinton.\n\nChaldeans were not among them. They tended to support Mr. Trump, said Noori Barka, a businessman who moved to San Diego from Iraq in the 1980s. Mr. Barka, a community leader who runs a Chaldean-language news outlet and heads a Chaldean-focused nongovernmental organization, said that Chaldeans felt neglected by President Barack Obama’s response to the humanitarian crisis caused by ISIS. They wished more refugee spots had been allotted to Christians, he said.\n\nMr. Barka, who owns a biotechnology firm that employs 45 people, supports Mr. Trump’s temporary ban on refugees.\n\n“I think it’s a good idea to stop the program and look at it more carefully,” he said.\n\nThe ban on visas, however, will hurt businesses, he said. He was supposed to meet with a distributor from the Middle East who will no longer be able to come.\n\n“I hope our president understands, because he’s a businessman, that we cannot stop doing business,” Mr. Barka said.\n\nAdvertisement Continue reading the main story\n\nRoxana Popescu\n\n_____", "authors": ["The New York Times"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["live", "trump", "san", "immigrants", "community", "iraq", "barka", "trumps", "diego", "banned", "nations", "president", "mr", "center"], "summary": "Are you affected by President Trump’s executive order on immigration, or do you know someone who is?\n“It’s been traumatizing,” said Amano Dube, director of the bustling community center, where discarded protest signs were stacked on Monday behind the front desk.\nThe community center provides a variety of programming, including tutoring, after-school care, diabetes workshops, college-prep training and a food pantry.\nIn the San Diego area, there were 27,827 immigrants born in Iraq, according to census figures, which are among the highest concentrations in the country.\nMr. Barka, who owns a biotechnology firm that employs 45 people, supports Mr. Trump’s temporary ban on refugees."}