{"url": "https://www.nytimes.com/2017/02/04/sports/football/donald-trump-ban-shahid-khan-jaguars.html?mcubz=0", "id": "197", "title": "Jaguars Owner Shahid Khan Opposes Trump’s Immigration Ban", "text": "Photo\n\nHOUSTON — Commissioner Roger Goodell of the N.F.L. declined to take a public stance last week on President Trump’s executive order temporarily banning visits by citizens from seven predominantly Muslim countries, even as leaders in the N.B.A. spoke out against the order.\n\nBut the owner Shahid Khan of the Jacksonville Jaguars made it clear Saturday that he was opposed to the ban and said he had been heartened on Friday when a federal judge in Seattle temporarily blocked the president’s immigration order.\n\n“The bedrock of this country are immigration and really a great separation between church and state,” Mr. Khan, 66, said in Houston, the site of Sunday’s Super Bowl.\n\n“Even for the country, it’s not good,” he added, explaining that he thought the order could deny entry to some of “the tens of thousands of people who can contribute to the making of America.”\n\nAdvertisement Continue reading the main story\n\nThe only Muslim among the principal owners of N.F.L. teams, Mr. Khan came to the United States from Pakistan in 1967, earned a degree in engineering and went on to own Flex-N-Gate, a multibillion-dollar car parts business. He became a United States citizen decades ago.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Sports Newsletter Get the big sports news, highlights and analysis from Times journalists, with distinctive takes on games and some behind-the-scenes surprises, delivered to your inbox every week. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Khan said it was “kind of a sobering time for somebody like me,” in part because he had expected Mr. Trump to moderate his views on immigrants and Muslims once in office. But Mr. Khan said he hoped the courts would provide a bulwark against the president’s actions against immigrants.", "authors": ["Ken Belson"], "publish_date": "2017-02-04", "source": "nytimes", "top_words": ["ban", "temporarily", "immigration", "owner", "week", "united", "trumps", "states", "times", "opposes", "sign", "reading", "shahid", "jaguars", "york", "mr", "khan"], "summary": "“The bedrock of this country are immigration and really a great separation between church and state,” Mr. Khan, 66, said in Houston, the site of Sunday’s Super Bowl.\nteams, Mr. Khan came to the United States from Pakistan in 1967, earned a degree in engineering and went on to own Flex-N-Gate, a multibillion-dollar car parts business.\nHe became a United States citizen decades ago.\nMr. Khan said it was “kind of a sobering time for somebody like me,” in part because he had expected Mr. Trump to moderate his views on immigrants and Muslims once in office.\nBut Mr. Khan said he hoped the courts would provide a bulwark against the president’s actions against immigrants."}