{"url": "https://www.nytimes.com/2017/02/01/travel/trump-travel-ban-opposition-tourism-executives.html?mcubz=0", "id": "165", "title": "Trump’s Travel Ban Draws Growing Opposition From Tourism Executives", "text": "Of the seven nations singled out by the executive order, only Iran drew significant interest on the part of leisure travelers. Among North American travelers, trips to Iran with Intrepid Travel had grown 35 percent in the past year, on pace with Iceland, Japan and Sri Lanka, three other trending destinations. Cox & Kings said it had doubled its traffic to Iran in the past 12 months. Wilderness Travel went from offering one itinerary in 2016 to three in 2017. The founder of Abercrombie & Kent, Geoffrey Kent, singled out Iran as a top destination in 2017.\n\nThese and other operators say previously announced trips will run. They have taken a wait-and-see position regarding whether Iran will retaliate with its own travel ban, as its government has suggested.\n\n“Our customers are very adventurous and want to travel, so probably there would be a shift in travel rather than canceling and staying home for a year,” said Warren Chang, the chief operating officer of Cox & Kings.\n\nGetting into Iran requires a visa that travelers can apply for no sooner than 90 days before their trip, said Annie Lucas, vice president of Mir Corporation, a tour operator based in Seattle that has been guiding trips in Iran for close to 20 years.\n\n“You can’t get one a year in advance,” Ms. Lucas said. “There’s a timeline. That’s what calls it all into question. There are a lot of people waiting for approvals.”\n\nThe presidential directive set a 90-day deadline to review the United States’ procedures for vetting travelers from the seven countries.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“I’m hoping if the Iranians retaliate it will be three months on their side,” said Steve Kulay, who runs Iran Luxury Travel in North Carolina. “I’m not optimistic. They don’t like being pushed around.”\n\nSmarTours, based in New York, had just begun selling its first trips to Iran in January and still plans to run that first group departure in July, with monthly departures thereafter.\n\nAdvertisement Continue reading the main story\n\n“There’s an element of Iran as the new Cuba, with a few twists,” said Greg Geronemus, a chief executive of SmarTours. He said the company booked more trips since the president’s order than accepted cancellations.\n\n“I get a sense of a spirit of resolve and defiance among those booking these trips,” he said. “I think it’s one of the ways they’re saying they disagree with the policy.”\n\nFrank Rosemond, 80, of San Francisco, said he did not plan to alter his booking with SmarTours to visit Iran in October. He said he was excited to see the ancient ruins of Persepolis and the beautifully tiled mosques of Isfahan.\n\n“We understand the people are friendly, and once again it’s government to government that’s the problem,” Mr. Rosemond said.\n\nWhether Americans venture to Iran or elsewhere, some experts think the order will have a chilling effect on travel in general.\n\n“It just contributes to a sense of unease,” said Jason Clampet, the editor in chief of the travel news website Skift.com. “Not knowing what the government might do means people will make a safe choice, if they make a decision at all. The flip side is most Americans with summer vacations do them domestically.”\n\nInbound tourism, already challenged by weak exchange rates against the dollar, is another question. Based in England, the agency Responsible Travel said it had experienced a 57 percent decrease in revenue from trips to the United States over the past year and put the country on its “not hot” list for 2017.\n\n“The U.S. was already positioned to have a poor year because of the strength of the dollar,” said Mr. Clampet, “and this contributes to another reason not to go.”", "authors": ["Elaine Glusac"], "publish_date": "2017-02-01", "source": "nytimes", "top_words": ["iran", "travel", "ban", "growing", "travelers", "united", "trumps", "trips", "chief", "draws", "based", "opposition", "order", "york", "tourism", "executives", "past"], "summary": "Of the seven nations singled out by the executive order, only Iran drew significant interest on the part of leisure travelers.\nAmong North American travelers, trips to Iran with Intrepid Travel had grown 35 percent in the past year, on pace with Iceland, Japan and Sri Lanka, three other trending destinations.\nThey have taken a wait-and-see position regarding whether Iran will retaliate with its own travel ban, as its government has suggested.\nWhether Americans venture to Iran or elsewhere, some experts think the order will have a chilling effect on travel in general.\n“It just contributes to a sense of unease,” said Jason Clampet, the editor in chief of the travel news website Skift.com."}