{"url": "https://www.nytimes.com/2017/02/21/books/22pen-america-letter-to-donald-trump-visa-ban.html?mcubz=0", "id": "275", "title": "In Open Letter, 65 Writers and Artists Urge Trump to Reconsider Visa Ban", "text": "The letter noted how the original visa ban last month had disrupted cultural life. The Iranian director Asghar Farhadi, whose film “The Salesman” is up for a foreign-language Academy Award, said he would not attend this weekend’s Oscars ceremony. It said the Syrian singer Omar Souleyman might not be able to perform in New York in May, and it was unclear whether the Paris-based Syrian poet Adonis, who is 87, would be able to attend PEN’s World Voices Festival in New York in May. That literary festival was founded by Salman Rushdie to foster literary conversation across borders and promote free expression.\n\nGeorge Packer, the author and staff writer for The New Yorker, said he was under no illusions about the efficacy of signing his name to a letter like this. “I don’t expect it to change any minds at the top of the Trump administration, but perhaps it will give heart to officials lower down, and to foreigners who wonder if America is losing what makes it great,” he said.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“I’ve had enough refugees from banned countries staying in my own house to know that they’re exactly the kind of people we should welcome,” Mr. Packer added. “America’s openness to foreigners has earned us affection and respect around the world even in dark times. Why throw it away?”\n\nThe novelist Rick Moody said he hoped the letter would help in “keeping the resistance alive.” “Or, ideally,” he added, “budging the needle on policy a bit.” And the writer Susan Orlean echoed that sentiment: “I think this is the time to be noisy — to be loud about disagreeing when it comes to matters of essential unfairness.”\n\nThe cartoonist Jules Feiffer said he had signed the letter because at 88, “I’m too old to march.” He said he was keeping his spirits up. “Doctors say that enlisting in a fight over the life or death of this American nation affects the spirit like a miracle drug. I have never been more hopeful.”\n\nAnd though the novelist Jeffrey Eugenides said he was quite sure that sending this letter was akin to “shouting into a void,” something he’s used to as a fiction writer, he was still hopeful. “I’ve also been surprised, in the past, at how often the void shouts back,” he said.\n\nHere’s the letter:", "authors": ["Rachel Donadio"], "publish_date": "2017-02-21", "source": "nytimes", "top_words": ["syrian", "65", "writers", "reconsider", "urge", "trump", "world", "ban", "void", "packer", "writer", "novelist", "times", "sign", "open", "york", "artists", "visa", "letter"], "summary": "The letter noted how the original visa ban last month had disrupted cultural life.\nThat literary festival was founded by Salman Rushdie to foster literary conversation across borders and promote free expression.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\nView all New York Times newsletters.\n“America’s openness to foreigners has earned us affection and respect around the world even in dark times."}