{"url": "https://www.nytimes.com/2017/02/07/us/politics/trump-immigration-ban-hearing-appeal.html?mcubz=0", "id": "224", "title": "Appeals Court Panel Appears Skeptical of Trump’s Travel Ban", "text": "“This is a traditional national security judgment that is assigned to the political branches,” Mr. Flentje said.\n\n“Are you arguing, then, that the president’s decision in that regard is unreviewable?” Judge Michelle T. Friedland asked a few minutes later.\n\nMr. Flentje paused. Then he said yes.\n\n“There are obviously constitutional limitations, but we’re discussing the risk assessment,” he said.\n\nJudge Friedland asked what those limitations were, and Mr. Flentje did not provide a direct answer.\n\nSeveral courts around the nation have blocked aspects of Mr. Trump’s order, but the broadest ruling was the one at issue in Tuesday’s arguments in front of the Ninth Circuit. The panel was considering an earlier ruling by Judge James L. Robart of the Federal District Court in Seattle, which allowed previously barred travelers and immigrants to enter the country.\n\nJudge William C. Canby Jr., appointed by President Jimmy Carter, asked Mr. Flentje a hypothetical question meant to probe the limits of his position. “Could the president simply say in the order, ‘We’re not going to let any Muslims in?’”\n\nMr. Flentje said the two states that have sued over Mr. Trump’s executive order, Washington and Minnesota, would be powerless to challenge that scenario. He said other plaintiffs might be able to sue on religious discrimination grounds.\n\nNoah G. Purcell, Washington State’s solicitor general, fared little better in fending off questions from Judge Richard R. Clifton, appointed by President George W. Bush. Judge Clifton said the states’ evidence of religious discrimination was thin, adding that “the concern for terrorism with those connected with radical Islamic sects is kind of hard to deny.”\n\nAdvertisement Continue reading the main story\n\nJudge Friedland, who was appointed by President Barack Obama, did not seem persuaded that immediate suspension of travel from the seven countries was necessary.\n\nPhoto\n\n“Has the government pointed to any evidence connecting these countries with terrorism?” she asked Mr. Flentje.\n\nHe responded that the government had not had an opportunity to present evidence in court given the pace of the litigation. “These proceedings have been moving quite fast, and we’re doing the best we can,” Mr. Flentje said.\n\nWith that, Judge Friedland said, the government’s appeal may be premature.\n\nThe case, State of Washington v. Trump, is in its earliest stages, and the question for the appeals court on Tuesday was a narrow one: Should it stay Judge Robart’s temporary restraining order and reinstate the travel ban while the case proceeds?\n\nThe argument, which lasted about an hour, was conducted over the telephone and was streamed live on the appeals court’s website. In a media advisory issued before the argument, the court said that “a ruling was not expected to come down today, but probably this week.”\n\nMr. Flentje said the travel ban was well within Mr. Trump’s legal authority. A federal statute specifically gave presidents the power to deny entry to people whose presence would be “detrimental to the interests of the United States,” he said.\n\nHe added that the court should not question Mr. Trump’s motives, and should confine itself instead to “the four corners of the document.” He said the executive order did not, on its face, discriminate on the basis of religion.\n\nMr. Purcell, the lawyer for Washington State, responded that the underlying purpose of the executive order was religious discrimination. As a candidate, Mr. Purcell said, Mr. Trump had “called for a complete ban on the entry of Muslims.”\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMore recently, Mr. Trump has said he meant to favor Christian refugees. “The court can look behind the motives,” Mr. Purcell said.\n\nAdvertisement Continue reading the main story\n\nAs he closed his argument, Mr. Flentje, perhaps sensing that he was unlikely to achieve a complete victory, offered the court a middle ground. He asked, at a minimum, for the court to reinstate a part of the ban against people who have never been in the United States, calling this a “really key point.”\n\nReading from a brief, he conceded that those who could be allowed entry are “previously admitted aliens who are temporarily abroad now or who wish to travel and return to the United States in the future.”\n\nJudge Clifton said that the administration might be in a better position to narrow its executive order. “Why shouldn’t we look to the executive branch to more clearly define what the order means?” he asked.\n\nMr. Purcell also said that it was hard to tell precisely what distinctions the government meant to draw. “They’ve changed their mind about five times” since the executive order was issued, he said.\n\nJudge Friedland said that if the executive order violated the Constitution’s ban on government establishment of religion, the court could block it completely.\n\nBut Judge Clifton said that only a small fraction of the world’s Muslims were affected by the order, suggesting that he was unconvinced that its effect was religious discrimination.\n\nPhoto\n\nMr. Purcell responded that “we do not need to prove that this order harms only Muslims, or that it harms every Muslim.”\n\nAdvertisement Continue reading the main story\n\n“We just need to prove that it was motivated in part by a desire to harm Muslims,” he said.\n\nThe judges also questioned whether the two states that brought the challenge had suffered the sort of direct and concrete harm that gave them standing to sue.\n\nThe Supreme Court has said that states suing the federal government to defend their interests are entitled to “special solicitude in our standing analysis.” In 2015, an appeals court ruled that Texas had standing to sue the Obama administration to challenge an immigration initiative.\n\nBut the case did not seem likely to stall on the threshold issue of standing. Judge Canby appeared to indicate that the harm to state universities was enough to establish standing.\n\nNor were the judges much interested in another technical question pressed by Mr. Purcell.\n\nJudge Robart issued a temporary restraining order, an interim measure, and Mr. Purcell argued that it was not subject to appeal. In court papers, the Justice Department argued that the order amounted to a preliminary injunction, which can be appealed.\n\nProceedings before Judge Robart are continuing. On Tuesday, he asked for briefs on the question of whether he should issue a preliminary injunction.\n\nAt the close of the appeals court argument, Judge Friedland said she and her colleagues “appreciate the importance and the time-sensitive nature of this matter.” She said the court would rule “as soon as possible.”", "authors": ["Adam Liptak"], "publish_date": "2017-02-07", "source": "nytimes", "top_words": ["executive", "skeptical", "travel", "mr", "friedland", "ban", "appeals", "judge", "court", "purcell", "states", "trumps", "flentje", "asked", "appears", "order", "panel"], "summary": "“This is a traditional national security judgment that is assigned to the political branches,” Mr. Flentje said.\nJudge Friedland asked what those limitations were, and Mr. Flentje did not provide a direct answer.\nPhoto“Has the government pointed to any evidence connecting these countries with terrorism?” she asked Mr. Flentje.\nMr. Purcell also said that it was hard to tell precisely what distinctions the government meant to draw.\nJudge Friedland said that if the executive order violated the Constitution’s ban on government establishment of religion, the court could block it completely."}