{"url": "https://www.nytimes.com/2017/02/06/opinion/executive-power-run-amok.html?mcubz=0", "id": "214", "title": "Executive Power Run Amok", "text": "Photo\n\nBerkeley, Calif. — Faced with President Trump’s executive orders suspending immigration from several Muslim nations and ordering the building of a border wall, and his threats to terminate the North American Free Trade Agreement, even Alexander Hamilton, our nation’s most ardent proponent of executive power, would be worried by now.\n\nArticle II of the Constitution vests the president with “the executive power,” but does not define it. Most of the Constitution instead limits that power, as with the president’s duty “to take care that the laws are faithfully executed,” or divides that power with Congress, as with making treaties or appointing Supreme Court justices.\n\nHamilton argued that good government and “energy in the executive” went hand in hand. In The Federalist No. 70, he wrote that the framers, to encourage “decision, activity, secrecy and dispatch,” entrusted the executive power in a unified branch headed by a single person, the president.\n\nMany of Hamilton’s intellectual admirers today endorse the theory of the unitary executive, which holds that the Constitution grants the president all of the remaining executive powers that existed at the time of the founding. These include the powers to conduct foreign affairs, protect the national security, interpret and execute the law and manage all lower-level federal officers.\n\nAdvertisement Continue reading the main story\n\nAs an official in the Justice Department, I followed in Hamilton’s footsteps, advising that President George W. Bush could take vigorous, perhaps extreme, measures to protect the nation after the Sept. 11 attacks, including invading Afghanistan, opening the Guantánamo detention center and conducting military trials and enhanced interrogation of terrorist leaders. Likewise, I supported President Barack Obama when he drew on this source of constitutional power for drone attacks and foreign electronic surveillance.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut even I have grave concerns about Mr. Trump’s uses of presidential power.\n\nDuring the campaign, Mr. Trump gave little sign that he understood the constitutional roles of the three branches, as when he promised to appoint justices to the Supreme Court who would investigate Hillary Clinton. (Judge Neil M. Gorsuch will not see this as part of his job description.) In his Inaugural Address, Mr. Trump did not acknowledge that his highest responsibility, as demanded by his oath of office, is to “preserve, protect and defend the Constitution.” Instead, he declared his duty to represent the wishes of the people and end “American carnage,” seemingly without any constitutional restraint.", "authors": ["John Yoo"], "publish_date": "2017-02-06", "source": "nytimes", "top_words": ["executive", "mr", "constitution", "constitutional", "york", "trumps", "sign", "run", "protect", "president", "amok", "power"], "summary": "PhotoBerkeley, Calif. — Faced with President Trump’s executive orders suspending immigration from several Muslim nations and ordering the building of a border wall, and his threats to terminate the North American Free Trade Agreement, even Alexander Hamilton, our nation’s most ardent proponent of executive power, would be worried by now.\nArticle II of the Constitution vests the president with “the executive power,” but does not define it.\n70, he wrote that the framers, to encourage “decision, activity, secrecy and dispatch,” entrusted the executive power in a unified branch headed by a single person, the president.\nLikewise, I supported President Barack Obama when he drew on this source of constitutional power for drone attacks and foreign electronic surveillance.\nBut even I have grave concerns about Mr. Trump’s uses of presidential power."}