{"url": "https://www.nytimes.com/2017/02/05/us/politics/trump-immigration-law.html?mcubz=0", "id": "206", "title": "The President Has Much Power Over Immigration, but How Much?", "text": "Judge Robart’s brisk ruling contained almost no reasoning. By contrast, Judge Nathaniel M. Gorton, of the Federal District Court in Boston, issued a 21-page decision on Friday refusing to block the program and discussing the legal arguments in detail.\n\nJudge Gorton also sketched out the broader picture.\n\n“The rich immigrant history of the United States has long been a source of strength and pride in this country,” Judge Gorton wrote. “Conversely, the public interest in safety and security in this ever-more dangerous world is strong as well.” The balance, he wrote, tipped in favor of Mr. Trump.\n\nHow broad is the president’s constitutional power?\n\nArticle II of the Constitution confers authority on the president, the Supreme Court has said, to conduct foreign affairs and address immigration.\n\nIn their brief to Judge Robart, lawyers for Washington State, one of the two plaintiffs, along with the State of Minnesota, said there were constitutional checks on these powers. “While courts generally give more latitude to the political branches in the immigration context, this does not mean that the political branches can act with impunity,” the brief said.\n\n“Federal courts,” the brief said, “have no more sacred role than protecting marginalized groups against irrational, discriminatory conduct.”\n\nIn the Ninth Circuit, the Trump administration said judges were ill-equipped to decide cases involving national security. “Unlike the president,” the administration’s brief said, “courts do not have access to classified information about the threat posed by terrorist organizations operating in particular nations, the efforts of those organizations to infiltrate the United States, or gaps in the vetting process.”\n\nNoah G. Purcell, the solicitor general of Washington State, appeared to concede in court that there were areas in which Mr. Trump was entitled to act. But he asked the court to protect people whose lives had been changed by Mr. Trump’s order in a flash.\n\nAdvertisement Continue reading the main story\n\n“The focus of our claim,” he said, “is on people who have been here and have, overnight, lost the right to travel, lost the right to visit their families, lost the right to go perform research, lost the right to go speak at conferences around the world. And also people who had lived here for a long time and happened to be overseas at the time of this order, which came with no warning whatsoever, and suddenly lost the right to return to the United States.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nHow much power has Congress given the president?\n\nOn Friday, defending Mr. Trump’s executive order in a Seattle courtroom, Michelle Bennett, a Justice Department lawyer, cited Youngstown Sheet & Tube Co. v. Sawyer, a 1952 decision in which the Supreme Court rejected President Harry S. Truman’s assertion that he had the authority to seize steel mills during the Korean War.\n\nThe most famous part of the decision is a concurrence from Justice Robert H. Jackson, which set out a framework for considering clashes between presidential power and congressional authority. The president has the most power when he acts with congressional authorization, Justice Jackson said, and an intermediate amount when Congress is silent. The president’s power is at its “lowest ebb,” Justice Jackson wrote, when Congress has forbidden a particular action.\n\nTruman’s actions fell into the third category, Justice Jackson wrote. Ms. Bennett, by contrast, said Mr. Trump’s order was in the first category.\n\n“Here we have the president acting pursuant to power that Congress gave him, which means, under the Youngstown steel seizure case, he’s acting at the apex of his power,” she said.\n\nA key part of immigration law does give the president broad power. It says, “Whenever the president finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate.”\n\nBut another part of the law forbids discrimination “because of the person’s race, sex, nationality, place of birth or place of residence,” but only “in the issuance of an immigrant visa.” The Trump administration argues that the power to bar entry, the subject of the first law, is broader than the limits on issuing visas.\n\nWhat about arguments based on religious discrimination?\n\nLawyers for Washington State have said that the executive order violates the First Amendment’s prohibition against government establishment of religion because its provisions on the refugee program favor minority religions. “President Trump and his advisers have made clear that the very purpose of this order is to tilt the scales in favor of Christian refugees at the expense of Muslims,” they wrote in their brief to Judge Robart.\n\nThe Trump administration urged the Ninth Circuit to reject arguments based on religious discrimination, even though Mr. Trump has said he meant to favor Christian refugees. Judicial consideration of the president’s motives, the brief said, would violate the separation of powers.\n\nAdvertisement Continue reading the main story\n\n“The more searching inquiry envisioned by the states would create substantial separation-of-powers problems, by permitting probing of the president’s subjective motive in issuing the order,” the brief said.\n\nCould the case founder on the issue of injury?\n\nThe states challenging the order face the initial hurdle of demonstrating that they have suffered the sort of direct and concrete harm that gives them standing to sue. Judge Robart ruled that they did, relying on a decision from the federal appeals court in New Orleans, which said Texas could sue to challenge President Barack Obama’s plan to defer the deportation of millions of unauthorized immigrants and allow them to work.\n\n“The executive order adversely affects the states’ residents in areas of employment, education, business, family relations and freedom to travel,” Judge Robart wrote. He said the states had been hurt because the order affected their public universities and their tax bases.\n\nIn its Ninth Circuit brief, the Trump administration called the states’ asserted injuries “attenuated and speculative” and did not address the Texas decision. In court in Seattle on Friday, Ms. Bennett said the government disagreed with the Texas ruling.", "authors": ["Adam Liptak"], "publish_date": "2017-02-05", "source": "nytimes", "top_words": ["wrote", "mr", "trump", "brief", "immigration", "judge", "court", "states", "order", "president", "power"], "summary": "Article II of the Constitution confers authority on the president, the Supreme Court has said, to conduct foreign affairs and address immigration.\nHow much power has Congress given the president?\nThe president has the most power when he acts with congressional authorization, Justice Jackson said, and an intermediate amount when Congress is silent.\n“Here we have the president acting pursuant to power that Congress gave him, which means, under the Youngstown steel seizure case, he’s acting at the apex of his power,” she said.\nA key part of immigration law does give the president broad power."}