{"url": "https://www.nytimes.com/2017/02/27/sports/soccer/united-states-travel-restrictions-2026-world-cup-bid-uefa.html?mcubz=0", "id": "283", "title": "U.S. Travel Restrictions Would Damage 2026 World Cup Bid, UEFA President Says", "text": "Mr. Ceferin’s warning is significant; in addition to his position leading European soccer, he is a vice president of FIFA, world soccer’s governing body and the organizer of the World Cup. Bids for the 2026 tournament must be submitted by December 2018, before the start of a 13-month evaluation phase. FIFA will choose the host at a congress in May 2020.\n\nThe Trump administration’s proposed 90-day ban applied only to seven countries, but it caught the eye of world soccer officials because at least three of those countries have national teams that could be affected if it becomes more than a temporary policy. One of them, Iran, has played in the World Cup three times since 1998, and two others — Iraq and Syria — have joined Iran in the later rounds of Asian qualifying for next year’s tournament in Russia.\n\nU.S. Soccer declined to comment on Mr. Ceferin’s remarks on Sunday. Though it has not publicly confirmed its intention to bid for the tournament, the federation has expressed confidence that it would receive all the governmental guarantees needed to meet FIFA’s criteria for admitting visiting players and fans, and that no ban — temporary or otherwise — would be in place for the tournament. FIFA’s rules do not dictate that any potential hosts have entirely open borders.\n\nThe 2026 World Cup will be the first to comprise 48 teams after FIFA unanimously agreed last month to expand the competition from its current 32-team format. A final decision on how many spots each confederation will be given is expected when FIFA meets on March 30, but Mr. Ceferin insisted that Europe’s conditions are clear: UEFA will demand 16 places, an increase of three teams, and request a guarantee that only one European team will be placed in each three-team group.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Sports Newsletter Get the big sports news, highlights and analysis from Times journalists, with distinctive takes on games and some behind-the-scenes surprises, delivered to your inbox every week. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“Sixteen teams and each European team in a different group is the red line,” he said. “That is what we will insist on. The others are still discussing. That will happen, or we will make things quite complicated.\n\n“Two or three of our member nations suggested to me that we ask for 20 or 24 teams, and if we have to settle for 16, then O.K., but I do not want to push it. I said that we should be realistic. To say that we want half the teams at the World Cup would look arrogant to me.”\n\nMr. Ceferin also acknowledged that more stringent immigration policies could harm Britain’s chances of hosting major finals once that country exits the European Union. The Champions League final will have been held in Britain three times in the last nine years — twice at Wembley Stadium in London and this June at Millennium Stadium in Cardiff, Wales — and the semifinals and final of the 2020 European Championship are set for London.\n\nAdvertisement Continue reading the main story\n\n“If ‘Brexit’ happens, everything changes,” Mr. Ceferin said. “But football was played before, and it will be played in the future. Now, with free movement in the European Union, it is much better.”\n\nThough Mr. Ceferin, a former president of Slovenia’s soccer federation, insisted that UEFA’s commitment to staging the final matches of Euro 2020 in England remained “firm,” he said the organization might have to discount Britain as a potential venue for showpiece games if “Brexit” made it harder for players and fans to enter the country.\n\nAs proof of the extra complications that might arise after England’s exit, he cited the example of Serge Aurier, the Paris St.-Germain defender who was denied entry by British authorities for a Champions League game against Arsenal last year because of a conviction for assault that was under appeal.\n\n“I was very disappointed when Aurier, from P.S.G., was not allowed to enter England,” he said. “That will worsen when ‘Brexit’ happens, especially if the reasons were as formal. We could have a serious problem.”\n\nMr. Ceferin said he had no problem if the authorities wanted to withhold visas from “a severe criminal.”\n\n“But if we see that players cannot enter because they have any sort of procedure ongoing, then we will simply think if we should play our European matches there,” he said. “Neymar and Lionel Messi both have procedures going on. This year, the Champions League final is in Cardiff. Imagine if they did not let them in. That is a big thing for us, if players from England can travel anywhere but players from other teams cannot travel to England. With free movement in Europe, it is much better.\n\n“Even in 2020, if ‘Brexit’ has happened, then it can be a big problem for fans. That stays firm, and we will speak to the British government, and I am sure the English Football Association will help us.”", "authors": ["Rory Smith"], "publish_date": "2017-02-27", "source": "nytimes", "top_words": ["final", "travel", "restrictions", "world", "tournament", "players", "teams", "soccer", "cup", "2026", "bid", "ceferin", "times", "damage", "uefa", "president", "mr", "european"], "summary": "Mr. Ceferin’s warning is significant; in addition to his position leading European soccer, he is a vice president of FIFA, world soccer’s governing body and the organizer of the World Cup.\nBids for the 2026 tournament must be submitted by December 2018, before the start of a 13-month evaluation phase.\nThe 2026 World Cup will be the first to comprise 48 teams after FIFA unanimously agreed last month to expand the competition from its current 32-team format.\nAdvertisement Continue reading the main story“If ‘Brexit’ happens, everything changes,” Mr. Ceferin said.\nThat is a big thing for us, if players from England can travel anywhere but players from other teams cannot travel to England."}