{"url": "https://www.nytimes.com/2017/02/05/briefing/jim-mattis-travel-ban-pakistan.html?mcubz=0", "id": "201", "title": "Jim Mattis, Travel Ban, Pakistan: Your Morning Briefing", "text": "_____\n\nVideo\n\n• The rare diplomatic rift that opened between the U.S. and Australia last week focused on Mr. Trump’s dislike of an Obama-era agreement for the U.S. to take in 1,250 refugees from Australia’s offshore detention centers.\n\nAbove, one of those refugees, a Kurdish dissident from Iran, sent video diaries showing what his life in detention looks like.\n\n_____\n\nISIS Attacks Outside Its Self-Proclaimed Caliphate Counterterrorism officials have divided these attacks into three broad categories: directed, enabled and inspired. Sized by number of deaths Injuries only\n\n• The Islamic State’s strategic, and deadly, use of technology is evolving.\n\nCounterterrorism experts say the group has guided terror plots around the world by using the internet and messaging apps to enable attacks, right down to picking the targets and finding the guns.\n\n_____\n\nPhoto\n\n• China is challenging the U.S.’s long-held strategic monopoly on artificial intelligence, widely seen as the key factor in the next generation of warfare.\n\n“Using a chess analogy,” said Kai-Fu Lee, a Taiwan-born A.I. researcher turned venture capitalist, “we might say that grandmasters are still largely North American, but Chinese occupy increasingly greater portions of the master-level A.I. scientists.”\n\n_____\n\nPhoto\n\n• Pressure on Myanmar is rising after the U.N. described the country’s four-month crackdown on Rohingya Muslims as “very probably crimes against humanity.”\n\nThe report said the army and the police had killed hundreds of men, women and children, gang-raped women and girls and forced as many as 90,000 from their homes.\n\nAdvertisement Continue reading the main story\n\nThe country’s leader, Daw Aung San Suu Kyi, asked for the U.N.’s help in finding out more about the situation.\n\n\n\n_____\n\nPhoto\n\n• The New England Patriots won Super Bowl LI. Tom Brady led his team to a 34-28 overtime victory over the Atlanta Falcons, becoming the first quarterback in N.F.L. history to win five Super Bowls.\n\nAnyone expecting a loud political statement in Lady Gaga’s halftime show was disappointed.\n\nBusiness\n\nPhoto\n\n• Hundreds of thousands of Chinese students are flooding into American high schools and universities, an extraordinary rise that contributed $11.4 billion to the American economy in 2015 alone.\n\n• The Japanese auto giants Toyota and Suzuki appear to be close to announcing a deal on a partnership to develop new technology, including a self-driving car.\n\n• Alibaba opened its first Australia and New Zealand branch in Melbourne over the weekend. “Australia is a gold mine,” said its founder, Jack Ma.\n\n• The International Monetary Fund holds a crucial board meeting to discuss whether it will participate in the third Greek bailout in seven years.\n\n• Singapore’s Parliament considers whether to try to keep the Trans-Pacific trade partnership alive after the abandonment of the U.S.\n\n• Here’s a snapshot of global markets.\n\nMarket Snapshot View Full Overview\n\nIn the News\n\nPhoto\n\n• Pushback from Congress and cabinet officials appears to have prompted the Trump White House to back off its consideration of reopening C.I.A. overseas “black site” prisons. [The New York Times]\n\nAdvertisement Continue reading the main story\n\n• The satirical TV show “Saturday Night Live” went to town on President Trump and the White House press secretary, Sean Spicer. [The New York Times]\n\n• Two-thirds of the U.S. troops killed in action in the last 12 months served in Special Operations units, as the Pentagon shifts to specialized warriors from conventional troops on the ground. [The New York Times]\n\n• Heavy snow and avalanches have killed scores of people in Afghanistan and Pakistan in the past three days. [BBC]\n\n• In eastern China, a fire tore through a second-floor foot-massage parlor, sending some people jumping out of windows and leaving at least 18 dead, the state news media reported. [South China Morning Post]\n\n• “One of my easiest and biggest heists.” That’s how the acrobatic burglar known as “Spiderman” described his 2010 theft of five masterpieces from the Museum of Modern Art in Paris. [The New York Times]\n\nSmarter Living\n\nPhoto\n\n• We’re in Week 2 of New Year’s resolution month, when we’re helping you to stick to your goals. If you joined last week, welcome back. If not, there’s still time to participate.\n\nA key to staying motivated is to create habits that take away the opportunity to slip up. This is a concept my colleague Charles Duhigg has explored: “At the core of every habit is a neurological loop with three parts: a cue, a routine and a reward. To understand how to create habits — such as exercise habits — you must learn to establish the right cues and rewards.”\n\nThis article tells you how to do that. I can attest to the power of this approach, and we want you to try it out yourself. Email us with one habit that would support your resolution, and how you’re going to create it. Near the end of the month, we’ll check back in with some of these and see how you did. — Tim Herrera, Smarter Living editor\n\nAdvertisement Continue reading the main story\n\n• Recipe of the day: For a step away from weeknight pasta, try your hand at ricotta gnocchi.\n\nNoteworthy\n\nPhoto\n\n• Hideo Yokoyama, a former police reporter, is one of Japan’s most popular crime novelists. “Six Four,” his first book to be translated into English, and a best-seller in Britain, goes on sale in the U.S. on Tuesday.\n\n• And remember Gondwana? That’s the “supercontinent” that included Africa, Antarctica, Australia and South America. Tiny, sparkly minerals on the island of Mauritius help to tell the story of its breakup.\n\nBack Story\n\nPhoto\n\nLast week, the actor Peter Capaldi made headlines when he announced he would be leaving his starring role on “Doctor Who,” the long-running British television series about a time-traveling alien.\n\nThe Doctor — who isn’t referred to as Doctor Who — is a Time Lord from a distant planet who explores the universe in a time machine called the Tardis (which stands for Time and Relative Dimension in Space). A plucky human companion usually accompanies the Doctor, who faces a rotating cast of alien adversaries.\n\nOriginally conceived as a family-friendly educational program, the series began in 1963 and, with the exception of a 16-year gap (1989-2005), has been broadcast ever since.\n\nThe show is a national institution in Britain and a cult favorite elsewhere in the world, with more than 800 episodes (a Guinness world record).\n\nThe Doctor is capable of regenerating, a concept that was introduced to prolong the series when its first lead actor, William Hartnell, left amid failing health.\n\nMr. Capaldi, above, is the 12th actor — and the 12th white man — to fill the role. Fans have urged the producers to address the lack of diversity when the 13th Doctor makes his — or her — debut.\n\nChris Stanford contributed reporting.\n\n_____\n\nYour Morning Briefing is published weekday mornings.\n\nWhat would you like to see here? Contact us at asiabriefing@nytimes.com.", "authors": ["Charles Mcdermid"], "publish_date": "2017-02-05", "source": "nytimes", "top_words": ["main", "pakistan", "travel", "doctor", "australia", "world", "ban", "morning", "week", "mattis", "white", "try", "reading", "jim", "series", "briefing", "york"], "summary": "_____ISIS Attacks Outside Its Self-Proclaimed Caliphate Counterterrorism officials have divided these attacks into three broad categories: directed, enabled and inspired.\nAdvertisement Continue reading the main storyThe country’s leader, Daw Aung San Suu Kyi, asked for the U.N.’s help in finding out more about the situation.\nTom Brady led his team to a 34-28 overtime victory over the Atlanta Falcons, becoming the first quarterback in N.F.L.\n[The New York Times]• Heavy snow and avalanches have killed scores of people in Afghanistan and Pakistan in the past three days.\nFans have urged the producers to address the lack of diversity when the 13th Doctor makes his — or her — debut."}