{"url": "https://www.nytimes.com/2017/02/05/technology/airbnb-super-bowl-ad-trump-travel-ban.html?mcubz=0", "id": "202", "title": "In Airbnb’s Super Bowl Ad, Implied Criticism of Trump’s Travel Ban", "text": "SAN FRANCISCO — Ever since President Trump moved to sharply limit immigration, Silicon Valley executives have tweeted, blogged and voiced their opposition.\n\nAirbnb, one of the most aggressive corporate critics of Mr. Trump’s policy, took its opposition to the Super Bowl.\n\nAirbnb created a Super Bowl advertisement showing a diverse group of people and text that read: “We believe no matter who you are, where you’re from, who you love or who you worship, we all belong. The world is more beautiful the more you accept.”\n\nThe Airbnb ad came just nine days after Mr. Trump signed an executive order to temporarily close America’s borders to all refugees and to citizens of seven predominantly Muslim countries. The ad referred to the ban only obliquely so as not to run afoul of guidelines that say commercial time is not “for viewpoint or advocacy of controversial issues.”\n\nAdvertisement Continue reading the main story\n\nThe National Football League and Fox, the broadcaster of the game, maintain the right to approve ads, and some advertisers walked a tightrope to get ads with immigrants approved. Before the game started, Coca-Cola re-aired an ad from 2014 called “America the Beautiful,” which depicts Americans of different races and religions singing the song in a variety of languages. The building supply company 84 Lumber had to change an ad that showed a Spanish-speaking mother and daughter in front of a border wall.", "authors": ["Katie Benner"], "publish_date": "2017-02-05", "source": "nytimes", "top_words": ["bowl", "implied", "travel", "world", "trump", "ban", "ad", "game", "worship", "ads", "criticism", "youre", "trumps", "airbnbs", "super", "mr", "beautiful"], "summary": "SAN FRANCISCO — Ever since President Trump moved to sharply limit immigration, Silicon Valley executives have tweeted, blogged and voiced their opposition.\nAirbnb, one of the most aggressive corporate critics of Mr. Trump’s policy, took its opposition to the Super Bowl.\nThe world is more beautiful the more you accept.”The Airbnb ad came just nine days after Mr. Trump signed an executive order to temporarily close America’s borders to all refugees and to citizens of seven predominantly Muslim countries.\nBefore the game started, Coca-Cola re-aired an ad from 2014 called “America the Beautiful,” which depicts Americans of different races and religions singing the song in a variety of languages.\nThe building supply company 84 Lumber had to change an ad that showed a Spanish-speaking mother and daughter in front of a border wall."}