{"url": "https://www.nytimes.com/2017/02/28/nyregion/new-york-foreign-tourists-trump-policies.html?mcubz=0", "id": "285", "title": "New York Expects Fewer Foreign Tourists, Saying Trump Is to Blame", "text": "The White House did not immediately respond to a request for comment.\n\nThe rest of the country is expected to see an even larger decline in foreign tourism over the next two years, said Adam Sacks, president of Tourism Economics, an international firm that forecasts travel trends for several cities in the United States, including New York. He said the annual number of foreign visitors to the United States could fall by 6.3 million between 2016 and 2018 because of reactions to Mr. Trump’s words and actions, such as pledges to pull out of international trade agreements.\n\n“We’re going to be looking at a very challenging year for U.S. travel,” Mr. Sacks said.\n\nHe said indicators of interest in visiting the United States, including online searches for airline tickets and hotels, started dropping after the election. They dipped again after Mr. Trump’s inauguration and fell further after he signed an executive order on the travel ban, Mr. Sacks said.\n\nPhoto\n\n“The data are all showing a pretty dramatic shift in behavior and interest,” he said. “That certainly accelerated since the executive order.”\n\nMr. Sacks said his firm had a “solid track record” of forecasting tourism, but he added that there was less certainty in estimating what he called “Trump impacts.”\n\nForwardKeys, a Spanish company that tracks travel, said that it saw an “immediate slump” in bookings of flights to the United States after the travel ban was announced, including a 13.6 percent drop in Western Europe.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nTo combat the perception of a less hospitable climate, NYC & Company plans to start replacing some of its advertising overseas with billboards that declare that the city is “Welcoming the World.” Mr. Dixon said the city was “doubling down on our welcome message.”\n\nAlicia Glen, the city’s deputy mayor for housing and economic development, said it was not New York City’s style to turn people away.\n\n“We’re a place that welcomes everybody,” Ms. Glen said. “It’s in our values and in our economic interest. We’ll keep reminding visitors what we stand for, so we can keep this both the most internationally visited and the safest city in America.”\n\nAdvertisement Continue reading the main story\n\nNew York still expects a slight increase in tourism this year, but only because of an increase in domestic visitors, Mr. Dixon said. NYC & Company forecasts that the city will attract 61.7 million visitors, up from 60.7 million in 2016, with an increase of 1.3 million domestic visitors offsetting the decline of foreign travelers.\n\nBefore Mr. Trump’s election, the city had been expecting an increase of 400,000 foreign visitors in 2017, Mr. Dixon said. That swing will be very costly to the city’s economy, he said, because foreign tourists stay longer and spend more freely than domestic tourists. On average, foreigners spend about $2,000 in the city, compared with about $500 for Americans.\n\n“We were looking forward to a really strong 2017,” Mr. Dixon said. “Travel is a very precious commodity and people have choices. Once the vacation of 2017 is gone, you don’t get that back.”", "authors": ["Patrick Mcgeehan"], "publish_date": "2017-02-28", "source": "nytimes", "top_words": ["travel", "foreign", "mr", "trump", "visitors", "blame", "expects", "fewer", "sacks", "united", "city", "saying", "states", "york", "tourism", "tourists"], "summary": "“We’re going to be looking at a very challenging year for U.S. travel,” Mr. Sacks said.\nHe said indicators of interest in visiting the United States, including online searches for airline tickets and hotels, started dropping after the election.\nThey dipped again after Mr. Trump’s inauguration and fell further after he signed an executive order on the travel ban, Mr. Sacks said.\nBefore Mr. Trump’s election, the city had been expecting an increase of 400,000 foreign visitors in 2017, Mr. Dixon said.\nThat swing will be very costly to the city’s economy, he said, because foreign tourists stay longer and spend more freely than domestic tourists."}