{"url": "https://www.nytimes.com/2017/02/23/nyregion/weight-gain-and-trump.html?mcubz=0", "id": "277", "title": "Trump Made Me Eat It", "text": "You know what else may be contributing to blue state weight gain?\n\nTrudeau Envy.\n\nYou look at Canada’s adorable little prime minister, making what appear to be well-considered remarks, saying Canada will welcome those fleeing persecution, terror and war, and you find yourself thinking: What a decent fellow. I’ve made fun of Canada’s indiscriminate niceness for years, but I now see our friends to the north have more than thick-cut bacon going for them. Canadian bacon really is delicious. I especially like it as a winter snack, broiled in brown sugar and maple syrup and accompanied with a glass of icy Champagne. What’s the president tweeting today? “Our legal system is broken.” Leave the bottle.\n\nI must confess: I do find blaming Mr. Trump a pleasant change from the things I usually blame for my overeating: a miserable love life; an ecstatic love life; the stress of too much to do; the stress of nothing to do; a mother who is driving me crazy; a mother who, thanks to a major stroke three years ago, is certifiably crazy.\n\nMy mother, living in a Westchester nursing home, was my primary trigger for eating the wrong stuff for the past few months. She had developed an obsession with newborn babies, particularly boys.\n\n“Let’s go to the nursery and look at the babies,” she’d say.\n\n“That would be really nice, Ma, but they don’t have a nursery here,” I’d say.\n\n“Yes, they do,” Ma would say. “With the boys, the nurses have to wash their little penises.”\n\nIt got me down, particularly the penis bit, which made me think my mother had pitched her tent in Krafft-Ebing territory. But one of my brothers stocks my mother’s room with chocolate covered biscuits and Hershey’s Kisses and cookies, so relief was never more than three feet away.\n\nAre you non-Weight Watchers aware that one Hershey’s Kiss is the equivalent of a pat of butter? Give me a half-hour with my mother and I am good for a double handful; I inhale those suckers as if in a trance, and when I come to my senses, the floor is awash in silver confetti. It should be a wake-up call. But I know there is orange marzipan in the bureau under the television and I have not hit bottom yet.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThen Mr. Trump takes office and orders a travel ban and the people are protesting in the streets. Around this time, Ma, who had been a big traveler before her stroke, also has a new idea.\n\n“There’s something we need to talk about,” she tells me very seriously when I arrive. “There’s a trip I want to take, but it’s going to cost $20,000.”\n\nAdvertisement Continue reading the main story\n\n“No problem, Ma, you can afford it,” I say. “Where would you like to go?”\n\n“Mars,” Ma says.\n\n(Bonus caregiver tip: If you’re having trouble determining whether your loved one has early dementia or has progressed to advanced and he or she starts discussing space travel, no more need to wonder. They’ve arrived.)\n\n“I don’t think they’re ready for tourists on Mars, Ma,” I say. “Maybe you read a story about it, but I think it probably said that one day people will be going to Mars.”\n\n“No, they’re doing it right now,” Ma says. “I was thinking of asking my sister. But you know Betty, she never wants to go anywhere.”\n\nAn aide takes Ma to the bathroom. I talk to two of the other visiting daughters about the Muslim travel ban. We’re all upset about it. One of the daughters says that there is a fear that Muslims will be forced to register and that former Secretary of State Madeleine K. Albright just tweeted that if that happens, she will register as a Muslim in solidarity. I have the feeling of unreality I had during 9/11. Meanwhile, down the hall, two female residents with dementia are having screaming meltdowns.\n\nThe world has gone crazy, I think; I am literally in a madhouse, and the people outside have also gone mad. At least, unlike those poor screaming women, my mother is usually happy in her delusions. And she’s well taken care of. Thank heavens Medicaid will be in place when she runs through her money at this $180,000 a year nursing home.\n\nOr will it?\n\nHershey’s Kisses. Where are the Hershey’s Kisses?", "authors": ["Joyce Wadler", "I Was Misinformed"], "publish_date": "2017-02-23", "source": "nytimes", "top_words": ["travel", "mother", "ma", "trump", "know", "think", "going", "youre", "eat", "kisses", "hersheys", "say"], "summary": "My mother, living in a Westchester nursing home, was my primary trigger for eating the wrong stuff for the past few months.\nBut one of my brothers stocks my mother’s room with chocolate covered biscuits and Hershey’s Kisses and cookies, so relief was never more than three feet away.\nThen Mr. Trump takes office and orders a travel ban and the people are protesting in the streets.\nHershey’s Kisses.\nWhere are the Hershey’s Kisses?"}