{"url": "https://www.nytimes.com/2017/02/06/world/middleeast/mothers-and-daughters-divided-by-refugee-ban-encounter-the-guilt-of-good-fortune.html?mcubz=0", "id": "221", "title": "Mothers and Daughters Divided by Refugee Ban Encounter the Guilt of Good Fortune", "text": "In Knoxville, Tenn., an Iraqi woman who arrived five months ago has no explanation to offer her 18-year-old twin daughters, who are stranded back home. They cry every time she calls.\n\nIn Clarkston, Ga., a Somali mother fears for her daughter, 20, who was supposed to come on Feb. 6, but remains in a refugee camp in Kenya. The family had fled Somalia after gunmen stormed their home and raped and killed another daughter. That memory only makes things worse.\n\n“I am unable to sleep or eat,” the mother, Habibo Abdikadir Mohamed, 38, said through an interpreter this past week. “I’m not sure she will be safe. I’ve already lost one daughter. I’m worried I will lose another.”\n\nExactly how many families are divided like these is not known. A United States government lawyer said Friday that 100,000 visas had been revoked, while the State Department said the number was closer to 60,000.\n\nThe rules are changing so fast, it’s impossible to predict the fate of relatives left behind.\n\nOn Jan. 27, Mr. Trump signed the order suspending the resettlement of refugees from any country for four months, adding that Syrians seeking asylum would be barred indefinitely. Syrians and nationals from six other Muslim-majority countries, including Iraq and Somalia, would be unable to visit even if they had valid visas. Then, federal judges quashed the ban, at least temporarily. The State Department said it would allow refugees who had already been approved to fly to the United States, until Feb. 17.\n\nThere were nearly 20,000 people in that category — vetted and screened by multiple government agencies — according to the International Organization for Migration, a United Nations agency that arranged travel for the refugees. It was scrambling to get about 10 percent of them on planes to the United States in the next 10 days.\n\nThat didn’t bring much comfort to Meathaq Alaunaibi of Iraq. Her husband worked for 10 years as a translator for the United States Agency for International Development in Baghdad. Their home was shelled in 2006, an attack that she believes was done by militants because of his work with American officials. Her husband’s hand was burned by a car bomb in 2014.\n\nAdvertisement Continue reading the main story\n\nStill, it took four years for their visa application to be approved, and last summer, the couple, their 15-year-old daughter and their 5-year-old son landed in Knoxville. But there was a new wrinkle. Because the process took so long, their twin daughters, Aisha and Fatima, had just turned 18. They were told that they would have to be screened anew. One is in medical school in Baghdad; the other is in dentistry school in Kirkuk. Ms. Alaunaibi calls them every day, even if only to tell them to wait.\n\n“They just cry. ‘Why this happened to us? We love the U.S.A. We want to live in the U.S.A.,’” Ms. Alaunaibi, 45, said of their response. “You know, they are young, they are ambitious, they are smart and responsible. So this is a shock to them.”\n\nMs. Mohamed, the Somali mother in Clarkston, was waiting anxiously to hear whether her eldest daughter would be among those who could come. Ms. Mohamed’s family arrived in Georgia on Jan. 18, after 10 years in a refugee camp in Kenya. She had fled Somalia after gunmen stormed her home and raped one of her daughters in front of her. Ms. Mohamed’s sister and brother-in-law were killed, too, so she took in her sister’s two children, in addition to her own seven.\n\nThe last of the family, Batulo Abdalla Ramadhan, 20, was scheduled to leave Kenya on Monday. But then came the ban last month. Her travel was canceled, she called to tell her parents. They could hear the grief in her voice.\n\n“She’s always asking us, ‘What do I do?’” said Ms. Mohamed’s husband, Abdalla Ramadhan Munye. “She feels hurt that we left her behind. Only thing we can do is to listen to her and feel her pain.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Munye said he wanted to deliver a message to the first lady, Melania Trump.\n\n“As a mother,” he said, “she knows how difficult it would be to be separated from a child.”\n\nSana Mustafa from Syria said her parents had encouraged her and her sister to get out of the country as soon as they could after the Syrian civil war began.\n\nMs. Mustafa received a six-week fellowship funded by the State Department to visit Washington in the summer of 2013. “I applied, out of the blue, online, in the middle of the war,” she said. “My dad said, ‘Go.’”\n\nThat was one of her last conversations with him. A businessman known for his opposition to President Bashar al-Assad’s government, her father was picked up in July 2013, while Ms. Mustafa was in Washington.\n\nAdvertisement Continue reading the main story\n\nHer plans changed immediately. There was no chance of going back to Syria. She slept on the sofas of strangers who took her in. She applied for political asylum in the United States, and quickly got it.\n\nTo make ends meet, she worked as a hostess at a restaurant, then as a live-in babysitter. Through friends of friends, she landed a full scholarship at Bard College in upstate New York. She graduated last year.\n\nHer mother, Lamia Zreik, has not been as lucky. She fled with her other two daughters, Wafa and Ghena, after her husband was detained in 2013. They went to Gaziantep, Turkey — the border town now home to hundreds of thousands of Syrians — and in 2014, hoping to join Sana, applied for resettlement to the United States.\n\nThey were interviewed four times — by United Nations officials, then by American officials. One year passed, then two. When Wafa, who had been supporting the family, got a chance to go to Germany, Ms. Zreik told her that she couldn’t possibly pass it up.\n\n“We had two options — either she stays or I work,” Ms. Zreik said by telephone from Gaziantep, where she works with Syrian children orphaned by the war. “And the first wasn’t really an option.”\n\nIn early January, the first bad news came: an email informing Ms. Zreik that she and her daughter would have to undergo more security screenings.\n\nMs. Mustafa was visiting Gaziantep at the time. “Three years wasn’t enough for screening?” she said. “I was very devastated. I was actually very angry.”\n\nFor a while, neither of them told Ghena, 16, the bad news. Then came the executive order.\n\nMs. Mustafa said Ghena had taken it the hardest. “She was very sad,” she said. “She said: ‘We’re not going anywhere. No one is taking us.’”\n\nAdvertisement Continue reading the main story\n\nThe family has applied for resettlement to France and Canada. Wafa, 26 and studying in Berlin, said she could not sponsor them to Germany until she could prove she could support them financially. Wafa’s own good fortune weighs on her.\n\n“I’m thinking about this every day,” she said. “I have to find a way to help my mom and my sister.”\n\nFor now, there’s no place they can be together.\n\n“I can’t express my deep anger,” Ms. Zreik said. “We are a small family. Without my husband, and each girl in a different country, we can’t see each other.”", "authors": ["Somini Sengupta"], "publish_date": "2017-02-06", "source": "nytimes", "top_words": ["mother", "good", "took", "ban", "divided", "guilt", "fortune", "refugee", "family", "encounter", "united", "zreik", "ms", "mustafa", "reading", "states", "daughter", "daughters", "mothers"], "summary": "A United States government lawyer said Friday that 100,000 visas had been revoked, while the State Department said the number was closer to 60,000.\nThe State Department said it would allow refugees who had already been approved to fly to the United States, until Feb. 17.\nIt was scrambling to get about 10 percent of them on planes to the United States in the next 10 days.\nHer husband worked for 10 years as a translator for the United States Agency for International Development in Baghdad.\nMs. Mustafa received a six-week fellowship funded by the State Department to visit Washington in the summer of 2013."}