{"url": "https://www.nytimes.com/2017/02/07/us/travel-ban-customs-border-protection.html?mcubz=0", "id": "226", "title": "Homeland Security Chief Admits Travel Ban Was Rushed", "text": "In the meantime, a complaint filed with the inspector general for homeland security details what two legal advocacy groups call “systemic abuses and violations of the rights of individuals lawfully entering the United States” after the order was issued.\n\nPeople caught up in the confusion after the ban was imposed were denied access to lawyers, held in detention for hours without food, and in some instances coerced into signing away their entry visas, the Kathryn O. Greenberg Immigration Justice Clinic at Cardozo Law School and the Center for Constitutional Rights said in a complaint filed late Monday.\n\nThe complaint was redacted to protect the names of people caught up in the disruption. It included 26 accounts by lawyers barred from reaching their clients and in some cases by affected individuals or their relatives.\n\nIn his testimony, Mr. Kelly rejected accusations that inspectors had insulted or mistreated those caught up in the confusion after Mr. Trump signed the order.\n\n“Everyone was treated humanely,” Mr. Kelly, a retired Marine Corps general recently confirmed as homeland security secretary, told lawmakers. “We did have to step back and kind of re-cock in that first 24-hour period because of action by one of the federal courts. That changed things a bit, so we had to kind of step back.”\n\nMr. Kelly said he also agreed with a Twitter post by Mr. Trump that dangerous people could be getting into the country while a court order has held up the ban. He said it was “entirely possible” and it was likely that law enforcement officials would not know “until the boom.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nRepresentative Michael McCaul, the chairman of the Homeland Security Committee, said the rollout of the executive order had been problematic. Mr. McCaul, a Texas Republican, said he was concerned about “the lack of coordination, both within the executive branch and also with congressional leaders like myself.”\n\nBut he said he applauded Mr. Kelly for “quickly correcting what I consider to be errors by quickly granting the exception and waiver to green-card holders, which went a long way to remedy, I think, this executive order.”\n\nAdvertisement Continue reading the main story\n\nMr. Kelly said most of the confusion had occurred because of the multiple court rulings issued in response to the order and the many protesters who appeared at airports across the country, not because of the actions of Customs and Border Protection officers.\n\nRepresentative Bennie G. Thompson of Mississippi, the ranking Democrat on the committee, said he agreed that there had been problems with the rollout of the ban. But he rejected Mr. Kelly’s testimony that the order had not caused chaos at airports as customs officers tried to determine who would be denied entry.\n\n“They were put in an untenable position. Basically, they were flying by the seat of their pants trying to interpret an E.O. that had no directives to go with it,” Mr. Thompson said, referring to the executive order. “You had L.A. doing one thing, Atlanta doing one thing and J.F.K. doing another. So I’m troubled by the comment that he made that there was no chaos.”\n\nMr. Thompson said he and other members of Congress had requested copies of the guidance that United States Customs and Border Protection sent to its officers after the immigration order was signed, but had not received the information so far. “Our feeling is that the normal vetting that goes with the issuance of an E.O. was not done,” he said.\n\nThe executive order has been criticized by several former high-ranking diplomatic and security officials — among them former Secretary of State John F. Kerry and Leon E. Panetta, the former secretary of defense and C.I.A. director, whom Mr. Kelly worked for at the Pentagon — who said there was “no national security purpose” for the travel ban.\n\nAccording to the report by the legal advocacy groups, the niece of a detained Iranian described how he was not given food for 18 hours and then was physically carried to a plane headed back to Dubai. A Sudanese doctor in the middle of her residency in Cleveland told how her passport had been confiscated while she was detained and not returned until she had been deported to Saudi Arabia, the country she had flown in from.\n\nOver and over, lawyers said they had been unable to reach their clients. The report complained that border agents had “maintained an impenetrable wall between these detained individuals and lawyers.”\n\n“In order to prevent similar rights violations from occurring in the future, we recommend that the Office of Inspector General develop mechanisms to ensure that individuals detained in airports can communicate with legal counsel,” the report said.", "authors": ["Ron Nixon", "Nicholas Kulish"], "publish_date": "2017-02-07", "source": "nytimes", "top_words": ["executive", "travel", "homeland", "ban", "detained", "security", "admits", "secretary", "chief", "rushed", "individuals", "rights", "kelly", "thompson", "order", "mr"], "summary": "In his testimony, Mr. Kelly rejected accusations that inspectors had insulted or mistreated those caught up in the confusion after Mr. Trump signed the order.\n“Everyone was treated humanely,” Mr. Kelly, a retired Marine Corps general recently confirmed as homeland security secretary, told lawmakers.\nRepresentative Michael McCaul, the chairman of the Homeland Security Committee, said the rollout of the executive order had been problematic.\nthat had no directives to go with it,” Mr. Thompson said, referring to the executive order.\ndirector, whom Mr. Kelly worked for at the Pentagon — who said there was “no national security purpose” for the travel ban."}