{"url": "https://www.nytimes.com/2017/02/10/opinion/a-legal-setback-for-trumps-travel-ban.html?mcubz=0", "id": "244", "title": "A Legal Setback for Trump’s Travel Ban", "text": "My daughters are of the Obama generation, the most racially diverse generation yet. They do not fear the “other.” The first president they will remember is a black man with African and Arabic names. Theirs is not the generation of tolerance; it is the generation of acceptance.\n\nThis is Barack Obama’s legacy, and why the Muslim travel ban will be remembered as a vestige of bigotry.\n\nCARLA BENSON\n\nSpokane, Wash.\n\nTo the Editor:\n\nRe “Farmers Backed Trump; Now They’re Worried” (news article, Feb. 10):\n\nThis is a classic example of myopic voting. So zealous about wanting fewer regulations, the farmers backed Donald Trump, not believing he’d actually try to make good on his promise to deport illegal immigrants. Now the farmers are facing the specter of labor shortages.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nI was living in Washington State several years ago, the last time there was a “crackdown” on illegal migrant workers. The orchard owners and farmers were panicking, not having enough labor to harvest their crops. They were offering $125 a day, but no “Americans” showed up to do the backbreaking work. Imagine that! What happened to: “The illegals are stealing our jobs”?\n\nWell, we’re about to find out just how much these “illegals” contribute to our society. When people start paying $3 a head for lettuce perhaps they’ll wake up.\n\nYes, we need immigration reform, but this scorched-earth mentality is cruel, absurd and, ultimately, bad for our nation.\n\nMacKENZIE ALLEN\n\nSanta Fe, N.M.\n\nTo the Editor:\n\nRe “ ‘Bad Dude’? No, but Deported Anyway” (editorial, Feb. 10):\n\nAs an American citizen and the daughter of immigrants, I’m heartbroken that immigration officials elected to deport Guadalupe García de Rayos, a Mexican woman with two American-born children who has lived and worked in this country since the age of 14.\n\nMs. Rayos’s only crime was to use someone else’s Social Security number to obtain legal work. What is particularly galling about this is the fact that just five months after Ms. Rayos’s arrest, the Supreme Court issued a ruling limiting the federal government’s use of identity theft laws to go after undocumented immigrants trying to gain employment. If Ms. Rayos had been stopped a year later, she would have had no criminal conviction on her record, let alone a felony. She would not have faced deportation.\n\nIf President Trump wants to tighten immigration, he should concentrate his efforts on gang members and those convicted of violent crimes. To tear apart a family based on a law that our highest court ruled against is a travesty of justice.\n\nAdvertisement Continue reading the main story\n\nSUZANNE CHAZIN\n\nChappaqua, N.Y.\n\nThe writer is the author of a series of novels about the undocumented.", "authors": [], "publish_date": "2017-02-10", "source": "nytimes", "top_words": ["generation", "travel", "trump", "ban", "immigrants", "immigration", "setback", "trumps", "work", "try", "sign", "undocumented", "york", "farmers", "legal"], "summary": "This is Barack Obama’s legacy, and why the Muslim travel ban will be remembered as a vestige of bigotry.\nCARLA BENSONSpokane, Wash.To the Editor:Re “Farmers Backed Trump; Now They’re Worried” (news article, Feb. 10):This is a classic example of myopic voting.\nMs. Rayos’s only crime was to use someone else’s Social Security number to obtain legal work.\nIf President Trump wants to tighten immigration, he should concentrate his efforts on gang members and those convicted of violent crimes.\nTo tear apart a family based on a law that our highest court ruled against is a travesty of justice."}