{"url": "https://www.nytimes.com/2017/03/05/us/politics/trump-expected-to-issue-new-travel-ban-excluding-iraq-on-monday.html?mcubz=0", "id": "24", "title": "Trump Expected to Issue New Travel Ban Excluding Iraq on Monday", "text": "Trump Expected to Issue New Travel Ban Excluding Iraq on Monday Image President Trump in January. He is is expected to issue on Monday a new version of his executive order on immigration. Credit Doug Mills/The New York Times\n\nWASHINGTON — President Trump is expected to issue on Monday a new version of his executive order on immigration that excludes Iraq, a key ally in the fight against the Islamic State, from a list of predominantly Muslim countries whose citizens will face temporary restrictions on travel to the United States.\n\nThe new order would temporarily stop all refugee admissions to the United States, said a senior administration official familiar with it. The previous version included a 120-day ban on all refugees other than Syrians, who were barred indefinitely.\n\nThe new order removes the extra restrictions on Syrian refugees. It is unclear how long the temporary ban would last.\n\nThe earlier order has been blocked by the courts; the change on refugees is intended to help the new version withstand legal scrutiny. The new order would not affect people with green cards or those holding a valid visa at the time the order is signed.\n\nWhile some provisions in the new order have been relaxed, Mr. Trump and immigration hard-liners in the administration are expected to assert that the new version is no less strict because it retains a temporary ban on refugees.\n\nThe senior administration official said Iraq had been removed from the travel ban after Secretary of State Rex W. Tillerson had discussions with the Iraqi government about its vetting processes. The Iraqi officials insisted that their vetting system was thorough enough on its own.\n\nSome American officials had expressed concern that the restrictions would have affected Iraqis who had worked with the American military as interpreters or in other roles and sought to come to the United States.\n\nThe official said the executive order is expected to be signed on Monday. David Lapan, a spokesman for the Department of Homeland Security, referred all questions about the new executive order to the White House.\n\nMr. Trump’s previous order — which temporarily barred visitors from Iraq, Syria, Sudan, Iran, Somalia, Libya and Yemen — set off chaos and confusion at airports around the world. The new order retains a temporary travel ban on the six countries other than Iraq.\n\nAfter the first order was issued in January, passengers, many of them with green cards that allow them to live and work in the United States, were barred from flights into the country. Other people with visas were suddenly unsure if they would be allowed into the United States, and many of those who managed to arrive were stopped at airports.\n\nWhile the new restrictions are intended to withstand legal scrutiny, they are likely to set off similar court challenges.\n\nThe previous executive order was criticized by several former high-ranking diplomatic and security officials, who said there was no national security purpose for the travel ban.\n\nTrump administration officials, including John F. Kelly, the homeland security secretary, defended the previous restrictions, saying they were needed because the countries listed did not have vetting systems in place that could guarantee that immigrants and other travelers from those nations did not pose a threat to the United States.\n\n“I believe that the travel pause from all of those countries will give us time to evaluate those countries and the information they can provide us, which will ultimately lead to safety for the American people,” Mr. Kelly told a Senate committee last month.\n\nBut an intelligence assessment from Mr. Kelly’s own department said there was little evidence that those travelers posed an unusual threat.\n\nThe three-page report found that “country of citizenship is unlikely to be a reliable indicator of potential terrorist activity.”\n\nThe assessment, first reported by The Associated Press, found that only a small number of people from the seven countries had been involved in terrorism-related activities in the United States since the Syrian civil war began in 2011.\n\nThe report also found that in the past six years, the terrorism threat had reached much more widely than the seven countries listed: People from 26 countries had been “inspired” to carry out attacks in the United States, it said.\n\nThe new order is the first of several security measures planned for America’s borders. Mr. Trump has ordered the Department of Homeland Security to hire an additional 5,000 Border Patrol agents, and Customs and Border Protection has begun accepting design proposals for a wall along the border with Mexico.\n\nMr. Kelly said the administration was considering requiring foreign visitors to provide lists of the websites they have visited. This would enable intelligence officials “to get on those websites to see what they’re looking at,” he told senators last month.\n\nThe United States also made changes to the visa waiver program in 2016 that made it harder for travelers to enter the United States from Europe if they had dual citizenship from Iran, Iraq, Sudan or Syria, or had visited one of those countries, or Libya, Somalia or Yemen, since 2011.\n\nRon Nixon reported from Washington, and Maggie Haberman from New York. Get politics and Washington news updates via Facebook, Twitter and in the Morning Briefing newsletter. Order Reprints | Today’s Paper | Subscribe A version of this article appears in print on , on Page A 14 of the New York edition with the headline: New Version of Travel Ban Is Said to Exclude Iraq\n\n\n\n\n\n\n\nSign Up for the Morning Briefing Get what you need to know to start your day in the United States, Canada and the Americas, delivered to your inbox. SEE SAMPLE Please verify you’re not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. * Required field You agree to receive occasional updates and special offers for The New York Times products and services. * Required field Thank you for subscribing. View all New York Times newsletters. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. Sign Up", "authors": ["Ron Nixon", "Maggie Haberman"], "publish_date": "2017-03-05", "source": "nytimes", "top_words": ["travel", "trump", "ban", "security", "iraq", "order", "version", "united", "states", "countries", "expected", "issue", "york", "excluding"], "summary": "Trump Expected to Issue New Travel Ban Excluding Iraq on Monday Image President Trump in January.\nThe new order would temporarily stop all refugee admissions to the United States, said a senior administration official familiar with it.\nThe senior administration official said Iraq had been removed from the travel ban after Secretary of State Rex W. Tillerson had discussions with the Iraqi government about its vetting processes.\nThe new order retains a temporary travel ban on the six countries other than Iraq.\nThe previous executive order was criticized by several former high-ranking diplomatic and security officials, who said there was no national security purpose for the travel ban."}