{"url": "https://www.nytimes.com/2017/02/18/opinion/sunday/the-social-scientific-case-against-a-muslim-ban.html?mcubz=0", "id": "270", "title": "The Social Scientific Case Against a Muslim Ban", "text": "Photo\n\nThere were many reasons to oppose President Trump’s travel ban on refugees and visitors from seven predominantly Muslim countries, which is now blocked by a federal court’s temporary restraining order. Unfortunately, those same objections are also likely to apply to the revised version of the executive order that Mr. Trump promised on Thursday, which will share with its predecessor the goal of “immediately protecting the country” — presumably by keeping out people from countries he deems to be a threat.\n\nOne objection to such policies is that there is no good evidence that citizens of the countries the president has singled out so far present a significant threat to the United States. Another is that any policy that effectively discriminates against members of a specific religion is decidedly un-American.\n\nBut perhaps the most important objection, given the ostensible goal of protecting national security, is that these are precisely the sort of policies that can increase radicalization of Muslims already on American soil. Recently, a group of former diplomats and national security officials signed an open letter condemning the original ban on that ground, arguing that it would make the country less safe by feeding the narrative that America is anti-Islam.\n\nMr. Trump and his advisers should know that this is not mere speculation; it is grounded in social science. In a study published in 2015 in the journal Behavioral Science and Policy, we showed that policies like Mr. Trump’s ban may very well promote the psychological conditions that fuel the radicalization he seeks to combat.\n\nAdvertisement Continue reading the main story\n\nWe conducted a survey with nearly 200 American Muslims, half of whom were immigrants, half of whom were born in the United States. We asked them about their experiences as religious and cultural minorities, including their feelings of being discriminated against on the basis of their religion. We also asked how they managed their dual identities as Americans and Muslims, and how they felt toward fundamentalist Islamic groups and extremist causes.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nOur findings were clear: The more our participants reported feeling culturally homeless — that is, fully belonging neither to American culture nor to that of another nation — and discriminated against on the basis of their religion, the more they said they experienced a lack of meaning in their lives. In turn, this loss of meaning was associated with greater support for fundamentalist groups and extremist causes.", "authors": ["Sarah Lyons-Padilla", "Michele J. Gelfand", "Gray Matter"], "publish_date": "2017-02-18", "source": "nytimes", "top_words": ["muslims", "case", "policies", "ban", "united", "religion", "countries", "york", "sign", "trumps", "social", "scientific", "muslim", "american"], "summary": "PhotoThere were many reasons to oppose President Trump’s travel ban on refugees and visitors from seven predominantly Muslim countries, which is now blocked by a federal court’s temporary restraining order.\nAnother is that any policy that effectively discriminates against members of a specific religion is decidedly un-American.\nMr. Trump and his advisers should know that this is not mere speculation; it is grounded in social science.\nIn a study published in 2015 in the journal Behavioral Science and Policy, we showed that policies like Mr. Trump’s ban may very well promote the psychological conditions that fuel the radicalization he seeks to combat.\nAdvertisement Continue reading the main storyWe conducted a survey with nearly 200 American Muslims, half of whom were immigrants, half of whom were born in the United States."}