{"url": "https://www.nytimes.com/2017/02/06/us/politics/trump-travel-ban-court.html?mcubz=0", "id": "219", "title": "Justice Department Urges Appeals Court to Reinstate Trump’s Travel Ban", "text": "On Monday, Sean Spicer, the White House press secretary, said the administration stood ready to reinstate the entire ban. “Once we win the case, it will go right back into action,” he said.\n\nLater on Monday night, Mr. Trump called threats “from radical Islamic terrorism is very real.”\n\n“Courts must act fast!” Mr. Trump said on Twitter.\n\nTrial judges around the country have blocked aspects of Mr. Trump’s executive order, which suspended travel from the seven countries and limited the nation’s refugee program, but none of those cases have reached an appeals court. And none of the lower-court rulings were as broad as the one under review in the case, State of Washington v. Trump.\n\nThe Ninth Circuit scheduled the oral argument in the case for Tuesday at 3 p.m. Pacific time. It is to take place by telephone, and the court said it would be live-streamed on its website. Holding an oral argument by telephone in a major case is unusual.\n\nThe case will be heard by Judge William C. Canby Jr., appointed by President Jimmy Carter; Judge Michelle T. Friedland, appointed by President Barack Obama; and Judge Richard R. Clifton, appointed by President George W. Bush.\n\nAt issue is the earlier ruling, by Judge James L. Robart, a federal judge in Seattle, that blocked the key parts of Mr. Trump’s executive order. Judge Robart’s ruling allowed immigrants and travelers who had been barred from entry to come to the United States, and it inspired a harsh attack from Mr. Trump, who accused the judge of endangering national security.\n\nVideo\n\nOn Saturday, the administration asked the Ninth Circuit for an immediate administrative stay of Judge Robart’s ruling without hearing from the plaintiffs, the States of Washington and Minnesota. The court declined, instead asking for more briefs.\n\n\n\nAdvertisement Continue reading the main story\n\nOpponents of Mr. Trump’s targeted travel ban made three kinds of arguments in their submissions to the appeals court, saying that the ban is unlawful, that it represents bad national-security policy, and that it is a threat to the nation’s economy.\n\nA brief from Washington and Minnesota, filed early Monday morning, said that “President Trump unleashed chaos by signing the executive order.”\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nFifteen states and the District of Columbia — including New York, California, Massachusetts and Virginia — filed a supporting brief to argue that allowing the ban to stand would “cause harm to the states, including to state institutions such as public universities, to the businesses that sustain our economies, and to our residents.”\n\nIn a brief filed Saturday, the Trump administration argued that Judge Robart’s order would cause irreparable harm to national security.\n\nIn response, lawyers for Washington and Minnesota said that was not plausible, because it would mean the nation had long been suffering “some unspecified, ongoing irreparable harm.”\n\n“That makes no sense,” the brief said. “As this court has held, preserving the status quo against sudden disruption is often in the interest of all parties.”\n\nOn Monday, the Trump administration responded that the states were asking the courts “to take the extraordinary step of second-guessing a formal national-security judgment made by the president himself pursuant to broad grants of statutory authority.”\n\nIn its earlier brief, the Trump administration urged the Ninth Circuit to reject arguments based on religious discrimination, even though Mr. Trump has said he meant to favor Christian refugees. Judicial consideration of the president’s motives, the administration’s brief said, would violate the separation of powers.\n\nAdvertisement Continue reading the main story\n\nThe states responded that “courts have both the right and the duty to examine defendants’ true motives.”\n\nThey added that the administration had taken “a dizzying number of positions” on whether the executive order applied to permanent residents holding green cards. The order itself appears to cover such people, but the administration has said it will not enforce that part of the order.\n\nQuestions about permanent residents are not moot, the states’ brief said, as the administration could again change positions.\n\nSeveral former diplomatic and national security officials filed a declaration making a second kind of argument. “We view the order as one that ultimately undermines the national security of the United States, rather than making us safer,” it said. “In our professional opinion, this order cannot be justified on national security or foreign policy grounds.”\n\nThe officials filing the declaration included John Kerry, a secretary of state under Mr. Obama; Madeleine K. Albright, who held the same position under President Bill Clinton; Susan E. Rice, Mr. Obama’s national security adviser; and Leon E. Panetta, secretary of defense and director of the C.I.A. under Mr. Obama.\n\nMr. Trump’s order, the officials said, would endanger American troops and intelligence sources, disrupt counterterrorism and law enforcement efforts, damage the economy and have “a devastating humanitarian impact.”\n\n“And apart from all of these concerns,” the former officials said, “the order offends our nation’s laws and values.”\n\nThe third front in the legal battle against Mr. Trump’s order was opened by the technology industry and other businesses.\n\nAlmost 100 companies, including Apple, Facebook and Google, urged the Ninth Circuit to continue to block the order, saying it “harms the competitiveness of U.S. companies.”\n\nAdvertisement Continue reading the main story\n\nThe “instability and uncertainty” created by the order, the brief said, “will make it far more difficult and expensive for U.S. companies to hire some of the world’s best talent — and impede them from competing in the global marketplace.”", "authors": ["Adam Liptak"], "publish_date": "2017-02-06", "source": "nytimes", "top_words": ["travel", "administration", "trump", "national", "ban", "appeals", "brief", "judge", "court", "states", "trumps", "reinstate", "urges", "justice", "order", "president", "department", "mr"], "summary": "Later on Monday night, Mr. Trump called threats “from radical Islamic terrorism is very real.”“Courts must act fast!” Mr. Trump said on Twitter.\nTrial judges around the country have blocked aspects of Mr. Trump’s executive order, which suspended travel from the seven countries and limited the nation’s refugee program, but none of those cases have reached an appeals court.\nAt issue is the earlier ruling, by Judge James L. Robart, a federal judge in Seattle, that blocked the key parts of Mr. Trump’s executive order.\nAdvertisement Continue reading the main storyOpponents of Mr. Trump’s targeted travel ban made three kinds of arguments in their submissions to the appeals court, saying that the ban is unlawful, that it represents bad national-security policy, and that it is a threat to the nation’s economy.\nQuestions about permanent residents are not moot, the states’ brief said, as the administration could again change positions."}