{"url": "https://www.nytimes.com/2017/02/08/opinion/after-mr-trumps-din-the-quiet-grandeur-of-the-courts.html?mcubz=0", "id": "232", "title": "After Mr. Trump’s Din, the Quiet Grandeur of the Courts", "text": "Photo\n\nThe most reassuring sound in these rancorous early days of the Trump administration was the legal debate, at times arcane, over the president’s travel ban during live-streamed oral arguments in a federal appeals court on Tuesday.\n\nNo gratuitous insults, no personal threats or childish tantrum — only judges and lawyers debating complex legal issues with respect and restraint. It was the sound of grown-ups taking responsibility for governing the country, and for people’s lives.\n\nContrast that with the unfiltered outbursts Americans have endured from President Trump in the chaotic days since he signed his slapdash order suspending entry for people from seven predominantly Muslim countries, and all refugees.\n\nMr. Trump’s attacks on judges who questioned his order were too much even for his nominee to the Supreme Court, Judge Neil Gorsuch of the federal appeals court in Denver. Judge Gorsuch called the comments “demoralizing” and “disheartening,” according to a senator with whom he met on Capitol Hill on Wednesday.\n\nAdvertisement Continue reading the main story\n\nMr. Trump — who has a toddler’s aversion to the word “no” — berated a federal judge who temporarily blocked the order last week, calling him a “so-called” judge on Twitter. He then warned that the judge, and the entire court system, could be responsible for any future terrorist attacks that might occur.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe three-judge panel of the Court of Appeals for the Ninth Circuit, based in San Francisco, appeared skeptical of the administration’s argument on Tuesday that the executive order is essentially unreviewable. It has yet not issued a ruling, but that didn’t stop Mr. Trump, who wrote early Wednesday morning on Twitter, “If the U.S. does not win this case as it so obviously should, we can never have the security and safety to which we are entitled. Politics!”", "authors": ["The Editorial Board"], "publish_date": "2017-02-08", "source": "nytimes", "top_words": ["courts", "trump", "appeals", "judge", "court", "twitter", "trumps", "din", "times", "quiet", "grandeur", "sign", "federal", "order", "york", "mr"], "summary": "Mr. Trump’s attacks on judges who questioned his order were too much even for his nominee to the Supreme Court, Judge Neil Gorsuch of the federal appeals court in Denver.\nJudge Gorsuch called the comments “demoralizing” and “disheartening,” according to a senator with whom he met on Capitol Hill on Wednesday.\nHe then warned that the judge, and the entire court system, could be responsible for any future terrorist attacks that might occur.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\nView all New York Times newsletters."}