{"url": "https://www.nytimes.com/2017/02/06/opinion/im-afraid-it-will-make-terrorism-worse.html?mcubz=0", "id": "215", "title": "‘I’m Afraid It Will Make Terrorism Worse’", "text": "No refugee from any of the seven countries has committed a terrorist attack in the United States. If anything, American involvement in most of these countries has only exacerbated the flow of refugees. Last week, as I learned about Mr. Trump’s ban, I was hit by news that an American raid in Yemen had killed civilians, including an 8-year-old girl, Noura al-Awlaqi. How can the United States kill Yemenis while simultaneously barring civilians from seeking refuge here?\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Trump should end the use of military drones, or stop selling arms to Saudi Arabia. This at least would engender more trust of the United States in Yemen, since drones and the Saudi-led coalition have killed many civilians there.\n\nThe ban, if it is upheld, certainly won’t deter terrorism. I am afraid it will make things only worse. Radical groups will use this move to generate more hostility toward America, which now appears to endorse discrimination against Muslims. I am worried for other Muslims who live here, because Mr. Trump’s stance has increased hate crimes against immigrants like them. Even if the ban lasts only a short time, it has already done great harm.\n\nIt’s also insulting. People come to this country because they seek protection, refuge, a better life. But that doesn’t mean it is easy. So many people in the countries targeted by the ban are in danger, but leaving still means abandoning their homes and often their family. My own decision to study in America was much easier, but still bittersweet. I had to leave my family and my husband, whom I married only a year ago.\n\nEven before the current uncertainty, it was very difficult for Yemenis to get into the United States, so my husband and I knew we would face long periods of separation. But I was planning to see him in Yemen during the summer while he works on the papers to visit me here. Now we both have little confidence in that.\n\nWhen I talked to my husband last week, he said: “Everything is going to be fine. Don’t do anything reckless by leaving the country and coming back home.” He reminded me that I’m a strong woman and this education is the opportunity of a lifetime. He joked with me, saying he was really sorry, but he just wouldn’t be able to make it to Stanford to help me through this. I can’t imagine not being able to see him for another year, let alone four.\n\nHis optimistic spirit reminded me that Yemenis, exhausted as they are, and in the face of so much danger, still manage to laugh, to chat, to make jokes, as they move bravely through each day.\n\nThat level of courage in the face of fear is something I hope for Americans as well. For so long, this country has been a beacon of freedom, equality and justice — one that the rest of the world admires. This is the time for Americans to defend the values they stand for, the values the world loves.", "authors": ["Hadil Mansoor Al-Mowafak", "On Campus"], "publish_date": "2017-02-06", "source": "nytimes", "top_words": ["yemenis", "world", "yemen", "ban", "worse", "face", "husband", "united", "states", "country", "sign", "afraid", "im", "terrorism"], "summary": "No refugee from any of the seven countries has committed a terrorist attack in the United States.\nHow can the United States kill Yemenis while simultaneously barring civilians from seeking refuge here?\nThis at least would engender more trust of the United States in Yemen, since drones and the Saudi-led coalition have killed many civilians there.\nI am afraid it will make things only worse.\nFor so long, this country has been a beacon of freedom, equality and justice — one that the rest of the world admires."}