{"url": "https://www.nytimes.com/2017/02/07/us/politics/donald-trump-administration.html?mcubz=0", "id": "223", "title": "DeVos Is Confirmed as Education Secretary; Melania Trump Settles Libel Suit Against Blogger", "text": "While Ms. DeVos was confirmed, 51 to 50, thanks to Mr. Pence and the support of another important constituent:\n\nTrump bemoans ‘the haters’\n\nPresident Trump’s foreign-policy-by-tweet approach continued Tuesday morning, with the president suggesting on Twitter that “haters” were unfairly criticizing his praise of Mr. Putin.\n\nThe post appears to be a direct response to the criticism Mr. Trump received for his comments during a Fox News interview. In that interview, he seemed to defend Mr. Putin’s brutality while saying that American political leaders have “killed” people too.\n\nThe president appears to think that the avalanche of criticism he received is unfair, even though his insistence that he doesn’t know Mr. Putin or have deals in Russia is unrelated to his praise of the Russian president.\n\nWhat’s next on Trump’s immigration order?\n\nThe website of the federal appeals court in San Francisco is about to be tested.\n\nThe court will hear arguments at 3 p.m. Pacific time on Tuesday on the Trump administration’s emergency request to reinstate Mr. Trump’s executive order suspending travel from seven predominantly Muslim countries and limiting the nation’s refugee program.\n\nThe argument in the fast-moving case will be heard by telephone, and the court at first said it would release a recording afterward. An hour and a half later, the court thought better of the delay, now saying the hearing would be live-streamed on its site.\n\nYou can listen to a live stream of the arguments here:\n\nThe president had some thoughts to share on the subject.\n\nPaul D. Ryan as Trump translator\n\nFor a moment, House Speaker Paul D. Ryan seemed to be in the clear.\n\nAmid the now-typical deluge of questions for Mr. Ryan about the latest explosive comment from Mr. Trump, a reporter acknowledged the speaker’s standard reply: that he does not tend to comment on the “tweet of the day.”\n\nAdvertisement Continue reading the main story\n\n“You got my talking points down already!” Mr. Ryan said, perking up.\n\nHe did elaborate, though, steering clear of any remark that could be construed as a knock on the president.\n\nOn the subject of Mr. Trump’s insistence that the news media had willfully ignored or played down international terrorist attacks: “I can’t speak to whether or not you’re over or underreporting something. That’s your job. I’ll stick with doing mine.”\n\nOn Mr. Trump attacking who he called the “so-called judge” responsible for blocking the president’s immigration order: “Look, he’s not the first president to get frustrated with a ruling from a court.”\n\nOn the uncertainty wrought by the president’s recent suggestion that the Affordable Care Act might not be replaced until next year: “I think there’s a little confusion here.”\n\nThe legislative process will have played out this year, Mr. Ryan said. “The question is, how long does it take to implement the full replacement of Obamacare?”\n\nMelania Trump settles libel lawsuit\n\nFirst lady Melania Trump has settled a libel lawsuit against a Maryland blogger over a blog post published in August that she said contained “false and defamatory statements,” including that she once worked as a high-end escort.\n\nThe lawsuit, which was filed in September in Montgomery County, Md., pertained to a post that Webster G. Tarpley had published on his blog, Tarpley.net, in early August.\n\nMr. Tarpley retracted the post on Aug. 22 and issued an apology to Mrs. Trump. In a statement, Mr. Tarpley again issued a retraction and apologized to Mrs. Trump for publishing a post that was “replete with false and defamatory statements about her.”\n\nAdvertisement Continue reading the main story\n\n“I acknowledge that these false statements were very harmful and hurtful to Mrs. Trump and her family, and therefore I sincerely apologize to Mrs. Trump, her son, her husband and her parents for making these false statements,” he said.\n\nCharles J. Harder, a lawyer for Mrs. Trump, said in statement on his client’s behalf that Mr. Tarpley had agreed to pay Mrs. Trump “a substantial sum as a settlement.”\n\nIn addition to Mr. Tarpley, Mrs. Trump sued the publisher of The Daily Mail for libel. (The Daily Mail also published a retraction and apology.) A Maryland judge dismissed the lawsuit against The Daily Mail publisher last week after determining that Maryland courts do not have jurisdiction over Mrs. Trump’s claims; the lawsuit was refiled on Monday in New York State Court.\n\nBernie Sanders and Ted Cruz will debate\n\nSenators Bernie Sanders of Vermont and Ted Cruz of Texas will square off in a debate that liberal and conservative purists probably would have preferred in 2016 — a bronze medal game, of sorts, for the presidency.\n\nThe CNN town hall-style meeting will focus largely on the Affordable Care Act in the age of Trump. We’ll bring real-time analysis — policy, yuks, everything in between — from the reporters who covered the pair during their presidential runs and from a health policy expert.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMatt Flegenheimer, @mattfleg on Twitter, who covered Mr. Cruz; Yamiche Alcindor, @yamiche, who covered Mr. Sanders; and Margot Sanger-Katz, @sangerkatz, who writes extensively on health care policy, will be sorting out the facts from the froth.\n\nMake it a two-screen experience. The debate begins at 9 p.m. Eastern time.", "authors": ["Emmarie Huetteman", "Sydney Ember", "Michael D. Shear", "Matt Flegenheimer"], "publish_date": "2017-02-07", "source": "nytimes", "top_words": ["mrs", "suit", "trump", "tarpley", "libel", "blogger", "post", "secretary", "devos", "trumps", "ryan", "statements", "lawsuit", "president", "melania", "education", "mr", "settles", "confirmed"], "summary": "The post appears to be a direct response to the criticism Mr. Trump received for his comments during a Fox News interview.\nPaul D. Ryan as Trump translatorFor a moment, House Speaker Paul D. Ryan seemed to be in the clear.\nOn the subject of Mr. Trump’s insistence that the news media had willfully ignored or played down international terrorist attacks: “I can’t speak to whether or not you’re over or underreporting something.\nMr. Tarpley retracted the post on Aug. 22 and issued an apology to Mrs. Trump.\nHarder, a lawyer for Mrs. Trump, said in statement on his client’s behalf that Mr. Tarpley had agreed to pay Mrs. Trump “a substantial sum as a settlement.”In addition to Mr. Tarpley, Mrs. Trump sued the publisher of The Daily Mail for libel."}