{"url": "https://www.nytimes.com/2017/02/27/us/politics/george-w-bush-criticism-trump.html?mcubz=0", "id": "284", "title": "Former President George W. Bush Levels Tacit Criticism at Trump", "text": "“I consider the media to be indispensable to democracy,” Mr. Bush told Matt Lauer, the “Today” host. “We need the media to hold people like me to account. I mean, power can be very addictive and it can be corrosive and it’s important for the media to call to account people who abuse their power, whether it be here or elsewhere.”\n\nHe seemed to suggest that language like Mr. Trump’s made it more difficult to press authoritarian leaders like President Vladimir V. Putin of Russia to tolerate a free press. “It’s kind of hard to, you know, tell others to have an independent free press when we’re not willing to have one ourselves,” he said.\n\nPhoto\n\nMr. Bush also urged tolerance when asked about Mr. Trump’s efforts to temporarily ban travelers from seven predominantly Muslim countries. As president, Mr. Bush made a point of visiting a mosque after the attacks of Sept. 11, 2001, and regularly insisted that the United States was not at war with Islam.\n\n“It’s very important for all of us to recognize one of our great strengths is for people to worship the way they want to or not worship at all,” Mr. Bush said. “I mean the bedrock of our freedom — a bedrock of our freedom is the right to worship freely.”\n\nAsked if he supported a ban on Muslim visitors to the United States, the former president said, “I am for an immigration policy that’s welcoming and upholds the law.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut Mr. Bush, who has emphasized the importance of not criticizing a successor, tried to avoid seeming too critical of Mr. Trump. “Well, first of all, there’s only been one month in office,” he said. “Secondly, I think you have to take the man for his word that he wants to unify the country, and we’ll see whether he’s able to do so.”\n\nMr. Bush agreed to give interviews to publicize his book, “Portraits of Courage: A Commander in Chief’s Tribute to America’s Warriors,” published by Crown Publishing. The book, his third since leaving office, is a collection of 66 portraits of military veterans he has gotten to know personally. It also includes a four-panel mural he painted of several active and former members of the military. The paintings will be displayed at his presidential center in Dallas from March to October.\n\nMr. Bush picked up painting after leaving office when the historian John Lewis Gaddis mentioned that it was a hobby of Winston Churchill’s. The former president’s initial efforts focused on his pets as subjects. Then he painted a series of portraits of world leaders he met while in office, including Mr. Putin, and displayed them at his center.\n\nMr. Bush, who as commander in chief ordered American forces into Afghanistan and Iraq, hosts regular bicycle rides and golf tournaments with wounded veterans and decided to make them his next focus. He started painting them in September 2015. Some of the portraits in the book show veterans with prosthetic limbs. A few depict amputees playing golf.\n\nAdvertisement Continue reading the main story\n\n“I painted these men and women as a way to honor their service to the country and to show my respect for their sacrifice and courage,” he wrote in the book. “I hope to draw attention to the challenges some face when they come home and transition to civilian life — and the need for our country to better address them.”", "authors": ["Peter Baker"], "publish_date": "2017-02-27", "source": "nytimes", "top_words": ["book", "veterans", "tacit", "trump", "george", "office", "painted", "worship", "portraits", "levels", "press", "w", "president", "criticism", "mr", "bush"], "summary": "“I consider the media to be indispensable to democracy,” Mr. Bush told Matt Lauer, the “Today” host.\nPhotoMr. Bush also urged tolerance when asked about Mr. Trump’s efforts to temporarily ban travelers from seven predominantly Muslim countries.\nAs president, Mr. Bush made a point of visiting a mosque after the attacks of Sept. 11, 2001, and regularly insisted that the United States was not at war with Islam.\nBut Mr. Bush, who has emphasized the importance of not criticizing a successor, tried to avoid seeming too critical of Mr. Trump.\nMr. Bush picked up painting after leaving office when the historian John Lewis Gaddis mentioned that it was a hobby of Winston Churchill’s."}