{"url": "https://www.nytimes.com/2017/02/09/insider/good-bad-and-mad-andrew-rosenthal-on-the-news.html?mcubz=0", "id": "237", "title": "Good, Bad and Mad: Andrew Rosenthal on the News", "text": "Photo\n\nWhat is Andrew Rosenthal mad about this week? Yes, Donald Trump, “with his Twitter finger twitching at all hours and his caps lock key on,” Mr. Rosenthal says the president and his team are “acting like a bunch of middle-school mean kids and spewing out an endless stream of blatant lies and personal insults” instead of grappling with the big issues Mr. Trump says he was elected to address.\n\nThe bad news of the week: “The sad state of the United States Senate.” The latest idiocy, says Mr. Rosenthal, came while the Senate was “debating” Senator Jeffrey Session’s nomination for attorney general.\n\nLast, the good news. Several judges stayed the effects of President Trump’s anti-Muslim and refugee travel ban. The question of the ban’s constitutionality will likely proceed to the Supreme Court, where its fate is uncertain. “But it was good to see that we still have three branches of government in this country, and one of them is independent.”\n\nSusan Lehman is host.", "authors": ["Susan Lehman", "Insider Podcasts"], "publish_date": "2017-02-09", "source": "nytimes", "top_words": ["mr", "good", "trump", "bad", "uncertain", "rosenthal", "week", "united", "yes", "mad", "president", "senate", "andrew"], "summary": "PhotoWhat is Andrew Rosenthal mad about this week?\nThe bad news of the week: “The sad state of the United States Senate.” The latest idiocy, says Mr. Rosenthal, came while the Senate was “debating” Senator Jeffrey Session’s nomination for attorney general.\nLast, the good news.\nThe question of the ban’s constitutionality will likely proceed to the Supreme Court, where its fate is uncertain.\n“But it was good to see that we still have three branches of government in this country, and one of them is independent.”Susan Lehman is host."}