{"url": "http://nytlive.nytimes.com/womenintheworld/2017/01/27/iranian-actress-to-boycott-oscars-over-racist-plan-to-suspend-immigration-from-muslim-countries/?mcubz=0", "id": "2", "title": "Iranian actress planned to boycott Oscars over ‘racist’ suspension of immigration from 7 Muslim countries", "text": "Iranian actress Taraneh Alidoosti, co-star of The Salesman, an Iranian film nominated for an Academy Award in the foreign-language category, has said she intends on boycotting the award ceremony in protest of President Donald Trump’s plan to temporarily suspend immigration from predominantly Muslim countries such as Iran, Iraq, Libya, Somalia, Sudan, Syria, and Yemen. On Friday afternoon, Trump signed an executive order suspending citizens of the aforementioned countries temporarily — except Syria, for which the travel ban is indefinite. The move set off chaos at airports around the country and world on Saturday as the U.S. Department of Homeland Security began to enforce the order. A global uproar ensued, but Alidoosti was well ahead of the curve on the travel ban.\n\n“Trump’s visa ban for Iranians is racist,” wrote Alidoosti in a post on Twitter a day before Trump enacted the travel ban. “Whether this will include a cultural event or not, I won’t attend the #AcademyAwards 2017 in protest.” Now, it appears she wouldn’t be able to attend the event event if she wanted to. The film’s director, Asghar Farhadi, also would be barred from attending under the current executive order and on Sunday told The New York Times he wouldn’t attend the event even if he’s allowed to do so.\n\nTrump's visa ban for Iranians is racist. Whether this will include a cultural event or not,I won't attend the #AcademyAwards 2017 in protest pic.twitter.com/CW3EF6mupo — Taraneh Alidoosti (@t_alidoosti) January 26, 2017\n\nIn an interview conducted over email, Alidoosti told The New York Times she would not attend the ceremony even if she were able to obtain a visa in spite of the ban.\n\n“I decided not to go even if I could, because it hurts me deeply to see ordinary people of my country being rejected for what might be their legal right to have access to their children abroad or to their school classes as students,” the actress explained.\n\n“I’m sure the United States has also benefited many times from Iranian immigrants and people who have worked there and served that country,” she added. “So it’s not acceptable to me to respect a state that does not respect the people of my country.”\n\nThe Salesman tells the story of a Tehran couple’s deteriorating relationship as they take part in an amateur production of famed Arthur Miller play, Death of a Salesman. The film’s director, Asghar Farhadi, had previously won an Oscar for best foreign language film in 2012 for A Separation.\n\nWatch the video below for more on the story.\n\nRead the full story at The New York Times.\n\nRelated:\n\nThis affable and controversial woman is firing up anti-Islamic sentiment in the U.S.\n\nFearing attacks, Muslim women are taking measures to protect themselves\n\nThe headscarf, fear and Islamophobia in the heart of America", "authors": ["Witw Staff"], "publish_date": "2017-01-27", "source": "nytimes", "top_words": ["travel", "salesman", "racist", "actress", "ban", "immigration", "oscars", "attend", "iranian", "york", "countries", "times", "boycott", "protest", "suspension", "muslim", "event", "alidoosti", "visa", "planned"], "summary": "On Friday afternoon, Trump signed an executive order suspending citizens of the aforementioned countries temporarily — except Syria, for which the travel ban is indefinite.\nA global uproar ensued, but Alidoosti was well ahead of the curve on the travel ban.\n“Trump’s visa ban for Iranians is racist,” wrote Alidoosti in a post on Twitter a day before Trump enacted the travel ban.\nTrump's visa ban for Iranians is racist.\nRead the full story at The New York Times."}