{"url": "https://www.nytimes.com/2017/02/06/business/trumps-travel-ban-hits-close-to-home-for-corporate-travelers.html?mcubz=0", "id": "210", "title": "Trump’s Travel Ban Hits Close to Home for Corporate Travelers", "text": "Similar tales of disruption are being told across the country, though for now the order has been temporarily stayed by a federal judge. A quick survey by the Association of Corporate Travel Executives, conducted three days after the executive order was issued, found that the repercussions in the business travel community were swift. Nearly four in 10 executives said the travel ban would curtail their company’s business travel.\n\n“People like certainty, travelers like certainty, companies like certainty,” said Greeley Koch, the group’s executive director. In the absence of that, he said, “they’ll just err on the side of caution and not take the trip.”\n\nSteve Rudner, founder and managing partner at Rudner Law Offices, a firm that represents hotels, said that one corporate group of about 40 scheduled to arrive last Friday at a Florida hotel he represents canceled at the last minute over concerns that the company’s chief executive, a Canadian resident with dual Canadian-Iranian citizenship, would not be able to enter the United States.\n\n“Anytime, as a country, we throw up a sign that says certain people are not welcome, certain people will be detained or denied entry, there are many groups who will not want to risk denial of entry,” Mr. Rudner said. He estimated the group could forfeit as much as $58,000 because of the last-minute cancellation. “Many groups will just look to move the meeting elsewhere,” he added.\n\nMichael W. McCormick, executive director and chief operating officer of the Global Business Travel Association, offered a similar prediction. “You’re dealing with a perception and whether people are going to postpone that trip or find another way in the near term to accomplish their business,” he said.\n\nA member survey conducted online early last week found that nearly a third of travel managers said their companies were cutting back on business travel in the immediate aftermath of the order. More than half expressed worry that there would be uncertainty in the future about whether a green card or approved visa would be considered valid for entry to the United States, and more than one in four predicted that the executive order would lead to a long-term reduction in business travel.\n\n“That’s a concern — you start talking about that impact,” Mr. McCormick said. “What we’re seeing from companies is that there will be a short- and long-term impact and reduction in business travel.”\n\nPhoto\n\nFor many meeting and convention organizers, the long lead time they need for planning means that even events not taking place for months are stuck in a holding pattern.\n\nAdvertisement Continue reading the main story\n\nDebbie Baker, owner of an independent meeting planning company, said she was waiting to sign hotel contracts for a Las Vegas meeting scheduled for the fall. The client, a mining and generating company, has about 20 percent of its attendees coming from overseas. “Because they have offices in every country, they have V.P.s in every country as well,” she said.\n\nMs. Baker said she was worried that she could lose the client’s business entirely. “If they canceled the meeting, it would be an astronomical amount of money I’d lose,” she said. “They might decide to hold it in Saudi Arabia or someplace like that, in which case I would lose the whole meeting.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe big question is what happens next. “As we talk about the economy and creating jobs, the last thing you want to do is put something in place that has the tendency to reduce travel,” Mr. Koch said.\n\nJoseph Parilla, a fellow at the Brookings Institution’s Metropolitan Policy Program, warned that perceptions of either uncertainty or hostility — if not both — could be corrosive to the domestic travel industry.\n\n“If our foreign policy becomes more antagonistic, one could posit that would influence people’s decision to come to the United States,” he said. “If you don’t feel like you’re welcome, even if the policy isn’t directly targeting you, that may change your view of whether you’d feel comfortable traveling in that country,” a sentiment that meeting and event planners say they are already hearing from worried constituents.\n\n“These policies are not helpful,” Mr. Parilla said, predicting that groups would gravitate to more welcoming destinations. “We’re not the only game in town,” he added.\n\nThis has already started to happen. At the biennial conclave of the World Federation of Tourist Guide Associations in Tehran last week, where 300 to 400 professional tour guides from around the world gathered, a contingent from the Guides Association of New York City presented their group’s bid to bring the event to New York in 2019.\n\n“If the entire vote was based on that evening, we would’ve had it in the bag,” said Matthew Baker, past president of the New York association and a member of the bid committee. “There was a tremendous amount of good feedback from everyone, especially our Iranian hosts.”\n\nAdvertisement Continue reading the main story\n\nThen, word started trickling in about the travel ban, and the confidence turned to anxiety.\n\n“I started receiving reports from my colleagues around the world — everyone was worried about getting a visa into the U.S.,” Mr. Baker said. “One of our Iranian hosts was elected to the new executive board, so there was the concern about one of our executive board members not being able to attend a convention he was supposed to be organizing.”\n\nUltimately, the roughly 50 delegates voting for the next convention site chose Tbilisi in the Republic of Georgia over New York. Mr. Baker said the Iranian tour guides at the convention sympathized with his delegation’s situation, noting their own challenges promoting their country as a tourist destination in the face of travel restrictions and sanctions.\n\nEven though a relatively small number of the participants were from the seven nations affected by the travel ban, delegates from other countries worried that this early signal from the new American administration foreshadowed potential trouble down the road.\n\n“If we can have a ban on seven countries now,” Mr. Baker said, “what can happen in the future?”", "authors": ["Martha C. White"], "publish_date": "2017-02-06", "source": "nytimes", "top_words": ["executive", "travel", "ban", "worried", "corporate", "travelers", "close", "trumps", "country", "meeting", "groups", "hits", "york", "baker", "mr", "business"], "summary": "A quick survey by the Association of Corporate Travel Executives, conducted three days after the executive order was issued, found that the repercussions in the business travel community were swift.\nNearly four in 10 executives said the travel ban would curtail their company’s business travel.\n“People like certainty, travelers like certainty, companies like certainty,” said Greeley Koch, the group’s executive director.\nMichael W. McCormick, executive director and chief operating officer of the Global Business Travel Association, offered a similar prediction.\n“If we can have a ban on seven countries now,” Mr. Baker said, “what can happen in the future?”"}