{"url": "https://www.nytimes.com/2017/02/12/world/world-diplomats-trump-nikki-haley.html?mcubz=0", "id": "259", "title": "World’s Diplomats, Seeking a Bridge to Trump, Look to Haley", "text": "His travel ban on seven Muslim-majority nations has given ballast to the Islamic State, his somersaults on Taiwan are seen to have strengthened China’s hand, and his unpleasant exchanges with the leaders of close allies like Mexico and Australia have left many diplomats wondering whether they can count on the world’s most powerful nation as a reliable partner.\n\nMr. Trump’s supporters see his edicts and outbursts as perfectly consistent with his campaign promise to upend the establishment, reassert America’s primacy and put all on notice not to trifle with him — a kind of chaos theory of foreign-policy management to leave everyone guessing, all the time.\n\nFor America’s friends in the world, the uncertainty is complicated by not knowing exactly whom to talk to. The warrens of the State Department are unusually empty. Obama administration officials have packed up; new appointments have yet to be made. And a series of contradictory statements have emerged from cabinet officials about crucial issues — not least Russia.\n\nPhoto\n\nMr. Trump has continued to express his admiration for his counterpart in the Kremlin, Vladimir V. Putin. Yet Ms. Haley has taken a different posture. In both her confirmation hearing and in her first open remarks in the Security Council, she condemned Russia’s “aggressive actions” in Ukraine and insisted that United States sanctions on Moscow would remain.\n\nSeveral Western envoys breathed a sigh of relief, but not without doubts. Was she speaking for herself, or for the administration? Was the inconsistency deliberate, or did it reflect a lack of consensus? Who is setting United States policy, and whom should they be talking to?\n\n“Unanswerable right now,” advised Kathleen Hicks, a Pentagon official under President Barack Obama and now a senior vice president at the Center for Strategic and International Studies in Washington. “They’re smartest to have multiple points of entry. Backups to backups.”\n\nAdvertisement Continue reading the main story\n\nMs. Haley will have to weigh in on difficult, contentious issues that are already on the United Nations’ agenda: how to save South Sudan from what could be a genocide, say, or whether to punish the president of Syria, Bashar al-Assad, for unleashing chemical weapons on his people, or how to stanch the spread of terrorism in West Africa.\n\nYet she has not expressed opinions on much. On Twitter, she posted selfies with her husband, Michael, and a YouTube video of Billy Joel singing “New York State of Mind.” She admitted to being excited to see the movie “Deepwater Horizon,” and offered a new hashtag: #WeekendsInNYC.\n\nOn the last Sunday of January, as Mr. Trump’s travel ban left immigrants and refugees stranded across the world, Ms. Haley wrote a Twitter post about her husband driving up to New York with the family’s pets, including two frogs and a fish.\n\nOn Saturday night, after North Korea tested a missile, Ms. Haley posted a Twitter message about her admiration for Joan Jett, the 1980s rock star.\n\nWhat kind of influence she may have on the White House remains unknown. She is far from being a confidante of Mr. Trump’s, and it’s unclear how much sway she will have over him on any of the big crises facing the world.\n\n“Nikki Haley will be a perfectly normal politician sent to be ambassador,” said Eliot A. Cohen, a former Bush administration official. Mr. Trump, he warned, has “instincts and prejudices which are out of the norm of American diplomatic belief and practice.”\n\nThe diplomatic corps is queuing up to see her — and those who score face time are wasting no time sharing it. “The #SpecialRelationship comes to @UN,” the British ambassador, Matthew Rycroft, posted on Twitter, along with a photo of the two of them shoulder to shoulder.\n\n“Very positive meeting,” offered the Ukrainian ambassador, Volodymyr Y. Yelchenko, posting a picture of his own.\n\nAt a crowded reception one recent evening, one diplomat described the first weeks of the Trump presidency as “surreal,” as though he were describing a Luis Buñuel movie. Then he spotted Ms. Haley and deftly snaked through the crowd to introduce himself.\n\nPhoto\n\nAdvertisement Continue reading the main story\n\nI spoke to more than a dozen diplomats for this article, and nearly all described Ms. Haley, the former governor of South Carolina, as a natural politician and a refreshing contrast to the president. “Cordial,” one envoy said. “Businesslike,” said another.\n\n“We need to find a way to engage with the new administration, particularly with Ambassador Haley, and to explore with them what we can do together,” said João Vale de Almeida, the envoy representing the European Union’s 28 member nations. “In doing so, we should try to avoid dangers and pitfalls.”\n\nVitaly I. Churkin, the Russian ambassador and perhaps Ms. Haley’s most important colleague on the Council, complimented her “very powerful record” as governor. On Twitter, he said cryptically that he looked forward to working with her according to the “mind-set of their capitals.” (Her boss, in Washington, has lavished praise on his, in Moscow.)\n\nFew people at the United Nations need to be on her good list more than the man who heads the world body, António Guterres.\n\nMr. Trump has dismissed Mr. Guterres’s entire operation as a social club. Republicans in Congress have threatened to pull funding. And Ms. Haley has made it clear that she intends to scrutinize how the United Nations spends its money and eliminate things that do not serve United States interests, while also taking pains to say she would not take a “slash and burn” approach.\n\nThe United States pays for more than a fifth of the United Nations’ core budget, and controls key jobs in the world body’s system. So Mr. Guterres must strike a balance between keeping United States officials on board and not being seen as subservient to United States interests.\n\nAdvertisement Continue reading the main story\n\nHe faced that challenge over Mr. Trump’s travel ban. Mr. Guterres was criticized as not speaking out against it directly enough, quickly enough. Finally, he told reporters that the restrictions “violate our basic principles” and called for them to be discontinued.\n\nMr. Guterres is a former socialist prime minister of Portugal. Ms. Haley is a conservative from the American South. But both are politicians, as Richard Gowan, a research fellow at the European Council on Foreign Relations, pointed out. And, he argued, they could help each other — Ms. Haley in prodding him to show that America gets value at the United Nations, Mr. Guterres by using pressure from her to make the reforms he thinks are necessary.\n\nAs Mr. Gowan put it in a recent essay, “Their political fortunes are inseparable.”", "authors": ["Somini Sengupta"], "publish_date": "2017-02-12", "source": "nytimes", "top_words": ["ambassador", "world", "trump", "bridge", "united", "states", "twitter", "trumps", "diplomats", "ms", "haley", "nations", "seeking", "mr", "look", "worlds"], "summary": "Yet Ms. Haley has taken a different posture.\nWho is setting United States policy, and whom should they be talking to?\nThen he spotted Ms. Haley and deftly snaked through the crowd to introduce himself.\nSo Mr. Guterres must strike a balance between keeping United States officials on board and not being seen as subservient to United States interests.\nMs. Haley is a conservative from the American South."}