{"url": "https://www.nytimes.com/2017/02/08/briefing/travel-ban-vladimir-putin-carbon-tax.html?mcubz=0", "id": "230", "title": "Ivanka Trump, Alexei Navalny, Travel Ban: Your Morning Briefing", "text": "Ms. Warren, a Democratic senator, was formally silenced during the debate over Jeff Sessions, who was confirmed as President Trump’s attorney general after a bitter and racially charged nomination.\n\n_____\n\nPhoto\n\n• The White House is finishing an executive order for the Pentagon to bring future Islamic State detainees to Guantánamo Bay prison, according to administration officials and a draft order obtained by The Times.\n\nYemen has withdrawn permission for U.S. Special Operations ground missions in its country amid outrage over civilian casualties in a commando raid, the first authorized by Mr. Trump. Above, graffiti in the Yemeni capital.\n\n_____\n\nVideo\n\n• The wall the U.S. intends to build between the U.S. and Mexico already exists in some stretches.\n\nOur reporters spoke to people who live in those areas divided by walls, fences, rivers and other barricades. Standing next to a steel fence in Texas, Selena Aguirre, 20, said: “It’s a barbaric way to take care of a situation.”\n\n_____\n\nPhoto\n\n• In East Africa, there are celebrations for a new railway line from Djibouti to Ethiopia that showcases China’s effort to extend its influence on the continent with aid and expertise.\n\nAdvertisement Continue reading the main story\n\nNot everyone is comfortable with China’s vision for Africa, but there’s a lot to embrace. In tiny Djibouti, that includes $14 billion worth of projects, including three ports, two airports, a water pipeline and jobs for thousands of local workers.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Morning Briefing What you need to know to start your day in Asia, delivered to your inbox. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBusiness\n\nPhoto\n\n• Chinese coal-to-gas energy plants require vast amounts of water and spew carbon dioxide, undermining Beijing’s goal of becoming a global leader on climate change.\n\n• A group of Republican elder statesmen in the U.S. called a tax on carbon emissions the fairest way to address global warming. The idea has been billed as “a conservative climate solution.”\n\n• Seth A. Klarman, a cult hero in investment circles, cautioned confidantes against the euphoria seen on Wall Street since Mr. Trump took office, warning that investors were “ignoring the risks from America-first protectionism” and noting that promised stimulus efforts “could prove quite inflationary.”\n\n• Jose Cuervo is going public. The 200-year-old company, which makes 30 percent of the world’s tequila, is seeking more than $700 million in its initial public offering on the Mexican stock market.\n\n• Why did China’s foreign exchange reserves drop to below $3 trillion? Largely because of moves to protect the renminbi.\n\n• Gold hit a three-month high of $1,244.67. Here’s a snapshot of global markets.\n\nMarket Snapshot View Full Overview\n\nIn the News\n\nPhoto\n\n• A blistering exchange in Australia’s Parliament: Malcolm Turnbull denounced the opposition leader Bill Shorten as a “simpering sycophant” and a “parasite,” and Mr. Shorten shot back that the prime minister was “the most out-of-touch personality to ever hold this great office.” [ABC]\n\n• A Russian judge convicted the opposition politician Aleksei A. Navalny on fraud charges, strongly increasing the likelihood of President Vladimir V. Putin’s election to a fourth term next year. [The New York Times]\n\nAdvertisement Continue reading the main story\n\n• Pope Francis criticized atrocities against Myanmar’s Rohingya: “They have been suffering for years, they have been tortured, killed simply because they wanted to live their culture and their Muslim faith.” [The New York Times]\n\n• A Vatican ceremony in Osaka elevated a feudal Japanese warlord — who was banished for refusing to renounce Christianity — just one step from sainthood. [Asahi Shimbun]\n\n• A warning for the Philippines: A former president of Colombia, in an Op-Ed essay, says that drug wars can’t be won with armed forces and law enforcement agencies alone and notes that “locking up nonviolent offenders and drug users almost always backfires.” [The New York Times]\n\n• Political turmoil is escalating India’s southern state of Tamil Nadu after the former chief minister said he had been forced out to make way for Sasikala Natarajan, an aide to the revered politician known as Amma, who died two months ago. [BBC]\n\nSmarter Living\n\nPhoto\n\n• Couldn’t make it to the gym this morning? No sweat, just work out at work.\n\n• At age 105, Robert Marchand, a French amateur cyclist, is fitter than most 50-year-olds, and appears to be getting fitter with age.\n\n• Instead of a recipe today, we want you to meet our new baking columnist: the renowned chef Yotam Ottolenghi. Above, his pastry nests with poached pears, feta and saffron cream.\n\nNoteworthy\n\nPhoto\n\n• Prints of rarely seen pictures of the U.S.’s Japanese internments during World War II, taken by the renowned photographer Dorothea Lange, are being sold to raise funds for the American Civil Liberties Union.\n\n• A newly discovered species of gecko tears off its scales to escape from attackers. “It looks like a fish until you grab it,” one expert said, “and then it looks like a naked chicken breast.” (The scales grow back.)\n\nAdvertisement Continue reading the main story\n\nBack Story\n\nPhoto\n\nWhen you think of doomed luxury ocean liners, the Titanic sinking in 1912 might be the first to come to mind. But the Normandie, a French ship that burned and capsized in New York City on this day 75 years ago, was nearly as remarkable.\n\nLaunched in 1932, it was the first liner to exceed 1,000 feet in length. The Normandie was lauded as the biggest, fastest luxury ship afloat, featuring a first-class dining room with a sumptuous Art Deco interior.\n\nAfter World War II started, though, the ocean liner never again sailed. It was held and eventually taken over by the U.S. military, which renamed it the U.S.S. Lafayette, after the French general who helped America during the Revolutionary War.\n\nDuring its conversion to a troopship in 1942, the Normandie caught fire and tipped over. Sabotage was suspected but never proven. The official cause was listed as life preservers set ablaze by a welder’s torch.\n\nA year later, the ship was salvaged, and then scrapped.\n\nBut the Normandie was not forgotten. Its steam whistle blew again in 2010 to commemorate the anniversary of its first arrival in New York.\n\nDes Shoe contributed reporting.\n\n_____\n\nYour Morning Briefing is published weekday mornings.\n\nWhat would you like to see here? Contact us at asiabriefing@nytimes.com.", "authors": ["Charles Mcdermid"], "publish_date": "2017-02-08", "source": "nytimes", "top_words": ["main", "travel", "alexei", "trump", "ivanka", "ban", "morning", "ship", "president", "navalny", "times", "reading", "normandie", "sign", "continue", "briefing", "york", "way"], "summary": "Advertisement Continue reading the main storyNot everyone is comfortable with China’s vision for Africa, but there’s a lot to embrace.\nNewsletter Sign Up Continue reading the main story Sign Up for the Morning Briefing What you need to know to start your day in Asia, delivered to your inbox.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\nView all New York Times newsletters.\nAdvertisement Continue reading the main storyBack StoryPhotoWhen you think of doomed luxury ocean liners, the Titanic sinking in 1912 might be the first to come to mind."}