{"url": "https://www.nytimes.com/2017/02/05/us/politics/donald-trump-mike-pence-travel-ban-judge.html?mcubz=0", "id": "204", "title": "Trump Clashes Early With Courts, Portending Years of Legal Battles", "text": "Trump Clashes Early With Courts, Portending Years of Legal Battles Image President Trump speaking with reporters on Air Force One on Friday. He has quickly pushed into a confrontation with the courts as he tests the limits of executive power. Credit Stephen Crowley/The New York Times\n\nWASHINGTON — President Trump is barreling into a confrontation with the courts barely two weeks after taking office, foreshadowing years of legal battles as an administration determined to disrupt the existing order presses the boundaries of executive power.\n\nLawyers for the administration were ordered to submit a brief on Monday defending Mr. Trump’s order temporarily banning refugees from around the world and all visitors from seven predominantly Muslim countries from entering the United States. An appeals court in California refused on Sunday to reinstate the ban after a lower court blocked it.\n\nAs people from the countries targeted by Mr. Trump struggled to make their way to the United States while they could, the president for the second day in a row expressed rage at the judge in the case, this time accusing him of endangering national security. Vice President Mike Pence defended the president’s tone, but lawyers and lawmakers of both parties said Mr. Trump’s comments reflected a lack of respect for the constitutional system of checks and balances.\n\nLate in the day, Mr. Trump took to Twitter to pre-emptively blame the judge and the judiciary for what the president suggested would be a future terrorist attack.\n\n“Just cannot believe a judge would put our country in such peril,” Mr. Trump wrote, a day after referring to the “so-called judge” in the case. “If something happens blame him and court system.”\n\nEven before the latest post, Republicans joined Democrats in chiding him. Senator Mitch McConnell of Kentucky, the majority leader, said it was “best not to single out judges.”\n\n“We all get disappointed from time to time,” he said on CNN’s “State of the Union.” “I think it is best to avoid criticizing judges individually.”\n\nThe White House offered no evidence for Mr. Trump’s suggestion that potential terrorists would now pour over the border because of the judge’s order. Since Sept. 11, 2001, no American has been killed in a terrorist attack on American soil by anyone who immigrated from any of the seven countries named in Mr. Trump’s order.\n\nVideo In January, President Trump blocked travel from seven Muslim-majority countries, and cut refugee admissions by more than half. We checked the facts.\n\nThe impassioned debate over the immigration order brought to the fore issues at the heart of the Trump presidency. A businessman with no experience in public office, Mr. Trump has shown in his administration’s opening days that he favors an action-oriented approach with little regard for the two other branches of government. While Congress, controlled by Republicans, has deferred, the judiciary may emerge as the major obstacle for Mr. Trump.\n\nDemocrats and some Republicans said Mr. Trump’s attack on the courts would color the battle over the nomination of Judge Neil M. Gorsuch to the Supreme Court as well as the president’s relationship with Congress.\n\nOther presidents have clashed with the judiciary. The Supreme Court invalidated parts of Franklin D. Roosevelt’s New Deal, forced Richard M. Nixon to turn over Watergate tapes and rejected Bill Clinton’s bid to delay a sexual harassment lawsuit.\n\nThe last two presidents battled with courts repeatedly over the limits of their power. The judiciary ruled that George W. Bush overstepped his bounds in denying due process to terrorism suspects and that Barack Obama assumed power he did not have to allow millions of unauthorized immigrants to stay in the country.\n\nCharles Fried, solicitor general under Ronald Reagan, said the ruling by a Federal District Court in Washington State blocking Mr. Trump’s order resembled a ruling by a Texas district court stopping Mr. Obama from proceeding with his own immigration order.\n\nBut rarely, if ever, has a president this early in his tenure, and with such personal invective, battled the courts. Mr. Trump, Mr. Fried said, is turning everything into “a soap opera” with overheated attacks on the judge. “There are no lines for him,” said Mr. Fried, who teaches at Harvard Law School and voted against Mr. Trump. “There is no notion of, this is inappropriate, this is indecent, this is unpresidential.”\n\nOther Republicans brushed off the attacks, noting that judges have lifetime tenure that protects them from criticism. But even some Republicans said Mr. Trump’s order raised valid legal questions for the courts.\n\n“If I were in the White House, I’d feel better about my position if the ban or moratorium or whatever you call it were based on an actual attack or threat,” former Attorney General Alberto R. Gonzales, who served under Mr. Bush, said in an interview. Still, he said, when it comes to noncitizens overseas, “the executive has enjoyed great deference from the courts.”\n\nJudge James Robart, a Federal District Court judge in Seattle appointed by Mr. Bush, on Friday issued a nationwide suspension of Mr. Trump’s order while its legality was debated. The administration quickly asked the United States Court of Appeals for the Ninth Circuit to overrule the judge, but it refused early Sunday and instead ordered the government to file a brief on Monday. The quick briefing schedule indicated that the appeals court could issue a ruling on the merits of the president’s order within days.\n\nIn the meantime, refugees vetted by the government can proceed to the United States, as can any travelers with approved visas from the seven targeted nations: Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\n\nStill, widespread confusion and anger were reported at overseas airports on Sunday. Unsure which orders to follow, airlines stopped even some of the people named in the lawsuits who were technically cleared to come to the country, according to a government official.\n\nThe assertion of broad latitude by the president in areas of national security resembles the struggles of the Bush years, when in the months after the Sept. 11 attacks the administration claimed sometimes sweeping power in the name of fighting terrorism.\n\nJack Goldsmith, who as head of the Justice Department’s Office of Legal Counsel under Mr. Bush argued that some of the initial orders went too far and forced them to be rolled back, said on Sunday that there were similarities. “But Bush’s legal directives were not as sloppy as Trump’s,” he said. “And Trump’s serial attacks on judges and the judiciary take us into new territory. The sloppiness and aggressiveness of the directives, combined with the attacks on judges, put extra pressure on judges to rule against Trump.”\n\nThis was not the first time Mr. Trump has castigated a judge who ruled against him. As a candidate last year, Mr. Trump asserted that Judge Gonzalo P. Curiel, who was presiding over a fraud lawsuit by former students of Trump University, had a conflict of interest because his family was of Mexican heritage and he therefore would be biased because of Mr. Trump’s promise to build a border wall.\n\nSuch comments from a sitting president, however, were unusual and triggered consternation in the legal community. Bartholomew J. Dalton, the president of the American College of Trial Lawyers, called Mr. Trump’s “insulting language” inappropriate.\n\n“It is wrong for the chief executive of the executive branch to demean a member of the judiciary with such language,” Mr. Dalton said in a statement. “This undermines judicial independence, which is the backbone to our constitutional democracy.”\n\nSenators of both parties appearing on Sunday talk shows concurred. “I’ll be honest, I don’t understand language like that,” Senator Ben Sasse, Republican of Nebraska, said on “This Week” on ABC. “We don’t have so-called judges. We don’t have so-called senators. We don’t have so-called presidents. We have people from three different branches of government who take an oath to uphold and defend the Constitution.”\n\n“The president is not a dictator,” Senator Dianne Feinstein of California, the Judiciary Committee’s top Democrat, said on “Fox News Sunday.” “The framers of our Constitution wanted a strong Congress for the very reason that most of these kinds of things should be done within the scope of lawmaking. This is done within the scope of executive power.”\n\nIt fell to Mr. Pence to defend Mr. Trump. “Well, look, the president of the United States has every right to criticize the other two branches of government. And we have a long tradition of that in this country,” he said on “Meet the Press” on NBC.\n\n“The judge’s actions in this case,” he added, “making decisions about American foreign policy and national security, it’s just very frustrating to the president, to our whole administration, to millions of Americans who want to see judges that will uphold the law and recognize the authority the president of the United States has under the Constitution to manage who comes into this country.”\n\nSign Up for the Morning Briefing Get what you need to know to start your day in the United States, Canada and the Americas, delivered to your inbox. SEE SAMPLE Please verify you’re not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. * Required field You agree to receive occasional updates and special offers for The New York Times products and services. * Required field Thank you for subscribing. View all New York Times newsletters. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. Sign Up", "authors": ["Peter Baker"], "publish_date": "2017-02-05", "source": "nytimes", "top_words": ["courts", "trump", "early", "clashes", "judges", "portending", "judge", "court", "united", "states", "battles", "trumps", "order", "president", "mr", "legal"], "summary": "Trump Clashes Early With Courts, Portending Years of Legal Battles Image President Trump speaking with reporters on Air Force One on Friday.\nVideo In January, President Trump blocked travel from seven Muslim-majority countries, and cut refugee admissions by more than half.\nMr. Trump, Mr. Fried said, is turning everything into “a soap opera” with overheated attacks on the judge.\n“There are no lines for him,” said Mr. Fried, who teaches at Harvard Law School and voted against Mr. Trump.\nBut even some Republicans said Mr. Trump’s order raised valid legal questions for the courts."}