{"url": "https://www.nytimes.com/2017/03/06/us/for-yale-law-group-fighting-trumps-travel-ban-echoes-of-1991.html?mcubz=0", "id": "296", "title": "For Yale Law Group Fighting Trump’s Travel Ban, Echoes of 1991", "text": "Video\n\nWith President Trump recasting his executive order banning the entry of migrants from certain predominantly Muslim countries, it may be a moment to recall Dick the Butcher. Reaction to the new restrictions seems destined to reprise that to Mr. Trump’s original order in January, and it echoes the Butcher’s oft-quoted line from Shakespeare’s “Henry VI, Part 2.” There is a crucial one-word change, though. This version goes: “The first thing we do, let’s call all the lawyers.”\n\nThat’s what opponents of the travel ban did in January. In short order, legal teams formed to represent immigrants who were suddenly detained at airports, with nowhere to go. Their challenge to presidential authority was sustained by federal judges, and their motivation underpins this short video from Retro Report, a documentary series that mines the past for guidance as to what may lie ahead. The focus is on a network of current and former students at Yale Law School who helped draft a legal petition that became part of the pushback that stopped the first Trump order in its tracks.\n\nFor Michael J. Wishnie, a Yale law professor involved in that effort, what happened in January was familiar. “It was very much a replay of what I had seen,” he told Retro Report.\n\nAs a Yale law student in 1991, Professor Wishnie was part of a team that worked on behalf of Haitians who had fled their country by boat after a coup there. They sought asylum in the United States, but instead were sent to the American naval base in Guantánamo Bay, Cuba, and held behind barbed wire. Ultimately, a federal judge ordered that more than 150 Haitians be released and allowed to enter the United States.\n\nAdvertisement Continue reading the main story\n\nThen, as now, there were fears in this country that the migrants presented a threat. Nonetheless, “there have to be rules, and there have to be limits,” said Lisa Daugaard, a 1992 graduate of Yale Law School who is the director of the Public Defender Association, a nonprofit group based in Seattle. And “if the executive agencies are not willing to observe the limits themselves,” Ms. Daugaard said, it falls to the courts to sort things out.\n\nFrom statements issued on Monday after the president’s new order was announced, it appeared that various groups were prepared to call all the lawyers once again. The members of the Yale group said they were ready. They have support from one of their more prominent professors, Harold Hongju Koh, who was involved in the 1990s effort to help Haitian refugees and who was the State Department’s legal adviser during President Barack Obama’s first term.", "authors": ["Clyde Haberman", "Retro Report"], "publish_date": "2017-03-06", "source": "nytimes", "top_words": ["travel", "yale", "trump", "fighting", "ban", "retro", "1991", "echoes", "wishnie", "united", "trumps", "group", "school", "order", "law", "short", "legal"], "summary": "This version goes: “The first thing we do, let’s call all the lawyers.”That’s what opponents of the travel ban did in January.\nIn short order, legal teams formed to represent immigrants who were suddenly detained at airports, with nowhere to go.\nFor Michael J. Wishnie, a Yale law professor involved in that effort, what happened in January was familiar.\nAs a Yale law student in 1991, Professor Wishnie was part of a team that worked on behalf of Haitians who had fled their country by boat after a coup there.\nNonetheless, “there have to be rules, and there have to be limits,” said Lisa Daugaard, a 1992 graduate of Yale Law School who is the director of the Public Defender Association, a nonprofit group based in Seattle."}