{"url": "https://www.nytimes.com/2017/02/24/us/politics/hr-mcmaster-trump-islam.html?mcubz=0", "id": "280", "title": "H.R. McMaster Breaks With Administration on Views of Islam", "text": "General McMaster, several officials said, has been vocal about his views on dealing with Islamic militancy, including with Mr. Trump, who on Monday described him as “a man of tremendous talent, tremendous experience.” General McMaster got the job after Mr. Trump’s first choice, Robert S. Harward, a retired Navy vice admiral, turned it down.\n\nWithin a day of his appointment on Monday, General McMaster was popping into offices to introduce himself to the council’s professional staff members. The staff members, many of them holdovers from the Obama administration, felt viewed with suspicion by Mr. Trump’s team and shut out of the policy-making process, according to current and former officials.\n\nIn his language, General McMaster is closer to the positions of former Presidents Barack Obama and George W. Bush. Both took pains to separate acts of terrorism from Islamic teaching, in part because they argued that the United States needed the help of Muslim allies to hunt down terrorists.\n\n“This is very much a repudiation of his new boss’s lexicon and worldview,” said William McCants, a senior fellow at the Brookings Institution and the author of “The ISIS Apocalypse.”\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“McMaster, like Obama, is someone who was in positions of leadership and thought the United States should not play into the jihadist propaganda that this is a religious war,” Mr. McCants said.\n\n“There is a deep hunger for McMaster’s view in the interagency,” he added, referring to the process by which the State Department, Pentagon and other agencies funnel recommendations through the National Security Council. “The fact that he has made himself the champion of this view makes people realize they have an advocate to express dissenting opinions.”\n\nBut Mr. McCants and others cautioned that General McMaster’s views would not necessarily be the final word in a White House where Mr. Trump and several of his top advisers view Islam in deeply xenophobic terms. Some aides, including the president’s chief strategist, Stephen K. Bannon, have warned of a looming existential clash between Islam and the Judeo-Christian world.\n\nAdvertisement Continue reading the main story\n\nMr. Bannon and Stephen Miller, another senior adviser with anti-Islamic views, have close ties to Mr. Trump and walk-in privileges in the Oval Office. General McMaster, 54, has neither.\n\nKnown for challenging his superiors, General McMaster was nearly passed over for the rank of brigadier general in 2007, until Gen. David H. Petraeus, who used his counterinsurgency strategy in Iraq, and Robert M. Gates, then the defense secretary, rallied support for him.\n\nThe schisms within the administration could be aired publicly if the Senate Armed Services Committee exercises a right to hold a confirmation hearing for General McMaster. Although the post of national security adviser does not require Senate confirmation, senators must approve his retention of his three-star rank in a new position.\n\nSenator John McCain, the committee’s chairman and a strong supporter of General McMaster, has not said whether he wants to hold a hearing.\n\nTo outside observers, the administration’s approach to the world appears increasingly schizophrenic. Mr. Pence, Defense Secretary Jim Mattis and other senior cabinet officers have reaffirmed American support for alliances with NATO and in East Asia. Mr. Bannon and other White House officials continue to suggest there will be radical shifts in American policy. These mixed messages extend beyond the Muslim world. This week, Mr. Pence traveled to Brussels to declare — on Mr. Trump’s behalf, he said — “the strong commitment of the United States to the continued cooperation and partnership with the European Union.”\n\nBut on Thursday, the German ambassador to the United States, Peter Wittig, said his government remains concerned that the White House views the European Union as an ailing, inefficient economic club, rather than a political project that has kept Europe at peace.\n\nBefore Mr. Pence’s trip, according to Reuters, Mr. Wittig met Mr. Bannon, who told him the White House viewed the European Union as a “flawed construct” and preferred to negotiate with Germany and other European countries one-on-one. Mr. Wittig declined to discuss the meeting, while Mr. Bannon did not respond to a request for comment.\n\nBut Mr. Wittig said to reporters, “We will certainly fight for a coherent and resilient European Union.”", "authors": ["Mark Landler", "Eric Schmitt"], "publish_date": "2017-02-24", "source": "nytimes", "top_words": ["mr", "bannon", "views", "breaks", "wittig", "united", "general", "view", "hr", "islam", "mcmaster", "white", "administration", "european"], "summary": "Within a day of his appointment on Monday, General McMaster was popping into offices to introduce himself to the council’s professional staff members.\nIn his language, General McMaster is closer to the positions of former Presidents Barack Obama and George W. Bush.\nThe schisms within the administration could be aired publicly if the Senate Armed Services Committee exercises a right to hold a confirmation hearing for General McMaster.\nSenator John McCain, the committee’s chairman and a strong supporter of General McMaster, has not said whether he wants to hold a hearing.\nMr. Wittig declined to discuss the meeting, while Mr. Bannon did not respond to a request for comment."}