{"url": "https://www.nytimes.com/2017/03/03/world/europe/trump-merkel-meeting.html?mcubz=0", "id": "290", "title": "Merkel to Meet Trump in Washington This Month", "text": "WASHINGTON — Chancellor Angela Merkel of Germany will travel to Washington on March 14 to meet President Trump, their first encounter after a rocky start to relations amid disagreements about trade, Mr. Trump’s travel ban and his comments about the news media.\n\nAn American official announced the visit, which will take place shortly before a meeting in Germany of the finance ministers of the Group of 20, which comprises industrial and emerging-market countries plus the European Union. Her visit will also help lay the groundwork for Mr. Trump’s trip to Germany in July for a meeting of Group of 20 leaders.\n\nMr. Trump and Ms. Merkel issued a joint statement after a telephone call in January, underscoring the importance of NATO and vowing to work together more closely to combat terrorism.\n\nA few days later, Ms. Merkel sharply criticized Mr. Trump’s temporary travel ban on citizens from seven majority-Muslim countries. She has also repeatedly underscored the importance of a free press when asked about Mr. Trump’s negative comments about the news media.\n\nMs. Merkel had a warm relationship with President Barack Obama.\n\nThe meeting between Mr. Trump and Ms. Merkel is likely to cover a wide variety of issues, including the global economy, trade, NATO, ties with Russia and China, and the fight against the Islamic State.", "authors": [], "publish_date": "2017-03-03", "source": "nytimes", "top_words": ["travel", "meet", "trump", "visit", "merkel", "month", "trumps", "ms", "meeting", "germany", "washington", "mr"], "summary": "WASHINGTON — Chancellor Angela Merkel of Germany will travel to Washington on March 14 to meet President Trump, their first encounter after a rocky start to relations amid disagreements about trade, Mr. Trump’s travel ban and his comments about the news media.\nMr. Trump and Ms. Merkel issued a joint statement after a telephone call in January, underscoring the importance of NATO and vowing to work together more closely to combat terrorism.\nA few days later, Ms. Merkel sharply criticized Mr. Trump’s temporary travel ban on citizens from seven majority-Muslim countries.\nShe has also repeatedly underscored the importance of a free press when asked about Mr. Trump’s negative comments about the news media.\nMs. Merkel had a warm relationship with President Barack Obama."}