{"url": "https://www.nytimes.com/2017/03/21/us/politics/trump-gorsuch-criticizing-judges.html?mcubz=0", "id": "25", "title": "‘I’ll Criticize Judges,’ Trump Says, Hours After a Scolding for Doing Just That", "text": "Photo\n\nWASHINGTON — Not even a public scolding from Judge Neil M. Gorsuch could get President Trump to stop bashing federal judges.\n\nHours after Mr. Trump’s nominee for the Supreme Court declared during Senate confirmation hearings that he was “disheartened” about Mr. Trump’s unrestrained attacks on the judicial branch, the president was at it again, calling out the federal judges who have halted his second executive order banning travel from certain predominantly Muslim nations.\n\n“Somebody said I should not criticize judges. O.K. I’ll criticize judges,” Mr. Trump said on Tuesday night at a fund-raising dinner for the National Republican Congressional Committee — reiterating his pique at a federal court judge in Hawaii who last week placed a stay on his second travel order.\n\nMr. Trump was in a loose mood after a day of wrangling votes for the House Republican leadership’s measure to repeal and replace the Affordable Care Act. He predicted victory in a vote on a revamped bill, scheduled for Thursday, that legislators say is still too close to call.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“The American people gave us clear instructions. It’s time to get busy, get to work, and get the job done,” Mr. Trump told the audience at the National Building Museum.\n\nAdvertisement Continue reading the main story\n\nMr. Trump said his “legislative effort begins with Thursday’s crucial vote” on the health care bill. He added that he “had no choice” but to tackle the health bill first, amid criticism from some Republicans that he should have opened by pushing through a trillion-dollar infrastructure package that was likely to garner at least some Democratic support.", "authors": ["Glenn Thrush"], "publish_date": "2017-03-21", "source": "nytimes", "top_words": ["ill", "travel", "judges", "trump", "scolding", "vote", "doing", "trumps", "sign", "federal", "hours", "criticize", "york", "mr", "bill"], "summary": "PhotoWASHINGTON — Not even a public scolding from Judge Neil M. Gorsuch could get President Trump to stop bashing federal judges.\nI’ll criticize judges,” Mr. Trump said on Tuesday night at a fund-raising dinner for the National Republican Congressional Committee — reiterating his pique at a federal court judge in Hawaii who last week placed a stay on his second travel order.\nMr. Trump was in a loose mood after a day of wrangling votes for the House Republican leadership’s measure to repeal and replace the Affordable Care Act.\nIt’s time to get busy, get to work, and get the job done,” Mr. Trump told the audience at the National Building Museum.\nAdvertisement Continue reading the main storyMr. Trump said his “legislative effort begins with Thursday’s crucial vote” on the health care bill."}