{"url": "https://www.nytimes.com/2017/02/28/us/politics/first-ladys-box-guest-list.html?mcubz=0", "id": "286", "title": "With His Guests, Trump to Highlight Illegal Immigration as a Security Issue", "text": "Mr. Shaw’s son, Jamiel Shaw Jr., was a high school football star in Los Angeles and just 17 at the time of his death. He was on his way home from a shopping mall when he was shot twice by Pedro Espinoza, 19, who was a member of a notorious street gang and had entered the United States illegally from Mexico. Mr. Espinoza had previously been convicted of weapons possession and resisting arrest, and he was released from jail the day before he killed Mr. Shaw. He was convicted of murder and is now on death row.\n\nLuis Enrique Monroy Bracamontes, an unauthorized immigrant, is accused of killing Deputy Oliver and Detective Davis in October 2014.\n\nThe authorities said that Mr. Bracamontes shot Deputy Oliver with a handgun, and then shot Detective Davis and another officer with an AR-15 assault rifle in the ensuing pursuit.\n\nMr. Bracamontes had already been deported to Mexico twice after facing drug charges in the United States. He is to be tried in the killings this year.\n\nIn one of Mr. Trump’s executive orders on immigration, he said that unauthorized immigrants “present a significant threat to national security and public safety” and has sharply criticized jails that allow them to go free. A number of studies have shown that immigrants commit fewer crimes per capita than American-born citizens, but those who do have long been a focus of immigration policy.\n\nPresident Barack Obama made serious criminals a primary focus of his deportation efforts, while Mr. Trump has taken the issue further and called for all undocumented immigrants to be removed.\n\nAnd Mr. Trump’s emphasis on the victims of crimes committed by those in the country illegally offers a sharp contrast to Mr. Obama’s final State of the Union address last year, when his guest list included a Syrian refugee and a Mexican immigrant who came to the United States illegally and went on to serve in the United States Army.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMany congressional Democrats have announced that they will bring their own guests to counter Mr. Trump’s messages, including immigrants who would suffer under his policies and people who have benefited from the Affordable Care Act, Mr. Obama’s signature health care law, which Mr. Trump and Republicans are working to dismantle.\n\nAdvertisement Continue reading the main story\n\nAaima Sayed, a Muslim-American medical student who was temporarily shielded from deportation under an Obama immigration policy known as Deferred Action for Childhood Arrivals, or DACA, will accompany Senator Richard J. Durbin of Illinois. According to the senator’s office, Ms. Sayed was brought to the United States from Pakistan when she was 3, graduated magna cum laude from Rutgers University and is now in her third year at the Stritch School of Medicine at Loyola University in Chicago.\n\nMr. Trump has so far kept DACA in place, despite calls from some conservatives to end it.\n\nAlso seated near the first lady will be Maureen McCarthy Scalia, the wife of Antonin Scalia, the Supreme Court justice who died a year ago. After a bitter, protracted Senate fight last year over Republican efforts to hold the seat open for the next president, Mr. Trump last month nominated Judge Neil M. Gorsuch to succeed Justice Scalia. Mr. Gorsuch’s confirmation hearing is scheduled to begin March 20.\n\nMegan Crowley, whose rare genetic disorder, known as Pompe disease, prompted her father to start a pharmaceutical company in search of a cure, will also attend, as will Denisha Merriweather, who graduated from a private high school and college after benefiting from a school-choice program in Florida.\n\nThe Trump administration favors giving parents and students the option to use public money to attend private or charter schools.", "authors": ["Emmarie Huetteman", "Caitlin Dickerson"], "publish_date": "2017-02-28", "source": "nytimes", "top_words": ["highlight", "illegal", "trump", "guests", "immigrants", "security", "immigration", "scalia", "shot", "united", "states", "trumps", "school", "issue", "mr"], "summary": "Mr. Bracamontes had already been deported to Mexico twice after facing drug charges in the United States.\nPresident Barack Obama made serious criminals a primary focus of his deportation efforts, while Mr. Trump has taken the issue further and called for all undocumented immigrants to be removed.\nMr. Trump has so far kept DACA in place, despite calls from some conservatives to end it.\nAfter a bitter, protracted Senate fight last year over Republican efforts to hold the seat open for the next president, Mr. Trump last month nominated Judge Neil M. Gorsuch to succeed Justice Scalia.\nThe Trump administration favors giving parents and students the option to use public money to attend private or charter schools."}