{"url": "https://www.nytimes.com/2017/02/07/world/middleeast/muslim-brotherhood-terrorism-trump.html?mcubz=0", "id": "228", "title": "White House Weighs Terrorist Designation for Muslim Brotherhood", "text": "The Iran part of the plan has strong support within the White House, but momentum behind the Muslim Brotherhood proposal seems to have slowed in recent days amid objections from career officials at the State Department and the National Security Council, who argue that there is no legal basis for it and that it could alienate allies in the region. Former officials said that they had been told the order would be signed on Monday, but that it had now been put off at least until next week.\n\nThe delay may reflect a broader desire by the White House to take more time with executive actions after the chaos associated with hastily issued orders, like the temporary ban on visitors from seven predominantly Muslim countries. But it also underscored the complex dynamics involving the Muslim Brotherhood, whose chapters have only loose relationships across national lines.\n\nCritics said they feared that Mr. Trump’s team wanted to create a legal justification to crack down on Muslim charities, mosques and other groups in the United States. A terrorist designation would freeze assets, block visas and ban financial interactions.\n\n“This would signal they are more interested in provoking conflict with an imaginary fifth column of Muslims in the U.S. than in preserving our relationships with counterterrorism partners like Turkey, Jordan, Tunisia and Morocco, or with fighting actual terrorism,” said Tom Malinowski, an assistant secretary of state under Mr. Obama.\n\nThe Brotherhood has long been a source of alarm on the right, especially at Breitbart News, whose chairman, Stephen K. Bannon, is now Mr. Trump’s chief White House strategist. A 2007 summary for a film Mr. Bannon proposed making on radical Islam in America, obtained by The Washington Post, called the Brotherhood “the foundation of modern terrorism.”\n\nSebastian Gorka and Katharine Gorka, two Breitbart contributors who have long warned of Muslim extremists in the United States, also joined the new administration. Mr. Gorka is a deputy national security assistant, while Ms. Gorka is working at the Department of Homeland Security.\n\nFrank Gaffney Jr., founder of the Center for Security Policy, who once asserted that Mr. Obama might secretly be a Muslim, urged Mr. Trump on Breitbart’s radio show last week to designate the Muslim Brotherhood as a terrorist organization. He has argued that the Brotherhood’s philosophy mirrors that of groups that are already on the list.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“The goals of the Muslim Brotherhood,” Mr. Gaffney said in a recent interview with The New York Times, are “exactly the same as the Islamic State, exactly the same as the Taliban, exactly the same as, you know, Al Qaeda, Boko Haram, Al Nusra Front, on and on, Al Shabab. It’s about Islamic supremacism. It’s about achieving the end state that is their due.”\n\nAdvertisement Continue reading the main story\n\nSome congressional Republicans reintroduced legislation last month calling on the State Department to designate the Brotherhood as a terrorist organization or explain why it would not. “It’s time to call the enemy by its name,” Senator Ted Cruz of Texas, who sponsored the measure with Representative Mario Diaz-Balart of Florida, wrote on Twitter.\n\nAmong those objecting is the Council on American-Islamic Relations, which describes itself as the largest Muslim civil rights organization in the United States. Mr. Gaffney and others have accused it of being a front for the Brotherhood, which the council denies. It said such an order by Mr. Trump would be a brazen attempt to repress Muslims.\n\n“We believe it is just a smoke screen for a witch hunt targeting the civil rights of American Muslims,” said Ibrahim Hooper, a spokesman for the council. He said that, given what he called false attempts to link Muslim Americans to the Brotherhood, a terrorist designation would “inevitably be used in a political campaign to attack those same groups and individuals, to marginalize the American Muslim community and to demonize Islam.”\n\nIt is unclear what form a presidential order would take. Presumably, Mr. Trump could direct Secretary of State Rex W. Tillerson to review whether the Brotherhood should be designated. At his confirmation hearing, Mr. Tillerson grouped the Brotherhood and Al Qaeda together as “agents of radical Islam.”\n\nBut officials may try to narrow the scope of such an order to avoid affecting Brotherhood affiliates outside Egypt, or they may shelve the order in favor of waiting for legislation from Congress.\n\nGot a confidential news tip? The New York Times would like to hear from readers who want to share messages and materials with our journalists.\n\nFounded in 1928 in Egypt, the Brotherhood used violence for decades in pursuit of its Islamist goals, but officially renounced it in the 1970s and embraced democracy as its means.\n\nIn recent years, offshoots have joined the political system, including Ennahda, a party that belongs to the governing coalition in Tunisia and has eschewed extremism. Even in Turkey, a NATO ally, President Recep Tayyip Erdogan’s Justice and Development Party has long supported the Muslim Brotherhood.\n\nAdvertisement Continue reading the main story\n\nThe Brotherhood’s most successful period ended in 2013, when President Mohamed Morsi of Egypt, who had succeeded Mr. Mubarak, alienated other sectors of society and, after protests, was removed by the military. The general who took over, President Abdel Fattah el-Sisi, has cracked down on the Brotherhood and lobbied the United States to designate it as a terrorist organization\n\nFrom 2013 through mid-2015, a former American official said, every interaction with Egyptian leaders included pressure on the issue. At one point, a senior Egyptian intelligence official personally brought a dossier to Secretary of State John Kerry, though it had no new information, according to the former American official. The State Department decided the Brotherhood did not meet the legal requirements for the designation because there was no evidence that its leaders had systematically ordered terrorist attacks.\n\nA similar review released by Britain in 2015 found that the Brotherhood “selectively used violence and sometimes terror in pursuit of their institutional goals,” and that it emphasized engagement in English but jihad in Arabic. Its leaders have defended Hamas’s attacks on Israel and justified attacks on American forces in Iraq and Afghanistan, the review said. But it did not recommend that it be designated as a terrorist organization, either.\n\nIn his short time in office, Mr. Trump has already come under pressure from Arab allies eager for such a designation. He had phone conversations with Mr. Sisi; Sheikh Mohammed bin Zayed al-Nahyan, the crown prince of Abu Dhabi; and King Salman of Saudi Arabia. But he also spoke with Mr. Erdogan on Tuesday.\n\nA top Arab official, who spoke on the condition of anonymity according to diplomatic protocol, declined to discuss what was said on the calls, but added, “It’s safe to assume since U.A.E., Saudi and Egypt have all designated the M.B. as a terrorist organization, that decision would be welcome by those countries and several others in the region.”", "authors": ["Peter Baker"], "publish_date": "2017-02-07", "source": "nytimes", "top_words": ["state", "terrorist", "weighs", "house", "brotherhood", "organization", "american", "york", "united", "designation", "order", "muslim", "white", "mr"], "summary": "But it also underscored the complex dynamics involving the Muslim Brotherhood, whose chapters have only loose relationships across national lines.\nFrank Gaffney Jr., founder of the Center for Security Policy, who once asserted that Mr. Obama might secretly be a Muslim, urged Mr. Trump on Breitbart’s radio show last week to designate the Muslim Brotherhood as a terrorist organization.\nEven in Turkey, a NATO ally, President Recep Tayyip Erdogan’s Justice and Development Party has long supported the Muslim Brotherhood.\nBut it did not recommend that it be designated as a terrorist organization, either.\nas a terrorist organization, that decision would be welcome by those countries and several others in the region.”"}