{"url": "https://www.nytimes.com/2017/02/16/us/politics/travel-ban-muslim-ninth-circuit.html?mcubz=0", "id": "265", "title": "Trump Will Issue New Travel Order Instead of Fighting Case in Court", "text": "In a news conference on Thursday, Mr. Trump said the new executive order would be issued next week.\n\nIn its brief, the Justice Department urged the appeals court to await the new order and then vacate last Thursday’s decision.\n\nIt is not clear that the issuance of a new and narrower executive order will make the case before the Ninth Circuit moot or that the court will agree to vacate the decision even if it did.\n\nThe Supreme Court has said the “voluntary cessation” of a government action does not usually make a case moot if the government remains free to resume the conduct after the case is dismissed.\n\nIn calling for a legal do-over, the Justice Department avoided a Supreme Court test of the original executive order. A 4-to-4 tie on the short-handed Supreme Court would have left the panel’s decision in place.\n\nMr. Trump’s travel ban, issued Jan. 27, caused confusion and protests at airports nationwide and was immediately challenged in court. Many federal judges blocked aspects of the order.\n\nThe broadest injunction was issued on Feb. 3 by Judge James L. Robart of the Federal District Court in Seattle, acting in a lawsuit filed by the states of Washington and Minnesota. Judge Robart required the administration to roll back the key aspects of the order, and travel from the affected countries resumed almost immediately.\n\nThe next day, the Justice Department filed an emergency appeal, saying that national security concerns required immediate action from the appeals court. The three-judge panel heard arguments a few days later, and in a unanimous decision last Thursday, it refused to reinstate the ban.\n\nAdvertisement Continue reading the main story\n\nMany legal scholars, including ones who disapproved of the ban, have criticized the reasoning in the panel’s ruling. The Justice Department’s brief tracked many of those critiques, saying the panel’s decision was plagued by misunderstandings about the scope of the original executive order and the president’s authority to address immigration.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“In other circumstances,” the brief said, “the panel’s multiple errors in sustaining a substantially overbroad injunction, and thereby prohibiting enforcement of a lawful executive order designed to protect the nation’s security, would warrant” review by a larger panel of the Ninth Circuit.\n\n“Such review is not called for at this time,” the brief said, given the forthcoming executive order.\n\nIn their own brief filed Thursday, Washington and Minnesota agreed with the administration on one thing: that no rehearing of the panel’s decision was warranted. But the states argued that the panel’s ruling had been careful and correct.\n\n“The panel’s order thoroughly considered the legal precedent and the parties’ arguments and neither overlooked nor misunderstood a point of law or fact,” the brief said.\n\nThe briefs came in response to a request from the appeals court. Last Friday, an unidentified appeals court judge called for a vote on whether the three-judge panel’s ruling should be reheard by a larger panel of the Ninth Circuit.\n\nIf a majority of the court’s active judges vote to rehear the case, it would typically be considered by an 11-member panel made up of the circuit’s chief judge and 10 judges chosen at random.\n\nRehearing motions filed by parties and requests for votes on rehearings requested by judges are not particularly unusual. The Ninth Circuit rehears decisions issued by three-judge panels 15 to 25 times a year, the court said.\n\nThe Ninth Circuit has 25 active judges; 18 were appointed by Democratic presidents.\n\nEven if the Ninth Circuit agrees to vacate the panel’s decision, challenges to the original executive order will continue in other courts. And the new executive order may draw fresh legal challenges.", "authors": ["Adam Liptak"], "publish_date": "2017-02-16", "source": "nytimes", "top_words": ["executive", "ninth", "travel", "case", "judges", "trump", "fighting", "brief", "panels", "court", "issue", "order", "instead", "panel", "decision", "legal"], "summary": "In a news conference on Thursday, Mr. Trump said the new executive order would be issued next week.\nIn calling for a legal do-over, the Justice Department avoided a Supreme Court test of the original executive order.\nA 4-to-4 tie on the short-handed Supreme Court would have left the panel’s decision in place.\n“Such review is not called for at this time,” the brief said, given the forthcoming executive order.\nEven if the Ninth Circuit agrees to vacate the panel’s decision, challenges to the original executive order will continue in other courts."}