{"url": "https://www.nytimes.com/2017/02/25/us/politics/travel-ban-nations-terror-risk.html?mcubz=0", "id": "281", "title": "People From 7 Travel-Ban Nations Pose No Increased Terror Risk, Report Says", "text": "Photo\n\nWhen President Trump signed an executive order last month temporarily barring visitors from seven mostly Muslim countries, he said he was moving to protect the United States from terrorist attacks. The Homeland Security secretary, John F. Kelly, echoed the president, saying the travel ban was necessary because vetting procedures “in those seven countries are suspect.”\n\nBut an internal report written by intelligence analysts at Mr. Kelly’s department appears to undercut the assessment that people from the seven countries — Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen — pose a heightened threat of terrorism. The three-page report found that “country of citizenship is unlikely to be a reliable indicator of potential terrorist activity.”\n\nThe report adds to the difficulties the Trump administration has faced in carrying out the travel ban. Federal judges have suspended the order, and the administration has said it will redo it to withstand legal scrutiny, but has not given a timetable.\n\nThe Department of Homeland Security assessment, first reported by The Associated Press, found that only a small number of people from the seven countries had been involved in terrorism-related activities in the United States since the Syrian civil war began in 2011. In addition, the report noted, while terrorist groups in Iraq, Syria and Yemen pose a threat to the United States, militant groups in the other four countries have a more regional focus.\n\nAdvertisement Continue reading the main story\n\nThe report also found that in the past six years, the terrorism threat reached much more widely than the seven countries listed — individuals from 26 countries had been “inspired” to carry out attacks in the United States.", "authors": ["Ron Nixon"], "publish_date": "2017-02-25", "source": "nytimes", "top_words": ["seven", "travel", "risk", "trump", "yemen", "travelban", "report", "terrorist", "united", "states", "countries", "pose", "nations", "terror", "increased", "threat"], "summary": "PhotoWhen President Trump signed an executive order last month temporarily barring visitors from seven mostly Muslim countries, he said he was moving to protect the United States from terrorist attacks.\nThe three-page report found that “country of citizenship is unlikely to be a reliable indicator of potential terrorist activity.”The report adds to the difficulties the Trump administration has faced in carrying out the travel ban.\nFederal judges have suspended the order, and the administration has said it will redo it to withstand legal scrutiny, but has not given a timetable.\nIn addition, the report noted, while terrorist groups in Iraq, Syria and Yemen pose a threat to the United States, militant groups in the other four countries have a more regional focus.\nAdvertisement Continue reading the main storyThe report also found that in the past six years, the terrorism threat reached much more widely than the seven countries listed — individuals from 26 countries had been “inspired” to carry out attacks in the United States."}