{"url": "https://www.nytimes.com/2017/02/09/nyregion/rudolph-giuliani-donald-trump-travel-ban.html?mcubz=0", "id": "238", "title": "First Came Giuliani’s Input on the Immigration Order. Now There’s the Court Test.", "text": "No specific religion is mentioned in the executive order, which was issued on Jan. 27, but the appeals court said it must examine evidence that the order was meant to carry out a Muslim ban.\n\nThat would include an interview Mr. Giuliani gave the day after it was issued. Speaking to Fox News, he cast himself as the architect.\n\nAsked if the new order had anything to do with religion, Mr. Giuliani held forth on how it had been devised and what he said had been his role in carrying out Mr. Trump’s wishes.\n\n“I’ll tell you the whole history of it,” Mr. Giuliani said on Fox. “So when he first announced it, he said, ‘Muslim ban.’ He called me up and said, ‘Put a commission together, show me the right way to do it legally.’”\n\nBy focusing the order not on religion but on areas of the world that created danger for the United States, Mr. Giuliani said, the ban is “perfectly sensible, perfectly legal.”\n\nNow federal courts are considering if the order is, in fact, “perfectly legal.”\n\nCongress and the Constitution give a president broad control over the country’s borders. One explicit limit is that a president may not refuse immigrants visas because of their race, sex, nationality, place of birth or residence.\n\nAugust Flentje, a lawyer from the Department of Justice, argued this week before the United States Court of Appeals for the Ninth Circuit that judges cannot try to find out if a president disguised some of the reasons for an executive order. The “best evidence” of the president’s intent is the language of the order, he said, adding: “That is the end of the inquiry.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe State of Washington, and others challenging the order, argue that it was an illegal ban of Muslims, papered over with reasons that the law permits.\n\nAdvertisement Continue reading the main story\n\nAnd that is where Mr. Giuliani’s remarks come in. Until his interview, Mr. Giuliani — the former mayor of New York, former candidate for the United States Senate and former candidate for president — had largely fallen into eclipse following a spectacular run of appearances on behalf of Mr. Trump during the campaign.\n\nIn October, Mr. Giuliani boasted of having inside information from F.B.I. agents and promised a late-game surprise that would damage the campaign of Hillary Clinton, the Democratic opponent of Mr. Trump. “We’ve got a couple of things up our sleeve that should turn this thing around,” he said.\n\nIndeed, 11 days before the election, the F.B.I. director announced that the agency was looking into emails that had been found on a laptop used by the estranged husband of an aide to Mrs. Clinton. Although the F.B.I. eventually said nothing in the emails warranted prosecution, the political damage had been done to the Clinton campaign.\n\nDuring arguments this week, the lawyer from the Department of Justice seemed to scoff at citations from news reports of remarks by Mr. Trump and Mr. Giuliani.\n\n“It is extraordinary for a court to enjoin the president’s national security determination based on some newspaper articles,” Mr. Flentje said.\n\nJudge Richard R. Clifton, a member of the appeals panel who was nominated to the bench by President George W. Bush, wanted clarification.\n\n“Do you deny that in fact the statements attributed to then-candidate Trump and to his political advisers, and most recently Mr. Giuliani — do you deny that those statements were made?” Judge Clifton asked.\n\nMr. Flentje suggested that campaign statements were not the right place to look for the president’s intent.\n\nJudge Clifton said the words mattered: “Either those kinds of statements were made, or they’re not.”", "authors": ["Jim Dwyer", "About New York"], "publish_date": "2017-02-09", "source": "nytimes", "top_words": ["theres", "came", "input", "test", "trump", "immigration", "court", "united", "states", "religion", "statements", "order", "president", "york", "mr", "giuliani", "giulianis"], "summary": "That would include an interview Mr. Giuliani gave the day after it was issued.\n“I’ll tell you the whole history of it,” Mr. Giuliani said on Fox.\nIn October, Mr. Giuliani boasted of having inside information from F.B.I.\nagents and promised a late-game surprise that would damage the campaign of Hillary Clinton, the Democratic opponent of Mr. Trump.\nDuring arguments this week, the lawyer from the Department of Justice seemed to scoff at citations from news reports of remarks by Mr. Trump and Mr. Giuliani."}