{"url": "https://www.nytimes.com/2017/02/20/opinion/should-judge-gorsuch-answer.html?mcubz=0", "id": "272", "title": "Should Judge Gorsuch Answer?", "text": "Photo\n\nTo the Editor:\n\nCharles E. Schumer, the senior senator from New York and the Senate minority leader, should know better (“We Won’t Be Fooled Again,” Sunday Review, Feb. 12). Judge Neil M. Gorsuch, President Trump’s nominee to the Supreme Court, acted properly by not responding to Senator Schumer’s questions: The courts and judges do not deal with hypotheticals.\n\nJudge Gorsuch has been a member of the 10th Circuit Court of Appeals for more than a decade, and his fitness for the Supreme Court should be assessed by his opinions and rulings on the cases he participated in while on the bench.\n\nFinally, it is important to note that without the support of Chief Justice John G. Roberts Jr. — who Senator Schumer feels fooled him — the Affordable Care Act, arguably the Obama administration’s signature domestic legislative achievement that is under review by the new administration, might not have survived.\n\nIRA SOHN\n\nNew York\n\nTo the Editor:\n\nJudge Neil M. Gorsuch would not describe his views on a Muslim travel ban, executive power, voter fraud versus voting rights, Citizens United, the Bush v. Gore ruling or the Emoluments Clause in an hour discussion with Senator Charles E. Schumer.\n\nAdvertisement Continue reading the main story\n\nShould we assume that Judge Gorsuch had the same nonanswers when he talked with President Trump, Vice President Mike Pence and Stephen K. Bannon before his nomination to the Supreme Court? Absolutely not.", "authors": [], "publish_date": "2017-02-20", "source": "nytimes", "top_words": ["m", "supreme", "judge", "answer", "court", "neil", "gorsuch", "senator", "president", "review", "schumer"], "summary": "PhotoTo the Editor:Charles E. Schumer, the senior senator from New York and the Senate minority leader, should know better (“We Won’t Be Fooled Again,” Sunday Review, Feb. 12).\nJudge Neil M. Gorsuch, President Trump’s nominee to the Supreme Court, acted properly by not responding to Senator Schumer’s questions: The courts and judges do not deal with hypotheticals.\nJudge Gorsuch has been a member of the 10th Circuit Court of Appeals for more than a decade, and his fitness for the Supreme Court should be assessed by his opinions and rulings on the cases he participated in while on the bench.\nIRA SOHNNew YorkTo the Editor:Judge Neil M. Gorsuch would not describe his views on a Muslim travel ban, executive power, voter fraud versus voting rights, Citizens United, the Bush v. Gore ruling or the Emoluments Clause in an hour discussion with Senator Charles E. Schumer.\nAdvertisement Continue reading the main storyShould we assume that Judge Gorsuch had the same nonanswers when he talked with President Trump, Vice President Mike Pence and Stephen K. Bannon before his nomination to the Supreme Court?"}