{"url": "https://www.nytimes.com/2017/02/06/us/attorneys-general-democrats-trump-travel-ban.html?mcubz=0", "id": "217", "title": "How Attorneys General Became Democrats’ Bulwark Against Trump", "text": "“If they follow through on campaign promises as outrageous as a Muslim ban, then we do have a serious challenge to our constitutional structure,” Mr. Schneiderman said.\n\nThe immigration order spurred swift legal actions from five states in four federal courts, and for the most part they adopted a common strategy. With the attorneys general and their aides frequently trading notes, three states — New York, Massachusetts and Virginia — intervened on behalf of individuals stopped at airports. All three cited the state’s interest in protecting students and faculty members at public universities.\n\nPhoto\n\nA fourth attorney general, Bob Ferguson of Washington State, took a different approach, suing Mr. Trump on behalf of the state itself. He said he spoke with a number of colleagues last week to invite them to join his riskier plan, but initially found only one taker, Lori Swanson of Minnesota.\n\nIt was Mr. Ferguson’s suit that won the biggest victory: a federal judge’s ruling on Friday that froze, at least temporarily, the carrying out of a travel ban. Mr. Trump’s administration has filed an appeal before the United States Court of Appeals for the Ninth Circuit, which is set to hold a hearing on Tuesday.\n\nThe matter is likely to end up before the Supreme Court.\n\nThe number of states opposing Mr. Trump’s order in court may continue to grow: On Monday, Attorney General Doug Chin of Hawaii filed a motion to join Mr. Ferguson’s suit. And 16 of Mr. Ferguson’s colleagues — including Mr. Schneiderman, Mr. Shapiro and Mr. Becerra — filed an amicus brief with the appeals court supporting his action.\n\nHector Balderas, the New Mexico attorney general, said he had directed aides to identify areas where Trump administration policies could damage New Mexico.\n\nHe described the attack on Mr. Trump’s immigration order as a blueprint for state attorneys general who aim to rein in the White House.\n\nAdvertisement Continue reading the main story\n\n“It does seem that we are becoming, potentially, the fourth branch of government,” Mr. Balderas said in an interview.\n\nA Looming Fight\n\nEven before Mr. Trump’s directive, Democratic attorneys general were gearing up to play a larger role in national politics. With Republicans in control of the White House and Congress, Democrats have increasingly looked to the states both to challenge Mr. Trump’s policies and to enforce federal regulations, including on business and the environment, that his administration may ignore.\n\nSeveral state attorneys general have cited as an inspiration the long-running legal war waged against the Obama administration by Republican attorneys general, who derailed key White House policies on immigration and nearly voided the Affordable Care Act.\n\nWhile Mr. Trump was being sworn in last month, three up-and-coming Democratic attorneys general — Mr. Balderas, Mr. Schneiderman and Maura Healey of Massachusetts — joined a conference of wealthy political donors in South Florida to deliberate over the party’s future. Ms. Healey said there appeared to be an “awakening” among Democratic leaders about the significance of party leaders in the states.\n\nChris Jankowski, a Republican strategist who was an architect of his party’s efforts to elect formidable attorneys general over the past decade, said Democratic attorneys general were “clearly poised to emerge as a check on the Trump administration, just as their Republican colleagues did for eight years.”\n\nMr. Jankowski, a lawyer, said Democratic attorneys general would probably rely heavily on the Constitution’s civil rights protections, much as Republicans leaned on constitutional limits on federal economic power.\n\n“State attorneys general are now permanent pieces on the chessboard of national policy development and implementation,” Mr. Jankowski said. “And they are not mere pawns.”\n\nOn the last Friday in January, many of those officials had gathered in Fort Lauderdale for a conference of the Democratic Attorneys General Association, a group that helps raise money for their campaigns.\n\nAdvertisement Continue reading the main story\n\nNormally a combination of dry panel discussions and partisan strategizing, the event had a distinctly ominous tone in the shadow of Mr. Trump’s inauguration, several attendees said: At a private luncheon, Representative Debbie Wasserman Schultz, the former Democratic Party chairwoman, exhorted the group to see itself as a last line of defense.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMs. Wasserman Schultz, in an interview, said she asked the attorneys general to work with congressional Democrats to combat “an administration that has no regard for the law or the Constitution.”\n\nThe White House issued its immigration decree the same day.\n\nThe Frantic Response\n\nFor the Democrats gathered in Fort Lauderdale, the order was like a starter’s pistol. Racing back to their home states, they began a loosely coordinated effort to challenge Mr. Trump in court.\n\nMr. Ferguson landed in Seattle at noon Saturday, Jan. 28, amid growing airport protests. After rushing home and conferring with staff members, he began calling up Washington-based corporations — including Expedia and Amazon — to enlist them in a lawsuit.\n\nIf some of his colleagues were caught off guard, Mr. Ferguson, a cerebral former state chess champion, said his office had been bracing for just such an action. “We’d been anticipating that the president would execute an executive order along these lines,” he said. “We’d been having internal communications about it.”\n\nMr. Ferguson told his staff that he viewed Mr. Trump’s policy as thoroughly unconstitutional. An effective lawsuit, he said, should leave the order in tatters.\n\nHis colleagues across the country, however, quickly settled on a narrower legal strategy: In New York and Massachusetts, Mr. Schneiderman and Ms. Healey developed plans to assail the Trump order based on its impact on specific state institutions, like public hospitals and universities where faculty members and students would be affected.\n\nMs. Healey, a former Harvard basketball player, said she and her senior aides spoke with top officials at the University of Massachusetts, M.I.T. and her alma mater as they developed their suit. In a bipartisan gesture, she also resolved to bring her state’s Republican governor, Charlie Baker, on board. The two spoke before the suit was filed, Ms. Healey said, and Mr. Baker issued a statement backing the challenge.\n\nPhoto\n\nThough many national Republicans declined to criticize Mr. Trump, Ms. Healey said the image of solidarity across party lines had been important in her state. “This goes to the heart of who we are,” she said.\n\nAdvertisement Continue reading the main story\n\nIn the suburbs of Philadelphia on the same Saturday, Mr. Shapiro, a former county commissioner sworn in as attorney general just 11 days earlier, began rounding up counterparts to issue a joint statement of opposition to the executive order while he was coaching his 7-year-old son’s basketball game.\n\nTapping away on his iPhone, Mr. Shapiro circulated a draft to colleagues including Mr. Schneiderman, Mr. Becerra and Ms. Healey before appealing to the full group of Democratic attorneys general to endorse it. Democratic legal officers from 16 states and the District of Columbia signed the letter; attorneys general from six states, including deep-red Mississippi and Kentucky, did not.\n\nIn the statement, the signers pledged to “use all the tools of our offices to fight this unconstitutional order and preserve our nation’s national security and core values.” Mr. Shapiro said he “personally worked the phones” to organize the group message.\n\nThe Struggle in Court\n\nOver the first weekend Mr. Trump’s executive order was in effect, groups like the American Civil Liberties Union charged into court and won temporary restraining orders blocking key parts of it.\n\nBut Mr. Ferguson filed the first and broadest state lawsuit on Monday, Jan. 30, with a far more sweeping complaint depicting the executive order as an unlawful assault on Washington businesses and communities.\n\nEach day brought new legal actions by the states: On Tuesday, Ms. Healey announced that Massachusetts would join a lawsuit backed by the A.C.L.U. involving plaintiffs flying through Logan International Airport in Boston. Mr. Schneiderman announced a similar approach in New York. Throughout the week, Attorney General Mark R. Herring of Virginia filed a flurry of legal actions aimed at bolstering the claims of people detained at Dulles International Airport, and challenging the conduct of federal immigration officers there.\n\nPhoto\n\nYet rather than demonstrating weakness, the diffuse nature of the Democratic legal response ended up working to the state attorneys general’s advantage, effectively allowing Mr. Trump’s foes to test multiple strategies before multiple federal judges.\n\nAnd when the anti-Trump lawyers faced one setback in court on Friday, as a federal judge in Boston declined to extend a decision suspending parts of the travel ban, that disappointment was quickly overshadowed by Mr. Ferguson’s victory in Seattle.\n\nAdvertisement Continue reading the main story\n\n“All of us cheered,” Ms. Healey said, recalling the news of the ruling.\n\nSome did more than cheer: One group, including Mr. Shapiro, Mr. Schneiderman and Ms. Healey, marshaled support for a “friend of the court” brief supporting Mr. Ferguson as he heads into protracted litigation.\n\nMr. Trump’s administration has appealed the Seattle judge’s ruling, and the states face a long legal battle with the federal government.\n\nBut in a reflection of the power states have to thwart his agenda, Mr. Trump spent the weekend raging on Twitter that an individual court ruling could stop the whole executive branch in its tracks.\n\n“What is our country coming to,” he wrote, “when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.?”", "authors": ["Alexander Burns"], "publish_date": "2017-02-06", "source": "nytimes", "top_words": ["bulwark", "trump", "state", "democrats", "order", "democratic", "trumps", "attorneys", "general", "states", "mr", "healey"], "summary": "PhotoA fourth attorney general, Bob Ferguson of Washington State, took a different approach, suing Mr. Trump on behalf of the state itself.\nHe described the attack on Mr. Trump’s immigration order as a blueprint for state attorneys general who aim to rein in the White House.\nA Looming FightEven before Mr. Trump’s directive, Democratic attorneys general were gearing up to play a larger role in national politics.\nSeveral state attorneys general have cited as an inspiration the long-running legal war waged against the Obama administration by Republican attorneys general, who derailed key White House policies on immigration and nearly voided the Affordable Care Act.\n“State attorneys general are now permanent pieces on the chessboard of national policy development and implementation,” Mr. Jankowski said."}