{"url": "https://www.nytimes.com/2017/02/10/opinion/footing-the-bill-for-trumps.html?mcubz=0", "id": "246", "title": "Footing the Bill for Trumps", "text": "Melania says her legal actions are completely misunderstood.\n\nConservatives used to have a field day complaining about the high cost of moving the Obamas around. The future President Trump himself once tweeted: “The habitual vacationer, @BarackObama, is now in Hawaii. This vacation is costing taxpayers $4 million +++ while there is 20% unemployment.”\n\nThe unemployment rate was not, at the time, anywhere near 20 percent. And last weekend Trump happily ran up a federal bill of around $3 million for a trip to Mar-a-Lago where he watched the Super Bowl and dropped in on a Red Cross ball, which presumably brought his resort a hefty fee.\n\nYeah, it’s the profit-making end of the story that’s so irritating. When Eric Trump went to Uruguay, his mission was to promote Trump Tower Punta del Este. “We’re going to have an amazing company,” Eric told the local media, adding that his father was going to do “amazing things for the United States.” And that Dad would be “an incredible commander in chief.” The apple doesn’t fall far from the tree, adjective-wise.\n\nThe president has theoretically separated himself from all his businesses, but they still belong to him. He may not have operational command, but Eric does, and it’s hard for folks in Uruguay not to believe that the president is watching when the son comes to call and mix with his fellow realtors, flanked by a security detail that’s on our dime.\n\nThose continuing financial interests around the world are a huge problem — you probably noticed that the immigration ban on Muslim-majority countries didn’t include the ones in which the president had hotels or condos or golf courses? And he’s never going to do anything to fix it. When Trump was calling for better ethics in Washington, he only wanted us to drain the other guys’ swamp.\n\nBut don’t you wish he’d try to show he appreciates the security price tag? We don’t want to make little Barron change schools, but Trump could buy Melania a condo in a relatively low-traffic location to save security from having to create a no-go zone in Midtown. It would send up a signal that he realized the problems he was causing. Also it would be cheaper for the Defense Department. And maybe closer to the school. The only thing inconvenienced would be Donald’s bottom line.\n\nAnd Eric could have put his security detail up for free. Given that he was traveling on a moneymaking venture and all.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nTrump did announce that when the Japanese prime minister, Shinzo Abe, came to visit him in Mar-a-Lago this weekend, he was not going to charge Abe for his room. “That is a gift that the president is extending to the prime minister,” said White House Press Secretary Sean Spicer, otherwise known as The Most Miserable Man on Earth.\n\nAdvertisement Continue reading the main story\n\nThat was the grand gesture. Meanwhile, you could argue that Trump is using a visit by an important foreign leader to promote one of his brands.\n\nAt least Abe has not been requested to pose holding up a gift bottle of Trump wine. As far as we know.", "authors": ["Gail Collins"], "publish_date": "2017-02-10", "source": "nytimes", "top_words": ["eric", "world", "trump", "weekend", "security", "abe", "going", "trumps", "sign", "president", "york", "footing", "bill"], "summary": "The future President Trump himself once tweeted: “The habitual vacationer, @BarackObama, is now in Hawaii.\nAnd last weekend Trump happily ran up a federal bill of around $3 million for a trip to Mar-a-Lago where he watched the Super Bowl and dropped in on a Red Cross ball, which presumably brought his resort a hefty fee.\nWhen Eric Trump went to Uruguay, his mission was to promote Trump Tower Punta del Este.\nMeanwhile, you could argue that Trump is using a visit by an important foreign leader to promote one of his brands.\nAt least Abe has not been requested to pose holding up a gift bottle of Trump wine."}