{"url": "https://www.nytimes.com/2017/02/05/us/politics/trumps-travel-ban.html?mcubz=0", "id": "207", "title": "Where Trump’s Travel Ban Stands", "text": "Photo\n\nWASHINGTON — A fast-moving legal fight over President Trump’s targeted travel ban reached the United States Court of Appeals for the Ninth Circuit, in San Francisco, late Saturday. Here is a look at where things stand.\n\nWhat does the Trump administration want?\n\nLawyers for the federal government asked the appeals court to stay a temporary restraining order issued Friday by Judge James Robart of the Federal District Court in Seattle. Judge Robart was appointed by President George W. Bush.\n\nVideo\n\nActing on a request from two states, Washington and Minnesota, Judge Robart temporarily banned the administration from enforcing two parts of Mr. Trump’s order: its 90-day suspension of entry into the United States of people from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen, and its limits on accepting refugees, including “any action that prioritizes the refugee claims of certain religious minorities.”\n\nJudge Robart’s order allowed people from the seven countries who had been authorized to travel, along with vetted refugees from all nations, to enter the country.\n\nAdvertisement Continue reading the main story\n\nWhat does the administration argue?\n\nIn its brief, the administration said that Judge Robart had “improperly second-guessed the president’s national security determinations.” The brief said the president had vast power over immigration under the Constitution and federal law.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nWhat did the appeals court do?\n\nThe court declined to issue an immediate administrative stay, but it said it would consider the federal government’s emergency motion for a stay after receiving more briefs. The court set a very fast briefing schedule, asking the states to respond by midnight Sunday Pacific time, with the federal government to file a second brief by 3 p.m. on Monday.", "authors": ["Adam Liptak"], "publish_date": "2017-02-05", "source": "nytimes", "top_words": ["stands", "stay", "travel", "ban", "brief", "judge", "court", "order", "trumps", "federal", "states", "president", "robart", "administration"], "summary": "PhotoWASHINGTON — A fast-moving legal fight over President Trump’s targeted travel ban reached the United States Court of Appeals for the Ninth Circuit, in San Francisco, late Saturday.\nLawyers for the federal government asked the appeals court to stay a temporary restraining order issued Friday by Judge James Robart of the Federal District Court in Seattle.\nJudge Robart was appointed by President George W. Bush.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\nThe court declined to issue an immediate administrative stay, but it said it would consider the federal government’s emergency motion for a stay after receiving more briefs."}