{"url": "https://www.nytimes.com/2017/02/06/business/trump-travel-ban-apple-google-facebook.html?mcubz=0", "id": "211", "title": "Tech Opposition to Trump Propelled by Employees, Not Executives", "text": "Many of the companies initially placed their bets on engagement after an upbeat meeting with the president-elect in December. That modest approach, which even the most risk-averse executive can endorse, showed its limits last week. After widespread customer defections, Travis Kalanick, the chief executive of Uber, was forced to step down from one of the administration’s advisory councils.\n\n“People voted with their feet, and Travis listened,” said Dave McClure, who runs the 500 Startups incubator and started the Nerdz 4 Hillary group that tried to raise the $100,000. “We need to hold the other tech leaders accountable in the same way.”\n\nResistance, Mr. McClure said, begins at home.\n\n“You don’t have a voice with the president if you didn’t vote for him,” he said. “But employees and customers have a voice with the tech companies. Silicon Valley should be demonstrating at the front doors of Google, Facebook and Twitter to make sure they share our values.”\n\nSeveral factors are propelling Silicon Valley to the front lines of opposition to Mr. Trump. Some have been widely noted: The companies are often founded by and run by immigrants, which made the executive order on immigration offensive and a threat to their way of doing business. Tech companies frequently stress the importance of talent from other countries to their businesses.\n\nLess remarked on has been the political homogeneity of tech workers. “It’s not like you have 60 percent of the employees on one side and 40 percent on the other,” said Ken Shotts, a professor of political economy at the Stanford Graduate School of Business. “They all have the same leanings.”\n\nMr. Trump does have some support in Silicon Valley, most notably the venture capitalist Peter Thiel.\n\nYet another factor pushing the companies is the perennially tight job market in technology. Executives cannot afford to alienate a large bloc of workers. Beyond this, there is the mythology of Silicon Valley, which holds that the work being done there is building a better future. Google’s former slogan “Don’t be evil” is the most forceful expression of this.\n\n“If you go around making a lot of statements about your exalted role in society, at some point your employees might just make you follow through,” Mr. Shotts said.\n\nAdvertisement Continue reading the main story\n\nSince the executive order was issued, the companies have struggled to keep on the same page with their employees. Microsoft, for instance, initially made relatively muted comments that mostly celebrated immigration. Twenty-four hours later, it was much blunter, calling the order “misguided and a fundamental step backwards,” and saying it would create “much collateral damage to the country’s reputation and values.”\n\nPhoto\n\nAt an all-hands meeting at the beginning of the week with the chief executive, Satya Nadella, who was born in India, Microsoft employees expressed their concern. The company did not file a formal declaration supporting Washington State’s effort to block the order the way Amazon and Expedia did, but its public comments assisted the effort, Bob Ferguson, the state attorney general, said.\n\nThe immigration battle is in Microsoft’s self-interest. Seventy-six of its employees were affected by the order, the company said.\n\nSome in Silicon Valley have more expansive hopes for the tech companies there.\n\n“In 2016, we saw how technology could be used to polarize ourselves to extreme levels,” said Mr. Altman of Y Combinator. “The most important thing we could do is figure out how to use technology to depolarize the nation.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. McClure of 500 Startups said it was ridiculous “for the chief executives of the valley to suggest things like hate speech and bullying speech aren’t solvable problems. Google has been solving the problem of spam for the last 10 years. No reason they can’t fix the monetization of fake news.”\n\nPerhaps the companies just need a little push. On Sunday night, the Super Bowl was in overtime and a dreary winter rain was falling in San Francisco. That was not enough to deter more than 100 tech workers from showing up for a meeting of a new group, Tech Solidarity, that hopes to tackle some of these issues from the bottom up.\n\nMaciej Ceglowski, the organizer, canvassed the crowd. How many of you are immigrants? How many work for big tech companies? How many work for big tech companies that attended the Trump tech summit in December? In each case, numerous hands went up. Under the rules of the meeting, participants were not identified.\n\nIt was a very geeky event. Much of it was a fund-raiser for three legal aid groups that have been working to assist travelers caught in the ban. The speaker for the Council of American-Islamic Relations was asked what she needed. She replied that she was having trouble with her customer relationship management software.\n\n“I’ve actually been pretty obsessed with C.R.M.s lately,” said a woman in the audience, volunteering to help.\n\nAdvertisement Continue reading the main story\n\nMr. Ceglowski is a software engineer who runs the one-man start-up Pinboard. He was visiting the United States in 1981 with his mother when martial law was declared in their native Poland. He is now an American citizen.\n\nBest-known in tech circles as a caustic critic of the large tech companies and their attitude to issues like privacy, he took on the activist mantle shortly after Mr. Trump was elected. Since then, Tech Solidarity has held rallies in Portland, Ore.; New York; Seattle; Boston; and other cities.\n\nHe talked about Facebook’s chief operating officer, Sheryl Sandberg, the author of “Lean In,” which asks women, “What would you do if you weren’t afraid?” Mr. Ceglowski noted that Ms. Sandberg found time to go see Mr. Trump, but not to go to the women’s march on Washington. The crowd laughed. Ms. Sandberg has said that she had a personal obligation that kept her from the march.\n\nWhen Facebook employees did their own protest last week, he pointed out, it was done in secret so no one knew about it.\n\n“We have to protest in public,” he said. The event raised $30,000 for the legal aid groups.\n\n“It looked like two-thirds of the room were newcomers,” Mr. Ceglowski said after the event was over. Unlike the great Silicon Valley companies, which seemed to blossom overnight, he said he knew progress here would be slow. But he was hopeful that some of the attendees were previously apolitical folk who had taken their first steps to engagement.\n\n“I want pressure from below to counterbalance the pressure management is already feeling from above,” he said. “We have to make sure we’re pushing at least as hard as Trump is.”", "authors": ["David Streitfeld"], "publish_date": "2017-02-06", "source": "nytimes", "top_words": ["executive", "companies", "propelled", "trump", "tech", "valley", "order", "meeting", "opposition", "silicon", "employees", "mr", "executives"], "summary": "Silicon Valley should be demonstrating at the front doors of Google, Facebook and Twitter to make sure they share our values.”Several factors are propelling Silicon Valley to the front lines of opposition to Mr. Trump.\nTech companies frequently stress the importance of talent from other countries to their businesses.\n“They all have the same leanings.”Mr. Trump does have some support in Silicon Valley, most notably the venture capitalist Peter Thiel.\nHow many work for big tech companies that attended the Trump tech summit in December?\nUnlike the great Silicon Valley companies, which seemed to blossom overnight, he said he knew progress here would be slow."}