{"url": "https://www.nytimes.com/2017/02/10/world/middleeast/iran-revolution-anniversary.html?mcubz=0", "id": "252", "title": "Iran Celebrates Its Revolution, and Thanks Some Americans", "text": "“American people are welcome and invited to visit Iran,” one read. “Thanks to American people for supporting Muslims,” said another. “Down with American regime, long live U.S. people,” another exclaimed.\n\n“Let’s face it, we didn’t like Obama much, but he was much better than Mr. Trump,” said Manoucher Ashtiari, a retiree who carried a sign lauding the Islamic Revolution. “I come every year. This year, there are no missiles on display. I don’t care, what matters is that we support our revolution.”\n\nAdvertisement Continue reading the main story\n\nSpeaking to crowds gathered in Azadi Square here, Mr. Rouhani said that leaders of other nations “must talk to the Iranian nation with respect and dignity,” adding that Iran would meet any threat.\n\nVideo\n\n“We are not after tensions in the region and the world,” he said. “We are united in the face of bullying and any threat.”\n\nThe anniversary of the Islamic Revolution is mainly celebrated as a political event. When Iranians ousted the shah in 1979, one of their demands was independence from the dominant powers of the time, the United States and the Soviet Union. While many Iranians have criticized how their country is managed today, even more point to a long list of historical grievances they have with the United States.\n\n“The good thing about Trump is that he exposes to the world what is wrong with the U.S.,” said Mousa Aghababaei, a retired mathematics teacher who attended the rally with his family. They watched others walking by, pushing strollers and chatting. “I like to be here; it’s important for me.”", "authors": ["Thomas Erdbrink"], "publish_date": "2017-02-10", "source": "nytimes", "top_words": ["long", "iran", "celebrates", "mr", "world", "trump", "revolution", "united", "iranians", "thanks", "islamic", "americans", "american"], "summary": "“American people are welcome and invited to visit Iran,” one read.\n“Thanks to American people for supporting Muslims,” said another.\n“Down with American regime, long live U.S. people,” another exclaimed.\n“Let’s face it, we didn’t like Obama much, but he was much better than Mr. Trump,” said Manoucher Ashtiari, a retiree who carried a sign lauding the Islamic Revolution.\n“We are united in the face of bullying and any threat.”The anniversary of the Islamic Revolution is mainly celebrated as a political event."}