{"url": "https://www.nytimes.com/2017/03/06/us/politics/annotated-executive-order-immigration-travel-ban.html?mcubz=0", "id": "297", "title": "Analyzing Trump’s New Travel Ban", "text": "Photo\n\nWASHINGTON — President Trump on Monday morning approved a new travel ban executive order, replacing the one he issued in January that had spawned chaos nationwide and was blocked by federal courts. The new order bars entry of some people from six predominantly Muslim countries — Iran, Libya, Somalia, Sudan, Syria and Yemen — for 90 days and suspends entry of some refugees for 120 days. But it carves out many exceptions and is less sweeping than the original. The administration hopes that the narrower order will survive court challenges.\n\nHere are some excerpts from the executive order, with comments by The New York Times. The full text of the order is available here.\n\nIt invokes a vague threat of terrorism.\n\n“The screening and vetting protocols and procedures associated with the visa-issuance process and the United States Refugee Admissions Program (USRAP) play a crucial role in detecting foreign nationals who may commit, aid, or support acts of terrorism and in preventing those individuals from entering the United States. It is therefore the policy of the United States to improve the screening and vetting protocols and procedures …”\n\nThis is toned down from Mr. Trump’s original order, which invoked the terrorist attacks of Sept. 11, 2001, even though none of the 19 hijackers were refugees or nationals of the countries targeted by the directive, which had also included Iraq.\n\nIt defends the previous order against accusations of religious discrimination.\n\n“Executive Order 13769 did not provide a basis for discriminating for or against members of any particular religion. … That order was not motivated by animus toward any religion, but was instead intended to protect the ability of religious minorities — whoever they are and wherever they reside — to avail themselves of the USRAP in light of their particular challenges and circumstances.”\n\nDuring the presidential campaign, Mr. Trump flatly proposed banning Muslims from entering the United States. That evolved into his original order, which permanently barred Syrian refugees and temporarily barred entry of nationals from seven Muslim-majority countries, while prioritizing admission of refugees who are persecuted religious minorities — an exception that many understood to be an implicit reference to welcoming Christians from the Middle East. One of the federal judges who blocked the original order, citing its history and context, ruled that it likely amounted to unconstitutional religious discrimination.\n\nAdvertisement Continue reading the main story\n\nIraq is off the list.\n\nThe “close cooperative relationship between the United States and the democratically elected Iraqi government, the strong United States diplomatic presence in Iraq, the significant presence of United States forces in Iraq, and Iraq’s commitment to combat ISIS, justify different treatment for Iraq.”\n\nMr. Trump’s original order blocked Iraqis, too, but his new one left them out. The Pentagon had lobbied the White House to drop Iraq from the list because the backlash was undermining the joint campaign to battle the Islamic State. The new order emphasizes that Iraqis who have battled ISIS have “earned enduring respect.” It also says that since the original order, Iraq has undertaken unspecified steps to improve travel documentation and information sharing.", "authors": ["Charlie Savage"], "publish_date": "2017-03-06", "source": "nytimes", "top_words": ["original", "travel", "nationals", "analyzing", "ban", "iraq", "refugees", "united", "states", "trumps", "religious", "entry", "countries", "order"], "summary": "PhotoWASHINGTON — President Trump on Monday morning approved a new travel ban executive order, replacing the one he issued in January that had spawned chaos nationwide and was blocked by federal courts.\nHere are some excerpts from the executive order, with comments by The New York Times.\n“Executive Order 13769 did not provide a basis for discriminating for or against members of any particular religion.\nOne of the federal judges who blocked the original order, citing its history and context, ruled that it likely amounted to unconstitutional religious discrimination.\nThe new order emphasizes that Iraqis who have battled ISIS have “earned enduring respect.” It also says that since the original order, Iraq has undertaken unspecified steps to improve travel documentation and information sharing."}