{"url": "https://www.nytimes.com/2017/02/06/us/politics/trump-travel-ban-john-kerry.html?mcubz=0", "id": "220", "title": "Kerry and Albright Ask Courts to Keep Blocking Trump’s Travel Ban", "text": "Photo\n\nA group of prominent Democrats who served in recent administrations, including John Kerry and Madeleine K. Albright, have called on the courts to extend a ruling blocking crucial parts of President Trump’s travel ban, saying the White House executive order would “endanger U.S. troops” and disrupt antiterrorism efforts.\n\nThe former officials expressed their concerns on Monday to the United States Court of Appeals for the Ninth Circuit, based in San Francisco, which is considering the matter after a judge in Seattle effectively ruled that travelers from seven predominantly Muslim nations as well as vetted refugees from all nations could, for now, continue to enter the United States.\n\nWith Mr. Trump’s executive order, “we risk placing our military efforts at risk by sending an insulting message” to Iraqis working with American forces battling the Islamic State there, the legal filing to the court said. “The order will likely feed the recruitment narrative of ISIL and other extremists that portray the United States as at war with Islam,” it said, using another name for the Islamic State, also known as ISIS.\n\nIn addition to Mr. Kerry, a secretary of state under President Barack Obama, and Ms. Albright, who held the same position under President Bill Clinton, officials behind the filing included Susan E. Rice, Mr. Obama’s national security adviser, and Leon E. Panetta, who served as secretary of defense and head of the C.I.A.\n\nAdvertisement Continue reading the main story\n\nThe filing comes a week after Mr. Obama took issue with Mr. Trump’s order, saying in a statement that he “fundamentally disagrees with the notion of discriminating against individuals because of their faith or religion.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe former officials hope that adding their voice to the debate from a national security perspective undercuts a critical argument of the Trump administration: that the travel ban is meant to deter terrorist attacks by keeping the country safe from “very bad and dangerous people,” as Mr. Trump has put it.", "authors": ["Gerry Mullany"], "publish_date": "2017-02-06", "source": "nytimes", "top_words": ["travel", "courts", "ban", "filing", "state", "blocking", "albright", "united", "officials", "trumps", "ask", "order", "president", "york", "mr", "kerry", "continue"], "summary": "PhotoA group of prominent Democrats who served in recent administrations, including John Kerry and Madeleine K. Albright, have called on the courts to extend a ruling blocking crucial parts of President Trump’s travel ban, saying the White House executive order would “endanger U.S. troops” and disrupt antiterrorism efforts.\nWith Mr. Trump’s executive order, “we risk placing our military efforts at risk by sending an insulting message” to Iraqis working with American forces battling the Islamic State there, the legal filing to the court said.\nYou must select a newsletter to subscribe to.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\nView all New York Times newsletters."}