{"url": "https://www.nytimes.com/2017/02/08/world/middleeast/in-istanbul-surprise-that-trump-towers-complex-is-linked-to-trump.html?mcubz=0", "id": "236", "title": "In Istanbul, Surprise That Trump Towers Complex Is Linked to Trump", "text": "It was the revelation of that deal that had the Sumeli sisters making for a premature exit. “Why should I respect a president who doesn’t respect my veil?” asked the younger Ms. Sumeli, who is studying child development. “We won’t be coming here again,” her elder sister added.\n\nThe sisters were among several visitors to take issue with Mr. Trump’s attempts to suspend immigration from seven Muslim-majority countries. While Turks were not subject to the ban, most interviewed at Trump Towers were nevertheless offended by its principle and expressed solidarity with those from the affected countries.\n\n“It doesn’t matter whether Turkey is included or not — I’m against it,” the younger Ms. Sumeli said while gathering her things. If “my government banned Christians,” she added, “I’d be against that, too.”\n\nTrump Towers Istanbul is a two-pronged construct: an office block and an apartment complex that jut skyward from a multistory mall at the bottom.\n\nThough it stands in a country increasingly blighted by terrorism, and though it is named for a man increasingly at odds with the Muslim world, security is light. As at most malls in this city, there is just a single airport-style X-ray machine at each entrance. The local municipality says it has no plans to increase security, and visitors themselves displayed few signs of concern.\n\n“I really don’t care if it’s Trump’s or not,” said Ozan Tung, a 23-year-old actor who was finishing off a chicken curry. “What else am I going to do if I don’t come here?”\n\nYet Mr. Trump has received his fair share of bad publicity in Turkey. In June, President Recep Tayyip Erdogan even called for the towers to be renamed, in protest of Mr. Trump’s Islamophobic remarks during the campaign.\n\nPhoto\n\nSince Mr. Trump announced his travel ban, Mr. Erdogan has avoided directly condemning Mr. Trump, leaving criticism to colleagues in his government. Analysts speculate that Mr. Erdogan is waiting to see how Mr. Trump approaches Turkey before voicing his disapproval too openly.\n\nAdvertisement Continue reading the main story\n\nForeign visitors to the mall would recognize many of the shops; Benetton, Burger King, Mango and Lacoste all have a home there. In the basement is a playground and a carousel, among other attractions for children.\n\nAnd at the very top of the escalators is the most familiar name of all: Trump Cadde, or Trump Avenue. It’s a string of upscale cafes clustered around the mall’s main attraction, a restaurant called Trumpet.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe mall is full of the city’s middle class: hairdressers, students — and at one table, a quartet of female civil servants. They were wary of giving their full names because of the purge of government employees that followed the failed coup last year, but the question of the mall’s eponym nevertheless set off a lively discussion.\n\nAyten B., 45, won’t be coming again, she declared, to nods of approval from her friends. If their children didn’t like the playground in the basement so much, they said, they wouldn’t have come in the first place. But, Ayten said, there’s something to Mr. Trump’s thought process: Look at all those bad things happening in the seven banned countries.\n\nHatice E., 43, agreed. Iran is a law unto itself, and there’s chaos across Iraq, Somalia and Yemen. Who would want that?\n\nAyse G., 40, gently constructed a counterargument. Why should Mr. Trump punish a whole religion, she asked, rather than just the few people responsible?\n\nThen the coffees arrived and Hacer N., 43, spoke up. If Mr. Trump is against Muslims, she wondered, why has he built a mall in a Muslim country? He shouldn’t be erecting buildings here, Ayse chimed in, if he doesn’t like Muslims.\n\nThe Sumeli sisters said they were mystified by Mr. Erdogan’s approach to Mr. Trump, and by his other recent diplomatic moves, too.\n\nAdvertisement Continue reading the main story\n\n“Actually I can’t understand it,” Evin said. “He has good relations with someone, and then he breaks that relationship. He has bad relations with Russia, and then he fixes it.”\n\n“I just don’t get it,” Mizgin added.\n\nBut elsewhere in the building, not everyone was so concerned. Deep in the bowels of the mall, Umit Basalan, a 29-year-old shopkeeper, said there was little wrong with Mr. Trump’s travel ban.\n\n“His decision was right — it’s not about Muslims, it’s about terror,” said Mr. Basalan, suggesting that Turkey should copy Mr. Trump’s policy. “At first he spoke about Muslims, but then he just referred to these seven countries.”\n\nMr. Basalan fondly remembered a 2012 visit by Mr. Trump’s daughter and adviser, Ivanka Trump. “Maybe,” Mr. Basalan concluded, “she brings business.”\n\nTwo floors above, the Sumeli sisters had just made their exit. “We were going to tour around,” the elder sister said. “But now we’re just going to leave.”", "authors": ["Patrick Kingsley"], "publish_date": "2017-02-08", "source": "nytimes", "top_words": ["main", "trump", "visitors", "sumeli", "turkey", "towers", "complex", "trumps", "sisters", "istanbul", "mall", "basalan", "linked", "mr", "surprise"], "summary": "In June, President Recep Tayyip Erdogan even called for the towers to be renamed, in protest of Mr. Trump’s Islamophobic remarks during the campaign.\nPhotoSince Mr. Trump announced his travel ban, Mr. Erdogan has avoided directly condemning Mr. Trump, leaving criticism to colleagues in his government.\nAnalysts speculate that Mr. Erdogan is waiting to see how Mr. Trump approaches Turkey before voicing his disapproval too openly.\nWhy should Mr. Trump punish a whole religion, she asked, rather than just the few people responsible?\nThe Sumeli sisters said they were mystified by Mr. Erdogan’s approach to Mr. Trump, and by his other recent diplomatic moves, too."}