{"url": "https://www.nytimes.com/2017/02/08/arts/music/budapest-festival-orchestra-triumphs-over-trumps-travel-ban.html?mcubz=0", "id": "229", "title": "An Orchestra Triumphs Over Trump’s Travel Ban", "text": "So Mr. Fischer — who has worked to combat anti-Semitism at home by taking the orchestra to play in abandoned synagogues in Hungarian towns whose Jewish populations were killed off in World War II — spoke by phone to a State Department official. He argued that his cellist, whom he declined to name out of concern for the player’s safety, was as Hungarian as anyone in the orchestra, and that he did not believe that the executive order, which he read, applied to dual-passport holders. The next day, after pressure from diplomats in Britain, Canada and elsewhere, Trump administration officials announced that dual citizens would be allowed to enter the country.\n\nSo when the Budapest Festival Orchestra gathered onstage at David Geffen Hall on Monday evening to play the Ninth Symphony — and the “Ode to Joy” melody, a paean to brotherhood, was first sounded by the low strings — its cello section was intact.\n\nPhoto\n\nThe behind-the-scenes musical diplomacy was one of the more dramatic moments as the classical field adapts to a changing United States during the Trump era. The travel ban has drawn criticism from the League of American Orchestras and from Deborah Borda, the president and chief executive of the Los Angeles Philharmonic, who wrote in The Los Angeles Times that it “betrays our immigrant roots.” The Seattle Symphony planned a free Wednesday concert of music from the countries it targeted. And Christoph von Dohnanyi, the former music director of the Cleveland Orchestra, wrote a denunciation of the ban, stating that his uncle, the German Lutheran theologian Dietrich Bonhoeffer, who was killed by the Nazis, would have opposed a policy that barred Muslims while making exceptions for Christians.\n\nFor American music lovers, the resolution of the Budapest ensemble’s visa issue allowed them to hear one of the most admired, and unusual, orchestras of the day. Mr. Fischer is reverent about the music he conducts but not about what he sees as some of the stultifying traditions that have grown up around it.\n\nFor this week’s Beethoven concerts, that meant placing the timpanist front and center, where a concerto soloist usually stands, rather than at the back of the stage; inviting students from the Juilliard School and Bard College to run onstage to play near the end of a performance of the Fifth Symphony; and sprinkling undercover members of the Concert Chorale of New York around the audience so they could pop up to sing the “Ode to Joy” at the end of the Ninth.\n\n“I think if we hear these voices from everywhere — from the audience, from us, the people, then it comes much closer to the original meaning of the work,” Mr. Fischer said.\n\nPhoto\n\nEven his rehearsals are unusual. He began a Beethoven rehearsal at Geffen Hall on Monday morning with a Bach chorale, which he explained was a tradition: “It creates a separation between the outside world and our world — it helps the mind, it helps the soul, it helps the ears.” He sometimes got down from his podium to wander among the players, and repeatedly leapt off the stage and ran to Row J to test balances.\n\nAdvertisement Continue reading the main story\n\nJane Moss, the artistic director of Lincoln Center, said that Mr. Fischer had become a New York favorite for his virtuosity and his expansive ideas of what concerts can be. “In 80 percent of the cases, my right eyebrow is going up as there is yet again a new idea, and every single time, it turn out to be unbelievably powerful,” she said.\n\nMr. Fischer will return to the Mostly Mozart Festival at Lincoln Center this summer with Mozart’s “Don Giovanni,” one of several well-regarded semi-staged productions for which he serves as both conductor and director. (He calls the present tradition “completely artificial, with the director and the conductor being the two polarized forces pulling poor singers in two directions.”)\n\nAsked if he saw parallels between the United States these days and Hungary — which has also had a rise in right-wing populism, battles over immigration and refugees, and the construction of a fence along its southern border — he said that he saw these trends in many places.\n\n“I don’t see it as an American problem,” he said. “I see it as a worldwide problem. We now live in a period when fear is somehow misused and stirred up. And it’s an extremely dangerous phenomenon.”", "authors": ["Michael Cooper"], "publish_date": "2017-02-08", "source": "nytimes", "top_words": ["travel", "helps", "world", "play", "ban", "orchestra", "triumphs", "trumps", "director", "symphony", "fischer", "music", "mr", "center"], "summary": "The next day, after pressure from diplomats in Britain, Canada and elsewhere, Trump administration officials announced that dual citizens would be allowed to enter the country.\nPhotoThe behind-the-scenes musical diplomacy was one of the more dramatic moments as the classical field adapts to a changing United States during the Trump era.\nAnd Christoph von Dohnanyi, the former music director of the Cleveland Orchestra, wrote a denunciation of the ban, stating that his uncle, the German Lutheran theologian Dietrich Bonhoeffer, who was killed by the Nazis, would have opposed a policy that barred Muslims while making exceptions for Christians.\nMr. Fischer is reverent about the music he conducts but not about what he sees as some of the stultifying traditions that have grown up around it.\n“I think if we hear these voices from everywhere — from the audience, from us, the people, then it comes much closer to the original meaning of the work,” Mr. Fischer said."}