{"url": "https://www.nytimes.com/2017/02/08/us/love-interrupted-a-travel-ban-separates-couples.html?mcubz=0", "id": "233", "title": "Love, Interrupted: A Travel Ban Separates Couples", "text": "Mr. Nasreldin and Ms. Fadul were among those racing to reunite, hoping to bind themselves together no matter the outcome of federal court cases challenging the legality of Mr. Trump’s temporary ban.\n\nMany of the couples touched by the executive order are accustomed to living apart. They had met online, on business trips or on return visits to countries that one or both had left years ago. What changed, they said, was their certainty they would make it through the immigrant vetting process and one day live together in the United States.\n\n“It’s all up in the air,” said Guy R. Croteau, a psychotherapist in Boston who met his fiancé, an Iranian, through Facebook and became engaged after a few whirlwind visits in Istanbul and Malaysia.\n\nPhoto\n\nHis fiancé — Mr. Croteau publicly refers to him as “M” because he is concerned about M’s safety as a gay man living in Iran — received a K-1 fiancé visa that is valid until July, one of 30,000 to 40,000 such visas granted each year. But the couple are unsure whether the visa will still be valid after the administration’s 90-day immigration hold passes. They are waiting it out apart.\n\n“We don’t know,” Mr. Croteau said. “Will there be additional vetting? We don’t know.”\n\nIn the meantime, couples are trying to bridge the divide digitally. Olivia Cross chats by video with her husband, Yahya Abedi, an Iranian, as she walks between classes at the University of Michigan. Mr. Abedi has taped photos of the couple’s wedding to the wall of his apartment in Bandar Abbas so Ms. Cross, an American citizen, can see them when she calls.\n\nAfter meeting online, they married last February in Tbilisi, Georgia, and had been threading their way through the visa process when Mr. Trump signed the order. Iran retaliated, saying it would bar American citizens from traveling there. And there went the couple’s plans for a reunion in Iran this May.\n\n“I just feel like whatever I do, however I try to pivot, it’s all blocked,” Ms. Cross said. “We just want to be able to live our life together.”\n\nAdvertisement Continue reading the main story\n\nWhen Michelle Brady chats by video with her husband, a Sudanese-born aid worker recovering in Poland after heart surgery, their 21-month-old son, Jad, recognizes his father’s pixelated face on the screen. When they disconnect, Jad tries to find his father in the computer.\n\nPhoto\n\n“He’s crying and upset that his dad is not there,” said Ms. Brady, who is now unsure when her husband can join them at their home in the Washington area.\n\nEven those who aren’t separated say the order has scrambled their plans for weddings and engagements. Relatives from Iran or Syria aren’t sure whether they will be able to attend summer weddings in the United States. Couples with immigrant parents say they are hesitant about traveling to their familial homelands to celebrate.\n\nDr. Arash Afshinnik, who leads a neurointensive care unit in Fresno, was married three weeks ago in California and planned to fly to Iran with his wife, Sandra Shahinpour, for a second ceremony with her family. He has been in the United States since he was 3 months old, but she spent part of her 20s in Iran and is close to friends and cousins who had wanted to celebrate.\n\n“We’ve scrapped the plans,” Dr. Afshinnik, 40, said. His wife returned the dress she had bought for the ceremony. “While everything’s getting sorted out, what hasn’t changed is the uncertainty. Why even dip your toe in the pool? It just seems too hot.”\n\nFor much of their 21-month courtship, Jehan Mouhsen and Khaled Almilaji lived apart. She studied medicine in Montenegro. Dr. Almilaji, 35, a Syrian physician well known among humanitarian-aid workers, was in Turkey, saving lives, he said, by supporting doctors in the Syrian conflict zone. He is a romantic who sent Dr. Mouhsen, 26, “buckets of roses” and surprised her with visits to Montenegro.\n\nPhoto\n\nThey married in July, and in August they settled in Rhode Island, where Dr. Almilaji had received a scholarship for a master’s degree in public health at Brown University, studying on a student visa. He was excited to be sharpening skills to help rebuild his country. She was excited because it seemed their days apart were over.\n\nNow Dr. Almilaji is stranded in Gaziantep, Turkey, near the Syrian border, after what was supposed to be a one-week visit to take care of personal and professional affairs. His original return visa was not honored. He went to the American Consulate in Istanbul on Jan. 20 to get a new visa to return, and has not heard back.\n\nAdvertisement Continue reading the main story\n\nDr. Mouhsen fled the loneliness of their apartment in Providence to stay with friends in New York City, where she is studying for her medical board exams and wrestling with morning sickness. She is pregnant.\n\n“He tells me to eat fruits and vegetables, take care of me and the baby,” she said.\n\nAlthough Dr. Mouhsen has Montenegrin roots, they both grew up in Aleppo, Syria, and plan to return someday. In 2013, Dr. Almilaji’s early detection system found that polio was making a comeback in war-ravaged Syria, and he coordinated a campaign the next year that vaccinated more than a million Syrian children. Though his work was supported by powerful organizations like the United States Agency for International Development, Unicef, the World Health Organization and the Bill and Melinda Gates Foundation, there is little they can do to help him now.\n\nEarly in the civil war, Dr. Almilaji was arrested, tortured and jailed for six months by the regime. But he says he feels even more powerless now that his wife is suffering from an abrupt separation caused by the action of the United States government.\n\n“I’ve been arrested, and I’ve been tortured and everything,” he said in a phone conversation from Turkey. “But my wife, she doesn’t have to suffer this.”", "authors": ["Jack Healy", "Anemona Hartocollis"], "publish_date": "2017-02-08", "source": "nytimes", "top_words": ["dr", "iran", "travel", "couples", "syrian", "ban", "almilaji", "wife", "separates", "love", "united", "ms", "interrupted", "mr", "visa"], "summary": "Many of the couples touched by the executive order are accustomed to living apart.\nBut the couple are unsure whether the visa will still be valid after the administration’s 90-day immigration hold passes.\nDr. Almilaji, 35, a Syrian physician well known among humanitarian-aid workers, was in Turkey, saving lives, he said, by supporting doctors in the Syrian conflict zone.\nNow Dr. Almilaji is stranded in Gaziantep, Turkey, near the Syrian border, after what was supposed to be a one-week visit to take care of personal and professional affairs.\nEarly in the civil war, Dr. Almilaji was arrested, tortured and jailed for six months by the regime."}