{"url": "https://www.nytimes.com/2017/02/10/us/politics/trump-wall-21-billion-dollars.html?mcubz=0", "id": "250", "title": "Trump Overrules Tillerson, Rejecting Elliott Abrams for Deputy Secretary of State", "text": "Mr. Trump has been increasingly focused on who was with him or against him during his campaign, according to several people who have spoken with him in recent days.\n\nMr. Tillerson had argued strongly for Mr. Abrams. So had Jared Kushner, Mr. Trump’s son-in-law and a senior adviser. Senator Tom Cotton, Republican of Arkansas who is closely aligned with friends of Mr. Abrams’, and some members of the pro-Israel lobbying group Aipac, had been reaching out to Democratic senators to impress upon them the importance of Mr. Abrams receiving Senate confirmation.\n\nAides to Mr. Trump did not respond to an email seeking comment.\n\nDemocrats turn up heat on Flynn\n\nThe revelation that Michael T. Flynn, President Trump’s national security adviser, apparently discussed sanctions with Russia’s ambassador to the United States in the weeks before the inauguration has given Democrats a new cudgel to revive discussions of Mr. Trump’s ties to Russian President Vladimir V. Putin.\n\nAnd they are swinging it.\n\nRepresentative Eric Swalwell of California, the ranking Democrat on the C.I.A. subcommittee of the House Intelligence Committee, called it “a crime for someone outside of our government to negotiate with foreign entities on our nation’s behalf.”\n\nSenators Christopher S. Murphy of Connecticut and Edward J. Markey of Massachusetts, both Democrats, were similarly scathing in a joint statement. Said Mr. Murphy:\n\n“There is no good way to explain today’s report that Michael Flynn was coordinating sanctions relief for Russia before his boss was inaugurated. Either Donald Trump directed his National Security Adviser to undermine U.S. foreign policy on Russia, or Michael Flynn went rogue and did it on his own. Then he either lied to the Vice President or the Vice President went on television to lie to the American people. Whatever transpired, the President needs to get his White House under control.”\n\nCandidate for solicitor general drops out\n\nWith the legal fight over President Trump’s travel ban apparently headed for the Supreme Court, a leading contender for the job of arguing the government’s cases before the highest court has dropped out of consideration.\n\nThe candidate, Charles J. Cooper, said he was withdrawing as a possible nominee for solicitor general of the United States “after witnessing the treatment of my friend Jeff Sessions,” who was approved as attorney general Wednesday evening after bruising attacks by Senate Democrats over his civil rights record.\n\nMr. Cooper, a conservative Washington lawyer who argued against gay marriage in an important California case, said that after what Mr. Sessions “had to endure at the hands of a partisan opposition that will say anything and do anything to advance their political interests, I am unwilling to subject myself, my family, and my friends to such a process.”\n\nAdvertisement Continue reading the main story\n\nHis withdrawal appears to leave George T. Conway, a New York lawyer who is married to Kellyanne Conway, a top White House aide, as the leading contender for solicitor general. Mr. Trump said Thursday that he expected to select a new nominee in about a week. Whoever gets confirmed for the job could end up arguing the legality of Mr. Trump’s travel ban before the Supreme Court.\n\n‘Big, beautiful’ — and pricey\n\nNo wonder Mr. Trump wants the Mexicans to pay for it.\n\nThe wall on the southern border — really a set of fences and walls — would take three and a half years to build and would cost $21.6 billion, according to an internal report by the Department of Homeland Security that was seen by Reuters.\n\nThat’s well over the $12 billion estimated by Mr. Trump during the campaign, and the upper bound of $15 billion cited by Republican leaders in Congress.\n\nAt a time when federal deficits are again expected to grow, the amount is not pocket change. As the population ages and draws on Social Security, Medicare and Medicaid, the Congressional Budget Office is already expecting the government to heap nearly $10 trillion onto the federal debt over the coming decade — and that is with statutory caps on domestic and military spending. Mr. Trump has already vowed to bust through those caps on the military side of the ledger, something that would take an act of Congress.\n\nNow he’ll have to pay extra for his promised wall — either out of existing domestic programs or above the nondefense caps.\n\nPresidential viewing habits ... exposed\n\nMr. Trump is still pretty miffed that a three-judge panel of the Ninth Circuit Court of Appeals unanimously upheld a restraining order against his travel ban from seven majority-Muslim countries.\n\nWe can also deduce what he was watching on television: MSNBC’s Morning Joe.\n\nWonder why it took 12 minutes to compose that post on Twitter.\n\nThat sudden talk with China\n\nOn Thursday night, The New York Times published a scoop: the president of the United States had not spoken to the president of China, Xi Jinping, who was icing him out over his unorthodox call with the leader of Taiwan during his transition to power, and his suggestion that just maybe, Washington would no longer follow the “One China” policy (which affirms that Taiwan is a province of the mainland).\n\nAdvertisement Continue reading the main story\n\nHours later, the White House issued a statement that, hey, not only had Mr. Trump just spoken to Mr. Xi, he had also expressed support for the One China policy after all — something Mr. Trump had said he would do only in return for concessions.\n\nThe Times story was rewritten accordingly, capturing the news.\n\nBut Mr. Trump does not accept the chronology — at least not publicly.\n\nThe campaign never ends\n\nHillary Clinton has been slow to emerge after her November defeat. But there she was on social media Thursday night, praising the unanimous decision by a three-judge panel of the Ninth Circuit Court of Appeals to uphold a nationwide restraining order against Mr. Trump’s travel ban for seven majority-Muslim countries.\n\nTo which Kellyanne Conway, the Trump campaign-manager-turned-White House adviser, had a reply.\n\nWinning is everything.\n\nHouse Republicans face a backlash\n\nFirst came the video of Representative Mike Coffman of Colorado sneaking out a back door to avoid the angry crowd gathered for his town hall meeting — but his suburban Denver district is swingy.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThen Representative Tom McClintock of California had to flee under guard as constituents in Roseville demanded to know why he was so bent on repealing the Affordable Care Act. But hey, it’s California — even though his turf outside Sacramento isn’t exactly Berkeley.\n\nBut Utah? On Wednesday, it was Representative Jason Chaffetz’s turn — in the reddest of states, in the Salt Lake City suburb Cottonwood Heights.\n\nIt’s getting ugly out there.", "authors": ["Maggie Haberman", "Jonathan Weisman", "Eric Lichtblau"], "publish_date": "2017-02-10", "source": "nytimes", "top_words": ["elliott", "travel", "trump", "state", "security", "overrules", "secretary", "trumps", "york", "general", "abrams", "rejecting", "states", "president", "house", "mr", "tillerson", "deputy"], "summary": "Aides to Mr. Trump did not respond to an email seeking comment.\nMr. Trump said Thursday that he expected to select a new nominee in about a week.\nWhoever gets confirmed for the job could end up arguing the legality of Mr. Trump’s travel ban before the Supreme Court.\n‘Big, beautiful’ — and priceyNo wonder Mr. Trump wants the Mexicans to pay for it.\nMr. Trump has already vowed to bust through those caps on the military side of the ledger, something that would take an act of Congress."}