{"url": "https://www.nytimes.com/2017/03/06/opinion/dont-be-fooled-trumps-new-muslim-ban-is-still-illegal.html?mcubz=0", "id": "294", "title": "Don’t Be Fooled, Trump’s New Muslim Ban Is Still Illegal", "text": "President Trump has not been subtle in his intentions. We need look no further than his own words to figure them out. On the campaign trail, he constantly conflated the vast majority of peaceful Muslims with the small handful of violent Muslims.\n\nAfter the Paris attacks in November 2015, Mr. Trump said that “we’re going to have no choice” but to close some mosques in the United States, where “some really bad things are happening.” The next month, after the attack in San Bernardino, Calif., he called for a “complete shutdown of Muslims entering the United States” and released a factually dubious statement that “large segments of the Muslim population” have “great hatred towards Americans” and favor Shariah law. Astonishingly, that statement is still posted on Mr. Trump’s website.\n\nIn December, when a reporter asked whether he had reconsidered his stance on Islam, President-elect Trump replied: “You know my plans. All along, I’ve been proven to be right.” This dark and wholly unsubstantiated worldview about Islam and the American Muslim community is shared by several of the president’s senior aides and advisers.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nLet’s be clear: This revised order is a Muslim ban. All the countries he has excluded are more than 90 percent Muslim. Three of them — Iran, Somalia and Yemen — are more than 99 percent Muslim. Even though Mr. Trump tailored his order to survive legal challenges, as his former adviser Rudolph Giuliani conceded on national television, his objective is clearly to exclude Muslims.\n\nThe Trump administration argues that the ban protects the country. Yet by excluding Iraq from the order, Mr. Trump has cleared travel from one of the two countries from which Islamic State terrorists operates. Moreover, the Department of Homeland Security concluded last month that “country of citizenship is unlikely to be a reliable indicator of potential terrorist activity.” Former national security officials from Democratic and Republican administrations have made clear that the January order does not make our country safer. Instead, the bigotry that Mr. Trump spews at news conferences and on Twitter have been a boon for terrorists’ recruitment efforts.\n\nThe twisted worldview does not match reality. Muslims have been part of America for centuries, since the first slave ships arrived in the 17th century. Today, Muslims represent 1 percent of the United States population: They are our teachers, doctors, neighbors and co-workers.\n\nAmerican Muslims will suffer a particular harm from this executive order: Those who have ties to the banned countries won’t be able to see their family members and close friends. American Muslims will also be deprived of the instruction from the leading Islamic scholars who are from those countries.\n\nThousands of Muslim men and women serve in the armed forces; many have given their lives defending our nation and our ideals. They contribute to the diversity that has always been our nation’s pride and strength. President George W. Bush paid tribute to this in the weeks after the Sept. 11 attacks when he said, “There are thousands of Muslims who proudly call themselves Americans, and they know what I know — that the Muslim faith is based upon peace and love and compassion.”\n\nPresident Trump and his top advisers would be wise to listen to President Bush. The Muslim ban and President Trump’s relentless attacks on Islam are not just an assault on thousands of patriotic, innocent Americans — they violate our Constitution and our most fundamental American values and beliefs.", "authors": ["Farhana Khera", "Johnathan Smith"], "publish_date": "2017-03-06", "source": "nytimes", "top_words": ["illegal", "trump", "ban", "dont", "know", "united", "president", "trumps", "states", "fooled", "islam", "order", "muslim", "muslims", "mr"], "summary": "President Trump has not been subtle in his intentions.\nIn December, when a reporter asked whether he had reconsidered his stance on Islam, President-elect Trump replied: “You know my plans.\nYet by excluding Iraq from the order, Mr. Trump has cleared travel from one of the two countries from which Islamic State terrorists operates.\nInstead, the bigotry that Mr. Trump spews at news conferences and on Twitter have been a boon for terrorists’ recruitment efforts.\nToday, Muslims represent 1 percent of the United States population: They are our teachers, doctors, neighbors and co-workers."}