{"url": "https://www.nytimes.com/2017/02/10/opinion/bad-dude-no-but-deported-anyway.html?mcubz=0", "id": "245", "title": "‘Bad Dude’? No, but Deported Anyway", "text": "Photo\n\nBy no standard of common sense or decency should Guadalupe García de Rayos have been a priority for deportation. Ms. Rayos, a 35-year-old mother of two, was arrested on Wednesday by Immigration and Customs Enforcement agents in Phoenix. On Thursday she was deported to Mexico, a country she left 21 years ago. Her devastated family, including her American-born children, remains in the United States.\n\nPresident Trump persists in the absurd claim that America will be safe and great again only after an assault on “bad dudes” and “criminal aliens,” whom he has promised to arrest and remove by the millions.\n\nBut Ms. Rayos fits no such definition and was no threat, though she had been living in the United States illegally since she was 14. She had been known to the authorities since she was caught in a workplace raid in Phoenix in 2008. In the years since, she would check in regularly with immigration officials, who chose not to deport her, having more important things to do.\n\nMr. Trump ran for office promising to eliminate such discretion and replace it with heedless and pointless enforcement. His campaign amplified the nativist passions of his supporters and hard-line advisers, including the man who is now his right hand in the Justice Department, Attorney General Jeff Sessions.\n\nAdvertisement Continue reading the main story\n\nWhat was always most alarming about Mr. Trump’s posturing on immigration wasn’t the wall, which will never be built in the way he describes it. It is instead the prospect of ramped-up enforcement that promises to increase misery on both sides of the border. The criminalizing of law-abiding immigrants who have lived in the United States for years, and of the migrants from Central America who arrive desperate for refuge. The households sundered, the jobs lost, the brutal idiocy of it all.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Trump, or the ideologues who speak into his ear and guide his pen, came up with executive orders the first week of his presidency that vastly expanded the universe of potential deportation targets to include anyone found guilty of any offense, no matter how old or minor, and people accused of crimes but not convicted. The orders sweep away the priorities set by President Barack Obama and his homeland security secretary, Jeh Johnson, under which agents were told to focus strictly on public-safety risks.", "authors": ["The Editorial Board"], "publish_date": "2017-02-10", "source": "nytimes", "top_words": ["trump", "bad", "immigration", "enforcement", "united", "deported", "rayos", "times", "sign", "dude", "reading", "states", "york"], "summary": "On Thursday she was deported to Mexico, a country she left 21 years ago.\nHer devastated family, including her American-born children, remains in the United States.\nBut Ms. Rayos fits no such definition and was no threat, though she had been living in the United States illegally since she was 14.\nThe criminalizing of law-abiding immigrants who have lived in the United States for years, and of the migrants from Central America who arrive desperate for refuge.\nView all New York Times newsletters."}