{"url": "https://www.nytimes.com/2017/02/05/us/lancaster-refugees-trump-travel-ban.html?mcubz=0", "id": "203", "title": "A Resettlement Mission Upended by the Sweep of a President’s Pen", "text": "“How much is he going to increase the level of security here by preventing these people from getting the protection they need?” she asked.\n\nThe weekend may have had its bright moments for refugees and their advocates, such as when, early Sunday, a federal appeals court rejected a request by the Justice Department to restore the president’s order immediately. But Ms. Mastropietro is loath to give her employees false hope.\n\n“They all know we’re talking about layoffs,” she said.\n\nHer staff members went back to work, back to assisting the refugees waiting in the lobby, clutching foreign-language paperwork. But they struggled to concentrate, as the Trump administration continues its efforts to upend their mission, with the president effectively suggesting that they are abetting “many very bad and dangerous people.”\n\nHere was Josh Digrugilliers, 26, a Church World Service housing specialist. Just two months ago, a visit to Lancaster found him preparing a slate-gray house on a hillside for the imminent arrival of another Syrian family, this one with six members. He had shopped at Walmart for last-minute household necessities, using money from the one-time government grant of $1,000 or so that each refugee receives.\n\nNow he was setting up a modest apartment for an incoming Haitian couple, but thinking about all those he knew who were hoping to be joined someday by relatives left behind.\n\nPhoto\n\n“You were rooting for them,” he said. “And they just lost a very big bet.”\n\nHere was Gaby Garver, 22, a case manager who, two months ago, shopped for food and stocked the cabinets of that gray house. She had collected the junk mail and turned up the heat a few hours before the family’s arrival at Lancaster Airport.\n\nAdvertisement Continue reading the main story\n\nNow she was taking a short break, sipping tea in a downtown cafe. “I can’t focus,” she admitted. “We’re all trying to find our bearings.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nAnd, finally, here was Amer Alfayadh, 34, a senior case manager whose family had come from Iraq “because we did not have the option to stay,” and who is the husband of a local woman named Brandy and the father of 15-month-old Sejad — a “blond and blue-eyed” boy, he says. Two months ago, Mr. Alfayadh collected that grateful family of Syrians at the airport and drove them to their new home.\n\nThe night of the executive order, Mr. Alfayadh had a nightmare about immigration officials coming to arrest him.\n\n“But I’m a citizen!”\n\n“Turn around.”\n\nNow Mr. Alfayadh was returning to that house on the hillside to visit the Syrian family he and his colleagues had resettled: Ahmad and Fatima Mohamed Zein, 53 and 50, and four of their children: Somaya, 32; Mona, 19; Yousef, 13; and Aya, 10.", "authors": ["Dan Barry", "This Land"], "publish_date": "2017-02-05", "source": "nytimes", "top_words": ["syrian", "upended", "family", "ago", "pen", "visit", "mission", "resettlement", "york", "months", "sign", "sweep", "alfayadh", "house", "presidents", "mr"], "summary": "Her staff members went back to work, back to assisting the refugees waiting in the lobby, clutching foreign-language paperwork.\nJust two months ago, a visit to Lancaster found him preparing a slate-gray house on a hillside for the imminent arrival of another Syrian family, this one with six members.\n“And they just lost a very big bet.”Here was Gaby Garver, 22, a case manager who, two months ago, shopped for food and stocked the cabinets of that gray house.\nTwo months ago, Mr. Alfayadh collected that grateful family of Syrians at the airport and drove them to their new home.\nThe night of the executive order, Mr. Alfayadh had a nightmare about immigration officials coming to arrest him."}