{"url": "https://www.nytimes.com/2017/02/27/opinion/who-belongs-in-trumps-america.html?mcubz=0", "id": "282", "title": "Who Belongs in Trump’s America?", "text": "Photo\n\n“I have a question in my mind,” Sunayana Dumala said after her husband, an Indian engineer, was shot dead last week in a Kansas bar. “Do we belong?”\n\nThere is no satisfying response to her concern, which is widely shared. The gunman reportedly yelled “get out of my country” before killing Ms. Dumala’s husband, Srinivas Kuchibhotla, as he was having a glass of whiskey after work with a friend, who was wounded.\n\nPresident Trump and his administration have not only tried to keep many immigrants and foreign visitors out of the country, they have done so by casting them as criminals, potential terrorists and trespassers, out to steal the jobs and threaten the lives of Americans.\n\nMs. Dumala and millions of other members of minorities are integral to the United States, which is almost entirely made up of immigrants and their descendants. But this history might not comfort marginalized groups who hear the administration’s words and see what is happening in this country and wonder if it is safe to stay here, or come here.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Trump’s denunciations of and policies targeting Mexicans, Muslims and others have reawakened and energized the demons of bigotry. Hate crimes and other incidents of bias have flared up, as documented by many news organizations. Mr. Kuchibhotla’s murder is one end of a continuum of hate. Elsewhere, people have defiled or threatened violence at Jewish cemeteries and synagogues.\n\nAdvertisement Continue reading the main story\n\nMr. Trump has been shockingly slow to condemn these acts of hate. When asked about anti-Semitic threats on Feb. 15, he talked about his election victory. The next day he told a Jewish reporter who asked a similar question to sit down. It was not until last week that Mr. Trump called the rise of anti-Semitism “horrible.” He has not said anything about the Kansas shooting. The White House press secretary, Sean Spicer, initially dismissed as “absurd” any link between it and Mr. Trump’s rhetoric, but on Monday called the anti-Semitic attacks and the Kansas shooting “equally disturbing.” Each act of hate is easily explained away as the work of a disturbed person. Yet, had these attacks been perpetrated by a Muslim or an undocumented immigrant, the president would surely have claimed that he was right all along.", "authors": ["The Editorial Board"], "publish_date": "2017-02-27", "source": "nytimes", "top_words": ["belongs", "america", "trump", "kansas", "hate", "week", "trumps", "country", "work", "sign", "york", "mr"], "summary": "Photo“I have a question in my mind,” Sunayana Dumala said after her husband, an Indian engineer, was shot dead last week in a Kansas bar.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\nMr. Trump’s denunciations of and policies targeting Mexicans, Muslims and others have reawakened and energized the demons of bigotry.\nAdvertisement Continue reading the main storyMr. Trump has been shockingly slow to condemn these acts of hate.\nIt was not until last week that Mr. Trump called the rise of anti-Semitism “horrible.” He has not said anything about the Kansas shooting."}