{"url": "https://www.nytimes.com/2017/02/09/world/middleeast/iran-trump-burn-flag.html?mcubz=0", "id": "243", "title": "Burn an American Flag? Some Iranians Are Saying No", "text": "In Washington, a coalition of Iranian-American groups and Iranian individuals was among the latest to take legal action against the Trump administration, announcing on Thursday that it had filed a lawsuit in federal court to block the president’s order as unconstitutional.\n\n“The executive order shunts aside the intricate matrix of statutes and regulations that govern the U.S. immigration system, and casts many thousands of families adrift without so much as a passing glance at the Constitution,” the lawsuit states.\n\nAn estimated one million Americans of Iranian descent reside in the United States, and Iran was the country most affected by the visa restriction in Mr. Trump’s order. Roughly 35,000 Iranians come to the United States annually, more than any of the other countries on the list.\n\n“This travel ban has galvanized the Iranian-American community in unprecedented ways,” Cyrus Mehri, a Washington-based Iranian-American civil rights lawyer, said in a news conference by telephone about the lawsuit. “We are gathering together and uniting to stop this ban not only for our community, but all others adversely affected.”\n\nMr. Trump’s tirades against Iran — he said on Twitter on Tuesday that the country was “#1 in terror” — have infuriated many Iranians, and many fear a return of sanctions and even military strikes. Still, others seem to appreciate that he is remarkably unpopular at home.\n\nIran’s National Day celebration often features homemade versions of the American and Israeli flags going up in flames, as masses of Iranians gather in rallies that are a sign of ideological strength. It is also a day out for families and young people, who are as interested in the Chinese products being sold in stalls along the demonstration routes as they are in political sloganeering.\n\nAdvertisement Continue reading the main story\n\nCriticizing actions by hard-liners is dangerous in Iran, where the judiciary and the police are focusing increasingly on online dissent. In recent months in several Iranian provinces, social media users were arrested after they posted “undesirable” content or spoke out against the Islamic republic’s policies.\n\nMany hard-liners responded online by criticizing those who had urged an end to flag-burning. One user posted images of American and Israeli flags on fire and a picture of an Iran Air commercial jetliner. “We don’t burns flags without reason,” he wrote on Twitter, referring to when an Iranian plane was shot down in 1988 by a missile from a United States Navy ship, killing 290 people. “We will burn flags again.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nOne political analyst, Nader Karimi Joni, considered close to the government, said he supported those protesting the flag-burning. “Look at the kindness Iranians received at U.S. airports by those protesting Trump. We insult those people when we burn their flag,” he said. “Unfortunately, some encourage these actions.”\n\nBut hard-liners said it was their right to burn the American flag, or any flag for that matter. “We don’t have to be thankful for Americans welcoming Iranians rendering services to that country,” said Hamidreza Taraghi, a political analyst.\n\nHe also said that the United States had recently increased tensions with Iran. “It is clear some here are chickening out, and calling for compromise with America,” he said. “But we must burn the U.S. flag, as long as they are hostile to us.”", "authors": ["Thomas Erdbrink"], "publish_date": "2017-02-09", "source": "nytimes", "top_words": ["iran", "political", "burn", "flag", "iranians", "united", "iranian", "sign", "saying", "states", "flags", "american"], "summary": "Roughly 35,000 Iranians come to the United States annually, more than any of the other countries on the list.\n“We will burn flags again.”Newsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box.\nWe insult those people when we burn their flag,” he said.\n“Unfortunately, some encourage these actions.”But hard-liners said it was their right to burn the American flag, or any flag for that matter.\n“But we must burn the U.S. flag, as long as they are hostile to us.”"}