{"url": "https://www.nytimes.com/2017/02/20/travel/after-travel-ban-declining-interest-trips-to-united-states.html?mcubz=0", "id": "273", "title": "After Travel Ban, Interest in Trips to U.S. Declines", "text": "In addition, the Swedish travel search engine Flygresor.se analyzed 2.5 million flight searches made on its website and app the weekend following the announcement of the travel ban and found that searches to the United States declined by 47 percent, compared with the same period the year before.\n\nFlight bookings to the United States also declined following the ban, according to ForwardKeys, a travel research company in Valencia, Spain. The company looked at 16 million flight reservations a day between Jan. 28 and Feb. 4 and found that international bookings to the United States were down 6.5 percent, compared with the same period last year.\n\nSome travel companies, too, saw a dip in requests and bookings for trips to the United States.\n\nResponsible Travel, a tour operator in Brighton, England, had a 22 percent decrease in trip inquiries to the United States following the travel ban. In contrast, the company’s overall business is up 30 percent this year, compared with the same period last year, said its chief executive, Justin Francis.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“Prior to the ban, the U.S. was one of our best-selling destinations, but our customers are now choosing to travel to other countries,” he said.\n\nAnd from Jan. 27 to Feb. 16, the tour operator Intrepid Travel saw a 21 percent decrease in sales for trips to the United States from travelers in Australia and a 30 percent decrease in sales from travelers in Britain. This is a stark contrast from early January, when the company saw record booking numbers from travelers in these countries, said Intrepid’s North American director, Leigh Barnes.\n\nThe short-term weaker demand for travel to the United States aside, the bigger concern for travel analysts is the ban’s potential to damage the country’s lucrative tourism industry in the coming years. Statistics from the Bureau of Economic Analysis, part of the United States Department of Commerce, show that tourism-related spending in the United States was $1.56 trillion in 2015; tourism created 7.6 million jobs in the United States that same year.\n\nAccording to Adam Sacks, the president of Tourism Economics, part of the economic research firm Oxford Economics, President Trump’s executive order is part of a broader policy platform and “America first” rhetoric that is creating international antipathy toward the United States and already affecting traveler behavior.\n\nEarlier this month, his group conducted a study of travel to Los Angeles County and found that the county could suffer a potential three-year loss of 800,000 international visitors as a direct result of the ban, the equivalent of $736 million in tourism spending.\n\n“It doesn’t take a lot of uncertainty or adverse sentiment to affect travel decisions,” Mr. Sacks said.\n\nAdvertisement Continue reading the main story\n\nAnd Rummy Pandit, the executive director of the Lloyd D. Levenson Institute of Gaming, Hospitality and Tourism at Stockton University in New Jersey, said that it’s irrelevant that the ban has been lifted. “There’s now a perception that the U.S. is a place of instability, and that view will impact visitation to this country,” he said.", "authors": ["Shivani Vora"], "publish_date": "2017-02-20", "source": "nytimes", "top_words": ["travel", "international", "declines", "ban", "saw", "period", "travelers", "united", "trips", "interest", "million", "states", "tourism"], "summary": "Flight bookings to the United States also declined following the ban, according to ForwardKeys, a travel research company in Valencia, Spain.\nSome travel companies, too, saw a dip in requests and bookings for trips to the United States.\nResponsible Travel, a tour operator in Brighton, England, had a 22 percent decrease in trip inquiries to the United States following the travel ban.\n“Prior to the ban, the U.S. was one of our best-selling destinations, but our customers are now choosing to travel to other countries,” he said.\nThe short-term weaker demand for travel to the United States aside, the bigger concern for travel analysts is the ban’s potential to damage the country’s lucrative tourism industry in the coming years."}