{"url": "https://www.nytimes.com/2017/02/17/us/politics/dr-sebastian-gorka.html?mcubz=0", "id": "267", "title": "Who Is Sebastian Gorka? A Trump Adviser Comes Out of the Shadows", "text": "Who Is Sebastian Gorka? A Trump Adviser Comes Out of the Shadows Image Sebastian Gorka, right, with Michael T. Flynn at Trump Tower in New York in November. Mr. Gorka was named a deputy assistant to President Trump. Credit Ruth Fremson/The New York Times\n\nSince President Trump appointed Sebastian Gorka last month as a deputy assistant, Mr. Gorka has been an increasingly visible defender of the administration.\n\nHe has spoken out in favor of the targeted travel ban, which spurred mass protests and was then blocked by federal courts. He suggested in a recent interview with The Hill that the CNN anchor Jake Tapper was sexist for aggressively questioning the Trump adviser Kellyanne Conway. He has also insisted that media reports of turmoil in the White House bear “almost no resemblance to reality.”\n\nMr. Gorka came out swinging again on Thursday, after Mr. Trump’s contentious news conference in which he excoriated the media. Asked by Evan Davis of the BBC to assess Mr. Trump’s appearance, Mr. Gorka repeatedly declared the president’s performance “fabulous.”\n\n“It’s only weird to journalists like yourself, who are biased,” he said.\n\n\"What we saw today was the old Donald Trump from the campaign trail and it was fabulous\" - Trump advisor @SebGorka talks to #Newsnight pic.twitter.com/MPtJBiyM9M — BBC Newsnight (@BBCNewsnight) February 16, 2017\n\nWho is he? Here’s what we know:\n\nNaturalized American citizen\n\nMr. Gorka is an American citizen who was born in Britain to Hungarian parents. He earned a Ph.D. in political science from Corvinus University of Budapest and has made his living as a national security expert with a focus on Islamist extremism.\n\nHe wrote a best-selling book, published last year, called “Defeating Jihad: The Winnable War.” In his Breitbart articles, he has criticized foreign policy under the Obama administration and trumpeted the threat of the Islamic State group.\n\nBreitbart veteran and friend of Bannon\n\nMr. Gorka, 46, is a former editor for the far-right media outlet Breitbart News and a friend of Stephen Bannon, the former Breitbart chairman who is now a powerful assistant to Mr. Trump.\n\nUntil recently, Mr. Gorka was not well known to Washington policy makers. But his increasing visibility has brought headlines, some less welcome than others.\n\nHe has appeared in a number of television and radio interviews as a representative of the Trump administration and a member of a White House team called the Strategic Initiatives Group. The Daily Beast called it a think tank within the White House that was set up by Mr. Bannon and the president’s son-in-law and senior adviser, Jared Kushner.\n\n‘Who is he reporting to?’\n\nThe group’s formation raised red flags, said Julianne Smith, a former deputy national security adviser to Vice President Joseph R. Biden Jr. and the director of strategy and statecraft at the Center for a New American Security.\n\nThe National Security Council has traditionally played a decisive role in foreign policy decisions, she said. “Now we have the Strategic Initiatives Group and the National Security Council both working on issues of national security and strategy. So my question on Sebastian, ultimately, is: Who is he reporting to? Is he reporting to the National Security Council? Or is this a direct line to Bannon?”\n\nMr. Gorka said he could not comment for this article without clearance from the White House. But after multiple calls and emails since Tuesday, neither he nor the White House has answered questions about his position or the role of the initiatives group.\n\nThis month, Mr. Gorka told CNN that the group would bring private industry expertise to bear on a range of issues, including cybersecurity, veterans affairs and the modernization of government technological systems.\n\n“That is very different from what the National Security Council is doing every day under the sterling leadership of General Flynn,” he added, referring to Michael T. Flynn, then the national security adviser, who would resign 12 days later.\n\nMs. Smith said she was not personally familiar with Mr. Gorka, though she had crossed paths with him during the early 2000s.\n\n“I don’t know what to believe about this guy, but given his experience at Breitbart and what I had heard years ago, it does appear to me that he takes some rather extreme views,” she said.\n\nClaims of Nazi sympathies\n\nMr. Gorka dismissed such criticisms during a Wednesday interview with Sean Hannity of Fox News and brushed aside some of the more controversial reports buzzing around him.\n\n“I think we’re doing our job very well — don’t you, Sean? — if this is the best they can do,” he said.\n\nVIDEO:\n\n\n\nOur detractors can't argue us on the merits so they attack us personally.\n\n\n\nSo telling. https://t.co/KIXhArPzJY@FoxNews pic.twitter.com/Fy4Q9Wnoxy — Sebastian Gorka DrG (@SebGorka) February 16, 2017\n\nHe referred to reports, like one from Fusion, that said he had exaggerated his role as an expert witness in the trial of Dzhokhar Tsarnaev, who was convicted of helping to carry out the Boston bombing of 2013. Mr. Gorka told Mr. Hannity he still had invoices for the expert report he submitted for the case.\n\n“I may not have taken the stand, but I was an expert on the Boston bombing trial,” he said.\n\nAs for the speculations about Nazi sympathies, they go back to one of Mr. Trump’s inauguration balls, when Mr. Gorka — appearing in photos and a video interview with Mr. Hannity — wore a medal that could be interpreted as a nod to Miklos Horthy, a Hungarian leader who entered into a strained alliance with Nazi Germany in the early years of World War II.\n\nIn a video posted by Breitbart on Tuesday, Mr. Gorka said the medal belonged to his father, who he said had suffered “under both the Nazis and the Communists” in Hungary, having lived through World War II and survived torture under the Soviet-imposed government that later came to power.\n\nEveryone LOVES a story, right?\n\n\n\nWell here's my father's story resisting oppression and what it means to me. https://t.co/UXkGOBZlhl — Sebastian Gorka DrG (@SebGorka) February 14, 2017\n\nMisdemeanor weapons charge\n\nMr. Gorka was charged with a misdemeanor after he took a handgun into Reagan National Airport in Virginia last year.\n\nIn a statement quoted by Breitbart, he said that on his way to the airport, he had “grabbed the wrong bag, one I had just used” at a gun range. He added that he was allowed to board his flight, and that the weapon was confiscated.\n\nThe charge was dropped early this month.\n\nThough his appointment to the White House occurred only recently, Mr. Gorka has been in touch with Mr. Trump at least since 2015. He wrote last year that he had submitted some policy papers to the presidential candidate and had met with him twice to discuss national security issues.\n\nFederal election commission filings indicate that the Trump campaign paid $8,000 to Mr. Gorka for policy consulting in 2015.\n\nIt is difficult to predict the impact Mr. Gorka could have on foreign policy in the White House, Ms. Smith said, especially since he is apparently working under the shadowy aegis of Mr. Bannon.\n\n“We’ve got a situation where both outsiders and certain members of the government are confused about who is serving as the lead on foreign policy decisions,” she said. “And because we are not clear about Steve Bannon’s role, it raises a lot of concern because of his personal views, and also his lack of experience.”\n\nSign Up for the Morning Briefing Get what you need to know to start your day in the United States, Canada and the Americas, delivered to your inbox. SEE SAMPLE Please verify you’re not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. * Required field You agree to receive occasional updates and special offers for The New York Times products and services. * Required field Thank you for subscribing. View all New York Times newsletters. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. Sign Up", "authors": ["Jacey Fortin"], "publish_date": "2017-02-17", "source": "nytimes", "top_words": ["trump", "national", "sebastian", "security", "policy", "breitbart", "house", "gorka", "shadows", "white", "adviser", "mr", "comes"], "summary": "A Trump Adviser Comes Out of the Shadows Image Sebastian Gorka, right, with Michael T. Flynn at Trump Tower in New York in November.\nCredit Ruth Fremson/The New York TimesSince President Trump appointed Sebastian Gorka last month as a deputy assistant, Mr. Gorka has been an increasingly visible defender of the administration.\n“Now we have the Strategic Initiatives Group and the National Security Council both working on issues of national security and strategy.\nMr. Gorka told Mr. Hannity he still had invoices for the expert report he submitted for the case.\nThough his appointment to the White House occurred only recently, Mr. Gorka has been in touch with Mr. Trump at least since 2015."}