{"url": "https://www.nytimes.com/2017/02/05/us/politics/trump-white-house-aides-strategy.html?mcubz=0", "id": "208", "title": "Trump and Staff Rethink Tactics After Stumbles", "text": "But one thing has become apparent to both his allies and his opponents: When it comes to governing, speed does not always guarantee success.\n\nThe bungled rollout of his executive order barring immigrants from seven predominantly Muslim countries, a flurry of other miscues and embarrassments, and an approval rating lower than that of any comparable first-term president in the history of polling have Mr. Trump and his top staff rethinking an improvisational approach to governing that mirrors his chaotic presidential campaign, administration officials and Trump insiders said.\n\nThis account of the early days of the Trump White House is based on interviews with dozens of government officials, congressional aides, former staff members and other observers of the new administration, many of whom requested anonymity. At the center of the story, according to these sources, is a president determined to go big but increasingly frustrated by the efforts of his small team to contain the backlash.\n\n“What are we going to do about this?” Mr. Trump pointedly asked an aide last week, a period of turmoil briefly interrupted by the successful rollout of his Supreme Court selection, Judge Neil M. Gorsuch.\n\nChris Ruddy, the chief executive of Newsmax Media and an old friend of the president’s, said: “I think, in his mind, the success of this is going to be the poll numbers. If they continue to be weak or go lower, then somebody’s going to have to bear some responsibility for that.”\n\n“I personally think that they’re missing the big picture here,” Mr. Ruddy said of Mr. Trump’s staff. “Now he’s so caught up, the administration is so caught up in turmoil, perceived chaos, that the Democrats smell blood, the protesters, the media smell blood.”\n\nOne former staff member likened the aggressive approach of the first two weeks to D-Day, but said the president’s team had stormed the beaches without any plan for a longer war.\n\nAdvertisement Continue reading the main story\n\nClashes among staff are common in the opening days of every administration, but they have seldom been so public and so pronounced this early. “This is a president who came to Washington vowing to shake up the establishment, and this is what it looks like. It’s going to be a little sloppy, there are going to be conflicts,” said Ari Fleischer, President George W. Bush’s first press secretary.\n\nPhoto\n\nAll this is happening as Mr. Trump, a man of flexible ideology but fixed habits, adjusts to a new job, life and city.\n\nCloistered in the White House, he now has little access to his fans and supporters — an important source of feedback and validation — and feels increasingly pinched by the pressures of the job and the constant presence of protests, one of the reasons he was forced to scrap a planned trip to Milwaukee last week. For a sense of what is happening outside, he watches cable, both at night and during the day — too much in the eyes of some aides — often offering a bitter play-by-play of critics like CNN’s Don Lemon.\n\nUntil the past few days, Mr. Trump was telling his friends and advisers that he believed the opening stages of his presidency were going well. “Did you hear that, this guy thinks it’s been terrible!” Mr. Trump said mockingly to other aides when one dissenting view was voiced last week during a West Wing meeting.\n\nBut his opinion has begun to change with a relentless parade of bad headlines.\n\nMr. Trump got away from the White House this weekend for the first time since his inauguration, spending it in Palm Beach, Fla., at his private club, Mar-a-Lago, posting Twitter messages angrily — and in personal terms — about the federal judge who put a nationwide halt on the travel ban. Mr. Bannon and Reince Priebus, the two clashing power centers, traveled with him.\n\nVideo\n\nBy then, the president, for whom chains of command and policy minutiae rarely meant much, was demanding that Mr. Priebus begin to put in effect a much more conventional White House protocol that had been taken for granted in previous administrations: From now on, Mr. Trump would be looped in on the drafting of executive orders much earlier in the process.\n\nAnother change will be a new set of checks on the previously unfettered power enjoyed by Mr. Bannon and the White House policy director, Stephen Miller, who oversees the implementation of the orders and who received the brunt of the internal and public criticism for the rollout of the travel ban.\n\nMr. Priebus has told Mr. Trump and Mr. Bannon that the administration needs to rethink its policy and communications operation in the wake of embarrassing revelations that key details of the orders were withheld from agencies, White House staff and Republican congressional leaders like Speaker Paul D. Ryan.\n\nAdvertisement Continue reading the main story\n\nMr. Priebus has also created a 10-point checklist for the release of any new initiatives that includes signoff from the communications department and the White House staff secretary, Robert Porter, according to several aides familiar with the process.\n\nMr. Priebus bristles at the perception that he occupies a diminished perch in the West Wing pecking order compared with previous chiefs. But for the moment, Mr. Bannon remains the president’s dominant adviser, despite Mr. Trump’s anger that he was not fully briefed on details of the executive order he signed giving his chief strategist a seat on the National Security Council, a greater source of frustration to the president than the fallout from the travel ban.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nIt is partly because he is seen as having a clear vision on policy. But it is also because others who had been expected to fill major roles have been less confident in asserting their power.\n\nJared Kushner, Mr. Trump’s son-in-law, occupies a central role in the administration and has been present at most major decisions and photo ops, but he is a father of young children who has taken to life in Washington, and, along with his wife, Ivanka Trump, has already been spotted at events around town.\n\nMr. Bannon has rushed into the vacuum, telling allies that he and Mr. Miller have a brief window in which to push through their vision of Mr. Trump’s economic nationalism.\n\nMr. Bannon, whose website, Breitbart, was a magnet for white nationalists and xenophobic speech, has also tried to reassure official Washington. He has been careful to build bridges with the Republican establishment, especially Mr. Ryan — whom he once described as “the enemy” and vowed to force out. He now talks regularly with Mr. Ryan to coordinate strategy or plot their planned overhaul of the tax code.\n\nBefore he was ousted in November as transition chief, Gov. Chris Christie of New Jersey, the Trump adviser with the most government experience, helped prepare a detailed staffing and implementation plan in line with the kickoff strategies of previous Republican presidents.\n\nPhoto\n\nIt was discarded — a senior Trump aide made a show of tossing it into a garbage can — for a strategy that prioritized the daily release of dramatic executive orders to put opponents on the defensive.\n\nMr. Christie, who agrees in principle with the broad strokes of Mr. Trump’s immigration policy, says the president has been let down by his staff.\n\nAdvertisement Continue reading the main story\n\n“The president deserves better than the rollout he got on the immigration executive order,” Mr. Christie said. “The fact is that he’s put forward a policy that, in my opinion, is significantly more effective than what he had proposed during the campaign, yet because of the botched implementation, they allowed his opponents to attack him by calling it a Muslim ban.”\n\nIn the past few days, Mr. Trump’s team has stressed its cohesion and the challenges of jump-starting an administration that few outside its group ever thought would exist.\n\n“This team spent months in the foxhole together during the campaign,” said Sean Spicer, the White House press secretary. “We moved into the White House as a unified team committed to enacting the president’s agenda.”\n\nAs part of Mr. Trump’s Oval Office renovation, he ordered that four hardback chairs be placed in a semicircle around his Resolute Desk now heaped, in Trump Tower fashion, with memos and newspapers. They are an emblem of Mr. Trump’s in-your-face management style, but also a reminder that in the White House, the seats always outlast the people seated in them.\n\nBut finding enough skilled players to fill key slots has not been easy: Mr. Spicer is serving double duty as communications director, a key planning position, in addition to engaging in day-to-day combat with the news media. Mr. Trump, several aides said, is used to quarterbacking his own media strategy, and did not see the value of hiring an outsider.\n\nAn early plan was to give the communications job to Kellyanne Conway, his former campaign manager and top TV surrogate, but the demands of the job would have conflicted with Ms. Conway’s other duties as a free-range adviser to Mr. Trump with Oval Office walk-in privileges, according to one aide.\n\nMr. Trump remains intensely focused on his brand, but the demands of the job mean he spends less time monitoring the news media — although he recently upgraded the flat-screen TV in his private dining room so he can watch the news while eating lunch.\n\nHe often has to wait until the end of the workday before grinding through news clips with Mr. Spicer, marking the ones he does not like with a big arrow in black Sharpie — though he almost always makes time to monitor Mr. Spicer’s performance at the daily briefings, summoning him to offer praise or criticism, a West Wing aide said.\n\nAdvertisement Continue reading the main story\n\nVisitors to the Oval Office say Mr. Trump is obsessed with the décor — it is both a totem of a victory that validates him as a serious person and an image-burnishing backdrop — so he has told his staff to schedule as many televised events in the room as possible.\n\nTo pass the time between meetings, Mr. Trump gives quick tours to visitors, highlighting little tweaks he has made after initially expecting he would have to pay for them himself.\n\nFlanking his desk are portraits of Presidents Thomas Jefferson and Andrew Jackson. He will linger on the opulence of the newly hung golden drapes, which he told a recent visitor were once used by Franklin D. Roosevelt but in fact were patterned for Bill Clinton. For a man who sometimes has trouble concentrating on policy memos, Mr. Trump was delighted to page through a book that offered him 17 window covering options.\n\nUltimately, this is very much the White House that Mr. Trump wanted to build. But while the world reckons with the effect he is having on the presidency, he is adjusting to the effect of the presidency on him. He is now a public employee. And the only boss Mr. Trump ever had in his life was his father, a hard-driving developer the president still treats with deep reverence.\n\nWith most of his belongings in New York, the only family picture on the shelf behind Mr. Trump’s desk is a small black-and-white photograph of that boss, Frederick Christ Trump.", "authors": ["Glenn Thrush", "Maggie Haberman"], "publish_date": "2017-02-05", "source": "nytimes", "top_words": ["administration", "trump", "tactics", "policy", "rethink", "trumps", "president", "going", "staff", "house", "white", "mr", "stumbles"], "summary": "PhotoAll this is happening as Mr. Trump, a man of flexible ideology but fixed habits, adjusts to a new job, life and city.\n“This team spent months in the foxhole together during the campaign,” said Sean Spicer, the White House press secretary.\nMr. Trump, several aides said, is used to quarterbacking his own media strategy, and did not see the value of hiring an outsider.\nUltimately, this is very much the White House that Mr. Trump wanted to build.\nAnd the only boss Mr. Trump ever had in his life was his father, a hard-driving developer the president still treats with deep reverence."}