{"url": "https://www.nytimes.com/2017/02/23/us/politics/fact-checking-claims-about-trumps-travel-ban.html?mcubz=0", "id": "278", "title": "Fact-Checking Claims About Trump’s Travel Ban", "text": "Here are some of the more misleading claims Mr. Trump and his administration have made about the first iteration of the travel ban.\n\nMr. Miller asserted that scores of immigrants from the seven countries were involved in terror cases in the U.S.\n\n“First of all, 72 individuals, according to the Center for Immigration Studies, have been implicated in terroristic activity in the United States who hail from those seven nations, point one.”\n\nA dubious list. The Center for Immigration Studies, which favors restrictive immigration, used a Senate subcommittee report to identify 72 people associated with the seven countries targeted by the executive order “who had been convicted in terror cases.”\n\nBut at least 38 of those people were convicted of forging immigration documents, lying to the F.B.I., tax fraud or other activities that are not terrorism related.\n\nAccording to the New America Foundation, all 12 jihadist terrorists who have killed people in the United States since Sept. 11, 2001, were American citizens or permanent residents, and none had ties to the seven countries named in Mr. Trump’s executive order. Out of the nearly 400 non-deadly jihadist terrorist attacks on American soil since 9/11, perpetrators were linked to Iran or Somalia in three cases.\n\nMr. Trump claimed that the executive order was no different from former President Barack Obama’s policy.\n\n“My policy is similar to what President Obama did in 2011, when he banned visas for refugees from Iraq for six months.”\n\nThe comparison is superficial. Mr. Trump criticized the news media for “falsely reporting” the executive order as a Muslim ban and suggested that he was merely building on a previous policy.\n\nMr. Obama’s State Department temporarily stopped processing refugee applications from Iraq in 2011, after two Iraqi refugees living in Bowling Green, Ky., were arrested on charges of trying to send money and supplies to Al Qaeda. But records from the State Department show that Iraqi refugees were still admitted to the United States every month in 2011.\n\nSo Mr. Obama’s “pause” had a narrower scope, was in response to a specific episode and does not appear to have been fully implemented.\n\nAdvertisement Continue reading the main story\n\nReince Priebus, the White House chief of staff, argued that the seven nations were previously identified by Mr. Obama as extremely terror-prone.\n\n“Here’s the deal, if you’re coming in and out of one of those seven countries — by the way, identified by the Obama administration as the seven most dangerous countries in the world in regard to harboring terrorists.”\n\nThis needs context. Under a 2015 law signed by Mr. Obama, foreign nationals who had traveled to or had dual citizenship in Iran, Iraq, Sudan or Syria were no longer eligible for the United States’ visa waiver program. Libya, Somalia and Yemen were later added.\n\nThe 2015 law, however, did not ban travel altogether, nor did it identify the seven countries as “the most dangerous.” While the State Department considers Iran, Sudan and Syria state sponsors of terrorism, these designations came decades before Mr. Obama. The State Department’s list of terrorist havens does include Iraq, Libya, Somalia and Yemen, as well as eight other areas not included in Mr. Trump’s ban.\n\nMr. Trump warned that refugees coming into the United States are not screened.\n\n“We’ve allowed thousands and thousands of people into our country. There was no way to vet those people. There was no documentation, there was no nothing.”\n\nThere was a way. The system for screening refugees, conceived in the 1980s and updated after 9/11, involves the United Nations and several intelligence and immigration government agencies. Applicants undergo several rounds of biographical and biometric — like fingerprinting and DNA testing — background checks that last one to two years.\n\nIntelligence officials have expressed concern about gaps in data collection for those fleeing chaotic conflict zones like Syria. In other words, the system isn’t foolproof, but it’s inaccurate to say the United States had “no way” to vet refugees.\n\nMr. Trump implied that the refugee admission system discriminated against Christian Syrians.\n\n“Do you know if you were a Christian in Syria, it was impossible, at least very tough, to get into the United States? If you were a Muslim, you could come in, but if you were a Christian, it was almost impossible.”\n\nNo evidence of discrimination. Christians make up around 10 percent of Syria’s overall population but just 1 percent of refugees admitted since Jan. 1, 2012. Neither the United Nations nor the State Department really know why this is the case, but experts have speculated that many Syrian Christians are moving to neighboring Lebanon or simply not seeking refugee status.\n\nThe strongest evidence against a systemic anti-Christian bias is the refugee makeup of the countries targeted by Mr. Trump’s executive order. For example, less than 1 percent of Iran’s population identifies as Christian, but 49 percent of Iranian refugees since 2012 have been Christian. The same pattern exists for Iraq, Sudan and Yemen.\n\nMr. Trump suggested that the U.S. Court of Appeals for the Ninth Circuit has an unusually poor track record.\n\n“In fact, we had to go quicker than we thought because of the bad decision we received from a circuit that has been overturned at a record number. I have heard 80 percent, I find that hard to believe, that is just a number I heard, that they are overturned 80 percent of the time.”\n\nNot the highest reversal rate. Mr. Trump has repeatedly knocked the court that blocked his executive order, and he is right that the Supreme Court reversed eight out of 10, or 80 percent, of Ninth Circuit cases on which it had a definitive ruling in 2015. But that’s neither a record nor particularly meaningful, as PolitiFact has reported.\n\nTwo other circuits — the state courts and the 11th Circuit — had higher reversal rates that year, at 85 percent and 100 percent. And just under 12,000 cases were filed to the Ninth Circuit from March 2014 to March 2015, meaning the Supreme Court reversed less than a tenth of a percent of all the cases the circuit has heard.", "authors": ["Linda Qiu"], "publish_date": "2017-02-23", "source": "nytimes", "top_words": ["claims", "seven", "travel", "executive", "trump", "ban", "state", "refugees", "order", "united", "states", "trumps", "countries", "factchecking", "mr"], "summary": "Here are some of the more misleading claims Mr. Trump and his administration have made about the first iteration of the travel ban.\nMr. Trump claimed that the executive order was no different from former President Barack Obama’s policy.\nMr. Trump criticized the news media for “falsely reporting” the executive order as a Muslim ban and suggested that he was merely building on a previous policy.\nThe strongest evidence against a systemic anti-Christian bias is the refugee makeup of the countries targeted by Mr. Trump’s executive order.\nMr. Trump suggested that the U.S. Court of Appeals for the Ninth Circuit has an unusually poor track record."}