{"url": "https://www.nytimes.com/2017/03/04/us/afghan-family-detained-los-angeles-visas.html?mcubz=0", "id": "291", "title": "An Afghan Family, With Visas in Hand, Is Detained in Los Angeles", "text": "“I’ve never, ever heard of this happening,” said Becca Heller, the director of the International Refugee Assistance Project, or IRAP, which filed the petition. “They go through so many layers of security clearance, including one right before they get on the plane.”\n\nCalling the detention “egregious, inhumane and unconstitutional,” the group petitioned the court to release the family, whose names were not publicly revealed. The judge did not order the family be released, but set a hearing in the case for Monday.\n\nAccording to Ms. Heller, the father was being held Saturday night at a men’s immigration detention facility in Orange County, Calif. His wife and children were taken to a detention center in downtown Los Angeles.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nAsked for comment on the case, a spokesman for Immigration and Customs Enforcement said only that the agency “will fully comply with the March 4 judicial order and all other legal requirements.”\n\nThe case was the latest instance of what advocates say has been increased scrutiny at American airports since President Trump took office, especially after his January executive order temporarily banning travelers from seven predominantly Muslim countries. A federal court halted that order, but the administration has said it will issue a revised version. Afghanistan was not one of the seven countries in the original ban.\n\nEven so, customs agents at airports have been using their power to detain passengers, demand passwords for smartphones to search their contents and to even cancel visas. Mem Fox, a best-selling children’s book author from Australia, described being held for questioning — also at Los Angeles International Airport — for several hours with no access to water or a bathroom, and was prohibited from using her cellphone.\n\nHenry Rousso, a prominent French historian of the Holocaust, said he was detained at an airport in Houston for more than 10 hours and was threatened with deportation when he arrived to give the keynote address at a conference at Texas A&M University.\n\nIt was unclear exactly how the Afghan man who was detained had helped the United States, but IRAP wrote in the court petition that “his service put not only his own life, but also the lives of his wife and three small children, at risk.”\n\nKerry Arndt, a spokeswoman for Senator Patty Murray, Democrat of Washington State, where the family was going to settle, said the senator’s office was trying to get information from the Department of Homeland Security, but was “very frustrated from the lack of communication and information that we’re getting.”", "authors": ["Nicholas Kulish"], "publish_date": "2017-03-04", "source": "nytimes", "top_words": ["seven", "detention", "case", "family", "visas", "los", "hand", "wife", "court", "using", "afghan", "sign", "angeles", "order", "york", "detained"], "summary": "The judge did not order the family be released, but set a hearing in the case for Monday.\nAccording to Ms. Heller, the father was being held Saturday night at a men’s immigration detention facility in Orange County, Calif. His wife and children were taken to a detention center in downtown Los Angeles.\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\nA federal court halted that order, but the administration has said it will issue a revised version."}