{"url": "https://www.nytimes.com/2017/08/27/technology/uber-ceo-search.html?mcubz=0", "id": "34", "title": "Uber Chooses Expedia’s Chief as C.E.O., Ending Contentious Search", "text": "But Uber’s future became murkier this year when the company was pummeled by scandal after scandal, including sexual harassment accusations in the workplace, a Department of Justice criminal investigation into some of its methods, and an intellectual property dispute with a self-driving car rival. While Uber’s business continued to grow, Mr. Kalanick’s management style faced scrutiny and investors mutinied against him.\n\nHow much of an impact Mr. Khosrowshahi can have on Uber is uncertain. The company still bears the imprint of Mr. Kalanick, who remains on Uber’s board. The board itself has been rived with discord, especially between Mr. Kalanick and Benchmark, a venture capital firm that is a major Uber shareholder and that also has a seat on Uber’s board. Both Mr. Kalanick and Benchmark had their own preferred candidates for a new chief. Benchmark also has sued Mr. Kalanick to try and force him off the board.\n\nPhoto\n\nMr. Khosrowshahi, who has been president and chief executive of Expedia since 2005, has experience in a digital industry that, like Uber, affects offline life and the logistics and movement of people. Based in Bellevue, Wash., Expedia has travel brands including Hotels.com and Orbitz. The publicly traded company is smaller than the privately held Uber, with a market capitalization of around $23 billion compared with Uber’s private valuation of nearly $70 billion.\n\nMr. Khosrowshahi also joined the board of The New York Times Company in 2015, and previously worked at IAC/InterActive Corp.\n\nAt Expedia, Mr. Khosrowshahi has been an outspoken chief executive. His family emigrated to the United States from Iran because of the revolution in that country in the late 1970s, so Mr. Khosrowshahi had a personal perspective on the executive order that President Trump signed restricting travel from seven predominantly Muslim countries this year.\n\nExpedia, along with Amazon, became one of two technology companies to contribute early declarations to a lawsuit filed by Washington State’s attorney general objecting to the travel ban. Mr. Khosrowshahi described his early experience as an immigrant to the United States in an email to employees at that time.\n\n“We sure didn’t feel like refugees, but in hindsight I guess we were — my father and mother left everything behind to come here — to be safe and give their boys a chance to re-build a life,” he wrote.\n\nAdvertisement Continue reading the main story\n\nHe expressed other pointed concerns in the wake of Mr. Trump’s coming to office. In February, he raised eyebrows when he concluded a conference call with Wall Street analysts by saying, “Hopefully we will all be alive to see the end of next year.”\n\nAt Uber, the chief executive search has been turbulent. Board members were split over candidates early on in the process. According to people with knowledge of the situation, Mr. Kalanick favored Mr. Immelt while Benchmark, whose partner Matt Cohler sits on Uber’s board, preferred Ms. Whitman.\n\nA spokesman for Mr. Kalanick did not immediately respond to a request for comment. Benchmark declined to comment.\n\nNewsletter Sign Up Continue reading the main story Interested in All Things Tech? The Bits newsletter will keep you updated on the latest from Silicon Valley and the technology industry. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nLast month, after Ms. Whitman emerged as a candidate for the job, she posted on Twitter that she was “fully committed to H.P.E. and plan to remain the company’s C.E.O.” She also gave an interview to The Wall Street Journal last week reiterating that there was “a lot of work to be done at H.P.E.”\n\nBut in reality, Ms. Whitman was in touch with members of Uber’s board in recent days about the chief executive role, said the people with knowledge of the process. Mr. Immelt, who recently left his job as chief executive of G.E., also had emerged as a candidate in recent weeks. Mr. Khosrowshahi’s candidacy was kept under wraps.\n\nAs recently as late last week, Uber’s board was deadlocked on candidates, the people said. On Friday, the board met in San Francisco, with Mr. Immelt and Mr. Khosrowshahi talking to the directors. Ms. Whitman spoke with directors on Friday and Saturday.\n\nOn Sunday morning, Mr. Immelt posted on Twitter that he had “decided not to pursue a leadership position at Uber.” By then, it was apparent that Mr. Immelt did not have the software experience that some board members deemed important for the Uber chief executive role, said people with knowledge of the process. Another person with knowledge of the situation said Mr. Immelt considered Uber’s board to be dysfunctional.\n\nG.E. declined to comment on behalf of Mr. Immelt. A spokesman for Ms. Whitman also declined to comment.\n\nAdvertisement Continue reading the main story\n\nAt that point, the board was leaning toward Ms. Whitman, said two people with knowledge of the process. Ms. Whitman, who had previously also led eBay, had a wealth of management experience. As a female leader, she also offered the opportunity for Uber to improve its workplace image.\n\nMs. Whitman asked Uber’s board about some issues, including what role Mr. Kalanick would play in Uber’s future, the people said. Another point of discussion was the current legal battle over board control between Mr. Kalanick and Benchmark.\n\nBy late Sunday, Ms. Whitman and the board could not agree on some of those matters, the people said. Soon, Uber’s board had settled on Mr. Khosrowshahi.", "authors": ["Mike Isaac"], "publish_date": "2017-08-27", "source": "nytimes", "top_words": ["executive", "ending", "search", "immelt", "kalanick", "board", "uber", "chief", "ceo", "ubers", "expedias", "contentious", "chooses", "ms", "khosrowshahi", "whitman", "mr"], "summary": "The company still bears the imprint of Mr. Kalanick, who remains on Uber’s board.\nBoth Mr. Kalanick and Benchmark had their own preferred candidates for a new chief.\nMr. Khosrowshahi described his early experience as an immigrant to the United States in an email to employees at that time.\nOn Friday, the board met in San Francisco, with Mr. Immelt and Mr. Khosrowshahi talking to the directors.\nMs. Whitman asked Uber’s board about some issues, including what role Mr. Kalanick would play in Uber’s future, the people said."}