{"url": "https://www.nytimes.com/2017/03/18/us/politics/trump-controversies-chaos.html?mcubz=0", "id": "329", "title": "In One Rocky Week, Trump’s Self-Inflicted Chaos on Vivid Display", "text": "The health care measure appears on track for a House vote this week, and the president, who planned a weekend of relaxation at Mar-a-Lago, his Palm Beach, Fla., club, is likely to receive a large measure of the credit. But it has also become clear that Mr. Trump, an agitator incapable of responding proportionately to any slight, appears hellbent on squandering his honeymoon.\n\nInstead, he has sowed chaos in his own West Wing, and talked or tweeted his way into trouble, over and over again.\n\nThat was never more apparent than over the last week, when fresh questions about his refusal to release his tax returns and the blocking of his executive order sapped the spotlight from his efforts to build support for the health measure and even the unveiling of his first budget.\n\nEven more self-lacerating: his insistence that President Barack Obama had authorized surveillance on his 2016 campaign, a claim that continued unabated despite rebukes from Republicans, denials by the congressional intelligence committees and complaints from the British government after Mr. Trump’s spokesman suggested that one of its intelligence agencies had aided in the spying.\n\n“It’s a pattern with him — he sometimes counterpunches so hard he hits himself,” said Ari Fleischer, who served as White House press secretary for George W. Bush.\n\nThe public outbursts are mirrored by internal tensions. With the embers of the old rivalry extinguished between his chief strategist, Stephen K. Bannon, and chief of staff, Reince Priebus, a new realignment has emerged in a West Wing already rived by suspicion and intrigue.\n\nGary Cohn, the former Goldman Sachs executive who serves as the president’s top economic policy adviser and who is decidedly more liberal than the rest of Mr. Trump’s inner circle, is on the rise, and has the ear of the president’s powerful son-in-law, Jared Kushner. Mr. Kushner also gained an ally on the National Security Council with the appointment of Dina Powell, a Republican and another former Goldman official who worked with Mr. Cohn, as a deputy for strategy.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nIn the newness of the administration, the constant need to tend to internal dynamics has been a distraction. The aides have watched each other warily and tried tending to the president’s base of supporters amid a sea of appointments of people who worked on Wall Street.\n\nAdvertisement Continue reading the main story\n\nMr. Trump is not bothered by turf battles in his administration. He believes they foster competition and keep any one aide from accumulating too much power. He is even more enthusiastic about waging war publicly, believing that it fires up his white working-class base.\n\nIndeed, in Nashville on Wednesday night, Mr. Trump spoke to a rapturous crowd of almost 10,000 people and his embattled spokesman, Sean Spicer, was greeted as a star by awe-struck supporters, who spent several minutes crowding around him to take pictures and pat him on the back.\n\nBut in Washington, some Republican lawmakers and officials have watched in dismay and frustration, they say privately, because the president they are looking to for cover and salesmanship of the health care overhaul keeps getting sidetracked.\n\nOne of those diversions came after the judge’s ruling on the travel ban. In Nashville, the president said he would prefer to go back to his first, more restrictive ban and pursue it to the Supreme Court. “That’s what I wanted to do in the first place,” Mr. Trump said, a statement that seems destined to be used against his own lawyers in upcoming court cases on the executive order.\n\nFor Mr. Trump, this was supposed to be a week of pivoting and message discipline. The president read from a script during public appearances and posted on Twitter less often. He invited lawmakers from both parties to the White House for strategy sessions on the health measure. He scheduled policy speeches, like one near Detroit, where he announced that he was halting fuel economy standards imposed by Mr. Obama, and the rally in Nashville, where he visited the grave of Andrew Jackson, the populist patron selected by his history-minded political impresario, Mr. Bannon, as Mr. Trump’s presidential analog.\n\nBut by Friday, as Mr. Trump worked to call attention to his powers of persuasion in securing commitments from a dozen wavering Republicans to back the health measure, the White House was left frantically trying to explain why Mr. Spicer had repeated allegations that the Government Communications Headquarters, the British spy agency, had helped to eavesdrop on the president during the campaign.\n\nRather than expressing regret for a slight of one of the United States’ strongest allies, Mr. Trump was unapologetic.\n\nAdvertisement Continue reading the main story\n\n“We said nothing,” he said at a news conference with Chancellor Angela Merkel of Germany. “All we did was quote a certain very talented legal mind who was the one responsible for saying that on television,” he added, referring to Andrew Napolitano, the commentator who first leveled the charge about the involvement of the British intelligence service on Fox News.\n\nThat did not seem to be enough for the irate British, who had called the charge “nonsense” and “utterly ridiculous.” Shepard Smith, a Fox News anchor, later disavowed it as well, saying his network could not back up Mr. Napolitano’s claims.\n\nThe episode left little time for talk of Mr. Trump’s “America First” budget released on Thursday, filled with domestic spending cuts so deep that even his budget director conceded they would be unpopular, or the health care measure that would affect more than 20 percent of the economy.\n\n“This White House is on two tracks,” Mr. Fleischer said. “The legislative one, which has been surprisingly and pleasantly productive, and the other one full of self-induced error.”\n\nThe problem for Mr. Trump, he added, is that the self-destructive behavior, if it continues, threatens to overshadow everything else.\n\n“He has a tremendous number of ingredients at his disposal to be a very successful president,” Mr. Fleischer added, “but he might not even get credit for it if he is so red-hot controversial.”", "authors": ["Julie Hirschfeld Davis", "Maggie Haberman"], "publish_date": "2017-03-18", "source": "nytimes", "top_words": ["measure", "british", "trump", "vivid", "selfinflicted", "chaos", "week", "house", "trumps", "worked", "white", "rocky", "display", "president", "health", "mr"], "summary": "But it has also become clear that Mr. Trump, an agitator incapable of responding proportionately to any slight, appears hellbent on squandering his honeymoon.\n“It’s a pattern with him — he sometimes counterpunches so hard he hits himself,” said Ari Fleischer, who served as White House press secretary for George W. Bush.\nFor Mr. Trump, this was supposed to be a week of pivoting and message discipline.\nHe invited lawmakers from both parties to the White House for strategy sessions on the health measure.\nRather than expressing regret for a slight of one of the United States’ strongest allies, Mr. Trump was unapologetic."}