{"url": "https://www.nytimes.com/2016/09/05/us/politics/muslim-gathering-laments-a-normalization-of-bigotry.html?mcubz=0", "id": "36", "title": "Muslim Gathering Laments a ‘Normalization of Bigotry’", "text": "In his address, Mr. Johnson told the audience that their lives were “the quintessential American story.”\n\nHe listed the contributions of well-known American Muslims, such as the boxer Muhammad Ali and Dalilah Muhammad, who won a gold medal in the 400-meter hurdles last month at the Olympics in Rio de Janeiro, and said they were not just Muslim heroes, but American heroes.\n\n“It’s frustrating to listen to those who foment fear, suspicion and intolerance,” Mr. Johnson said, “who don’t know the mistakes of history and are in the midst of repeating them.”\n\nPhoto\n\nMr. Johnson said his own history had made him more sensitive to the angry speech and physical attacks directed at Muslims.\n\nHe cited his grandfather, Charles S. Johnson, the first black president of Fisk University, who was called before the infamous House Un-American Activities Committee in 1949. In his testimony, he denied being a communist and defended the patriotism of African-Americans, who were accused of being anti-American for advocating civil rights.\n\nThe irony is that the room where his grandfather testified is now the same room where the House Homeland Security Committee meets, Mr. Johnson said.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“My grandfather likely testified in that hearing room to defend his patriotism; now his grandson testifies in the same room to explain what the U.S. government is doing to defend our nation,” Mr. Johnson said. “This is the promise and wonder of this country.”\n\nMr. Johnson spoke to an audience that featured Khizr and Ghazala Khan, who made international headlines in July during the Democratic National Convention by criticizing the Republican presidential nominee, Donald J. Trump, for his proposals to bar Muslims from entering the United States. The Khans lost their son, Humayun, an Army captain, while he was serving in Iraq.\n\nAdvertisement Continue reading the main story\n\nAlthough Mr. Johnson’s speech was greeted warmly, there were several small instances of protest. A few “boos” could be heard when Mr. Johnson entered to speak, and a couple of people held up a sign protesting the Department of Homeland Security’s deportation policies.\n\nThe conference also featured a heated debate among several Muslim scholars and activists about the Department of Homeland Security’s efforts to counter extremism and recruitment by groups like the Islamic State. Several panelists said the government’s efforts focused on potential extremism within Muslim communities to the exclusion of white nationalist groups, which have been linked to several domestic terrorist attacks.\n\nGeorge Selim, who heads the Department of Homeland Security’s Office of Community Partnerships, said the department worked to counter the spectrum of extremism, and that his office’s work was done at the request of communities.\n\n“We focus on all forms of extremism,” he said.\n\nDespite the controversy over the programs to counter extremism, Mohamed Elsanousi, the director of the Washington office of the Network for Religious and Traditional Peacemakers, said he welcomed Mr. Johnson’s speech and the government’s help.\n\n“We need to partner with the government to address the issues of radicalization,” he said. “We cannot fight this fight alone.”", "authors": ["Ron Nixon"], "publish_date": "2016-09-05", "source": "nytimes", "top_words": ["bigotry", "room", "homeland", "extremism", "gathering", "speech", "securitys", "sign", "muslim", "department", "laments", "mr", "normalization", "johnson"], "summary": "The irony is that the room where his grandfather testified is now the same room where the House Homeland Security Committee meets, Mr. Johnson said.\nAdvertisement Continue reading the main storyAlthough Mr. Johnson’s speech was greeted warmly, there were several small instances of protest.\nA few “boos” could be heard when Mr. Johnson entered to speak, and a couple of people held up a sign protesting the Department of Homeland Security’s deportation policies.\nThe conference also featured a heated debate among several Muslim scholars and activists about the Department of Homeland Security’s efforts to counter extremism and recruitment by groups like the Islamic State.\nSeveral panelists said the government’s efforts focused on potential extremism within Muslim communities to the exclusion of white nationalist groups, which have been linked to several domestic terrorist attacks."}