{"url": "https://www.nytimes.com/2017/03/07/opinion/the-travel-ban-an-assault-on-islam.html?mcubz=0", "id": "303", "title": "The Travel Ban: An Assault on Islam?", "text": "Photo\n\nTo the Editor:\n\nRe “Trump’s New Ban Halts Travelers From 6 Nations” (front page, March 7):\n\nThe Trump administration does not have a leg to stand on here. It cannot believe that the ban is truly necessary to protect the United States from a terrorist attack; otherwise it would not have delayed the announcement of the revised ban to allow positive press from the address to Congress to sit for a few days. This ban cannot be about public safety either. Study after study shows that the immigrants commit crimes at a lower rate than native-born Americans.\n\nTo see this order as anything other than a Muslim ban is willful blindness. This is just another tragic example of this astonishing lack of empathy for anyone the administration believes is different.\n\nSTEVEN RASHIN, NEW YORK\n\nTo the Editor:\n\nWhile there can be reasoned objections to President Trump’s revised executive order excluding six heavily Muslim countries from entry into the United States, the Op-Ed essay by Farhana Khera and Johnathan Smith (“Don’t Be Fooled, Trump’s New Muslim Ban Is Still Illegal,” nytimes.com, March 6) degenerates into an emotionally charged denunciation of the order as an “all-out assault on Islam and Muslims.” They lose all credibility with that indictment of Mr. Trump.\n\nAmong the countries not included in the ban are Indonesia, Pakistan, Bangladesh, Malaysia, Egypt, Saudi Arabia and Turkey. All of them are predominantly Muslim states, and Saudi Arabia in particular is an avowedly Islamic theocracy with a very strict brand of Sunni Islam at the core of its official identity. So how, pray, is President Trump’s visa ban an assault on Islam and Muslims as such?\n\nAdvertisement Continue reading the main story\n\nVIPAN CHANDRA, ATTLEBORO, MASS.\n\nTo the Editor:\n\nRegardless of one’s position on illegal immigration (and regardless of whom you voted for in the election), it must be acknowledged that separating children from their parents is nothing short of terrorizing to the child.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nIRA MOSES, NEW YORK\n\nTo the Editor:\n\n“Migrants Confront Judgment Day Over Old Deportation Orders” (front page, March 5) provides heart-wrenching anecdotes of immigrants’ lives under threat. I am ashamed that my country is creating such fear and terror among people who, aside from immigrating without proper papers, are law-abiding. This is inhumane!", "authors": [], "publish_date": "2017-03-07", "source": "nytimes", "top_words": ["travel", "ban", "study", "order", "assault", "united", "trumps", "islam", "states", "muslim", "york", "yorkto"], "summary": "PhotoTo the Editor:Re “Trump’s New Ban Halts Travelers From 6 Nations” (front page, March 7):The Trump administration does not have a leg to stand on here.\nStudy after study shows that the immigrants commit crimes at a lower rate than native-born Americans.\nTo see this order as anything other than a Muslim ban is willful blindness.\nAll of them are predominantly Muslim states, and Saudi Arabia in particular is an avowedly Islamic theocracy with a very strict brand of Sunni Islam at the core of its official identity.\nSo how, pray, is President Trump’s visa ban an assault on Islam and Muslims as such?"}