{"url": "https://www.nytimes.com/2017/04/17/opinion/when-hate-leads-to-depression.html?mcubz=0", "id": "346", "title": "When Hate Leads to Depression", "text": "Not everyone can find support in the wake of a hate crime. Dr. Prabhjot Singh, now the chair of the department of health system design and global health at the Mount Sinai Health System, felt angry and depressed after he was attacked in New York in 2005, when he was in graduate school. He reached out to mental health services at his university, but they weren’t much help, since they were geared toward people with severe psychiatric illness. When he was attacked again a few years later, his anger, depression and sense of isolation deepened. He dealt with them by throwing himself into work. He also began practicing his Sikh religion more actively, growing his beard and waking up before dawn to meditate.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThen, in 2013, he was attacked by a group of young men who called him “Osama” and “terrorist” and punched him in the face, breaking his jaw. That attack got significant media attention, and people began to email him asking for advice after they or their loved ones experienced hate crimes. The volume of recent messages has been a sign for him that hate crimes are on the rise. “I just hear it in my inbox,” he said.\n\nSometimes Dr. Singh can help the people who write to him, and sometimes he can’t. He sees a lack of resources for people who have been victims of hate crimes: “I don’t think there’s really a good way for people who have had this type of experience to find useful community.”\n\nSome nonprofit groups are mobilizing to offer mental health services for people affected by hate crimes or harassment, who may have unique needs that conventional therapy doesn’t always address. Staff at the YWCA of Kalamazoo in western Michigan found that while people who had experienced hate crimes could find individual counseling in the area, which is home to many immigrants working in the agriculture industry, there were no services for people feeling the indirect effects of hate crimes against people of their race or religion, said Jessica Glynn, the director of law and policy at the YWCA. To fill the gap, the YWCA of Kalamazoo earlier this year created a support group for survivors, witnesses and others affected by hate crimes, and plans to create more groups in the area if needed.\n\nEstablished a year and a half ago, the Bay Area Khalil Center has already expanded to include a second branch, and a third is in the works. In addition to support groups, the center offers individual therapy with Muslim therapists. Working with a therapist who shares their religion means patients “don’t have to start from scratch explaining things,” said Dr. Awaad.\n\nThe Maryland chapter of the Council on American-Islamic Relations holds free self-defense workshops and recently conducted its first training on how to respond to an active shooter. Learning preparedness skills can help people cope with anxiety and fear, said Dr. Zainab Chaudry, the council’s Maryland outreach manager. “We can’t control external factors in our environment,” she added, “but we can control how we respond.”\n\nSince the attack in 2013, Dr. Singh has discovered that little research or advice exists to help doctors identify and treat patients who have experienced hate crimes. He’s begun work on a guide, perhaps drawing on techniques developed to treat survivors of domestic and sexual violence.\n\nDr. Singh saw the election of President Trump as the latest symptom of a deep national confusion that he’s not sure how to address. But he takes comfort in his Sikh practice: “finding that stillness, finding that discipline to remember that we know each other far more than we say we do. We are all connected.”\n\nAdvertisement Continue reading the main story\n\nIf you have experienced, witnessed or read about a hate crime or incident of bias or harassment, you can use this form to send information about the incident to This Week in Hate and other partners in the Documenting Hate project. The form is not a report to law enforcement or any government agency. These resources may be helpful for people who have experienced harassment. If you witness harassment, here are some tips for responding. You can contact This Week in Hate at weekinhate@nytimes.com.", "authors": ["Anna North", "This Week In Hate"], "publish_date": "2017-04-17", "source": "nytimes", "top_words": ["dr", "harassment", "hate", "experienced", "singh", "depression", "leads", "crimes", "sign", "health", "help", "services"], "summary": "That attack got significant media attention, and people began to email him asking for advice after they or their loved ones experienced hate crimes.\nThe volume of recent messages has been a sign for him that hate crimes are on the rise.\nTo fill the gap, the YWCA of Kalamazoo earlier this year created a support group for survivors, witnesses and others affected by hate crimes, and plans to create more groups in the area if needed.\nDr. Singh saw the election of President Trump as the latest symptom of a deep national confusion that he’s not sure how to address.\nThese resources may be helpful for people who have experienced harassment."}