{"url": "https://www.nytimes.com/2017/05/25/us/politics/trump-travel-ban-blocked.html?mcubz=0", "id": "376", "title": "Appeals Court Will Not Reinstate Trump’s Revised Travel Ban", "text": "The revised order sought to soften the original ban, which was almost immediately blocked after foreign travelers found themselves stranded at chaotic airports and protesters nationwide called the policy un-American. The second order allowed case-by-case exceptions for incoming travelers and lifted the ban against Iraqi visitors. It also deleted explicit references to religion.\n\nBut both orders suspended the nation’s refugee program for 120 days and reduced the annual number of refugees to 50,000 from 110,000. And in Thursday’s ruling, Chief Judge Roger L. Gregory said Mr. Trump’s statements on the campaign trail — where he called for a “total and complete shutdown of Muslims entering the United States” — showed that the revised order remained the product of religious hostility.\n\nSuch discrimination, Judge Gregory wrote for the majority, violates the First Amendment’s ban on government establishment of religion. The Trump administration had urged the appeals court to ignore the statements as loose language made before the president assumed office. But Judge Gregory said the court could take account of the comments.\n\n“Then-candidate Trump’s campaign statements reveal that on numerous occasions, he expressed anti-Muslim sentiment, as well as his intent, if elected, to ban Muslims from the United States,” Judge Gregory wrote.\n\nThe appeals court vote was 10 to 3 and divided along ideological lines, with the three Republican appointees in dissent. Two other judges, both appointed by Republican presidents, recused themselves.\n\nIn dissent, Judge Paul V. Niemeyer said that the majority had made a grave error in considering Mr. Trump’s political comments to interpret his executive orders, calling campaign statements ambiguous by nature and “often shorthand for larger ideas; they are explained, modified, retracted and amplified as they are repeated and as new circumstances and arguments arise.”\n\nJudge Niemeyer also predicted that the majority’s reliance on campaign statements would meet a hostile reception in the Supreme Court.\n\nAdvertisement Continue reading the main story\n\n“The Supreme Court surely will shudder at the majority’s adoption of this new rule that has no limits or bounds — one that transforms the majority’s criticisms of a candidate’s various campaign statements into a constitutional violation,” he wrote. And Judge Dennis W. Shedd, also in dissent, wrote that those welcoming Thursday’s decision had missed the larger point.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“Today’s decision may be celebrated by some as a victory for individual civil rights and justice, and by others as a political defeat for this president,” Judge Shedd wrote. “Yet, it is shortsighted to ignore the larger ramifications of this decision.\n\n“Regrettably, at the end of the day, the real losers in this case are the millions of individual Americans whose security is threatened on a daily basis by those who seek to do us harm,” Judge Shedd wrote.\n\nOmar Jadwat, a lawyer with the American Civil Liberties Union who argued the appeal on behalf of people and groups challenging the revised order, said the court’s decision vindicated fundamental rights.\n\n\n\n“President Trump’s Muslim ban violates the Constitution, as this decision strongly reaffirms,” he said. “The Constitution’s prohibition on actions disfavoring or condemning any religion is a fundamental protection for all of us, and we can all be glad that the court today rejected the government’s request to set that principle aside.”\n\nThursday’s decision came from the full Fourth Circuit, which did not follow its usual practices in considering the appeal. Ordinarily, a three-judge panel would have heard the case and decided it, with the possibility of full-court review afterward.\n\nIn his dissent, Judge Niemeyer wrote that the law did not permit judges to second-guess a president’s national security judgments.\n\nBut Judge Gregory wrote that courts had a role to play.\n\n“Although the Supreme Court has certainly encouraged deference in our review of immigration matters that implicate national security interests,” he wrote, “it has not countenanced judicial abdication, especially where constitutional rights, values and principles are at stake.”\n\nAdvertisement Continue reading the main story\n\nIt was more than plausible, he added, that the revised order’s “stated national security interest was provided in bad faith, as a pretext for its religious purpose.”\n\n“The government has repeatedly asked this court to ignore evidence, circumscribe our own review, and blindly defer to executive action, all in the name of the Constitution’s separation of powers,” Judge Gregory wrote.\n\n“We decline to do so, not only because it is the particular province of the judicial branch to say what the law is, but also because we would do a disservice to our constitutional structure were we to let its mere invocation silence the call for meaningful judicial review.”\n\nIn March, federal judges in Maryland and Hawaii blocked parts of the new executive order, saying they could not ignore the remarks from Mr. Trump and his allies. “Simply because a decision maker made the statements during a campaign does not wipe them” from judicial memory, Judge Theodore D. Chuang of Federal District Court in Maryland wrote in the decision under review by the appeals court.\n\n\n\nA second appeals court, the United States Court of Appeals for the Ninth Circuit, in San Francisco, heard arguments recently in an appeal of the Hawaii decision. That court is expected to rule shortly.\n\nMr. Trump issued his initial order on Jan. 27, a week into his presidency. Less than two weeks later, the Court of Appeals for the Ninth Circuit affirmed an order halting it.\n\nThough Mr. Trump vowed to fight the ruling, he did not appeal to the Supreme Court. Instead, he issued a revised executive order. This time around, the administration will appeal, setting the stage for a major constitutional showdown.", "authors": ["Adam Liptak"], "publish_date": "2017-05-25", "source": "nytimes", "top_words": ["travel", "wrote", "campaign", "revised", "ban", "appeals", "judge", "court", "trumps", "gregory", "reinstate", "statements", "order", "decision"], "summary": "The revised order sought to soften the original ban, which was almost immediately blocked after foreign travelers found themselves stranded at chaotic airports and protesters nationwide called the policy un-American.\nSuch discrimination, Judge Gregory wrote for the majority, violates the First Amendment’s ban on government establishment of religion.\nThe Trump administration had urged the appeals court to ignore the statements as loose language made before the president assumed office.\nThe appeals court vote was 10 to 3 and divided along ideological lines, with the three Republican appointees in dissent.\nA second appeals court, the United States Court of Appeals for the Ninth Circuit, in San Francisco, heard arguments recently in an appeal of the Hawaii decision."}