{"url": "https://www.nytimes.com/2017/03/07/opinion/the-hard-truth-about-refugees.html?mcubz=0", "id": "302", "title": "The Hard Truth About Refugees", "text": "The Swedes have a word, “asikstkorridor,” which translates as “opinion corridor” and describes all those things considered incorrect not only to say but to think. One of those taboos, as I discovered when I visited Sweden at the height of the refugee crisis in the fall of 2015, is the idea that refugees from conservative Muslim countries, especially poorly educated young men, may not integrate into Swedish society as well as, say, relatively secular and prosperous Iranians or Bosnians.\n\nPresident Trump’s offhand comment last month about how dreadful things are in Sweden provoked an outraged reaction from Swedes rightly proud of the country’s longstanding commitment to accepting refugees from all over the world. The incident of violence the president appeared to be describing hadn’t happened. But then it did, in the form of a riot in a suburb of Stockholm heavily populated by immigrants. That’s where the opinion corridor can make you look foolish.\n\nIt is too early to know whether the net effect of the 2015 wave of largely Middle Eastern refugees on Sweden, Germany and other European countries will be positive or negative. Certainly Mr. Trump’s habit of blaming refugees for terrorism, used to justify his signing a revised executive order banning travel from six predominantly Muslim countries on Monday, flies in the face of the evidence. But so does the reflexive claim that the refugees will fit easily into European society or expand the labor force. Our liberal opinion corridor thus offers the perfect pretext for cynics and xenophobes to parade their prejudice as truth-telling courage.\n\nPhoto\n\nThe truth about refugees is complicated. Sweden offers a kind of laboratory in that regard: Almost all the non-Europeans in the country arrived as refugees. The Chileans, Iranians, Kurds and Bosnians have done very well; Eritreans and Somalis, less so. Labor-force participation and educational attainment among non-European immigrants are far lower than among native Swedes. Yet Sweden has one of Europe’s strongest economies.\n\nAdvertisement Continue reading the main story\n\nThe question that cannot yet be answered is how well the 100,000 or so Syrian, Iraqi, Afghan and other refugees who will be granted permanent residence in the country will integrate. Will they embrace Sweden’s extremely secular, extremely progressive culture? Probably not. Polls find that Muslim immigrants are vastly more conservative than native Europeans on matters of sex, family and the role of religion in public life.", "authors": ["James Traub"], "publish_date": "2017-03-07", "source": "nytimes", "top_words": ["sweden", "immigrants", "swedes", "opinion", "trumps", "countries", "truth", "corridor", "things", "refugees", "muslim", "hard"], "summary": "That’s where the opinion corridor can make you look foolish.\nBut so does the reflexive claim that the refugees will fit easily into European society or expand the labor force.\nOur liberal opinion corridor thus offers the perfect pretext for cynics and xenophobes to parade their prejudice as truth-telling courage.\nSweden offers a kind of laboratory in that regard: Almost all the non-Europeans in the country arrived as refugees.\nPolls find that Muslim immigrants are vastly more conservative than native Europeans on matters of sex, family and the role of religion in public life."}