{"url": "https://www.nytimes.com/2017/05/06/opinion/sunday/its-not-this-muslim-comedians-job-to-open-your-mind.html?mcubz=0", "id": "358", "title": "It’s Not This Muslim Comedian’s Job to Open Your Mind", "text": "I played this game, too. I tried to humanize Muslim families, with my one-woman show, “All Atheists Are Muslim,” sharing the story of moving in with my white atheist college boyfriend, and telling my parents about it. It’s a typical boy meets girl story, up against thousands of years of cultural tradition and religious doctrine. The message the audience was meant to be left with was that if total nonbelievers and Muslims can find common ground, then everyone in between should be able to.\n\nUnsurprisingly, none of this worked. I saw firsthand that the fairy tale, mind-opening reaction that producers imagined was nowhere to be found. While mixed-race and interfaith couples often thanked me after my shows, many others let me know that I was one of the “good Muslims” whom they didn’t have a problem with. I hadn’t made them more empathetic to Muslims as a whole.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nStill, “We’re just like you!” comedy is so much of what I’m being asked to do these days. Television producers, publishers and those booking events for college campuses all seem to want something similar: a representative of an “everyday” Muslim (I still don’t really know what that means) with an outlook relatable enough to get audiences to forget their bigotry. These pleas don’t make me as sad as the ones that come from Muslim activists, who seem to be begging: Use your jokes to make us human; make us likable; let us prove to people that we’re just like them.\n\nI do understand that comedy has some potential to open people’s minds. But I’ve become convinced that the primary role of political humor today shouldn’t be to alleviate tensions or smooth out differences. It should be to heighten them and illuminate for everyone what is a moment of crisis. At the White House Correspondents Dinner a week ago, Hasan Minhaj showed us how funny and effective this can be. One highlight: “As a Muslim, I like to watch Fox News for the same reason I like to play ‘Call of Duty’: Sometimes I like to turn my brain off and watch strangers insult my family and heritage.”\n\nOn occasion, I find this tension-heightening exhausting. I find myself reaching instead for stories divorced from a social agenda. Like how, as an immigrant kid, bringing home an A-minus in algebra meant my dad would look down on me with all the folds of disappointment on his face, as though to say, “We did not escape a revolution and swim the Atlantic Ocean and kiss the feet of the Statue of Liberty for you to get an A-minus in algebra. Our people invented algebra! You infidel!” And if I ever got an A-plus, he’d look just as disappointed and ask, “Why’d you take such an easy class?”\n\nI love pretending to do extreme sports just so that I can tag myself as an “extreme Muslim” on Instagram. I get a kick out of using my story to stick it to Muslims who think they’re the only ones getting Islam right. I enjoy perplexing people who wonder how I can identify as bisexual and be married to a straight cisgender man, and how I can identify as Muslim while my husband is an atheist — and I eat pork. But I do this because these things are amusing to me, and because part of my job is exposing tensions and pointing out the absurd, not because I’m trying to change minds.\n\nI’m remembering the kind of comedian I was before the “You could be exactly what the country needs right now” requests came rolling in. I’m enjoying poking fun at myself and my idiosyncrasies — like the fact that my preferred method of self-care during stressful times is to watch the same five climate change documentaries in a row — even when it may make my audience realize I have less in common with them than they thought.\n\nIn some ways, by rejecting the persistent call to deliver “We’re just like you” comedy in Trump’s America, I’m finally asserting my right to be “just like” any other comedian and, more important, just like myself.", "authors": ["Zahra Noorbakhsh"], "publish_date": "2017-05-06", "source": "nytimes", "top_words": ["comedians", "right", "watch", "job", "comedy", "mind", "york", "white", "algebra", "times", "open", "im", "muslim", "muslims"], "summary": "I tried to humanize Muslim families, with my one-woman show, “All Atheists Are Muslim,” sharing the story of moving in with my white atheist college boyfriend, and telling my parents about it.\nI saw firsthand that the fairy tale, mind-opening reaction that producers imagined was nowhere to be found.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\nView all New York Times newsletters.\nAt the White House Correspondents Dinner a week ago, Hasan Minhaj showed us how funny and effective this can be."}