{"url": "https://www.nytimes.com/2017/06/04/us/politics/britain-attack-trump-twitter-storm.html?mcubz=0", "id": "384", "title": "Trump’s Off-the-Cuff Tweets Strain Foreign Ties", "text": "He went on to say that residents should not worry as they encounter more police officers patrolling the streets.\n\n“Londoners will see an increased police presence today and over the course of the next few days,” Mr. Khan said. “No reason to be alarmed. One of the things the police, all of us, need to do is make sure we’re as safe as we possibly can be. I’m reassured that we are one of the safest global cities in the world, if not the safest global city in the world, but we always evolve and review ways to make sure that we remain as safe as we possibly can.”\n\nMr. Khan’s office later dismissed Mr. Trump’s post, saying the mayor was too busy to reply. “He has more important things to do than respond to Donald Trump’s ill-informed tweet that deliberately takes out of context his remarks urging Londoners not to be alarmed when they saw more police — including armed officers — on the streets,” his office said in a statement.\n\nVideo\n\nThe exchange reflected the tensions between Mr. Trump and the United States’ close allies in Europe. The president returned a little more than a week ago from Belgium and Italy, where he questioned the role of NATO. Then, once home, he followed up by criticizing Germany on trade and pulling the United States out of the Paris climate change accord.\n\nThe friction has been especially acute for more than a year between Mr. Trump and Mr. Khan, the first Muslim to serve as mayor of a major Western European capital. During last year’s presidential race, Mr. Khan criticized Mr. Trump’s proposal to temporarily ban all Muslims from entering the United States and endorsed Hillary Clinton, prompting an exchange with Mr. Trump’s campaign.\n\nCritics of Mr. Trump in Britain and the United States faulted him for his acrimonious response to the Saturday assault. “I don’t think that a major terrorist attack like this is the time to be divisive and to criticize a mayor who’s trying to organize his city’s response to this attack,” former Vice President Al Gore said on CNN’s “State of the Union” on Sunday.\n\nDamon Wilson, who was President George W. Bush’s top Europe adviser and is now the executive vice president of the Atlantic Council, lamented that the spat only undercut a relationship that mattered to the United States. “America is safer when we rally our friends and allies against the bad guys rather than pick fights with the good guys,” he said.\n\nAdvertisement Continue reading the main story\n\nBut the White House showed no signs of backing down, and a top aide to Mr. Trump amplified the attack shortly afterward. Dan Scavino Jr., the president’s director of social media, posted a message referring to Mr. Khan’s criticism of Mr. Trump a year ago for his “ignorant view of Muslims.”\n\nAddressing Mr. Khan, Mr. Scavino referred to his “tweet 13 months ago, after you criticized ... now President @realDonaldTrump — and WAKE UP!!!!”\n\nOther American officials sought to smooth over the dispute. “I commend the strong leadership of the @MayorofLondon as he leads the city forward after this heinous attack,” Lewis Lukens, a career diplomat serving as acting American ambassador to London, wrote on Twitter hours later.\n\nThis is just the latest time the American Embassy in London has had to manage turbulence in the relationship since Mr. Trump took office. The London government complained vociferously after the White House aired a conspiracy theory that British intelligence helped President Barack Obama secretly spy on Mr. Trump during last year’s campaign, which Britain denied. London complained again when American officials leaked details of the investigation into last month’s terrorist bombing in Manchester.\n\nMr. Trump’s initial arguments about the meaning of Saturday night’s terrorist attack stirred debate both at home and abroad.\n\n“We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!” he wrote in one message Saturday night.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“We must stop being politically correct and get down to the business of security for our people,” he wrote in another on Sunday morning. “If we don’t get smart it will only get worse.”\n\n“Do you notice we are not having a gun debate right now?” he added. “That’s because they used knives and a truck!”\n\nAdvertisement Continue reading the main story\n\nMr. Trump first tussled with Mr. Khan publicly last year shortly after Mr. Khan was elected. At the time, Mr. Trump’s proposed Muslim ban applied to all Muslims from all countries who were not American citizens, but Mr. Trump said he welcomed Mr. Khan’s election and would make an exception for him.\n\nMr. Khan replied that he wanted no exception and accused Mr. Trump of harboring “ignorant views about Islam.” Mr. Khan said Mr. Trump would only encourage Muslim alienation from the West. “He’s playing into the hands of extremists,” he said.\n\nMr. Scavino, at the time, fired back on Mr. Trump’s behalf, writing on Twitter that it was not ignorance: “It’s called not being ‘politically correct.’ @realDonaldTrump will MAKE AMERICA SAFE & GREAT AGAIN!”\n\nThe feud continued after Mr. Trump’s election. In March, after a terrorist attack in London, Donald Trump Jr. posted a link suggesting that Mr. Khan had said terrorist attacks were just “part of living in big city.” In fact, what Mr. Khan had said was that “part and parcel of living in a great global city” was being vigilant against terrorism and supporting the police.", "authors": ["Peter Baker"], "publish_date": "2017-06-04", "source": "nytimes", "top_words": ["offthecuff", "foreign", "tweets", "trump", "terrorist", "united", "trumps", "london", "ties", "states", "president", "mr", "strain", "khan", "attack"], "summary": "“Londoners will see an increased police presence today and over the course of the next few days,” Mr. Khan said.\nDuring last year’s presidential race, Mr. Khan criticized Mr. Trump’s proposal to temporarily ban all Muslims from entering the United States and endorsed Hillary Clinton, prompting an exchange with Mr. Trump’s campaign.\nMr. Trump’s initial arguments about the meaning of Saturday night’s terrorist attack stirred debate both at home and abroad.\nMr. Khan replied that he wanted no exception and accused Mr. Trump of harboring “ignorant views about Islam.” Mr. Khan said Mr. Trump would only encourage Muslim alienation from the West.\nMr. Scavino, at the time, fired back on Mr. Trump’s behalf, writing on Twitter that it was not ignorance: “It’s called not being ‘politically correct.’ @realDonaldTrump will MAKE AMERICA SAFE & GREAT AGAIN!”The feud continued after Mr. Trump’s election."}