{"url": "https://www.nytimes.com/2017/03/18/us/politics/kellyanne-conway-husband-trump-justice.html?mcubz=0", "id": "328", "title": "Kellyanne Conway’s Husband Is Trump’s Choice for Key Justice Post", "text": "But last week, two other federal judges — one in Hawaii and one in Maryland — moved to block the revised order, suggesting that it probably constituted religious discrimination and was in essence a backdoor Muslim ban of the sort that Mr. Trump promised during his presidential campaign.\n\nIt would also fall to Mr. Conway to oversee Mr. Trump’s defense in a pending lawsuit charging him with violations of the Constitution’s Emoluments Clause, which bans federal officeholders from accepting gifts or payments from foreign governments, because of the profits his hotels and resorts receive from foreign officials who are customers.\n\nBefore he was inaugurated, Mr. Trump’s personal lawyers argued that the clause did not bar “fair-market-value transactions,” like paying for hotel rooms. But the lawsuit, filed by Citizens for Responsibility and Ethics in Washington, a liberal watchdog group on government corruption, contends that the clause does bar such transactions.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nIt is likely that Mr. Trump will face additional legal challenges regarding possible conflicts of interest stemming from his vast real estate and business empire, from which he has refused to divest.\n\nInstalling Mr. Conway to lead the civil division means that defending the president from such challenges will become a family affair for the Conways. Ms. Conway, a staunch loyalist who ran the final months of Mr. Trump’s presidential campaign, has been a frequent presence on television news programs promoting the president’s agenda and dismissing criticism of his style and record.\n\nHer zeal on Mr. Trump’s behalf has sometimes landed her at the center of controversy, such as when she claimed that the White House was entitled to put forward “alternative facts” about the crowd size at his inauguration, and in a separate interview a few weeks later, referred to a terrorist attack in Bowling Green that never occurred. Last week, she appeared to suggest that President Barack Obama might have spied on Mr. Trump through a microwave. Ms. Conway later clarified that she was speaking in general about possible means of surveillance, not about Mr. Obama, and Sean Spicer, the White House press secretary, said she had been joking.\n\nMr. Conway had been a contender for the job of solicitor general for the Trump administration, but Mr. Trump announced this month that the job would go to Noel J. Francisco.\n\nMr. Conway is a partner at the New York City firm of Wachtell, Lipton, Rosen & Katz. He specializes in securities, contract and antitrust litigation, as well as mergers and acquisitions, according to his biography on the firm’s website. He is a graduate of Harvard University and the Yale Law School.\n\nWhile there is a law against nepotism in government, it would not affect the Conways. It says that no public official can hire a family member — including one related by marriage — to serve in an agency or office over which he or she has authority. Ms. Conway would have no direct authority over her husband were he to be confirmed, nor would the reverse be true.", "authors": ["Julie Hirschfeld Davis"], "publish_date": "2017-03-18", "source": "nytimes", "top_words": ["trump", "clause", "kellyanne", "post", "conway", "husband", "week", "trumps", "later", "ms", "key", "choice", "justice", "white", "york", "mr", "conways"], "summary": "Before he was inaugurated, Mr. Trump’s personal lawyers argued that the clause did not bar “fair-market-value transactions,” like paying for hotel rooms.\nInstalling Mr. Conway to lead the civil division means that defending the president from such challenges will become a family affair for the Conways.\nLast week, she appeared to suggest that President Barack Obama might have spied on Mr. Trump through a microwave.\nMr. Conway had been a contender for the job of solicitor general for the Trump administration, but Mr. Trump announced this month that the job would go to Noel J. Francisco.\nMs. Conway would have no direct authority over her husband were he to be confirmed, nor would the reverse be true."}