{"url": "https://www.nytimes.com/2017/03/16/opinion/trump-is-not-above-the-courts.html?mcubz=0", "id": "316", "title": "Trump Is Not Above the Courts", "text": "CHICAGO — So much has happened during these early weeks of President Trump’s administration that it is easy to lose sight of the single event that may well have the most powerful and troubling impact on American democratic society.\n\nI speak of the administration’s startling assertion following its first travel ban, which was blocked by the courts, not merely that the president’s executive order limiting immigration from seven nations was constitutional, but that the president is actually immune from judicial review of the constitutionality of his action. The president’s lawyers explicitly made this argument before the Ninth Circuit, and the presidential counselor Stephen Miller has asserted that presidential power over immigration cannot be questioned.\n\nPhoto\n\nThe constitutionality of the president’s bans on travel from parts of the Muslim world — the most recent one was blocked this week, by federal judges in Hawaii and Maryland — gives rise to complex issues on which reasonable people can differ. But what is not in dispute is the ability of the judiciary to determine their constitutionality, free from control by the executive branch of government. Indeed, not only is such thinking largely inconsistent with over 200 years of established American constitutional practice, but it also ignores and undermines the genius of the Constitution’s framers, who saw the judiciary as perhaps the most important deterrent to tyrannical power. By “tyranny” the framers did not mean simply the abuse of power. Rather, it is the very accumulation of such power that they saw as the essence of tyranny, because once the power is accumulated, the harm has already taken place.\n\nThe framers considered the Constitution to be the primary protector against authoritarianism. The document is framed in mandatory language and can be amended only by a complex process. Congress cannot simply enact a law repealing a provision of the Constitution. Rather, those who wish to amend it must go through an intentionally difficult process requiring substantial supermajoritarian majorities. The framers knew that throughout history republican governments ultimately degenerated into authoritarian regimes. To preserve democratic government in which those in power remain representative of and accountable to the populace, that government must be subject to the control of a countermajoritarian document — the Constitution. This describes the democratic paradox that underlies American constitutionalism: to preserve democracy, we must limit democracy.\n\nAdvertisement Continue reading the main story\n\nOnce we understand the special role played by the Constitution in preserving democratic government, the role of the judiciary in enforcement of that document flows inescapably. Of the three branches of the federal government, only one is explicitly insulated from the dictates of democratic representation and political accountability: the judicial branch. Article III of the Constitution guarantees to federal judges life tenure (subject only to removal through the impeachment process) and protects their salaries from reduction. A nation that only a few years earlier had fought a revolution over the slogan “no taxation without representation” protected one of the three branches of its federal government against the check of political accountability. Why would the framers have done this?\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe answer should be obvious as a logical matter, even if we didn’t have the careful words of Alexander Hamilton in Federalist No. 78 to back up that logical inference. The judiciary was insulated from democratic accountability so that it could serve as an effective enforcer of the directives of the countermajoritarian Constitution against the democratically accountable branches.", "authors": ["Martin H. Redish"], "publish_date": "2017-03-16", "source": "nytimes", "top_words": ["courts", "trump", "constitution", "process", "democratic", "framers", "sign", "federal", "document", "presidents", "power", "judiciary"], "summary": "But what is not in dispute is the ability of the judiciary to determine their constitutionality, free from control by the executive branch of government.\nThe framers considered the Constitution to be the primary protector against authoritarianism.\nThe document is framed in mandatory language and can be amended only by a complex process.\nRather, those who wish to amend it must go through an intentionally difficult process requiring substantial supermajoritarian majorities.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services."}