{"url": "https://www.nytimes.com/2017/04/28/opinion/white-house-of-grifters.html?mcubz=0", "id": "354", "title": "White House of Grifters", "text": "Because the Trump White House is a business with the shades closed — the visitor logs no longer available to the public, the tax returns a dark secret — we cannot know how extensively the Trump clan is making foreign policy to help its holdings. The family has extensive entanglements in China, the Philippines and Turkey, to name just a few “conflicts.”\n\nAnd Jared Kushner, who has a far-reaching diplomatic portfolio, is also a beneficiary of many businesses backed by unnamed foreign partners, as my colleague Jesse Drucker reported this week.\n\nIt’s clear now that the reason Trump — in defiance of all ethical standards for the office — has refused to divest his business interests is that the levers of executive power directly help Trump Inc.\n\nTurning management over to his sons is a farce, one you would expect from a man who ran a casino into bankruptcy, stiffed plumbers and carpenters, and defrauded thousands of people at a phony “university.”\n\nTrump makes money every time a foreign diplomat or favor-seeking industrialist stays at one of his hotels or becomes a tenant in one of his buildings. On top of that, influence peddlers pay him through his campaign. In the first three months of the Trump presidency, his 2020 campaign spent almost $500,000 on hotels, golf clubs and restaurants owned by the Trump family.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nTrump, certainly, knows where it’s all going. After promising not to talk business with his father, Eric Trump admitted that he will discuss “the bottom line, profitability reports and stuff like that” with Dad.\n\nAdvertisement Continue reading the main story\n\nHe also said, “Nepotism is kind of a factor of life.” Well, yes — in kleptocracies, dictatorships and monarchies. For years, the United States has worked to eliminate nepotism in backwater regimes. Now it’s the role model for inbred charlatans.\n\nIt’s bad enough that taxpayers funnel money to the Trumps when the president brings his entourage to his for-profit club in Florida, Mar-a-Lago. But what about that Mar-a-Lago marketing piece that you and I paid for on an official government website?\n\nThe same administration that wants to zero-out public money for the arts used public money to inform people of Trump’s exquisite taste in private property. The post has since been taken down.\n\nThis week Trump proposed a huge tax cut for himself and the businesses he and his family own. He would have saved $31 million, in the one year for which we have his tax return, under his plan. At the same time, he wants to take away college scholarships for the poor and gut funding for cancer research.\n\nHis associates take their cue from the top. Michael Flynn, the man who led the lock-her-up chants against Hillary Clinton, possibly broke the law by failing to disclose the big sums he got from foreign governments. And Kellyanne Conway violated the rule against public officials’ promoting private businesses when she plugged Ivanka’s product line.\n\nA lot of this will be resolved in lawsuits, and perhaps impeachment. Meanwhile, Trump continues to debase the office. He spent four hours at the White House with Sarah Palin and Ted Nugent, the no-talent musician who called President Barack Obama a “subhuman mongrel.” The guests posed, in thug mode, before a portrait of Hillary Clinton — a fitting image for a host who has turned the home of Lincoln and Roosevelt into a House of Grifters.", "authors": ["Timothy Egan"], "publish_date": "2017-04-28", "source": "nytimes", "top_words": ["foreign", "trump", "businesses", "public", "york", "sign", "white", "house", "grifters", "tax", "business", "money"], "summary": "Because the Trump White House is a business with the shades closed — the visitor logs no longer available to the public, the tax returns a dark secret — we cannot know how extensively the Trump clan is making foreign policy to help its holdings.\nThe same administration that wants to zero-out public money for the arts used public money to inform people of Trump’s exquisite taste in private property.\nThis week Trump proposed a huge tax cut for himself and the businesses he and his family own.\nAnd Kellyanne Conway violated the rule against public officials’ promoting private businesses when she plugged Ivanka’s product line.\nHe spent four hours at the White House with Sarah Palin and Ted Nugent, the no-talent musician who called President Barack Obama a “subhuman mongrel.” The guests posed, in thug mode, before a portrait of Hillary Clinton — a fitting image for a host who has turned the home of Lincoln and Roosevelt into a House of Grifters."}