{"url": "https://www.nytimes.com/2017/03/16/briefing/donald-trump-federal-reserve-dutch-elections.html?mcubz=0", "id": "313", "title": "Donald Trump, Federal Reserve, Dutch Elections: Your Thursday Briefing", "text": "Listen from a computer, on an iOS device or on an Android device.\n\nBusiness\n\n• The Federal Reserve is moving toward the end of its nine-year-old economic stimulus campaign. The central bank raised interest rates on Wednesday for the second time in three months.\n\nAdvertisement Continue reading the main story\n\n• The U.S. charged two Russian intelligence officers with directing a criminal conspiracy that stole data on 500 million Yahoo accounts in 2014.\n\n• Vowing to expand the number of jobs in the auto industry, Mr. Trump halted a move to tighten fuel standards.\n\n• U.S. stocks were up on Wednesday. Here’s a snapshot of global markets.\n\nMarket Snapshot View Full Overview\n\nSmarter Living\n\n• Last week, we asked readers to share their morning routines, and 331 were gracious enough to respond. Among the most mentioned: Coffee (126 mentions), prayer or meditation (84), running/walking (95) or exercise (94), and breakfast (97).\n\n• Here are some of the tips, and a few quick links about warm-ups and cool-downs, ways to be mindful and the power of to-do lists.\n\n• Recipe of the day: Have pie for dinner with this torta pasqualina filled with leafy greens and cheese.\n\nNoteworthy\n\n• The desert is blooming.\n\nIn today’s 360 video, watch as colorful flowers blossom in Anza-Borrego Desert State Park in California.\n\nVideo\n\n• A grim fate for a natural wonder.\n\nScientists say large sections of the Great Barrier Reef, a coral ecosystem off the coast of Australia so large that it can be seen from space, are dead or dying because of rising sea temperatures.\n\nAdvertisement Continue reading the main story\n\nThe level of destruction wasn’t expected for another 30 years, the author of a new study said.\n\nPhoto\n\n• March Madness begins.\n\nThe first round of the N.C.A.A. men’s basketball tournament starts today. We’ll have live updates, scores and analysis of the first round.\n\n• A spoiler becomes a savior.\n\nIn the past few decades, the internet has threatened just about every cultural medium, from movies to music to something close to this writer’s heart, journalism. But people are starting to pay for online content, a big deal that our tech columnist says is difficult to overstate.\n\n• Press freedom in Egypt.\n\nDeclan Walsh, our Cairo bureau chief, joined a group of journalists to discuss the difficulties of reporting from the Middle East.\n\n• Best of late-night TV.\n\nThe hosts were not impressed by Rachel Maddow’s anticlimactic revelation of Mr. Trump’s tax forms the day before. “Is this news or a reality show?” asked Stephen Colbert.\n\nBack Story\n\nA new space race is underway, fueled by billionaires like Elon Musk and Jeff Bezos who are eager to capitalize on booming technology and the allure of space tourism.\n\nSuch audacious plans weren’t always embraced. In 1920, when Robert H. Goddard outlined how a rocket might reach the moon, The Times wrote that he seemed “to lack the knowledge ladled out daily in high schools” and argued, incorrectly, that thrust was not possible in a vacuum.\n\nPhoto\n\nHistory has been kinder to Dr. Goddard since his death in 1945, and he’s now viewed as a pioneer of the space age.\n\nAdvertisement Continue reading the main story\n\nA crucial step in his career came on this day in 1926, when he tested the first liquid-fueled rocket, from his aunt’s farm in Massachusetts. It reached only 41 feet, but, according to NASA, the experiment was “as significant to history as that of the Wright brothers at Kitty Hawk.”\n\nAfter Apollo 11 launched in 1969, even The Times came around, noting in a correction that it was “now definitely established that a rocket can function in a vacuum as well as in an atmosphere.”\n\nBut Dr. Goddard deserves the last word. About perseverance, he wrote: “When old dreams die, new ones come to take their place. God pity a one-dream man.”\n\nCharles McDermid contributed reporting.\n\n_____\n\nPhotographs may appear out of order for some readers. Viewing this version of the briefing should help.\n\nYour Morning Briefing is published weekdays at 6 a.m. Eastern and updated on the web all morning.\n\nWhat would you like to see here? Contact us at briefing@nytimes.com.\n\nYou can sign up here to get the briefing delivered to your inbox.", "authors": ["Chris Stanford"], "publish_date": "2017-03-16", "source": "nytimes", "top_words": ["main", "rocket", "wrote", "trump", "day", "space", "dutch", "elections", "donald", "goddard", "times", "reading", "federal", "continue", "briefing", "reserve"], "summary": "Business• The Federal Reserve is moving toward the end of its nine-year-old economic stimulus campaign.\nAdvertisement Continue reading the main story• The U.S. charged two Russian intelligence officers with directing a criminal conspiracy that stole data on 500 million Yahoo accounts in 2014.\n• Vowing to expand the number of jobs in the auto industry, Mr. Trump halted a move to tighten fuel standards.\nAdvertisement Continue reading the main storyThe level of destruction wasn’t expected for another 30 years, the author of a new study said.\nYour Morning Briefing is published weekdays at 6 a.m. Eastern and updated on the web all morning."}