{"url": "https://www.nytimes.com/2017/03/17/insider/chinese-exclusion-act-travel-ban.html?mcubz=0", "id": "326", "title": "135 Years Ago, Another Travel Ban Was In the News", "text": "Chinese laborers had begun arriving in the 1850s. They worked some of the toughest jobs the West had to offer — in gold mines, on railroads and in factories — at wages so low native laborers could not or would not accept them.\n\nIn 1882, Senator John F. Miller, Republican of California, turned racism, resentment and fear into national legislation. His act barred “Chinese laborers,” skilled or unskilled, from entering the country for 10 years. It further declared that “no State court or court of the United States shall admit Chinese to citizenship.”\n\nMiller told the Senate on Feb. 28: “It is a fact of history that wherever the Chinese have gone they have always taken their habits, methods, and civilization with them; and history fails to record a single example in which they have ever lost them. They remain Chinese always and everywhere; changeless, fixed and unalterable.”\n\n“If the Chinese could be lifted up to the level of the free American, to the adoption and enjoyment of American civilization, the case would be better; but this cannot be done,” he concluded. “Forty centuries of Chinese life has made the Chinaman what he is. An eternity of years cannot make him such a man as the Anglo-Saxon.”\n\nThe Times noted his speech in a single paragraph. On the other hand, it gave prominent display on Page 1 to an impassioned rebuttal by Senator George Frisbie Hoar, Republican of Massachusetts. The newspaper reported:\n\n“Taking the ground that the principles embodied in the Declaration of Independence, that all men are created free and equal, is the cardinal principle upon which this Government is established, he went on to declare that no question of policy could be made a pretext for setting it aside to make a distinction against any race of men.”\n\n“He said that all the arguments against the negroes used years ago were now applied to the Chinese,” the article continued.\n\nJohn Foord, The Times’s editor-in-chief (a role that was equivalent to that of the editorial page editor today), took exception — not to Senator Miller’s “masterly statement,” but to Senator Hoar’s “unfortunate” attempt to liken the races.\n\nAdvertisement Continue reading the main story\n\n“There is no rational connection between the settled problem of negro citizenship and the unsettled problem of Chinese immigration,” The Times’s editorial said. “The restrictive bill now under consideration in the Senate does not take away any right from the Chinaman.”\n\nRenewed, expanded and sharpened — again and again — the Chinese Exclusion Act remained in force until 1943, when it was repealed by the Magnuson Act, named for Representative Warren G. Magnuson, Democrat of Washington.\n\nEditorially, The Times celebrated that “about 15 acts or parts of acts directed against that mythical creature the ‘Heathen Chinee’ are scheduled to disappear from our statute books” and applauded the impending admission under quota of cultured, courageous and “innately democratic” Chinese people: all 105 of them a year.", "authors": ["David W. Dunlap"], "publish_date": "2017-03-17", "source": "nytimes", "top_words": ["single", "travel", "timess", "republican", "chinese", "ban", "ago", "problem", "135", "act", "laborers", "times", "senator", "senate"], "summary": "Chinese laborers had begun arriving in the 1850s.\nIn 1882, Senator John F. Miller, Republican of California, turned racism, resentment and fear into national legislation.\nHis act barred “Chinese laborers,” skilled or unskilled, from entering the country for 10 years.\nAn eternity of years cannot make him such a man as the Anglo-Saxon.”The Times noted his speech in a single paragraph.\nOn the other hand, it gave prominent display on Page 1 to an impassioned rebuttal by Senator George Frisbie Hoar, Republican of Massachusetts."}