{"url": "https://www.nytimes.com/2017/04/26/us/politics/trump-immigration-courts-california.html?mcubz=0", "id": "351", "title": "Defiant Trump Vows to Take Immigration Case to Supreme Court", "text": "But Mr. Trump’s confidence in a future victory at the Supreme Court follows the successful confirmation of his appointment of Justice Neil M. Gorsuch. In theory, at least, Justice Gorsuch bolsters the conservative wing of the court, but there is no guarantee that five justices would agree to overturn a ruling against the administration even if the case does reach them.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nIn the sanctuary city case, Judge William H. Orrick of the Federal District Court for the Northern District of California, in San Francisco, issued a temporary injunction on Tuesday preventing the president from holding back billions in federal funding from jurisdictions like San Francisco and Santa Clara County, which filed the lawsuit. The injunction applied nationwide until the judge can rule on the underlying constitutional issues, but he indicated strongly that he leaned against the Trump administration on the matter.\n\nMr. Trump signed an executive order shortly after becoming president targeting cities and counties that limit their cooperation with federal immigration authorities by, for example, refusing in some instances to turn over illegal immigrants held in local jails on other matters or preventing local police officers from inquiring about immigration status.\n\nThe White House reacted with scorn to Judge Orrick’s ruling. “It’s another example of how the Ninth Circuit went bananas,” Reince Priebus, the White House chief of staff, told reporters late Tuesday. “It will be overturned.”\n\nThe United States Court of Appeals for the Ninth Circuit is generally considered the most liberal in the country, and Mr. Trump elaborated on his pique with it on Twitter on Wednesday morning.\n\n“Out of our very big country, with many choices, does everyone notice that both the ‘ban’ case and now the ‘sanctuary’ case is brought in the Ninth Circuit, which has a terrible record of being overturned (close to 80%),” he wrote. “They used to call this ‘judge shopping!’ Messy system.”\n\nThe figure Mr. Trump cited does not refer to all rulings handed down by the appeals court but only to those that the Supreme Court reviewed. In general, the Supreme Court chooses to hear appeals only in cases where it finds a significant dispute, especially if there are different rulings in different lower courts, so such overturn rates tend to be high.\n\nOver all, the Supreme Court overturned about 70 percent of the rulings it chose to review from 2010 to 2015, according to PolitiFact. Among those it took from the United States Court of Appeals for the Ninth Circuit, it overturned 79 percent, the third highest among the 13 federal appeals courts.\n\nAdvertisement Continue reading the main story\n\nThe “judge shopping” that Mr. Trump denounced has been used to thwart presidents of both parties. Just as liberals are now arguing that Mr. Trump has exceeded his executive authority, conservatives made the same case against President Barack Obama and likewise found judges in parts of the country who were more sympathetic to their point of view, often in Texas. But such rulings were often upheld. Mr. Obama’s success rate at the Supreme Court was the lowest of any president in more than a century.", "authors": ["Peter Baker"], "publish_date": "2017-04-26", "source": "nytimes", "top_words": ["ninth", "case", "rulings", "trump", "supreme", "immigration", "appeals", "judge", "court", "defiant", "president", "vows", "mr"], "summary": "But Mr. Trump’s confidence in a future victory at the Supreme Court follows the successful confirmation of his appointment of Justice Neil M. Gorsuch.\n“They used to call this ‘judge shopping!’ Messy system.”The figure Mr. Trump cited does not refer to all rulings handed down by the appeals court but only to those that the Supreme Court reviewed.\nOver all, the Supreme Court overturned about 70 percent of the rulings it chose to review from 2010 to 2015, according to PolitiFact.\nAdvertisement Continue reading the main storyThe “judge shopping” that Mr. Trump denounced has been used to thwart presidents of both parties.\nMr. Obama’s success rate at the Supreme Court was the lowest of any president in more than a century."}