{"url": "https://www.nytimes.com/2017/06/04/business/media/london-attack-trump-media-cnn-fox-news.html?mcubz=0", "id": "383", "title": "After London Attack, Trump Again the Center of Partisan Media Combat", "text": "The president’s retweet of a Drudge headline — “fears of new terror attack,” it read, even as the nature of the assault remained unclear — prompted a rebuke of sorts from NBC Nightly News, whose Twitter account pointedly noted that its journalists would not relay the president’s retweet, “as the info is unconfirmed.”\n\nThat led to accusations of liberal bias, with the “Fox & Friends” co-host Abby Huntsman asking, “Can we not just come together?”\n\nIt was the kind of chain reaction that is increasingly commonplace in a deeply polarized political environment, where news organizations attract tribal followings, and where major events like the London attack can stoke fears and inflame emotions — from Mr. Trump on down.\n\nMr. Aslan responded with his angry posts after the president, in the immediate wake of the attack on Saturday, wrote on Twitter that his proposed travel ban was needed to prevent terrorism. Mr. Aslan, an Iranian-American writer and religion scholar who hosts a weekly show about faith and society for CNN, also described Mr. Trump as “an embarrassment to humankind.”\n\nThat prompted expressions of outrage from right-wing news outlets like Breitbart News and the hosts of “Fox & Friends” on Sunday morning, who lamented his comment. CNN was already mired in an uproar over the comedian Kathy Griffin, a co-host of the network’s New Year’s Eve coverage, who posted a photograph in which she held a fake severed head meant to look like the president’s; CNN severed ties with Ms. Griffin last week.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“I should have used better language to express my shock and frustration at the president’s lack of decorum and sympathy,” Mr. Aslan wrote in a statement on Sunday. “I apologize for my choice of words.” (A spokeswoman for CNN added: “That kind of discourse is never appropriate.”)\n\nAdvertisement Continue reading the main story\n\nThe backlash against Mr. Trump’s tweets, however, went beyond Mr. Aslan. Critics pointed to the president’s criticism of London’s mayor, Sadiq Khan, noting that Mr. Trump had taken a quote from the mayor out of context to suggest that he was unconcerned about terrorism.\n\nThere was also some disbelief in online comments that the president, who has access to up-to-the-minute national intelligence, chose to send a speculative item from The Drudge Report to his 31.5 million Twitter followers on an issue of international import. The Drudge Report, which is hugely popular with conservatives, counts Mr. Trump among its devotees: @Drudge_Report is just one of 45 Twitter accounts that he follows.\n\nOn “Fox & Friends,” a reliably Trump-friendly morning show, there was little concern over the president’s tweets, but some criticism of Mr. Aslan’s remark, which the hosts described as evidence of an explicit bias against Mr. Trump in some quarters of the news media.\n\nIt was not long until the “Fox & Friends” crew was coping with its own troubles.\n\nOne of the show’s guest commentators, Katie Hopkins of The Daily Mail, raised the prospect of rounding up Muslims on the terrror watch list in the United Kingdom and placing them in internment camps as a way of preventing future attacks. Another guest — Nigel Farage, the British political figure and “Brexit” advocate who is now a Fox News contributor — also mentioned the idea of internment.\n\nLater in the broadcast, the “Fox & Friends” anchors paused for a formal denunciation of the statements, lest viewers be left with the impression that Fox was endorsing the idea.\n\n“On behalf of the network, I think all of us here find that idea reprehensible here at Fox News Channel, just to be clear,” a co-host, Clayton Morris, told viewers.\n\nMs. Huntsman added, “It’s important to be said.”", "authors": ["Michael M. Grynbaum"], "publish_date": "2017-06-04", "source": "nytimes", "top_words": ["cnn", "trump", "aslan", "hosts", "combat", "fox", "twitter", "london", "partisan", "friends", "drudge", "media", "presidents", "mr", "center", "attack"], "summary": "Mr. Aslan responded with his angry posts after the president, in the immediate wake of the attack on Saturday, wrote on Twitter that his proposed travel ban was needed to prevent terrorism.\n“I should have used better language to express my shock and frustration at the president’s lack of decorum and sympathy,” Mr. Aslan wrote in a statement on Sunday.\nThe Drudge Report, which is hugely popular with conservatives, counts Mr. Trump among its devotees: @Drudge_Report is just one of 45 Twitter accounts that he follows.\nIt was not long until the “Fox & Friends” crew was coping with its own troubles.\nLater in the broadcast, the “Fox & Friends” anchors paused for a formal denunciation of the statements, lest viewers be left with the impression that Fox was endorsing the idea."}