{"url": "https://www.nytimes.com/2017/03/16/business/dealbook/sec-nominee-travel-ban-trump-jay-clayton.html?mcubz=0", "id": "314", "title": "Ex-Workers at S.E.C. Nominee’s Firm Urge Him to Denounce Travel Ban", "text": "Mr. Clayton is a longtime partner Sullivan & Cromwell, which is known for its representation of Goldman Sachs and major financial firms. As the president’s choice to lead the S.E.C., he has come under scrutiny over whether he will use his experience to protect investors or to loosen regulations that have constrained Wall Street activities in recent years.\n\nThe former Sullivan & Cromwell lawyers ask that Mr. Clayton join those in the legal profession “who have stood, and will continue to stand, in defense of those targeted at the order of the president you are about to serve in the courts, in the streets, in the airport terminals in New York City, Washington, D.C., Chicago, Los Angeles, San Francisco and elsewhere.”\n\n“The S.E.C. does not make immigration policy, but if one is confirmed by Congress, you are an important member of the administration,” said Chiansan Ma, one of those who signed the letter. Mr. Ma. a legal services lawyer, left Sullivan & Cromwell last year.\n\nPhoto\n\nMr. Clayton’s office did not immediately respond to a request for comment. Mr. Ma said that those who signed the letter were not criticizing their former colleague, but were appealing to him “from a place of respect.”\n\nThe former associates, none of whom worked directly with Mr. Clayton at the firm, write that “by observation and reputation each one of us regards you as a person of professionalism and integrity and as a leader of the firm, our profession and our community.”\n\nBut, they note, they have felt “growing alarm” over the Trump administration’s “actions and statements” regarding the travel ban, and they cite “disturbing reports and allegations regarding the implementation” of the executive order.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe group says their concerns include reports that officials “have detained individuals to whom the United States has already granted legal permanent residency; that they have pressured holders of lawfully issued U.S. visas to waive their rights under those visas and leave this country under threat of deportation; that they have barred detainees from speaking with legal counsel; and that they have acted in contempt of federal court orders to desist.”\n\nEven the revised executive order, the letter says, “will continue to cause needless confusion, suffering and fear.”\n\nAdvertisement Continue reading the main story\n\nAnd that, the letter says, could include “members of the legal profession seeking to join U.S.-based firms such as Sullivan & Cromwell.”\n\nLarge international firms like Sullivan & Cromwell hire lawyers from around the world, but the president’s executive orders have cast doubt on the ability of some foreign-born lawyers to work in the United States, the letter says.\n\n“Law graduates who have offers of employment at U.S. firms fear they will be unable to practice in the United States,” said Mohammad H. Fadel, a former Sullivan & Cromwell associate who signed the letter.\n\nMr. Fadel, now an associate professor at the University of Toronto Faculty of Law, said some of his students with employment offers in New York are citizens of countries identified in the executive orders, such as Syria and Iran.", "authors": ["Elizabeth Olson"], "publish_date": "2017-03-16", "source": "nytimes", "top_words": ["executive", "travel", "mr", "urge", "legal", "cromwell", "ban", "firms", "exworkers", "united", "firm", "sullivan", "continue", "denounce", "york", "nominees", "sec", "letter"], "summary": "Mr. Clayton is a longtime partner Sullivan & Cromwell, which is known for its representation of Goldman Sachs and major financial firms.\na legal services lawyer, left Sullivan & Cromwell last year.\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\n“Law graduates who have offers of employment at U.S. firms fear they will be unable to practice in the United States,” said Mohammad H. Fadel, a former Sullivan & Cromwell associate who signed the letter."}