{"url": "https://www.nytimes.com/2017/04/20/us/politics/jeff-sessions-judge-hawaii-pacific-island.html?mcubz=0", "id": "347", "title": "Jeff Sessions Dismisses Hawaii as ‘an Island in the Pacific’", "text": "Photo\n\nWASHINGTON — Attorney General Jeff Sessions spoke dismissively about the State of Hawaii while criticizing a Federal District Court ruling last month that blocked the Trump administration from carrying out its ban on travel from parts of the Muslim world.\n\n“I really am amazed that a judge sitting on an island in the Pacific can issue an order that stops the president of the United States from what appears to be clearly his statutory and constitutional power,” Mr. Sessions said this week in an interview on “The Mark Levin Show,” a conservative talk radio program.\n\nMr. Sessions’s description of Hawaii, where the federal judge who issued the order, Derrick K. Watson, has his chambers, drew a rebuke from both of the United States senators who represent the state. Annexed as a territory of the United States in the late 19th century, Hawaii became the 50th state in 1959.\n\n“Hawaii was built on the strength of diversity & immigrant experiences — including my own,” Senator Mazie Hirono, Democrat of Hawaii, wrote on Twitter. “Jeff Sessions’ comments are ignorant & dangerous.”\n\nAdvertisement Continue reading the main story\n\nThe other senator from Hawaii, Brian Schatz, who is also a Democrat, expressed similar sentiments, writing on Twitter: “Mr. Attorney General: You voted for that judge. And that island is called Oahu. It’s my home. Have some respect.”\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nAsked for a response from Mr. Sessions, Ian Prior, a spokesman for the Justice Department, said in an email: “Hawaii is, in fact, an island in the Pacific — a beautiful one where the attorney general’s granddaughter was born. The point, however, is that there is a problem when a flawed opinion by a single judge can block the president’s lawful exercise of authority to keep the entire country safe.”", "authors": ["Charlie Savage"], "publish_date": "2017-04-20", "source": "nytimes", "top_words": ["hawaii", "island", "email", "dismisses", "state", "judge", "sessions", "united", "states", "pacific", "attorney", "jeff", "mr"], "summary": "Sessions said this week in an interview on “The Mark Levin Show,” a conservative talk radio program.\nAnnexed as a territory of the United States in the late 19th century, Hawaii became the 50th state in 1959.\n“Hawaii was built on the strength of diversity & immigrant experiences — including my own,” Senator Mazie Hirono, Democrat of Hawaii, wrote on Twitter.\n“Jeff Sessions’ comments are ignorant & dangerous.”Advertisement Continue reading the main storyThe other senator from Hawaii, Brian Schatz, who is also a Democrat, expressed similar sentiments, writing on Twitter: “Mr.\nSessions, Ian Prior, a spokesman for the Justice Department, said in an email: “Hawaii is, in fact, an island in the Pacific — a beautiful one where the attorney general’s granddaughter was born."}