{"url": "https://www.nytimes.com/2017/05/20/world/middleeast/donald-trump-saudi-arabia.html?mcubz=0", "id": "370", "title": "Saudis Welcome Trump’s Rebuff of Obama’s Mideast Views", "text": "Mr. Jubeir praised Mr. Trump for renewing ties between the two countries, and pointed to the “extremely, extremely productive and historic visit.”\n\nFor Mr. Trump, the warm embrace by the Saudi monarchy was a welcome break from the cascade of bad news in Washington. Even as Air Force One took off from a Maryland air base on Friday afternoon, headlines revealed new details about the swiftly expanding investigation into ties between Russia and Mr. Trump’s advisers.\n\nQuestions about those headlines followed Mr. Trump across the globe, a reminder of the political troubles dogging him back home. But the president at least initially resisted the temptation to deviate from his diplomatic script to address reports that he had referred to James B. Comey, the former F.B.I. director, as “a nut job” during meetings with Russian officials in the Oval Office.\n\nAt his news conference, Mr. Tillerson said he did not have “any information or knowledge” about an unnamed White House official reported by The Washington Post to be a person of interest to investigators in the Russia case.\n\nThroughout his first day as America’s top overseas ambassador, Mr. Trump posed for pictures, shook hands with his hosts and avoided his domestic turmoil.\n\nMr. Trump announced a nearly $110 billion arms deal with Saudi Arabia as evidence of a renewed commitment by the United States to the security of the Persian Gulf region. The package includes precision weaponry that Mr. Obama had held up over concerns that it would be used to kill civilians in the war in neighboring Yemen, as well as an antimissile system.\n\nAdvertisement Continue reading the main story\n\nA forum bringing together American and Saudi corporate executives on Saturday also produced a series of multibillion-dollar deals. Among them: Lockheed Martin signed a $6 billion letter of intent to assemble 150 Black Hawk helicopters in Saudi Arabia, and General Electric announced projects it valued at $15 billion.\n\nCritics said the last thing the region needed was more arms. “In the powder keg that is the Middle East, this sale may simply light a fuse that sends the region, and us, deeper down the rabbit hole of perpetual military conflict,” Senator Chris Murphy, Democrat of Connecticut, wrote on HuffPost.\n\nMr. Trump himself had little to say publicly on Saturday, calling his first stop of his trip “a tremendous day” that would bring “hundreds of billions of dollars of investments into the United States and jobs, jobs, jobs.”\n\nPhoto\n\nDuring two days here, the president is set to meet with dozens of leaders from the Persian Gulf and the wider Muslim world as he seeks to shape a new Middle East coalition. His current embrace of the Gulf nations differs sharply with some of his previous remarks. In 2014, before becoming a candidate for the White House, Mr. Trump wrote on Twitter: “Tell Saudi Arabia and others that we want (demand!) free oil for the next ten years or we will not protect their private Boeing 747s. Pay up!”\n\nOn Sunday, Mr. Trump is scheduled to deliver a speech that White House aides described as a call to Saudi Arabia and the rest of the Muslim world to unite against extremism. One senior White House official said the president hoped to “reset” both the global fight against Islamist terrorism and his own reputation for intolerance of Muslims, which was fueled by his campaign call for a “total and complete shutdown of Muslims entering the United States.” After taking office, Mr. Trump signed an executive order to temporarily block visitors from some predominantly Muslim countries, but courts have blocked it pending a legal review.\n\nMr. Trump’s royal hosts, whose country was not among those covered by the travel ban, have chosen to ignore that history in the interests of working with an American president who seems to share their goals and will not lecture them about repression of women or minority Shiites in Saudi Arabia, or its brutal conduct of the war in Yemen.\n\n“Traditional Arab allies welcome the U.S. back because they believe it is largely on their terms: a U.S. that is clearly anti-Iran and anti-political Islam, a U.S. that de-emphasizes political reform and human rights, a U.S. that is in business mode and a White House that seems more accessible than in the past eight years,” said Emile Hokayem, a senior fellow at the International Institute for Strategic Studies.\n\nBut Mr. Hokayem said Arab leaders might be in for a surprise over the long run. “There is a lot of projection and wishfulness in the Gulf view of Trump’s America,” he said. “There is plenty of inflated expectations.”\n\nVideo\n\nTamara Cofman Wittes, a former State Department official who worked on the Middle East under Mr. Obama, said Mr. Trump’s goal of aligning with the Sunni states fundamentally conflicted with his desire for closer relations with Russia, which has sided with Iran in bolstering the government in Syria’s civil war. Allowing President Bashar al-Assad to remain in power in Syria under Iran’s thumb is precisely the outcome the Sunni states and Israel oppose, noted Ms. Wittes, who is now at the Brookings Institution in Washington.\n\nAdvertisement Continue reading the main story\n\nMr. Trump is the only sitting president to make Saudi Arabia the first stop on his inaugural, nine-day trip overseas.\n\nThe president and his wife, Melania, emerged from Air Force One against a stark desert backdrop on Saturday morning and were greeted on a long red carpet by King Salman, who was leaning on a cane, and other members of the Saudi royal family.\n\nMrs. Trump stood near her husband with her hair uncovered, as is common for visiting American first ladies. The country’s tradition is for Saudi women to cover their heads in public. (In 2015, Mr. Trump criticized Michelle Obama on Twitter for not wearing a head scarf during an official visit here. Hillary Clinton and Chancellor Angela Merkel of Germany also did not cover their hair during trips to the country.)\n\nKing Salman greeted Mr. Trump at the airport, a gesture he did not extend to Mr. Obama. Later, he bestowed the Collar of Abdulaziz Al Saud Medal, the nation’s highest honor, on the new president, draping the gold medal and chain around Mr. Trump’s neck. Previous recipients of the award include Mr. Obama, President George W. Bush, and Vladimir V. Putin, the president of Russia.\n\nA television microphone picked up the king’s remarks to Mr. Trump. “Syria, too, used to be one of the most advanced countries,” the king said. “We used to get our professors from Syria. They served our kingdom. Unfortunately, they too brought destruction to their own country.”\n\n“You could destroy a country in mere seconds,” the king told the president, “but it takes a lot of effort.”", "authors": ["Michael D. Shear", "Peter Baker"], "publish_date": "2017-05-20", "source": "nytimes", "top_words": ["arabia", "trump", "views", "rebuff", "obamas", "saudi", "house", "president", "trumps", "obama", "saudis", "welcome", "states", "mideast", "white", "mr"], "summary": "Questions about those headlines followed Mr. Trump across the globe, a reminder of the political troubles dogging him back home.\nThroughout his first day as America’s top overseas ambassador, Mr. Trump posed for pictures, shook hands with his hosts and avoided his domestic turmoil.\nIn 2014, before becoming a candidate for the White House, Mr. Trump wrote on Twitter: “Tell Saudi Arabia and others that we want (demand!)\nKing Salman greeted Mr. Trump at the airport, a gesture he did not extend to Mr. Obama.\nPrevious recipients of the award include Mr. Obama, President George W. Bush, and Vladimir V. Putin, the president of Russia."}