{"url": "https://www.nytimes.com/2017/05/24/world/europe/fact-check-manchester-bombing-rumors-and-hoaxes.html?mcubz=0", "id": "375", "title": "Fact Check: Manchester Bombing Rumors and Hoaxes", "text": "Some are presuming officials were closely tracking the attacker, when that remains unclear.\n\nSocial media users are questioning how Mr. Abedi could have re-entered Britain if he was “known to the police,” but law enforcement officials have yet to reveal how closely they were monitoring him.\n\nBritain’s home secretary, Amber Rudd, told Sky News that Mr. Abedi had been known to the police “up to a point” and declined to state whether he was on a watch list. Pressed to clarify in an interview with the BBC, Ms. Rudd said: “The intelligence services know a lot of people. I’m sure we will find out what level they knew him in due course. But at the moment all they have confirmed is that they did know about him.”\n\nIn addition to Mr. Abedi’s trip to Libya last month, the French interior minister, Gérard Collomb, has said he also had most likely traveled to Syria. It is unclear whether these visits occurred in the same trip, and whether he had caught the attention of law enforcement before, during or after.\n\nAs a British citizen, Mr. Abedi had the “right of abode,” meaning he did not have to obtain the permission of an immigration officer and could simply enter the United Kingdom, though the government could revoke this right.\n\nSocial media posts are spreading hoaxes about missing children.\n\nPeople took to social media to search for loved ones lost in the chaos that followed the explosion, which occurred at an Ariana Grande concert at Manchester Arena. But many well-wishers and social media good Samaritans have been duped into sharing fake reports of missing victims. In a cruel sign of social savvy, many of the most successful frauds have used fake photos and back stories children, as The Washington Post and BuzzFeed have reported.\n\nOne account posted a plea to find “my son” that was retweeted over 19,000 times.\n\nBut the person pictured is a popular YouTube user, who posted a video denying the claim and calling the post “fake news” from online trolls “just to try to get some laughs out it.” He offered his condolences to the victims.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe account later acknowledged that the post was a stunt, calling it the user’s “most successful troll,” before being suspended by Twitter.\n\nAdvertisement Continue reading the main story\n\nIn another post, a Twitter user claimed to be searching for “my little brother Frank.” The boy pictured is a model for Downs Designs Dreams, a fashion line for people with Down syndrome based in Ohio, and his name is Griffith, not Frank.\n\n“This little boy is 9 or 10 now. He was 2 or 3 years old then. He’s certainly not missing,” said Karen Bowersox, the executive director of Downs Designs Dreams. Twitter suspended the account that posted the claim.\n\nPhoto\n\nOthers are misdirecting parents to hotels where they claim dozens of unaccompanied children are staying.\n\nIn the confusion of the attack, many were pointing frantic parents to Manchester-area hotels.\n\nBut InterContinental Hotels, the parent company of Holiday Inn, told The New York Times that the rumors were not accurate.\n\n“There has been reports of a number of unaccompanied children being brought to a Holiday Inn or Holiday Inn Express in the area. However, these are incorrect,” said Gemma Bull, a spokeswoman for the company. “Our hotels were working with police throughout the night, but we did not have a large group of unaccompanied children at our hotel.”\n\nThe Greater Manchester police have also denied the rumor.\n\nTwitter users appear to be misinterpreting Facebook posts from a woman named Paula Robinson, who said she ushered 50 children to Holiday Inn after the explosion. She would stay with them as they awaited their parents, Ms. Robinson wrote.\n\nIn an interview with the BBC, Ms. Robinson said that after the attack, she and her husband were carrying two children and told the crowd to seek refuge at the Holiday Inn before posting her messages on Facebook.\n\n“It’s gotten mistaken that I am the help line,” she said, adding that hundreds of parents have called her inquiring about their children, but “I just don’t know.”\n\nSome are taking old allegations about Ariana Grande out of context.\n\nSome users are resurfacing reports from 2014 that Ms. Grande had said she hoped her fans would “die.” These rumors were denied by Ms. Grande’s representatives at the time.\n\nAdvertisement Continue reading the main story\n\nA Trump forum on Reddit claimed that BuzzFeed had removed its article about Ms. Grande’s alleged remark in a “little cover-up.” BuzzFeed temporarily removed the article before posting an update with the original text to reflect that the singer’s three-year-old remarks were “unrelated to the attack.”\n\nThe original article was based on comments from an unnamed “industry insider” to The Daily News in a larger article about Ms. Grande’s “diva behavior.” A representative for Ms. Grande called the allegation untrue, and Ms. Grande indirectly rebutted it on Twitter.\n\nAfter the bombing, Ms. Grande suspended her tour and offered her condolences on social media.", "authors": ["Linda Qiu"], "publish_date": "2017-05-24", "source": "nytimes", "top_words": ["inn", "holiday", "social", "post", "hoaxes", "media", "parents", "check", "rumors", "fact", "ms", "manchester", "children", "bombing", "grande", "users"], "summary": "But many well-wishers and social media good Samaritans have been duped into sharing fake reports of missing victims.\nBut InterContinental Hotels, the parent company of Holiday Inn, told The New York Times that the rumors were not accurate.\n“There has been reports of a number of unaccompanied children being brought to a Holiday Inn or Holiday Inn Express in the area.\nShe would stay with them as they awaited their parents, Ms. Robinson wrote.\nAfter the bombing, Ms. Grande suspended her tour and offered her condolences on social media."}