{"url": "https://www.nytimes.com/2017/06/12/us/politics/trump-travel-ban-court-of-appeals.html?mcubz=0", "id": "393", "title": "Trump Loses Travel Ban Ruling in Appeals Court", "text": "The decision, from a three-judge panel, was unanimous. It was issued jointly by Judges Michael Daly Hawkins, Ronald M. Gould and Richard A. Paez. All three were appointed by President Bill Clinton.\n\nThe ruling affirmed most of a March decision from Judge Derrick K. Watson, of the Federal District Court in Hawaii. But the appeals court narrowed the injunction issued by Judge Watson in a significant way.\n\nThe appeals court said Judge Watson had erred in barring the administration from conducting internal reviews of its vetting procedures while the case moved forward.\n\nThat may turn out to be important as the Supreme Court considers how to address the two cases.\n\nThe key part of the executive order suspended travel from six predominantly Muslim countries for 90 days to give the administration time to conduct a review of its vetting procedures. If that review can soon be completed, the justices may decide that the case will soon be moot.\n\nIn briefs filed Monday in the Supreme Court, lawyers challenging the revised executive order urged the court not to hear the Trump administration’s appeal of the Fourth Circuit’s decision or to stay the injunctions entered in the two cases.\n\nThey said the cases might be moot as soon as Wednesday, as the 90-day suspension of entry contemplated by the revised executive order was, counting from its effective date, set to expire then.\n\nThe administration has argued that Judge Watson’s ruling stopped the 90-day clock. It asked the justices to agree to hear an appeal of the Fourth Circuit decision before they leave for their summer break and to schedule arguments in the fall.\n\nAdvertisement Continue reading the main story\n\nBy lifting the part of Judge Watson’s injunction that barred review of internal vetting procedures in the meantime, the Ninth Circuit may have ensured that the case will be moot by the time it is argued, no matter how the 90 days are calculated.\n\n“It would be unnecessary and wasteful for the court to grant review of an issue that is essentially moot,” lawyers for the State of Hawaii wrote.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nLike the Fourth Circuit, Judge Watson blocked major parts of the revised order on the ground that they violated the Constitution’s ban on a government establishment of religion. Judge Watson wrote that the statements of Mr. Trump and his advisers made clear that his executive order amounted to an attempt to disfavor Muslims.\n\nJudge Watson should not have reached the constitutional issue and should have ruled on statutory grounds, the Ninth Circuit said.\n\n“We need not, and do not, reach the Establishment Clause claim to resolve this appeal,” the appeals court’s opinion said.\n\nVideo\n\nJudge Watson’s injunction was broader than the one affirmed by the Fourth Circuit. In addition to halting the limits on travel from the six countries, Judge Watson blocked a 120-day suspension of the nation’s refugee program and a 50,000-person cap on refugee admissions in 2017, down from 110,000. The Ninth Circuit affirmed those parts of Judge Watson’s decision.\n\nThe Ninth Circuit said it had a role to play in testing Mr. Trump’s actions.\n\n“Whatever deference we accord to the president’s immigration and national security policy judgments does not preclude us from reviewing the policy at all,” the appeals court’s opinion said. “We do not abdicate the judicial role, and we affirm our obligation ‘to say what the law is’ in this case,” it added, quoting Marbury v. Madison, the foundational 1803 Supreme Court decision.\n\nA federal law gives the president the power to exclude foreigners if he finds that letting them enter the country “would be detrimental to the interests of the United States.”\n\nThe appeals court said Mr. Trump had exceeded that authority, in large part because he had failed to offer adequate justifications for his order.\n\nAdvertisement Continue reading the main story\n\n“In suspending the entry of more than 180 million nationals from six countries, suspending the entry of all refugees, and reducing the cap on the admission of refugees from 110,000 to 50,000 for the 2017 fiscal year,” the court said, “the president did not meet the essential precondition to exercising his delegated authority: The president must make a sufficient finding that the entry of these classes of people would be ‘detrimental to the interests of the United States.’”\n\nThe court said Mr. Trump’s justifications for the executive order were inadequate.\n\n“The order does not tie these nationals in any way to terrorist organizations within the six designated countries,” the opinion said. “It does not identify these nationals as contributors to active conflict or as those responsible for insecure country conditions. It does not provide any link between an individual’s nationality and their propensity to commit terrorism or their inherent dangerousness.”\n\n“In short,” the opinion concluded, “the order does not provide a rationale explaining why permitting entry of nationals from the six designated countries under current protocols would be detrimental to the interests of the United States.”\n\nThe appeals court also ruled that the administration had run afoul of another provision of the immigration laws, one that forbids discrimination “because of the person’s race, sex, nationality, place of birth or place of residence,” but only “in the issuance of an immigrant visa.” The Trump administration argued that the power to bar entry, the subject of a different provision, was broader than the limits on issuing visas.\n\nThe appeals court said the two provisions must be read together.\n\n“We cannot blind ourselves to the fact that, for nationals of the six designated countries,” the opinion said, the revised order “is effectively a ban on the issuance of immigrant visas.”", "authors": ["Adam Liptak"], "publish_date": "2017-06-12", "source": "nytimes", "top_words": ["ruling", "travel", "nationals", "trump", "ban", "appeals", "circuit", "judge", "court", "opinion", "countries", "entry", "order", "loses", "watson"], "summary": "The ruling affirmed most of a March decision from Judge Derrick K. Watson, of the Federal District Court in Hawaii.\nBut the appeals court narrowed the injunction issued by Judge Watson in a significant way.\nThe appeals court said Judge Watson had erred in barring the administration from conducting internal reviews of its vetting procedures while the case moved forward.\nJudge Watson should not have reached the constitutional issue and should have ruled on statutory grounds, the Ninth Circuit said.\nThe appeals court said the two provisions must be read together."}