{"url": "https://www.nytimes.com/2016/09/18/us/politics/hate-crimes-american-muslims-rise.html?mcubz=0", "id": "38", "title": "Hate Crimes Against American Muslims Most Since Post-9/11 Era", "text": "“We’re seeing these stereotypes and derogative statements become part of the political discourse,” said Brian Levin, the director of the Center for the Study of Hate and Extremism at the San Bernardino campus. “The bottom line is we’re talking about a significant increase in these types of hate crimes.”\n\nHe said that the frequency of anti-Muslim violence appeared to have increased immediately after some of Mr. Trump’s most incendiary comments.\n\nThe latest major episode of anti-Muslim violence came last weekend, when an arsonist on a motorcycle started a fire that engulfed the Islamic Center of Fort Pierce, Fla., where Omar Mateen — the gunman in the June massacre at the Pulse nightclub in Orlando — had sometimes prayed.\n\nThe police, who called the attack “a terrible tragedy” for the community, arrested a local man who had criticized Islam in social media postings.\n\nThe arson, along with an earlier assault on a congregant outside the mosque and other episodes there, has left worshipers scared, said Mohammed Malik, 43, a businessman who has attended the mosque for nearly a decade.\n\n“There is a lot of negative rhetoric,” he said. “The negative rhetoric is causing the hate, and in turn the hate is causing the violent acts.”\n\nThe new study from Mr. Levin’s nonpartisan group, based on official police reports in 20 states, estimated that there were about 260 hate crimes against Muslims nationwide in 2015.\n\nAdvertisement Continue reading the main story\n\nThat was the most since the record 481 documented hate crimes against Muslims in 2001, when the Sept. 11 attacks set off waves of crimes targeting Muslims and Middle Easterners, Mr. Levin said. The huge increase last year was also the biggest annual rise since 2001, he said.\n\nThe rise came even as hate crimes against almost all other groups — including blacks, Hispanics, Jews, gays and whites — either declined or increased only slightly, his study found. One exception was hate crimes against transgender people, which rose about 40 percent.\n\nAn advance copy of the study was provided to The New York Times.\n\nThe statistics almost certainly understate the extent of the problem, researchers say, because victims are often reluctant to report attacks for fear of inflaming community tensions, and because it is sometimes difficult for investigators to establish that religious, ethnic or racial hatred was a cause.\n\nIn the killing last year of three Muslim students in Chapel Hill, N.C., for instance, the authorities did not bring hate crime charges against a neighbor who is charged with murdering them, despite calls from Muslims who said there were religious overtones to the violence. The police said that a parking dispute, not bigotry, may have led to the killings.\n\nSometimes, the evidence is more clear-cut.\n\n“I hate ISLAM!” a former Marine named Ted Hakey Jr. wrote to a friend on Facebook after last November’s terrorist attacks in Paris. Hours later, in a drunken rampage, he fired a high-powered rifle four times into the mosque next door to his Connecticut home.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nLast month, an apologetic Mr. Hakey began a six-month prison sentence after pleading guilty to a hate crime charge.\n\nIn Brooklyn, two women out walking their children in strollers were attacked this month, the police said, by a woman who screamed anti-Muslim obscenities and tried to rip off their traditional veils. And in Queens, a man was beaten in April by three strangers who shouted “ISIS, ISIS.”\n\nIn Minneapolis, a man shouting obscenities about Islam shot two Muslim men in traditional religious garb in June, the authorities said.\n\nIn St. Louis, a man was arrested in February after the police said he pointed a gun at a Muslim family shopping on his block and told them they “all should die.”\n\nAdvertisement Continue reading the main story\n\nLast month, an imam in Queens and his assistant were shot and killed execution-style on the sidewalk. The authorities have charged a 35-year-old man in the attack but have not determined a motive or whether it should be treated as a hate crime.\n\nThe increase in reports of apparent hate crimes has worried Justice Department officials.\n\n“We saw it after 9/11, and we continue to see an uptick in allegations of hate-related incidents today following the tragic events over the past year,” said Vanita Gupta, who leads the Justice Department’s civil rights division.\n\n“We see criminal threats against mosques; harassment in schools; and reports of violence targeting Muslim-Americans, Sikhs, people of Arab or South-Asian descent and people perceived to be members of these groups,” Ms. Gupta said.\n\nThe Justice Department has moved to draw public attention to the problem and marshal resources to combat it as part of a broader effort against religious discrimination.\n\nA number of experts in hate crimes said they were concerned that Mr. Trump’s vitriol may have legitimized threatening or even violent conduct by a small fringe of his supporters.\n\nIn a few cases, people accused of hate crimes against Muslims and others have even cited Mr. Trump.\n\nThe police here in Washington released a videotape in May of a woman who reportedly poured liquid on a Muslim woman after berating Islam and declaring that she was going to vote for Mr. Trump so that he could “send you all back where you came from.”\n\nOn Thursday, Hillary Clinton charged that Mr. Trump had “incited violence” in a campaign marked by “bigotry” and “hatred.”\n\nPhoto\n\nMr. Trump’s supporters say that he has never endorsed violence against any minorities, and some conservatives have challenged data showing an increase in violence against American Muslims as a creation of liberal-leaning researchers.\n\nAdvertisement Continue reading the main story\n\nMr. Trump has said he is not responsible for any violence by his supporters.\n\n“They’re not angry about something I’m saying,” he said on “Meet the Press” in March. “I’m just a messenger. The people are angry about the fact that, for 12 years, the workers in this country haven’t had a pay increase.”\n\nJames Nolan, a former F.B.I. crime analyst who teaches about hate crimes at West Virginia University, said that the data seemed to show “a real spike” in hate crimes against American Muslims, caused in part by candidates’ “raising the specter that radical Islam is at our doorstep.”\n\nMark Potok, a senior fellow at the Southern Poverty Law Center, which monitors hate groups and extremism, went further.\n\n“I don’t have the slightest doubt that Trump’s campaign rhetoric has played a big part” in the rising attacks, he said.", "authors": ["Eric Lichtblau"], "publish_date": "2016-09-18", "source": "nytimes", "top_words": ["post911", "continue", "mr", "hate", "man", "era", "trumps", "crimes", "islam", "study", "muslims", "american", "violence"], "summary": "Advertisement Continue reading the main storyThat was the most since the record 481 documented hate crimes against Muslims in 2001, when the Sept. 11 attacks set off waves of crimes targeting Muslims and Middle Easterners, Mr. Levin said.\nOne exception was hate crimes against transgender people, which rose about 40 percent.\n“I hate ISLAM!” a former Marine named Ted Hakey Jr. wrote to a friend on Facebook after last November’s terrorist attacks in Paris.\nThe increase in reports of apparent hate crimes has worried Justice Department officials.\nIn a few cases, people accused of hate crimes against Muslims and others have even cited Mr. Trump."}