{"url": "https://www.nytimes.com/2017/03/14/world/europe/headscarves-ban-european-court.html?mcubz=0", "id": "309", "title": "Ban on Head Scarves at Work Is Legal, E.U. Court Rules", "text": "Far-right leaders surely would have pounced had the court ruled differently. Along with Mr. Wilders, the French far-right leader Marine Le Pen has stirred up anti-Islam anger by accusing Muslims of failing to integrate. Europe has been struggling to accommodate huge numbers of migrants, many from predominantly Muslim countries.\n\nFew issues are more politically fraught in Europe than the issue of the rights of observant Muslim women to cover their faces and bodies. Last summer, for instance, a few French municipalities generated global headlines — and outrage — when Muslim women were prohibited from swimming in the sea while wearing a body covering known as the burkini.\n\nSeveral countries — including France, Belgium, Austria and the Netherlands — have either passed laws that led to bans on full face-covering veils in public, or are considering legislation that would do so. Those laws, however, apply to public and government spaces.\n\nThe ruling on Tuesday, which experts said was the first time the court had issued a ruling on women wearing head scarves while on the job, applies only to the workplace and provides a minimum legal standard that member states must meet.\n\nThe European Court of Justice, based in Luxembourg, interprets the law for the 28-nation European Union, and its decisions are binding for member states. Its ruling on Tuesday followed advisory opinions in two distinct cases before the court.\n\nIn a case in May, Juliane Kokott, an advocate general with the court, issued an opinion saying that a company could prohibit a Muslim employee from wearing a head scarf, provided that the policy applied to attire for all religions and did not single out Islam.\n\nThat opinion came after a complaint by Samira Achbita, a Muslim woman in Belgium, who was fired as a receptionist for the international security services company G4S after she insisted that she be allowed to wear a head scarf at work.\n\nAdvertisement Continue reading the main story\n\nMs. Achbita sued the company, and the Belgian Court of Cassation asked the European Court of Justice for clarification about what European law required.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe Court of Justice concurred on Tuesday with the advisory ruling, saying that Ms. Achbita had not been subject to discrimination because the internal directive was broadly written and did not single out Islam.\n\nThe court said it was up to the Belgian Court of Cassation to determine whether an employer had committed “indirect discrimination” if any directive ultimately affected “persons adhering to a particular religion or belief.”\n\nIn a separate case, from July, Eleanor Sharpston, another advocate general for the court, said that Micropole, an information technology consultancy, had engaged in unlawful discrimination when it fired a Muslim woman, Asma Bougnaoui, in 2009 for refusing to remove her head scarf when dealing with clients.\n\nMs. Bougnaoui took her case to a French court, which referred it to the European Court of Justice. In her advisory opinion, Ms. Sharpston said the company’s decision to dismiss Ms. Bougnaoui had constituted “direct discrimination” based on religion or belief.\n\nMs. Sharpston said there was no evidence to suggest that Ms. Bougnaoui’s scarf interfered with her ability to perform her job as a design engineer. If she had covered her face completely, the opinion found, the situation would have been different, because eye-to-eye contact was important in Western business interactions.\n\nBut the court on Tuesday found that, in the absence of an internal company policy, it was not enough for an employer to simply justify a dismissal by pointing to a customer’s desire not to interact with someone wearing a head scarf.\n\nLegal experts said the court’s ruling could give greater leeway to employers across Europe to regulate religious attire in the workplace, as long as they did so with neutral policies that did not target Muslims.\n\nSimon Cox, a senior legal officer specializing in anti-discrimination issues with the Open Society Foundations, said the ruling “will force employers to choose which side they are on and open the door to a greater willingness not to employ women in head scarves.”\n\nAdvertisement Continue reading the main story\n\nMaryam H’madoun, a policy adviser who is also with the Open Society Foundations, expressed concern that the ruling could potentially help exclude many Muslim women from the work force. “This disappointing ruling weakens the guarantee of equality that is at the heart of the E.U.’s anti-discrimination directive,” she said.\n\nColm O’Cinneide, a professor of human rights and constitutional law at University College London, said the ruling could lead to more bans on religious attire in workplaces.\n\nHe also noted that the ruling required that any ban on religious attire be “objectively justified” and that imposing a ban could be difficult when employees were not the public face of the company or interacting with customers directly.\n\n“Depending on a country and its internal debates, companies that want to have a head scarf ban will feel more comfortable doing so, and this ruling gives them some legal cover,” Mr. O’Cinneide said.", "authors": ["Dan Bilefsky"], "publish_date": "2017-03-14", "source": "nytimes", "top_words": ["ruling", "women", "head", "ban", "european", "scarves", "rules", "court", "eu", "company", "scarf", "work", "opinion", "wearing", "muslim", "legal"], "summary": "Few issues are more politically fraught in Europe than the issue of the rights of observant Muslim women to cover their faces and bodies.\nThe European Court of Justice, based in Luxembourg, interprets the law for the 28-nation European Union, and its decisions are binding for member states.\nAdvertisement Continue reading the main storyMs. Achbita sued the company, and the Belgian Court of Cassation asked the European Court of Justice for clarification about what European law required.\nMs. Bougnaoui took her case to a French court, which referred it to the European Court of Justice.\n“Depending on a country and its internal debates, companies that want to have a head scarf ban will feel more comfortable doing so, and this ruling gives them some legal cover,” Mr. O’Cinneide said."}