{"url": "https://www.nytimes.com/2017/05/26/us/politics/united-states-refugees-trump.html?mcubz=0", "id": "377", "title": "U.S. Quietly Lifts Limit on Number of Refugees Allowed In", "text": "The department’s quotas on refugee resettlement were largely the result of budget constraints imposed by Congress in a temporary spending measure passed last fall. But when Congress passed a spending bill this month that funded the government for the rest of the fiscal year, the law did not include any restrictions on refugee admissions.\n\nA State Department spokeswoman, speaking on the condition of anonymity because she was not authorized to discuss the issue publicly, said the department had consulted the Department of Justice about its refugee quotas and had decided to adjust them.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nPresident Trump has sought to lower the ceiling on the number of refugees annually allowed in the country to 50,000 from 110,000. Mr. Trump’s executive orders on immigration, the first of which he issued on Jan. 27, also sought to suspend all refugee admissions for at least four months. Federal judges stayed those orders, but the confusion over them has contributed to a falloff in refugees entering the United States.\n\nWhile 13,255 refugees were admitted in August, that number plunged to just 2,070 in March. So far during the 2017 fiscal year, 45,732 people have been admitted, just a few thousand short of Mr. Trump’s proposed cap.\n\nRefugee groups now predict that entries into the United States could increase so rapidly that the total number of refugees admitted by Sept. 30, the end of the fiscal year, could exceed 70,000. That is well below the 84,994 refugees admitted in fiscal year 2016, but not by nearly as much as many advocates had feared.\n\nRefugee advocates were delighted by the State Department’s decision.\n\n“This is long overdue, but we’re very happy,” said Mark Hetfield, president and chief executive of HIAS, an immigrant aid society.\n\nBut many of the advocates said they were worried that any reprieve would be temporary.\n\n“The president’s proposed budget cuts for 2018 would mean we would have a much smaller program next year no matter what happens with his executive orders,” said Erol Kekic, executive director of the immigration and refugee program at Church World Service.\n\nAdvertisement Continue reading the main story\n\nPerhaps even more worrisome, refugee advocates said they had seen a slowdown in security screenings by the Department of Homeland Security, whose checks are required for refugees to enter the United States.\n\nStill, even Republicans in Congress have said that few of Mr. Trump’s proposed budget cuts to foreign aid and the State Department’s budget would be adopted into law.\n\nIn a visit this week to Syrian refugee camps in Turkey, Nikki R. Haley, the United Nations ambassador, all but urged Congress to reverse Mr. Trump’s proposed cuts in aid to refugees.\n\n“It’s starting the conversation,” Ms. Haley said of Mr. Trump’s proposed budget, according to The Associated Press. “It doesn’t mean that’s where it will end up. He’s going to have that conversation with Congress on where we should fall on this.”", "authors": ["Gardiner Harris"], "publish_date": "2017-05-26", "source": "nytimes", "top_words": ["executive", "quietly", "allowed", "congress", "budget", "refugee", "lifts", "united", "trumps", "number", "fiscal", "proposed", "limit", "refugees", "mr"], "summary": "President Trump has sought to lower the ceiling on the number of refugees annually allowed in the country to 50,000 from 110,000.\nMr. Trump’s executive orders on immigration, the first of which he issued on Jan. 27, also sought to suspend all refugee admissions for at least four months.\nSo far during the 2017 fiscal year, 45,732 people have been admitted, just a few thousand short of Mr. Trump’s proposed cap.\nStill, even Republicans in Congress have said that few of Mr. Trump’s proposed budget cuts to foreign aid and the State Department’s budget would be adopted into law.\n“It’s starting the conversation,” Ms. Haley said of Mr. Trump’s proposed budget, according to The Associated Press."}