{"url": "https://www.nytimes.com/2017/03/21/us/politics/tsa-ban-electronics-laptops-cabin.html?mcubz=0", "id": "333", "title": "Devices Banned on Flights From 10 Countries Over ISIS Fears", "text": "Washington also has restricted some flights from Kuwait, Morocco, Qatar and the United Arab Emirates. London, meanwhile, has additionally restricted flights from some airports in Lebanon and Tunisia.\n\nThe targeting of a jetliner using explosives shows how the Islamic State, which has long worked to inspire terrorist attacks, is trying to compete with groups like Al Qaeda’s affiliate in Yemen. The Qaeda affiliate has spent years inventing explosives that are difficult to detect, including trying to disguise bombs in devices like cellphones. Now, American intelligence officials believe the Islamic State has also developed explosives that can be hidden in electronic devices, one of the senior counterterror officials said.\n\nRepresentative Peter King, Republican of New York, who sits on the House Intelligence and Homeland Security Committees, said that government officials had called him on Saturday to alert him to the impending ban.\n\n“It was based on intelligence reports that are fairly recent,” Mr. King said in a telephone interview. “Intelligence of something possibly planned.”\n\nThe Department of Homeland Security said the restricted items on flights to the United States included laptop computers, tablets, cameras, travel printers and games bigger than a phone. The restrictions would not apply to aircraft crews, officials said in a briefing to reporters to outline the terms of the ban.\n\nThe American ban on electronics applies only to flights on foreign carriers. It does not affect American-operated airlines, since they do not fly directly to the United States from 10 designated airports in eight countries — Amman, Jordan; Cairo; Istanbul; Jidda and Riyadh in Saudi Arabia; Kuwait City; Casablanca, Morocco; Doha, Qatar; and Dubai and Abu Dhabi in the United Arab Emirates. Officials did not say how long the ban would remain in place or if other airports would be added.\n\nIn all, an estimated 50 flights each day into the United States would be affected. One of the world’s busiest airports, in Abu Dhabi, already requires American-bound passengers to undergo strict screening by United States customs officials before boarding flights. Abu Dhabi is one of 15 airports in the world to employ the Homeland Security preclearance techniques.\n\nAdvertisement Continue reading the main story\n\nSeveral hours after the American action, the British government announced its own ban on electronic devices on flights.\n\nThe British ban affects domestic and foreign airlines, including British Airways, the country’s largest. Foreign airlines affected by the order include Turkish Airlines, EgyptAir and Royal Jordanian, among others, and it affects direct flights to the United Kingdom from Turkey, Lebanon, Jordan, Egypt, Tunisia and Saudi Arabia.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nA British official said the U.K. ban resulted from the combination of an evolving threat picture and a proliferation of electronic devices that airline passengers carry on board.\n\nExamples of attacks by extremist groups against transportation hubs over the past two years include the October 2015 bombing of an airliner in Egypt, the attempted airliner downing in Somalia last year and armed attacks against airports in Brussels and Istanbul in 2016.\n\nThe new bans on electronic devices have prompted a round of protests from passengers who now face the prospect of flying long hours without the use of laptops or tablets.\n\nBanu Akdenizli, an associate professor of communication at Northwestern University’s campus in Doha, complained that the ban would affect her ability to work during a long flight to Greensboro, N.C., for a conference in April.\n\n“This is a 20-hour flight,” she said. “I think as an academic or any business traveler, the function of a work flight is to be able to work on it, especially if you’re going to a conference.”\n\nOsama Sharshar, a prominent Egyptian lawmaker and journalist who frequently travels to the United States, was critical of the changes and suggested President Trump issued the order simply to “please the right-wing extremists in America.”\n\nAdvertisement Continue reading the main story\n\n“It will terribly affect me as a journalist, a lawmaker and a regular Egyptian,” he said. “I work on planes all the time. And the flight to the States is very long.”\n\nThe Homeland Security Department’s new ban appeared to take officials from some of the affected countries by surprise.\n\nAhmet Arslan, Turkey’s transport, maritime and communication minister, said the ban would be harmful to the United States’ airline industry — and to Turkey’s.\n\n“Our problem is not how the practice would take place,” Mr. Arslan said. “The issue is, it can decrease the comfort of the passengers and reduce the numbers of passengers. We are emphasizing that this is not in the benefit of passengers, and we think that they should step back from this or ease it.”\n\nCounterterrorism experts seemed equally divided over the need for the device ban.\n\nMichael Chertoff, the former Homeland Security secretary, said the new policy made sense given the threats to aircraft from explosive devices and concerns about screening at the targeted airports.\n\n“The challenge is to balance security without making it impossible to fly,” Mr. Chertoff said.\n\nBut Erroll Southers, director of the Homegrown Violent Extremism Studies Program at the University of Southern California, said the new guidance would do little to enhance security.\n\n“This does little to minimize the threat of a remote-controlled I.E.D.,” he said, referring to improvised explosive devices hidden in checked baggage.\n\nAmerican intelligence officials did not cite threats against domestic airports, but one said the Transportation Security Administration has been on heightened alert at several airports. It was not clear if that alert was related to the new restrictions on electronic devices.\n\nThe restrictions follow other recent changes the T.S.A. has made in aviation security. Two weeks ago, the agency adopted enhanced pat-down searches for passengers at United States airports, a response to what it said were weaknesses in airport screening measures. Under the new rules, passengers will no longer be allowed to choose what type of searches they undergo in security lines.", "authors": ["Ron Nixon", "Adam Goldman", "Eric Schmitt"], "publish_date": "2017-03-21", "source": "nytimes", "top_words": ["passengers", "isis", "intelligence", "airports", "ban", "security", "officials", "united", "flights", "countries", "banned", "states", "devices", "fears"], "summary": "Now, American intelligence officials believe the Islamic State has also developed explosives that can be hidden in electronic devices, one of the senior counterterror officials said.\nIn all, an estimated 50 flights each day into the United States would be affected.\nOne of the world’s busiest airports, in Abu Dhabi, already requires American-bound passengers to undergo strict screening by United States customs officials before boarding flights.\nAdvertisement Continue reading the main storySeveral hours after the American action, the British government announced its own ban on electronic devices on flights.\nTwo weeks ago, the agency adopted enhanced pat-down searches for passengers at United States airports, a response to what it said were weaknesses in airport screening measures."}