{"url": "https://www.nytimes.com/2017/05/27/opinion/sunday/how-not-to-fight-trump.html?mcubz=0", "id": "378", "title": "How Not to Fight Trump", "text": "Of course, constitutional guarantees do not normally apply to foreign nationals. But allowing an immigration restriction motivated by religious animus, the opinion argues, would create a strong likelihood that some “constitutional harm will redound to citizens” as well. And this is enough, it concludes, to make an order that only directly affects foreigners a violation of every American Muslim’s First Amendment rights.\n\nThe second half of the argument is a remarkable constitutional bankshot. But it’s the first half that’s most troubling, because it effectively creates what David French of National Review — no Trump admirer — describes as a kind of “Trumplaw,” a set of restrictions on presidential action that only apply to Donald Trump. This president cannot do things that would be perfectly legal if any other president did them, under this standard, because the courts will rule against his past demagogy rather than the policies themselves.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nTo some members of the Resistance this may sound like a brilliant approach. It is not. First, as the dissenting opinion rightly notes, it establishes a precedent that would further politicize an already-partisan judiciary, by licensing judges to constantly look beyond the law for excuses to rule against politicians (liberal or conservative) they dislike.\n\nSecond, it effectively tells populist politicians who flout norms on the campaign trail that they needn’t bother moderating once in office, because the system has already decided that they can’t. So it doesn’t matter that Trump has shifted his tone on Islam; it doesn’t matter that he spent the days before the ruling palling around with Saudis like a Bush Republican. Once a deplorable, always a deplorable — a judgment that’s likely to only confirm future populists in their antinomian and extralegal impulses.\n\nAnd not only future populists but this White House, which remains responsible for counterterrorism in an age when the most important terror threats are Islamist, and any move to safeguard Americans is likely to have a disproportionate effect on Muslims.\n\nOne of the things that Trump critics fear most is his possible response to a Manchester-type terrorist attack (or something even worse). But rather than providing a check on future anti-terror overreach, the Fourth Circuit’s overreaching opinion is likely to encourage it.\n\nAfter all, if you tell the White House that it cannot do things that normal presidents are allowed to do because of Trump’s campaign-trail rhetoric, what incentive does the White House have to work carefully within constitutional lines should ISIS or Al Qaeda strike?\n\nAdvertisement Continue reading the main story\n\nInstead, if the courts are automatically going to rule against Trump on any counterterrorism issue that touches on Islam, the president may feel that he may as well prepare for war with the judiciary, since tailoring his policies to fit existing precedents is clearly just a waste.\n\nThere was a lot of loose talk about a “constitutional crisis” in the wake of the firing of James Comey. But it’s easier to imagine the term applying, as it did in the days of Trump’s idol Andrew Jackson, to a direct clash between the White House and the courts.\n\nTrump’s flaws of temperament and character make such a clash dangerously likely. But so does a judicial activism that cuts down normal legal precedent in order to go after him, and tries to pre-emptively strip away his powers without any warrant save self-righteousness.", "authors": ["Ross Douthat"], "publish_date": "2017-05-27", "source": "nytimes", "top_words": ["likely", "trump", "constitutional", "fight", "opinion", "president", "rule", "sign", "things", "house", "white"], "summary": "But it’s the first half that’s most troubling, because it effectively creates what David French of National Review — no Trump admirer — describes as a kind of “Trumplaw,” a set of restrictions on presidential action that only apply to Donald Trump.\nSo it doesn’t matter that Trump has shifted his tone on Islam; it doesn’t matter that he spent the days before the ruling palling around with Saudis like a Bush Republican.\nOne of the things that Trump critics fear most is his possible response to a Manchester-type terrorist attack (or something even worse).\nBut rather than providing a check on future anti-terror overreach, the Fourth Circuit’s overreaching opinion is likely to encourage it.\nBut it’s easier to imagine the term applying, as it did in the days of Trump’s idol Andrew Jackson, to a direct clash between the White House and the courts."}