{"url": "https://www.nytimes.com/2017/05/17/world/europe/austria-veil-ban-muslim.html?mcubz=0", "id": "365", "title": "Austrian Parliament Bans Full Facial Veils in Public", "text": "The Austrian Bar Board, which represents the legal profession, said the ban breached the values of constitutional democracy, along with “the fundamental rights of the freedom of conscience and the freedom of private life.”\n\nThe current coalition government — which includes the conservative People’s Party and the center-left Social Democratic Party — is on the brink of collapse, and early elections are expected in October. That could create an opportunity for the far-right Freedom Party to enter government for the second time since it was formed by former Nazis in the 1950s.\n\nThe Freedom Party’s nominee for president of Austria lost to a moderate in May and December of last year. (The election was ordered repeated because of procedural irregularities in the vote counting the first time.)\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe new restrictions come as countries across Europe, buffeted by the rise of far-right anti-immigrant parties, have been grappling with how to integrate a large influx of migrants, many of whom come from predominantly Muslim countries in the Middle East.\n\nAmid a simmering anti-immigrant backlash, religious clothing has become a proxy for fears that European identity and values are being subsumed by Islamic immigration. That alarm has been magnified by recent terrorist attacks in France, Belgium, Sweden and elsewhere, and by fears that extremists are entering Europe by posing as refugees.\n\nAustria is hardly alone in imposing restrictions on religious garb. Many critics of religious attire say it oppresses women, is physically restrictive and isolates them from mainstream society; many defenders say it is a religious obligation or, in some cases, a matter of individual identity and an expression of one’s heritage.\n\nIn 2010, the French Parliament voted to ban the wearing of face-concealing veils in public places, making France the first country to do so. Violators face a fine of 150 euros. A woman with a full facial veil was spotted in the audience at Opéra Bastille in Paris in 2014 and some of the performers refused to sing. After she was asked to uncover her face or leave, she and her husband left.\n\nA similar ban in Belgium went into effect in 2011.\n\nGermany’s Parliament this year approved a draft law banning women working in the judiciary, the civil service or the military from wearing face-covering veils, and will come into effect soon.\n\nIn December, Chancellor Angela Merkel announced her support for the ban, arguing that full facial veils were “not acceptable in Germany.” She called for them to be prohibited “wherever it is legally possible.”\n\nAdvertisement Continue reading the main story\n\nThe European Union’s highest court entered into the politically explosive debate in March, ruling that private employers can prohibit female workers from wearing head scarves on the job as long as it applies to religious garb from all faiths.", "authors": ["Dan Bilefsky", "Victor Homola"], "publish_date": "2017-05-17", "source": "nytimes", "top_words": ["values", "women", "veils", "ban", "party", "come", "public", "freedom", "parliament", "austrian", "religious", "wearing", "facial", "bans", "york"], "summary": "That could create an opportunity for the far-right Freedom Party to enter government for the second time since it was formed by former Nazis in the 1950s.\nThe Freedom Party’s nominee for president of Austria lost to a moderate in May and December of last year.\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box.\nIn 2010, the French Parliament voted to ban the wearing of face-concealing veils in public places, making France the first country to do so.\nGermany’s Parliament this year approved a draft law banning women working in the judiciary, the civil service or the military from wearing face-covering veils, and will come into effect soon."}