{"url": "http://nytlive.nytimes.com/womenintheworld/2017/01/30/4-women-judges-led-the-way-in-opposing-donald-trumps-travel-ban/?mcubz=0", "id": "3", "title": "4 women judges led the way in opposing Donald Trump’s travel ban", "text": "It took President Donald Trump just one week in office to instigate a new round of protests against his presidency. This time he signed an executive order preventing refugees, migrants and even green-card holders from seven predominantly Muslim countries from entering the U.S., a move many critics saw as a thinly-veiled attempt by Trump to enact one of his most shocking and divisive campaign promises. Trump insisted that the measure “is not a Muslim ban” and his administration scaled back on part of the order on Sunday, The New York Times reported, exempting green card holders with permanent residence status from the strictures of the new rules.\n\nAs a result of the travel ban, chaos ensued at airports in the U.S. and around the world as immigrants were prevented from boarding flights to the United States or held at customs on arrival, some without access to a lawyer. Crowds of demonstrators quickly gathered at airports across the country to protest the order and demand the release of those detained. Former secretary of state Hillary Clinton tweeted her support for the protesters and criticized the policy for being antithetical to American values.\n\nI stand with the people gathered across the country tonight defending our values & our Constitution. This is not who we are. — Hillary Clinton (@HillaryClinton) January 29, 2017\n\nBut it was the actions of four female judges that were pivotal in reigning in the president’s divisive legal maneuver. At 9 p.m. on Saturday evening, in the Eastern District of New York, Judge Ann Donnelly issued a temporary nationwide stay, preventing the government from removing the immigrants being detained at airports around the country. She was shortly followed by Judge Leonie Brinkema, from the Eastern District of Virginia, who issued a restraining order granting those being detained access to a lawyer and also prevented petitioners from being removed.\n\nJudge Allison Burroughs and Magistrate Judge Judith Dein, two federal judges in Boston, later implemented a seven-day restraining order against Trump’s executive order. U.S. District Judge Thomas Zilly, also issued another order against any deportations the following morning.\n\nOne week after the Women’s March on Washington, women are leading the fight against what many are denouncing as immoral and un-American policies implemented by Trump.\n\nRelated\n\nDonald Trump’s travel ban feels like it’s ‘keeping us safe’ from an invented threat\n\nJ.K. Rowling uses 17-word verse from the New Testament to impugn Mike Pence’s moral fiber", "authors": ["Witw Staff"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["opposing", "travel", "women", "led", "judges", "ban", "trump", "district", "airports", "judge", "donald", "trumps", "issued", "country", "order", "york", "detained", "way"], "summary": "It took President Donald Trump just one week in office to instigate a new round of protests against his presidency.\nCrowds of demonstrators quickly gathered at airports across the country to protest the order and demand the release of those detained.\nJudge Allison Burroughs and Magistrate Judge Judith Dein, two federal judges in Boston, later implemented a seven-day restraining order against Trump’s executive order.\nU.S. District Judge Thomas Zilly, also issued another order against any deportations the following morning.\nRelatedDonald Trump’s travel ban feels like it’s ‘keeping us safe’ from an invented threatJ.K. Rowling uses 17-word verse from the New Testament to impugn Mike Pence’s moral fiber"}