{"url": "https://www.nytimes.com/2017/03/17/briefing/donald-trump-ncaa-basketball-st-patricks-day.html?mcubz=0", "id": "325", "title": "Donald Trump, N.C.A.A. Basketball, St. Patrick’s Day: Your Friday Briefing", "text": "Listen from a computer, on an iOS device or on an Android device.\n\nBusiness\n\n• When the Federal Reserve lifted interest rates this week, it added momentum to a steady stream of money out of developing countries and toward the U.S.\n\nAdvertisement Continue reading the main story\n\n• The German authorities searched the offices of the American law firm hired by Volkswagen to lead its internal inquiry into emissions fraud.\n\n• The Trump White House is stacked with former employees of Goldman Sachs, but that might not be a boon to the bank.\n\n• U.S. stocks were mixed on Thursday. Here’s a snapshot of global markets.\n\nMarket Snapshot View Full Overview\n\nSmarter Living\n\n• Many of us mess up our sleep schedules over the weekend. Here’s the case for staying consistent and getting enough sleep.\n\n• Recipe of the day: For a meatless meal, try pasta alla Norma with roasted tomatoes and eggplant.\n\nNoteworthy\n\n• Harvest under the ice.\n\nIn today’s 360 video, watch as mussels are collected at low tide from an icy cave in Quebec.\n\nVideo\n\n• How’s your N.C.A.A. bracket doing?\n\nThere were only two upsets during the first day of the men’s basketball tournament. Here’s a look at the scores and highlights. We’ll have full coverage of Day 2 later today.\n\nPhoto\n\n(The women’s tournament begins today.)\n\n• National Book Critics Circle Awards.\n\nLouise Erdrich’s novel “LaRose,” about two families in North Dakota whose lives are upended by a horrific hunting accident, won the award for fiction on Thursday.\n\nAdvertisement Continue reading the main story\n\nThe sociologist Matthew Desmond won the nonfiction award for his critically acclaimed best seller “Evicted: Poverty and Profit in the American City.”\n\n• A lesson in punctuation.\n\nIn a list of three or more items — like “beans, potatoes and rice” — some people would put a comma after potatoes, and some would leave it out. A law in Maine omits the punctuation mark, known as an Oxford comma.\n\nThe result could cost millions for a dairy company facing a lawsuit about overtime pay.\n\n• Turkey, a message in a velvet box.\n\nIn the first of a series, our correspondent takes us behind the scenes of a nation in crisis and facing a crackdown on rights.\n\n• Best of late-night TV.\n\nJimmy Kimmel led the charge of criticism against the president’s proposed budget, which targets arts and social programs. “The guy who has three oil paintings of himself in his bathroom wants to cut the National Endowment for the Arts,” he said.\n\nBack Story\n\nIf you were tempted to hit the snooze button this morning, you might be interested in how other members of the animal kingdom slumber, in honor of World Sleep Day today.\n\nThe sea otter rests on a real water bed, floating on its back, often arm in arm with a mate.\n\nPhoto\n\nWary of predators, giraffes coil their bodies and doze for a few minutes at a time. A bottlenose dolphin stays alert by shutting down half its brain and keeping one eye open while catching a couple of hours of sleep.\n\nAdvertisement Continue reading the main story\n\nBirds are even more efficient. Scientists say the alpine swift can go on autopilot during its migratory flight to Africa from Europe. The Swainson’s thrush takes hundreds of power naps, lasting less than a minute each.\n\nSleeping while standing is a commuting trick for humans, but for horses, it’s a way of life. Ligaments that make up the “stay apparatus” brace the leg joints and take over for the muscles. Of course, horses occasionally lie down and sometimes even take something to relax; The Times wrote about one in 1911.\n\nMissing and believed stolen, that particular horse was found asleep hours later in a nearby orchard, apparently drunk from eating cider apples.\n\nSweet dreams this weekend.\n\nRemy Tumin contributed reporting.\n\n_____\n\nYour Morning Briefing is published weekdays at 6 a.m. Eastern and updated on the web all morning.\n\nWhat would you like to see here? Contact us at briefing@nytimes.com.\n\nYou can sign up here to get the briefing delivered to your inbox.", "authors": ["Chris Stanford"], "publish_date": "2017-03-17", "source": "nytimes", "top_words": ["main", "heres", "won", "st", "trump", "day", "tournament", "ncaa", "patricks", "basketball", "donald", "takes", "reading", "continue", "briefing", "sleep", "snapshot"], "summary": "• The Trump White House is stacked with former employees of Goldman Sachs, but that might not be a boon to the bank.\n• Recipe of the day: For a meatless meal, try pasta alla Norma with roasted tomatoes and eggplant.\nThere were only two upsets during the first day of the men’s basketball tournament.\nBack StoryIf you were tempted to hit the snooze button this morning, you might be interested in how other members of the animal kingdom slumber, in honor of World Sleep Day today.\nAdvertisement Continue reading the main storyBirds are even more efficient."}