{"url": "https://www.nytimes.com/2017/03/16/us/politics/travel-ban-muslim-trump.html?mcubz=0", "id": "322", "title": "Campaign Pledges Haunt Trump in Court", "text": "Justice Department lawyers had urged the judges to ignore Mr. Trump’s speeches on the campaign trail. “Candidates are not government actors, and statements of what they might attempt to achieve if elected, which are often simplified and imprecise, are not official acts,” the government said in a brief in the Maryland case. “They generally are made without the benefit of advice from an as-yet-unformed administration, and cannot bind elected officials who later conclude that a different course is warranted.”\n\nBut Judge Derrick K. Watson, of the Federal District Court in Hawaii, said he could not dismiss Mr. Trump’s blunt talk. “A review of the historical background here makes plain why the government wishes to focus on the executive order’s text, rather than its context,” Judge Watson wrote. “The record before this court is unique. It includes significant and unrebutted evidence of religious animus driving the promulgation of the executive order.”\n\nThe courts had to navigate two bodies of precedents, pointing in different directions. In cases concerning immigration and national security, most decisions suggest that courts should not look behind the stated government rationale.\n\nMr. Trump’s new executive order sought to address judicial objections to the earlier one, issued in January, which had caused chaos and drawn protests at airports. It was blocked last month by the United States Court of Appeals for the Ninth Circuit, in San Francisco.\n\nThe new order’s 90-day suspension of entry from Iran, Libya, Somalia, Sudan, Syria and Yemen was more limited and subject to case-by-case exceptions. The new order omitted Iraq, which had been listed in the earlier order. It removed a complete ban on Syrian refugees. And it deleted explicit references to religion.\n\nViewed in isolation, Judge Watson wrote on Wednesday, the new order was just fine. “It is undisputed that the executive order does not facially discriminate for or against any particular religion, or for or against religion versus nonreligion,” he wrote. “There is no express reference, for instance, to any religion nor does the executive order — unlike its predecessor — contain any term or phrase that can be reasonably characterized as having a religious origin or connotation.”\n\nThe problem, the judge said, was that Mr. Trump and his surrogates had made plain what the order meant to achieve: discrimination on the basis of religion in violation of the First Amendment’s establishment clause.\n\nAdvertisement Continue reading the main story\n\nMr. Trump’s most explicit statements about banning Muslims came during the campaign. In a news release in December 2015, for instance, his campaign said, “Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States.” In a television interview last March, Mr. Trump said, “We’re having problems with the Muslims, and we’re having problems with Muslims coming into the country.”\n\nAfter he was elected, Mr. Trump was less direct, but he did say he meant to favor Christian refugees. Rudolph W. Giuliani, an adviser to Mr. Trump, said he had helped draft the first executive order after Mr. Trump asked him, about a Muslim ban, “the right way to do it legally.”\n\nThe challengers in the Maryland case, represented by the American Civil Liberties Union, said Mr. Trump’s statements were not “a passing comment on the campaign trail or a clear example of campaign puffery.” They were, rather, the brief said, “a consistent pledge to take discriminatory action,” making the case “highly unusual, if not entirely unique.”\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nCourts have only rarely used statements from candidates to judge the constitutionality of government actions. In 2003, the United States Court of Appeals for the 11th Circuit, in Atlanta, took account of campaign materials from Chief Justice Roy S. Moore of the Alabama Supreme Court to judge his actions concerning a Ten Commandments monument in his courthouse.\n\nIn the context of immigration and efforts to combat terror, the Supreme Court has been reluctant to look behind official actions to root out authentic motives. In 2006, in a case concerning detainees at Guantánamo Bay, Cuba, Justice John Paul Stevens criticized a dissenting justice for relying on “press statements” from sitting Defense Department officials. “We have not heretofore, in evaluating the legality of executive action, deferred to comments made by such officials to the media,” Justice Stevens wrote. If even statements from government officials are out of bounds, it would follow that statement from political candidates should carry no weight.\n\nIn a 1972 immigration case concerning a Marxist scholar denied a visa, the Supreme Court similarly said it would not “look behind” the government’s “facially legitimate and bona fide reason.”\n\nMore recently, in a fractured 5-to-4 decision in 2015 with no majority opinion, the Supreme Court refused to second-guess the denial of a visa on national security grounds to the Afghan husband of an American woman. In a concurrence, Justice Anthony M. Kennedy said it might be proper to look behind the offered reason for the denial if there were evidence that consular officer had acted in bad faith.\n\nOn Wednesday, in a dissent in the Ninth Circuit, five judges said the 1972 decision should have been the end of the matter in a challenge to Mr. Trump’s first executive order. “Even if we have questions about the basis for the president’s ultimate findings — whether it was a ‘Muslim ban’ or something else — we do not get to peek behind the curtain,” Judge Jay S. Bybee wrote for the dissenters.\n\nAdvertisement Continue reading the main story\n\nBut the Supreme Court has been more willing to probe officials’ motives in cases concerning religion. In 2005, in a case concerning copies of the Ten Commandments posted in Kentucky county courthouses, the Supreme Court said it would consider the context and background of the policies that had led to their display.\n\nExamination of officials’ actual purposes was appropriate, Justice Souter wrote for the majority, “where an understanding of official objective emerges from readily discoverable fact, without any judicial psychoanalysis of a drafter’s heart of hearts.”\n\n“The world is not made brand new every morning,” Justice Souter wrote.", "authors": ["Adam Liptak"], "publish_date": "2017-03-16", "source": "nytimes", "top_words": ["haunt", "executive", "wrote", "pledges", "trump", "supreme", "judge", "court", "trumps", "justice", "order", "mr", "campaign"], "summary": "Justice Department lawyers had urged the judges to ignore Mr. Trump’s speeches on the campaign trail.\nMr. Trump’s new executive order sought to address judicial objections to the earlier one, issued in January, which had caused chaos and drawn protests at airports.\nIn the context of immigration and efforts to combat terror, the Supreme Court has been reluctant to look behind official actions to root out authentic motives.\nAdvertisement Continue reading the main storyBut the Supreme Court has been more willing to probe officials’ motives in cases concerning religion.\nIn 2005, in a case concerning copies of the Ten Commandments posted in Kentucky county courthouses, the Supreme Court said it would consider the context and background of the policies that had led to their display."}