{"url": "https://www.nytimes.com/2017/06/11/us/politics/as-trump-sounds-urgent-note-on-travel-ban-a-vetting-revamp-grinds-on.html?mcubz=0", "id": "392", "title": "Despite Trump’s Tough Talk on Travel Ban, Few Changes to Vetting", "text": "Administration officials say they are handcuffed because of vetting restrictions imposed by one of the federal judges who put a hold on the revised travel ban. The officials say they have done what they can to tighten the borders, including by announcing this month that some visa applicants will be required to provide more biographical information and reveal their social media postings.\n\nBut critics say the Department of Homeland Security and other federal agencies have always had — and continue to have — plenty of authority to evaluate threats from any country and impose tougher vetting on visa applicants.\n\nWhen Mr. Trump signed an executive order to impose his first travel ban just seven days after taking office, he said the government needed a 90-day “pause” on entry from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen to evaluate the dangers of letting people visit from those countries.\n\nVideo\n\n“We will again be issuing visas to all countries once we are sure we have reviewed and implemented the most secure policies over the next 90 days,” Mr. Trump wrote at the time on Facebook.\n\nBut after the ban was blocked and an appeals court refused to reinstate it, Mr. Trump’s lawyers slowed down the legal fight, asking for more than a month to draft a second version of the ban rather than continue to fight over the first one.\n\nWhen Mr. Trump’s second attempt at a travel ban — no longer covering Iraq and deleting references to religion — was blocked by federal judges, the government asked for another month to draft its legal arguments. And this month, the Justice Department urged the Supreme Court to take up the case — not on an expedited basis, but four or five months from now, as part of the court’s regular calendar in the fall.\n\n“The manner in which they have been pursuing the legal case undercuts the argument for the urgency of the executive order,” said Anthony Romero, the executive director of the American Civil Liberties Union, which sued over the travel bans.\n\nAdvertisement Continue reading the main story\n\nBut as the rules for admitting people from the six countries covered by the latest travel ban have remained almost entirely unchanged, officials have blamed a ruling by a federal judge who, in blocking the revised order, also prohibited the government from evaluating the risks of letting people enter from the affected countries.\n\nIn a legal brief on March 17, government lawyers asked the judge, Derrick K. Watson of United States District Court for the District of Hawaii, if he had meant to stop them from proceeding with the vetting review. In a reply two days later, the judge said yes.\n\n“I can tell you right now that because of the injunction that I am not fully confident we are doing all that we can to weed out potential wrongdoers from these locations,” John F. Kelly, the Homeland Security secretary, told lawmakers during a hearing on Tuesday.\n\n“Bottom line,” Mr. Kelly said, “I have been enjoined from doing these things that I know would make America safe.”\n\nCritics note that the administration faced no such judicial restrictions after the first travel ban order was issued, and that it could have completed the 30-day review of vetting procedures for the seven countries that had been called for in that initial order. Officials said they began the review but did not finish it.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Race/Related Newsletter Join a deep and provocative exploration of race with a diverse group of New York Times journalists. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“From the beginning, the administration has said the travel ban has been about the effective vetting of people coming to this country,” said Leon E. Panetta, who served as defense secretary and C.I.A. director under President Barack Obama. “They should stop with this attack on the courts with the silly ban and get on with doing a thorough assessment of the vetting process, if that’s the purpose.”\n\nSome counterterrorism experts said the government never needed a 90-day travel “pause” to examine vetting systems, because it already had a number of effective programs intended to prevent criminals and national security threats from entering the country.\n\n“We have gotten much more robust since 9/11 in our vetting of individuals seeking to come here,” said John C. Cohen, a counterterrorism coordinator at the Department of Homeland Security under Mr. Obama and President George W. Bush.\n\nAdvertisement Continue reading the main story\n\nThe department has nearly 2,000 people in about 80 countries working to combat international terrorism, including running screening programs that target high-risk travelers.\n\nUnarmed, plainclothes customs officers in the Immigration Advisory Program discreetly help airline and foreign security employees with reviews of passenger reservation and ticketing data on flights bound for the United States. These officers also help foreign countries examine documents for fraud and provide training for airline and foreign security personnel.\n\nUnder a separate visa security program, Immigration and Customs Enforcement special agents are stationed at diplomatic posts around the world to help State Department officials prevent ineligible applicants from receiving visas. These agents investigate applicants, examine documents submitted with applications and conduct interviews.\n\nThe State Department also has counterterrorism personnel who investigate visa and passport fraud and screen visa applicants for ties to terrorism, drug smuggling and human trafficking.\n\nStill, in his remarks to the Senate Homeland Security Committee on Tuesday, Mr. Kelly said that the process of determining which people might be a threat was more difficult for those from the countries included in the president’s executive order.\n\n“These are countries that are either unable or unwilling to help us validate the identities and backgrounds of persons within their borders,” Mr. Kelly told the lawmakers. He complained about the public debate over whether Mr. Trump had ordered a “ban” on travel.\n\n“We’ll let the chattering class and self-appointed critics talk about the name,” he said. “I just hope that Congress sees the wisdom in what the president is trying to do, to protect America and its people, and that Congress are willing to work with those of us in the business of securing the nation.”\n\n", "authors": ["Michael D. Shear", "Ron Nixon"], "publish_date": "2017-06-11", "source": "nytimes", "top_words": ["travel", "ban", "security", "vetting", "officials", "tough", "despite", "trumps", "countries", "changes", "talk", "order", "department", "mr", "visa"], "summary": "Administration officials say they are handcuffed because of vetting restrictions imposed by one of the federal judges who put a hold on the revised travel ban.\nWhen Mr. Trump’s second attempt at a travel ban — no longer covering Iraq and deleting references to religion — was blocked by federal judges, the government asked for another month to draft its legal arguments.\n“From the beginning, the administration has said the travel ban has been about the effective vetting of people coming to this country,” said Leon E. Panetta, who served as defense secretary and C.I.A.\nUnder a separate visa security program, Immigration and Customs Enforcement special agents are stationed at diplomatic posts around the world to help State Department officials prevent ineligible applicants from receiving visas.\nHe complained about the public debate over whether Mr. Trump had ordered a “ban” on travel."}