{"url": "https://www.nytimes.com/2017/03/15/us/politics/highlights-immigration-ruling.html?mcubz=0", "id": "311", "title": "Highlights From Court Ruling Halting Trump’s Revised Travel Ban", "text": "Photo\n\nHere are some highlights from Wednesday’s ruling by Judge Derrick K. Watson of United States District Court in Honolulu, who issued a temporary restraining order blocking the Trump administration’s revised travel ban from going into effect nationwide.\n\nThe case was brought by the state of Hawaii and Ismail Elshikh, an American citizen of Egyptian descent who is an imam and a leader in Hawaii’s Islamic community. (You can read the full ruling here.)\n\nAddressing the government’s contention that the only concrete injury Mr. Elshikh claims is that the order would prevent his mother-in-law, a Syrian national with no visa, from visiting him and his family in Hawaii:\n\nThe Government’s premise is not true. Dr. Elshikh alleges direct, concrete injuries to both himself and his immediate family that are independent of his mother-in-law’s visa status.\n\n_____\n\nAddressing the government’s contention that the text of the executive order was religiously neutral because it applied to people from six countries regardless of their religion:\n\nThe illogic of the Government’s contentions is palpable. The notion that one can demonstrate animus toward any group of people only by targeting all of them at once is fundamentally flawed. … It is undisputed, using the primary source upon which the Government itself relies, that these six countries have overwhelmingly Muslim populations that range from 90.7% to 99.8%. It would therefore be no paradigmatic leap to conclude that targeting these countries likewise targets Islam. Certainly, it would be inappropriate to conclude, as the Government does, that it does not.\n\n_____\n\nAddressing the government’s suggestion that the court should rely only on the text of the executive order to evaluate its purpose:\n\nOnly a few weeks ago, the Ninth Circuit commanded otherwise. … The Supreme Court has been even more emphatic: courts may not “turn a blind eye to the context in which [a] policy arose.”\n\n_____\n\nSuggesting why the government wanted the court to stay focused on the text of the executive order:\n\nThe record before this Court is unique. It includes significant and unrebutted evidence of religious animus driving the promulgation of the Executive Order and its related predecessor.\n\n_____\n\nAfter extensively quoting President Trump:\n\nThe Government appropriately cautions that, in determining purpose, courts should not look into the “veiled psyche” and “secret motives” of government decisionmakers and may not undertake a “judicial psychoanalysis of a drafter’s heart of hearts.” … The Government need not fear. The remarkable facts at issue here require no such impermissible inquiry. For instance, there is nothing “veiled” about this press release: “Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States.”\n\n_____\n\nSaying that Mr. Trump’s own words, and those of his aides and advisers, betrayed the true intent of the executive order:\n\nAny reasonable, objective observer would conclude, as does the Court for purposes of the instant Motion for TRO, that the stated secular purpose of the Executive Order is, at the very least, “secondary to a religious objective” of temporarily suspending the entry of Muslims.\n\n_____\n\nGiving credence to plaintiffs’ contention that national security was merely a pretext for, not the true purpose of, the executive order:\n\nOther indicia of pretext asserted by Plaintiffs include the delayed timing of the Executive Order, which detracts from the national security urgency claimed by the Administration, and the Executive Order’s focus on nationality, which could have the paradoxical effect of “bar[ring] entry by a Syrian national who has lived in Switzerland for decades, but not a Swiss national who has immigrated to Syria during its civil war,” revealing a “gross mismatch between the [Executive] Order’s ostensible purpose and its implementation and effects.”\n\n_____\n\nLeaving open the possibility that the Trump administration could issue yet another revised executive order that finally passes constitutional muster:\n\nHere, it is not the case that the Administration’s past conduct must forever taint any effort by it to address the security concerns of the nation. … context may change during the course of litigation, and the Court is prepared to respond accordingly.\n\n_____\n\nFinding that Mr. Elshikh had provided evidence that his First Amendment rights had been impinged:\n\nDr. Elshikh has made a preliminary showing of direct, concrete injuries to the exercise of his Establishment Clause rights. … These alleged injuries have already occurred and likely will continue to occur upon implementation of the Executive Order.\n\n_____\n\nConcluding:", "authors": ["The New York Times"], "publish_date": "2017-03-15", "source": "nytimes", "top_words": ["ruling", "executive", "travel", "purpose", "true", "revised", "national", "ban", "elshikh", "trump", "governments", "court", "text", "halting", "trumps", "order", "highlights"], "summary": "PhotoHere are some highlights from Wednesday’s ruling by Judge Derrick K. Watson of United States District Court in Honolulu, who issued a temporary restraining order blocking the Trump administration’s revised travel ban from going into effect nationwide.\nDr. Elshikh alleges direct, concrete injuries to both himself and his immediate family that are independent of his mother-in-law’s visa status.\n_____Addressing the government’s suggestion that the court should rely only on the text of the executive order to evaluate its purpose:Only a few weeks ago, the Ninth Circuit commanded otherwise.\nIt includes significant and unrebutted evidence of religious animus driving the promulgation of the Executive Order and its related predecessor.\n… These alleged injuries have already occurred and likely will continue to occur upon implementation of the Executive Order."}