{"url": "https://www.nytimes.com/2017/03/27/opinion/is-free-speech-good-for-muslims.html?mcubz=0", "id": "338", "title": "Is Free Speech Good for Muslims?", "text": "Photo\n\nI recently watched a curious debate that took place in 2015 at the Free Press Society of Denmark. On one side was Geert Wilders, the far-right Dutch politician and anti-Islam campaigner whose ascendance to power was, I’m happy to say, checked by the elections in the Netherlands this month. On the other side was Flemming Rose, the journalist who angered many Muslims in 2005 by publishing cartoons depicting the Prophet Muhammad in the Danish newspaper Jyllands-Posten.\n\nThe crux of the debate was what to do with Muslims and Islam in Europe. Mr. Wilders argued that the Quran must be banned and mosques must be shut down. Mr. Rose, in contrast, explained that this view is unacceptably authoritarian, and Muslims deserve freedom like everyone else. “You cannot deny Muslims the right to build a mosque or to establish faith-based schools,” he said, simply because some Europeans find them offensive.\n\nMost Muslims watching this debate would probably sympathize with Mr. Rose, thinking he was defending them. Mr. Rose, however, was merely defending a liberal principle: freedom for all. It was the very principle that led him to publish the cartoons of the Prophet Muhammad — cartoons seen by many Muslims, including me, as offensive.\n\nThis is just one of many manifestations of a paradox Muslims, especially those of us living in the West, face in the modern world: They are threatened by Islamophobic forces against which they need the protections offered by liberalism — freedom of speech, freedom of religion, nondiscrimination. But the same liberalism also brings them realities that most of them find un-Islamic — irreverence toward religion, tolerance of L.G.B.T. people, permissive attitudes on sex. They can’t easily decide, therefore, whether liberalism is good or bad for Muslims.\n\nAdvertisement Continue reading the main story\n\nThe same paradox can also be seen in the debates over female dress. When illiberal secularists in the West interfere regarding the outfits of conservative Muslim women — with bans on the burqa, the “burkini” or even just the head scarf — the defense is found within liberalism: Women have the right to “dress as they please.” This, of course, is a perfectly legitimate argument in a free society.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut the idea that women can “dress as they please” doesn’t actually go over well with some Muslims — if that means, for example, tight jeans and miniskirts. In Saudi Arabia and Iran women are forced by law to cover their heads. In fact, in some ways Saudi Arabia is a mirror image of the culturally hegemonic dystopia that Mr. Wilders dreams of: a land where the scriptures and shrines of a foreign religion are banned — not the Quran and mosques, in this case, but the Bible and churches.", "authors": ["Mustafa Akyol"], "publish_date": "2017-03-27", "source": "nytimes", "top_words": ["good", "women", "rose", "wilders", "speech", "free", "freedom", "religion", "sign", "liberalism", "muslims", "mr", "dress"], "summary": "Mr. Wilders argued that the Quran must be banned and mosques must be shut down.\nMr. Rose, in contrast, explained that this view is unacceptably authoritarian, and Muslims deserve freedom like everyone else.\nMost Muslims watching this debate would probably sympathize with Mr. Rose, thinking he was defending them.\nMr. Rose, however, was merely defending a liberal principle: freedom for all.\nThey can’t easily decide, therefore, whether liberalism is good or bad for Muslims."}