{"url": "https://www.nytimes.com/2017/03/14/magazine/how-lawfare-hit-the-big-time.html?mcubz=0", "id": "308", "title": "How a Wonky National-Security Blog Hit the Big Time", "text": "Photo\n\nA little over a year ago, Benjamin Wittes, the editor in chief of the blog Lawfare, made the case that Donald Trump, as a Republican presidential candidate, represented nothing less than a national-security threat. “Never before in my lifetime has either political party been led by a man with such an unusual combination of — from a national security perspective, anyway — terrifying liabilities,” Wittes wrote. Ticking off reasons ranging from his promise of a Muslim ban to his flirtation with Vladimir Putin, Wittes stressed Trump’s propensity for promising outcomes through force of personality rather than policies and programs. “In the national security space, it is a particularly pernicious lie,” he concluded. “Our tools are too dangerous.”\n\nThe warning was an early sign of the opposition to Trump that has since hardened among the national-security professionals and observers for whom Lawfare serves as a kind of bulletin board. Wittes, an author and a former editorial writer for The Washington Post, started the blog in 2010, with Jack Goldsmith, a Harvard law professor and former Bush Justice Department official, and Robert Chesney, a law professor at the University of Texas at Austin who served on a detention-policy task force for Obama. Published in partnership with the Brookings Institution, Lawfare has developed into a go-to bipartisan site for remarkably speedy and informed analysis about all matters related to “Hard National Security Choices,” as the blog’s tag line puts it, including counterterrorism and immigration.\n\nWith a steady stream of writing by law professors and law students as well as former Bush and Obama officials, Lawfare has helped translate and test the legal and policy framework that lawyers in the military and intelligence communities have hammered out. During the Obama years, the blog’s staff and contributors shared ideas with the top of the national-security hierarchy. “They’d reach out to me, and I’d reach out to them,” says Avril Haines, who was Obama’s deputy national security adviser.\n\nIn the Trump era, the blog has at once lost its cachet in the highest echelons of government and become relevant to a far larger audience as the writers train their expertise on the biggest controversies of the new presidency. Lawfare contributors still have deep ties throughout the national-security and foreign-service career ranks, and many posts reflect their shared concerns about Trump and his team.\n\nAdvertisement Continue reading the main story\n\nIt’s one of the many curiosities of this presidency that the commander in chief whose administration has little connection to Lawfare has also given the blog its biggest moment in the sun. In February, Trump tweeted “LAWFARE” and quoted a line Wittes wrote criticizing the Court of Appeals ruling that blocked the administration’s Jan. 27 refugee-and-travel ban. The president was probably reacting to the MSNBC program “Morning Joe,” which aired the same quote on-screen just before the president’s tweet. Trump presumably didn’t realize that in that piece and an earlier one, Wittes shredded the January ban as the product of “incompetent malevolence” and supported the court’s decision over all. “You decide whether the POTUS is quoting me in context,” Wittes tweeted back, linking to his post on the court ruling.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Magazine Newsletter Get the best of the Magazine delivered to your inbox every week, including exclusive feature stories, photography, columns and more. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nLawfare has already generated more traffic in 2017 (about 3.5 million page views) than it did in all of 2016. In January, Ira Glass invited Wittes on “This American Life” to talk about the January refugee-and-travel ban. “Two days ago, I’d never heard of you, and now you’re my new best friend,” Glass wrote to Wittes. There’s something very unlikely about liberals’ embracing Lawfare: Before Trump, the blog’s closeness to the national-security community made it “somewhat disreputable” to the left, Wittes told me, half-kiddingly. Lawfare observes rules that most publications don’t, including a pledge never to publish classified information. Contributors generally tend to be hawkish and “more sympathetic to the executive, and more accepting of the seriousness of the counterterrorism threat and the need for tools like targeting and surveillance, than a lot of writers in the national-security space,” Goldsmith says.", "authors": ["Emily Bazelon"], "publish_date": "2017-03-14", "source": "nytimes", "top_words": ["blog", "trump", "national", "ban", "wonky", "security", "big", "wittes", "hit", "lawfare", "sign", "nationalsecurity", "law"], "summary": "PhotoA little over a year ago, Benjamin Wittes, the editor in chief of the blog Lawfare, made the case that Donald Trump, as a Republican presidential candidate, represented nothing less than a national-security threat.\n“Never before in my lifetime has either political party been led by a man with such an unusual combination of — from a national security perspective, anyway — terrifying liabilities,” Wittes wrote.\n“In the national security space, it is a particularly pernicious lie,” he concluded.\nDuring the Obama years, the blog’s staff and contributors shared ideas with the top of the national-security hierarchy.\n“They’d reach out to me, and I’d reach out to them,” says Avril Haines, who was Obama’s deputy national security adviser."}