{"url": "https://www.nytimes.com/2017/03/22/theater/travel-ban-threatens-a-lincoln-center-festival-play.html?mcubz=0", "id": "334", "title": "Travel Ban Threatens a Lincoln Center Festival Play", "text": "Photo\n\nThis summer’s Lincoln Center Festival is about crossing borders. But its plan to present the North American premiere of a work by the Syrian playwright Mohammad al-Attar risks being stopped at the United States border if President Trump’s travel ban is upheld.\n\nTo present the play, “While I Was Waiting,” Lincoln Center is seeking visas for several artists with passports from Syria — one of several predominantly Muslim nations from which the Trump administration has sought to temporarily ban travelers. The recent pair of executive orders seeking the ban were both blocked by court orders. The festival is hoping the visas will be granted.\n\n“Our choice of artists predated the travel ban,” Nigel Redden, the director of the Lincoln Center Festival, said in an email. “But the very idea of the ban shows how important it is for us to have greater understanding of the world beyond our own borders.”\n\n“While I Was Waiting,” about the travails of a middle-class family in Damascus, is one of several international plays planned for this summer’s festival, which will run from July 10 to 30. The festival will begin with “Opening Skinner’s Box,” from Britain’s Improbable Theater, and will feature two productions from Israel: David Grossman’s “To the End of the Land” and Amos Gitai’s “Yitzhak Rabin: Chronicle of an Assassination.”\n\nDance Companies From Around the World\n\nA previously announced highlight of the festival will be an unusual international performance of George Balanchine’s “Jewels,” with the Paris Opera Ballet, New York City Ballet and the Bolshoi Ballet trading acts of a work that evokes different national dance styles.\n\nPhoto\n\nThe Bolshoi will also perform the American premiere of “The Taming of the Shrew,” choreographed by Jean-Christophe Maillot and with music by Shostakovich. And Aurélie Dupont, the director of dance at the Paris Opera Ballet, will appear in “Sleeping Water,” with the Japanese choreographer-dancer Saburo Teshigawara and his troupe, Karas.\n\nAnd the circus will come to the Rose Theater: “Il N’est Pas Encore Minuit” features the 22 acrobats of the French circus collective Compagnie XY.\n\nPhoto\n\nA Tribute to Ornette Coleman\n\nThe festival will play tribute to the jazz saxophonist and innovative composer Ornette Coleman, who died in 2015 at 85, with a series of programs. One will be a screening of “Naked Lunch,” David Cronenberg’s 1991 film adaptation of that William S. Burroughs novel, while the score, which Coleman co-wrote, is played live by Ensemble Signal, with guests including Coleman’s son, Denardo; Ravi Coltrane; and Henry Threadgill.\n\nGong Linna, the Chinese vocalist, will join the Bang on a Can All-Stars from New York in “Cloud River Mountain,” a staged work composed by Lao Luo, Michael Gordon, David Lang and Julia Wolfe.\n\nAnd Morton Subotnick, the pioneering American composer of electronic music, will mark the 50th anniversary of his influential “Silver Apples of the Moon” by performing it at the Stanley H. Kaplan Penthouse on a bill with a new work, “Crowds and Power,” featuring the singer Joan La Barbara and imagery by Lillevan, a Berlin-based video artist.", "authors": ["Michael Cooper"], "publish_date": "2017-03-22", "source": "nytimes", "top_words": ["david", "travel", "play", "ballet", "ban", "lincoln", "threatens", "work", "waiting", "center", "york", "american", "festival"], "summary": "PhotoThis summer’s Lincoln Center Festival is about crossing borders.\nBut its plan to present the North American premiere of a work by the Syrian playwright Mohammad al-Attar risks being stopped at the United States border if President Trump’s travel ban is upheld.\nTo present the play, “While I Was Waiting,” Lincoln Center is seeking visas for several artists with passports from Syria — one of several predominantly Muslim nations from which the Trump administration has sought to temporarily ban travelers.\nThe recent pair of executive orders seeking the ban were both blocked by court orders.\n“Our choice of artists predated the travel ban,” Nigel Redden, the director of the Lincoln Center Festival, said in an email."}