{"url": "https://www.nytimes.com/2017/06/20/business/travel-ban-tourism-trump.html?mcubz=0", "id": "397", "title": "As Travel Industry Awaits Slowdown, Travelers Pack Bags — for Now", "text": "Investors do not seem spooked, either. Shares in Wyndham Worldwide, the hotel company, are near their highest ever, as are shares of Marriott International, which merged last year with Starwood Hotels. A Bloomberg index of stocks for airlines based in the United States has risen 6.5 percent since the start of the year. Shares in United Airlines, which faced major public relations problems after the rough treatment of a passenger in April, are up 6.3 percent since the start of 2017.\n\nPhoto\n\nJ. Scott Kirby, president of United Airlines, was asked at a recent conference if the terrorist attacks in Britain had had any impact on demand for flights to that country. The short answer, he said, was no. “They’re terrible, that these events happen,” Mr. Kirby said. “And in a way, even worse is that they’re happening with such regularity that there isn’t much impact, that people are almost becoming numb, perhaps.”\n\nEven in the last two weeks, as London faced a new attack and Mr. Trump took to Twitter to repeat his support of a travel ban, there have been few hints that travelers are throwing out their plans. Major American carriers plan to increase seat capacity on international routes in the last four months of the year, according to airline analysts at Wolfe Research.\n\n“I’ve not seen that hard pullback that I think some might have anticipated,” said Chris Jones, chief marketing officer at McCarran International Airport in Las Vegas.\n\nLast week at Kennedy International Airport in New York, the nation’s busiest destination for international passengers, several travelers expressed resolve.\n\nAugustina Spina, who lives in Manhattan, was lingering outside Terminal 7 with a friend before an evening flight to London. She said she gave no thought to to rearranging her plans after the recent terrorist attacks.\n\n“I live in the city,” said Ms. Spina, 59. “It can happen anywhere. I absolutely love London.”\n\nPhoto\n\nDirk Siemon, 49, was on his way home to Berlin after a five-day trip to New York with his wife and son. He said he was “a little bit frightened there would be problems coming in,” but said his family encountered no difficulties.\n\nAdvertisement Continue reading the main story\n\nThe travel industry has expressed concern about Mr. Trump’s focus on travelers from the Middle East. In addition to the president’s executive orders, now blocked by the courts, the administration has banned electronic devices larger than a cellphone in the cabins of direct, inbound flights from airports in 10 Muslim-majority countries over fears that they could be used to conceal bombs.\n\nEmirates Airlines has attributed some fallout to Mr. Trump’s actions. The carrier, which had been aggressively expanding its high-end service to the United States, announced plans to reduce the number of flights to five American cities after it saw a “significant deterioration” in bookings.\n\n“The recent actions taken by the U.S. government relating to the issuance of entry visas, heightened security vetting and restrictions on electronic devices in aircraft cabins, have had a direct impact on consumer interest and demand for air travel into the U.S.,” Jerome Demare, a spokesman for Emirates, wrote in an email.\n\nPhoto\n\nHotel executives who gathered this week at the conference in New York, the New York University International Hospitality Industry Investment Conference, suggested that the consequences of Mr. Trump’s policies could just be beginning.\n\n“Words matter — perceptions matter,” said Jonathan M. Tisch, the chief executive of Loews Hotels. “And the way the administration’s policies are portrayed to the world matters.”\n\nSarah Murov, a spokeswoman for Loews, said the company was seeing declines this summer in bookings by travelers from many international destinations, not just the Middle East. She noted that the company’s hotels host a number of groups that have international attendees and “we have seen greater wash and cancellations from this segment.”\n\nThe pullback has not yet been reflected in the company’s financial results. Revenue for the first three months of the year were essentially flat from the same period last year.\n\nAdvertisement Continue reading the main story\n\nA similar story is playing out at Marriott. Connie Kim, a spokeswoman for that company, said it had not seen any “material impact” on its financial performance from a decline in tourists to the United States.\n\nStill, the anxiety is there. Arne Sorenson, the president and chief executive of Marriott, warned at the conference last week that the numbers of travelers to the United States would “look worse” over the next couple of months.\n\n“You’ll see more people go to Europe and other destinations,” he said, “where the reception seems to be warmer.”", "authors": ["Micah Maidenberg"], "publish_date": "2017-06-20", "source": "nytimes", "top_words": ["travel", "industry", "international", "mr", "conference", "bags", "travelers", "united", "week", "awaits", "slowdown", "impact", "airlines", "york", "pack", "way"], "summary": "A Bloomberg index of stocks for airlines based in the United States has risen 6.5 percent since the start of the year.\nShares in United Airlines, which faced major public relations problems after the rough treatment of a passenger in April, are up 6.3 percent since the start of 2017.\nPhotoJ. Scott Kirby, president of United Airlines, was asked at a recent conference if the terrorist attacks in Britain had had any impact on demand for flights to that country.\nLast week at Kennedy International Airport in New York, the nation’s busiest destination for international passengers, several travelers expressed resolve.\nAdvertisement Continue reading the main storyThe travel industry has expressed concern about Mr. Trump’s focus on travelers from the Middle East."}