{"url": "https://www.nytimes.com/2017/05/15/us/politics/trump-travel-ban-appeals-court.html?mcubz=0", "id": "363", "title": "3 Judges Weigh Trump’s Revised Travel Ban, but Keep Their Poker Faces", "text": "“The order on its face doesn’t have anything to do with religion,” he said.\n\nJudge Michael Daly Hawkins asked whether Mr. Trump had ever disavowed his campaign statements.\n\nMr. Wall responded that “over time the president clarified that what he was talking about were Islamic terrorist groups and the countries that shelter or sponsor them.”\n\nBut Neal K. Katyal, a lawyer for Hawaii, which is challenging the revised order, said that Mr. Trump’s campaign website until very recently continued to feature a 2015 news release that said “Donald J. Trump is calling for a total and complete shutdown of Muslims entering the United States.”\n\nThat document, Mr. Katyal said, “just happened to disappear moments before the Fourth Circuit argument last week.”\n\nOn May 8, a 13-judge panel of the United States Court of Appeals for the Fourth Circuit, in Richmond, Va., heard arguments in a separate appeal of an order blocking part of the revised travel ban, that one from a federal judge in Maryland.\n\nJudge Richard A. Paez asked Mr. Katyal whether Mr. Trump “is forever barred from issuing an executive order along these lines.”\n\nMr. Katyal responded that a revised order might be proper if Congress enacted new legislation authorizing it, if Mr. Trump explicitly disavowed his earlier statements or if he described Islam in the positive terms that President George W. Bush used after the Sept. 11 attacks.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Wall argued that the Constitution and the immigration laws give the president vast authority to make national security judgments about who may enter the country. The role of the courts, he said, was limited to determining whether the government had a “facially legitimate and bona fide reason” for taking action.\n\nAdvertisement Continue reading the main story\n\nLate in the argument, Judge Hawkins asked Mr. Katyal, “Why shouldn’t we be deferential to the office of president of the United States on these issues?”\n\n“That’s the million-dollar question,” Mr. Katyal said — and he added that the First Amendment’s ban on government establishment of religion supplied the answer.\n\n“Is this executive order, viewed from the standpoint of an objective observer, an establishment of a disfavored religion, Islam?” Mr. Katyal asked. The answer, he said, was yes.\n\nMr. Trump issued his initial order on Jan. 27, a week into his presidency. Less than two weeks later, a different three-judge panel of the Ninth Circuit affirmed an order halting it.\n\nWithin minutes of the ruling, Mr. Trump vowed to fight it. “SEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE!” Mr. Trump wrote on Twitter.\n\nBut the president did not appeal to the Supreme Court. Instead, he issued a revised executive order.\n\nThe new order’s 90-day suspension of entry from Iran, Libya, Somalia, Sudan, Syria and Yemen was more limited and subject to case-by-case exceptions. It omitted Iraq, which had been listed in the earlier order, and it removed a complete ban on Syrian refugees. And it deleted explicit references to religion. Like the earlier order, the new one suspended the nation’s refugee program for 120 days and reduced the annual number of refugees to 50,000 from 120,000.\n\nHawaii sued to challenge the revised executive order, saying it was the product of religious hostility. On March 15, Judge Derrick K. Watson, of the Federal District Court in Hawaii, blocked major parts of the revised order, saying they violated the Constitution’s ban on government establishment of religion. Judge Watson wrote that the statements of Mr. Trump and his advisers made clear that his executive order amounted to an attempt to treat Muslims with disfavor.\n\nAdvertisement Continue reading the main story\n\n“A reasonable, objective observer — enlightened by the specific historical context, contemporaneous public statements and specific sequence of events leading to its issuance — would conclude that the executive order was issued with a purpose to disfavor a particular religion,” Judge Watson wrote.\n\nMuch of Monday’s argument concerned how to reconcile two parts of the immigration laws.\n\nOne provision allows the president to “suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants” if he determines that their entry “would be detrimental to the interests of the United States.”\n\nBut another provision appears to limit that power, saying that “no person shall receive any preference or priority or be discriminated against in the issuance of an immigrant visa because of the person’s race, sex, nationality, place of birth or place of residence.”\n\nMr. Wall said the second provision would at most require the issuance of visas to people who could nonetheless still be barred at the border.\n\nJudge Hawkins said that “would be like Tom Hanks at the airport,” apparently referring to “The Terminal,” a 2004 film about a man stranded at Kennedy Airport.", "authors": ["Adam Liptak"], "publish_date": "2017-05-15", "source": "nytimes", "top_words": ["executive", "travel", "mr", "judges", "revised", "trump", "ban", "katyal", "judge", "faces", "united", "trumps", "religion", "order", "president", "weigh", "poker"], "summary": "“Is this executive order, viewed from the standpoint of an objective observer, an establishment of a disfavored religion, Islam?” Mr. Katyal asked.\nWithin minutes of the ruling, Mr. Trump vowed to fight it.\n“SEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE!” Mr. Trump wrote on Twitter.\nInstead, he issued a revised executive order.\nHawaii sued to challenge the revised executive order, saying it was the product of religious hostility."}