{"url": "https://www.nytimes.com/2017/06/05/opinion/trump-paris-climate-accord-nato.html?mcubz=0", "id": "386", "title": "Trump’s Incredible Shrinking America", "text": "Last month in Europe, Trump was as boorish and belligerent as it was possible to be, lashing out at our NATO allies about their defense spending just after having been gracious and magnanimous to leaders in the Middle East.\n\nThen last week Trump thumbed his nose at the world and the planet by announcing that he would pull America out of the Paris climate accord, even though a Yale survey found the agreement was popular and a majority of Americans in every state — including those that Trump won — wanted the United States to stay in the agreement.\n\nBut even beyond whether or not it was popular, staying in was right. More than 190 countries — most of the countries on the planet — are signatories to the agreement. We have one planet. It is in trouble. The world must band together to save it. How does it look for the world’s last remaining superpower to simply walk away?\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThis is not putting America first, this is putting America on a path of regression and isolationism. This is putting our future and the future of the planet in peril. This is dumb, hazardous and shortsighted.\n\nTrump justified his move using faulty information, citing issues that are not even in the agreement and flat-out lying. What else is new? Perhaps his most memorable line from his speech about the withdrawal was:\n\n“I was elected to represent the citizens of Pittsburgh, not Paris. I promised I would exit or renegotiate any deal which fails to serve America’s interests.”\n\nThe problem is that, as PolitiFact pointed out:\n\n“Clinton won almost 60 percent of the vote in Allegheny County, which includes Pittsburgh. The percentage was even higher in many precincts within the city of Pittsburgh itself. (Allegheny County includes a range of suburbs in addition to the city.)”\n\nIndeed, the mayor of Pittsburgh, Bill Peduto, told CNN after the speech: “The city of Pittsburgh voted for Hillary Clinton with nearly 80 percent of the vote.” Later on CNN, Peduto was asked if he had a message for Trump. Peduto responded: “What you did was not only bad for the economy of this country, but also weakened America in this world.”\n\nAdvertisement Continue reading the main story\n\nIn fact, mayors, governors and business leaders across the country were quick to rebuke Trump’s horrendous decision and to dedicate themselves to the spirit of the agreement.\n\nThen, for me, the icing on the cake was Trump’s absolute lack of grace and tact in his response to the London terror attacks over the weekend. His first response was not to express his horror and extend America’s condolences and offer American assistance. No, that would have required that he possess a shred of empathy and common decency.\n\nInstead, his first instinct was to use the attacks as political fodder to advance his own failed domestic agenda to impose a “travel ban.”\n\nShortly after the attacks, while people were still trying to get their minds around what exactly had happened in London, Trump tweeted:\n\n“We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!”\n\n(Note that Trump again calls it a “ban,” although White House Press Secretary Sean Spicer, who retweeted this message, scolded the media in January for calling Trump’s ban a ban, saying: “This is not a Muslim ban, it’s not a travel ban, it’s a vetting system to keep America safe.” Trump is killing himself in the courts with his own words.)\n\nTrump is pulling America back and pulling America down. We are now witnessing the incredible shrinking America, and it’s a sad sight to behold.", "authors": ["Charles M. Blow"], "publish_date": "2017-06-05", "source": "nytimes", "top_words": ["shrinking", "america", "travel", "world", "trump", "ban", "pittsburgh", "incredible", "trumps", "sign", "putting", "planet"], "summary": "More than 190 countries — most of the countries on the planet — are signatories to the agreement.\nThis is not putting America first, this is putting America on a path of regression and isolationism.\nThen, for me, the icing on the cake was Trump’s absolute lack of grace and tact in his response to the London terror attacks over the weekend.\nTrump is pulling America back and pulling America down.\nWe are now witnessing the incredible shrinking America, and it’s a sad sight to behold."}