{"url": "https://www.nytimes.com/2017/04/07/us/syria-refugees-trump.html?mcubz=0", "id": "344", "title": "Syrian Refugees Laud U.S. Strike and, in ‘New Emotion,’ Trump", "text": "Mr. Mahmoud and his family left their hometown, northwest of Aleppo, and lived for years in Turkey, before getting permission to go to the United States. Just as they were about to leave, in late January, Mr. Trump’s first pass at an immigration order put their plans on hold; when courts struck down the order, they were finally able to enter the country, on Feb. 9.\n\nHe heard about the president’s action on Thursday night, while in the middle of a work sheet on English verb tenses. The jubilation he felt about an action by the president was, he said, “a new emotion.”\n\nMohamad Chaghlil, 35, a woodworker from Damascus, said he hoped the missile attack — far too limited in his view to change the course of the war — would be the start of a major course correction by Mr. Trump. But he said he doubted it.\n\nAnd like some other refugees, he questioned why a poison gas attack that was attributed to the government prompted the American strike now, when earlier atrocities did not.\n\n“I don’t have full idea why he did that now,” he said. “We lose hundreds of Syrian people every day, we lost more than half a million people in Syria. So why chemical attack is worse? Dead is dead. I can’t understand, and the Syrians can’t understand.”\n\nMr. Chaghlil and his parents left Syria for Jordan four years ago, then began the laborious process of gaining refugee status. After his father died last July, his mother had to revise her paperwork, he said, delaying her case, so while Mr. Chaghlil came to the United States in December, she remains in Jordan.\n\n“I talk with her every morning,” he said. “She is old. She needs me, and I need her. I’m alone here and she is alone there.”\n\nAdvertisement Continue reading the main story\n\nHe said he worries about where American immigration policy will leave her, and still sees the president as anti-Muslim.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“I think he doesn’t care about who needs the support, and who is the murderer and who is the good person,” said Mr. Chaghlil, who was admitted to the country in December and lives in New Haven. “Maybe he felt he has to do something for politics.”\n\nAyham al-Asmi , who had been upset by Mr. Trump’s attempts to bar refugees, was so enthusiastic in his support for the airstrikes that he said he would vote for Mr. Trump if he could. He said more than 150 members of his extended family have died in the violence in Syria.\n\n“He’s a national hero now,” he said of the president, adding, “100 percent.”\n\nMr. Asmi, 34, who arrived in Worcester, Mass., about 18 months ago, said he had stayed up all night after seeing news of the raid on Facebook, contacting elated friends and family around the world.\n\n“The Syrian people just gave up on anyone coming to their rescue,” he said through an interpreter, Amjad Bahnassi, who is the chairman of the board that runs his mosque. The attack, Mr. Asmi said, was “light at the end of the tunnel.”\n\nFor Zelekha Mahmoud, 31, news of the American missile attack allowed her to hope that the war could come to an end, and that she, her husband, and their four small children, could return home.\n\nThey settled in October in Chicago, and are adjusting to their new life. They pray and socialize at an Islamic center, the children go to school, and her husband has found work at a food packaging company. But she longs for Syria.\n\nThe Times is withholding her family name — Mahmoud is her middle name — because she fears for the safety of the children and four siblings still in Syria. She says she is grateful that the United States has sheltered her and her family, but she remains wary of the welcome here; Mr. Trump’s travel orders at first made her fear they would be expelled.\n\nWhen her husband joyfully told her of the strike, “I was so happy,” she said, sitting in their apartment on Chicago’s North Side.\n\nAdvertisement Continue reading the main story\n\n“I feel that maybe now they will get rid of Assad so that Syria will be secure again, so we can return,” she said.\n\nMohamad Haidar, 47, who settled with his family in San Diego a year ago, said he feared that limited American strikes might escalate the war rather than tamp it down.\n\n“If the U.S. wanted to interfere with military action it would be more beneficial to strike the presidential palace in Damascus,” said Mr. Haidar, who, with his wife and three children, fled their town southwest of Aleppo in 2012, moving at first to Indonesia. “The United States is capable of stopping the conflict in one month if they are taking it seriously.”\n\nUnlike some others, he said he was not angered by Mr. Trump’s travel orders.\n\n“I thought as the president, it is up to him to decide to decide what is beneficial to his own country,” he said. “But I wish they took into consideration in the decision how many innocent people are suffering and hurting in Syria.”", "authors": ["Richard Pérez-Peña", "Jess Bidgood"], "publish_date": "2017-04-07", "source": "nytimes", "top_words": ["syrian", "trump", "family", "laud", "strike", "united", "states", "syria", "trumps", "emotion", "children", "chaghlil", "refugees", "president", "mr", "attack"], "summary": "Mr. Mahmoud and his family left their hometown, northwest of Aleppo, and lived for years in Turkey, before getting permission to go to the United States.\nAnd like some other refugees, he questioned why a poison gas attack that was attributed to the government prompted the American strike now, when earlier atrocities did not.\n“We lose hundreds of Syrian people every day, we lost more than half a million people in Syria.\n“Maybe he felt he has to do something for politics.”Ayham al-Asmi , who had been upset by Mr. Trump’s attempts to bar refugees, was so enthusiastic in his support for the airstrikes that he said he would vote for Mr. Trump if he could.\n“The United States is capable of stopping the conflict in one month if they are taking it seriously.”Unlike some others, he said he was not angered by Mr. Trump’s travel orders."}