{"url": "https://www.nytimes.com/2017/06/22/opinion/congress-nato-trump.html?mcubz=0", "id": "30", "title": "Congress Steps Up on Foreign Policy", "text": "Russia’s mischief knows few boundaries. The country is still destabilizing Ukraine, using its military force to defend President Bashar al-Assad of Syria, undermining democracy across Europe and trying to woo vulnerable NATO members in Eastern Europe to its side.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nReports that Mr. Tillerson wants to work with Russia on cybersecurity issues seem especially premature, not least because the Kremlin hasn’t admitted to hacking the Democratic campaign as well as the actual voting data in nearly 40 states.\n\nGiven the absence of any real progress, the Senate Foreign Relations Committee was quite right to move forward with the sanctions bill, which passed the full Senate by a vote of 97 to 2. It would add sanctions and allow Congress to block presidential efforts to reduce existing sanctions. That is a necessary precaution given that Mr. Trump’s fondness for President Vladimir Putin could cause him to prematurely lift the penalties imposed for the invasion of Ukraine and meddling in the American election.\n\nIn another effort to correct a bad decision by Mr. Trump, the Senate tried to block a $500 million arms sale to Saudi Arabia, which on Wednesday underwent a major leadership shuffle in the ruling royal family. The arms sale makes the United States complicit with the Saudis in the civil war in Yemen, which has killed untold numbers of civilians. The measure failed, but received more support than it had in the past.\n\nAnd after dragging its feet for years, the Senate Foreign Relations Committee on Tuesday began considering legislation intended to assert more power over military troop deployments. The president has largely ceded that authority to the Pentagon. Meanwhile, many legislators have vowed not to approve Mr. Trump’s budget, which would decimate the State Department. On a more granular level, a few senators have taken it upon themselves to smooth the ruffled feathers between Mr. Trump and foreign leaders.\n\nTo some extent, these battles are simply the latest manifestation of the long historical struggle for control over national security policy between the executive and legislative branches.\n\nThe Constitution divides war-making between the Congress, which controls taxes and spending, and the president, who is vested with executive power and the power to act as the military’s commander in chief.\n\nSince 9/11, there has been a striking expansion of the president’s executive power, particularly in the area of national security, and there is little doubt that the executive, in this case Mr. Trump, remains the most influential player on the world stage. But that does not mean that Congress has to remain silent, or shy from challenging any president on national security issues, correcting or mitigating mistakes that could threaten the nation.\n\nAdvertisement Continue reading the main story\n\nThere is even a hint of bipartisanship in this particular Congress’s efforts to compensate for this particular executive. That, too, is a good thing.", "authors": ["The Editorial Board"], "publish_date": "2017-06-22", "source": "nytimes", "top_words": ["executive", "foreign", "congress", "power", "trump", "national", "policy", "steps", "security", "sign", "president", "senate", "mr", "sanctions"], "summary": "It would add sanctions and allow Congress to block presidential efforts to reduce existing sanctions.\nOn a more granular level, a few senators have taken it upon themselves to smooth the ruffled feathers between Mr. Trump and foreign leaders.\nTo some extent, these battles are simply the latest manifestation of the long historical struggle for control over national security policy between the executive and legislative branches.\nThe Constitution divides war-making between the Congress, which controls taxes and spending, and the president, who is vested with executive power and the power to act as the military’s commander in chief.\nBut that does not mean that Congress has to remain silent, or shy from challenging any president on national security issues, correcting or mitigating mistakes that could threaten the nation."}