{"url": "https://www.nytimes.com/2017/04/12/us/trump-immigration-border-hiring.html?mcubz=0", "id": "345", "title": "To Detain More Immigrants, Trump Administration to Speed Border Hiring", "text": "Beyond removing the polygraph hurdle, the memo discusses eliminating a part of the entrance exam that tests the Spanish language skills of prospective hires, explaining that “few applicants fail the entrance exam solely because of these tests.” New agents will still have to obtain “the appropriate level of proficiency in Spanish” to graduate from the academy, the memo says.\n\nAll applicants must now pass two physical fitness tests, but the memo suggests that only one of the tests will count toward deciding whether to hire a Customs and Border Protection officer or a Border Patrol agent. Those who do not meet physical fitness standards at the academy, the document says, will “receive additional training.”\n\nThe memo is only a “draft that hasn’t made it to the front office yet,” said David Lapan, a spokesman for the department. “Anything in it is subject to change.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nJames Tomsheck, a former assistant commissioner for internal affairs at Customs and Border Protection, said any attempt to speed hiring by lowering standards leaves the agency vulnerable to corrupt or compromised agents. “I can’t see how this makes the border any more secure,” he said, calling the polygraph change “preposterous.”\n\nEven if more applicants qualify, the agency lacks the capacity or the money to process them quickly. By March, it took an average of about 300 days to hire a border agent, according to the memo, though that was an improvement over the 469-day average in January 2016.\n\nThe administration has already asked Congress to appropriate more than $60 million to help speed hiring, including money to encourage agents to move to less desirable regions along the border and expand recruiting efforts.\n\nSome of the money will help extend Customs and Border Protection’s outreach efforts at high schools and colleges and amplify its social media presence in order “to reach the millennial generation,” the memo says.\n\nThough the number of people apprehended at the border has fallen sharply in recent months and some detention beds are now empty, Immigration and Customs Enforcement has found 27 private and government facilities with 21,000 more potential beds for detention, according to the document. But it notes that the agency does not have the money to pay for them.\n\nThe administration also wants Mexico to agree to hold would-be immigrants while their cases go through American immigration courts. To speed those hearings, the administration is considering holding them by videoconference or sending more immigration judges to the border.\n\nAdvertisement Continue reading the main story\n\nThe memo also says that more than 50 police departments are interested in partnering with the federal agency to help enforce immigration laws, a program known as 287(g) that the Obama administration dropped amid concerns that it encouraged racial profiling and other abuses. The agency is already in the process of signing on 26 other jurisdictions.", "authors": ["Vivian Yee", "Ron Nixon"], "publish_date": "2017-04-12", "source": "nytimes", "top_words": ["speed", "agency", "trump", "hiring", "immigrants", "customs", "immigration", "memo", "detain", "border", "tests", "help", "administration", "money"], "summary": "All applicants must now pass two physical fitness tests, but the memo suggests that only one of the tests will count toward deciding whether to hire a Customs and Border Protection officer or a Border Patrol agent.\nJames Tomsheck, a former assistant commissioner for internal affairs at Customs and Border Protection, said any attempt to speed hiring by lowering standards leaves the agency vulnerable to corrupt or compromised agents.\nThe administration has already asked Congress to appropriate more than $60 million to help speed hiring, including money to encourage agents to move to less desirable regions along the border and expand recruiting efforts.\nThe administration also wants Mexico to agree to hold would-be immigrants while their cases go through American immigration courts.\nTo speed those hearings, the administration is considering holding them by videoconference or sending more immigration judges to the border."}