{"url": "https://www.nytimes.com/2017/05/07/us/travel-ban-lawyer.html?mcubz=0", "id": "359", "title": "A Travel Ban’s Foe: A Young Firebrand and Her Pro Bono Brigade", "text": "Bob Dylan’s son Jesse is making a short film about the group’s work. Saying he admired Ms. Heller’s “chutzpah,” Charles Bronfman, the Seagram heir and an executive whose organization had already given her a $100,000 prize, threw a fund-raiser for her last month at his Fifth Avenue apartment.\n\nMs. Heller, who uses profanity when ranting and raving, kept her promise to Mr. Bronfman that she would sanitize her speech. She drew chuckles from the two dozen guests when she referred with irony to the president’s “excellent” policies, and when she threatened to steal a Chagall mounted on the wall.\n\n“We made a lot of money,” she said afterward, declining to say how much. But all the attention has helped triple the IRAP budget this year, to $6.5 million, she said.\n\nMs. Heller characterizes her work as apolitical, which is not how supporters of Mr. Trump’s immigration agenda describe it. In their eyes, she comes off as a naïve liberal who puts the plight of foreigners over the nation’s security.\n\nDale Wilcox, executive director of the Immigration Reform Law Institute, which filed a brief supporting the government in the appellate case, said that for groups like IRAP, “there can be no such thing as an immigration policy that puts the national interest first.” He said they treated the immigration system “like a giant global welfare program.”\n\nTo those critics, Ms. Heller says her role is to uphold the nation’s tradition of responding to humanitarian crises. And to those who know her best, it is not surprising that Ms. Heller has caused the administration trouble.\n\nIn her senior year of high school, said Katherine Isokawa, a friend since middle school, Ms. Heller was voted “most likely to debate with a teacher.” Now, “she’s most likely to argue with the president.”\n\nAdvertisement Continue reading the main story\n\nMs. Heller grew up in Piedmont, Calif., an upscale town near Oakland, daughter of a cardiologist and a teacher. “It was challenging to have an argument with her,” said her mother, Serena, sitting in the kitchen of the two-story lavender-gray house where Ms. Heller was raised. “She was always an effective defender of her stance.”\n\nA frequent visitor to the principal’s office and later a skipper of high school classes that bored her, Ms. Heller most relished the debate team, and when her school no longer had one, she competed for another school. She did not receive a diploma on her graduation day, because she had refused to complete the physical education requirement, which she rectified with independent summer study.\n\nAfter Dartmouth College, where she won a humanitarian award for her work on hunger and housing, she received a Fulbright Scholarship to work on nutrition policy in Malawi.\n\nAt Yale Law, when she worked with a team of students defending day laborers caught up in an immigration sting, a professor, Michael Wishnie, took his teenage daughter to Ms. Heller’s first argument in federal court.\n\n“I wanted her to see this young woman’s mastery and courage,” he said, adding that at the courthouse cafeteria before the hearing, “she taught my daughter some new curses.”\n\nDuring a summer in Israel, Ms. Heller quit an internship and traveled to Jordan, where she met Iraqi refugees stuck in a state of limbo that appalled her.\n\nAfter finagling meetings with the United Nations refugee agency and the United States Embassy so she could better understand the resettlement process, she returned to Yale and, with another student, founded IRAP — the “I” then standing for Iraqi.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThere was one problem: They were students, not admitted to the bar. So they solicited lawyers from private law firms to help.\n\nWhen they pitched their project at firms, “it always felt we were pushing an open door,” recalled her co-founder, Jon Finer, who teaches at Princeton.\n\nAdvertisement Continue reading the main story\n\nMs. Heller helped Iraqis like Farah Marcolla, who applied to come to the United States after her first husband was murdered in retaliation for her family’s work with Americans. “When Becca got involved, the case went much faster,” said her second husband, Michael Marcolla, an American.\n\nA government official who has dealt with Ms. Heller and IRAP, who declined to be identified because the official was not authorized to speak publicly, said that the group was skilled at identifying and speeding up applications that were stuck in the system, but that it was possible many of those refugees would have ultimately been admitted anyway.\n\nBy 2014, IRAP had two dozen law school chapters and more than 50 law firms tackling a fast-growing caseload. It opened offices the next year in Amman, Jordan, and Beirut, Lebanon.\n\nThe organization’s main office in Lower Manhattan, which has a view of the Hudson River, has the feel of a start-up, with young adults in their 20s and 30s scurrying about. One recent afternoon, staff members talked with clients via Skype, discussed pending cases and reviewed policy issues to take to Capitol Hill.\n\nPhoto\n\nMs. Heller, who draws a $90,000 salary, wore her work uniform of jeans and a puffy vest and padded around in socks.\n\nShe and her husband, Dan Mullkoff, a Yale Law classmate, have an 18-month-old daughter, Anna, and when Ms. Heller feels stressed, she flips through a stack of photos of the toddler.\n\n“I am always worried I am not seeing her enough,” she said later.\n\nA week after the presidential election, Ms. Heller called an all-staff meeting to map out a strategy for the advent of a travel ban. After the inauguration, when she sent out three email blasts to her legal network, the response was so overwhelming that the link for signing up temporarily crashed.\n\nOn Jan. 27, Mr. Trump signed his executive order temporarily barring from entry people from seven majority-Muslim countries and freezing refugee resettlement so that the government could rethink its vetting procedures.\n\nAdvertisement Continue reading the main story\n\nWithin hours, lawyers were at airports, banging out petitions on laptops, sitting in hallways and at fast-food joints. Protesters descended on the terminals, chanting, “Let them in.”\n\n“If it hadn’t been for this operation, there would have been chaos and mayhem,” said Robert Atkins, a partner at the law firm Paul Weiss who volunteered at Kennedy International Airport, “but we, the public, would not have begun as quickly to understand the inhumanity of what was going on.”\n\nThe night after the order was signed, an IRAP client, Hameed Darweesh, an Iraqi detained at Kennedy, won the very first court ruling against the travel ban, from a federal judge in Brooklyn.\n\nLawyers at airports showed the order to officials on their smartphones. Travelers began to be set free.\n\nThough Ms. Heller and other challengers to the ban have been victorious in court, and popular among liberals, how broadly the public supports these efforts is an open question. While Hillary Clinton called for admitting more Syrian refugees, Mr. Trump called for blocking them entirely, and the original travel ban would have done just that.\n\nIn March, IRAP persuaded a federal judge in Maryland that a revised version of the travel ban, which dropped Iraq from the list of seven countries and omitted overt religious preferences, was still unconstitutional. A similar ruling from a federal judge in Hawaii is also being appealed by the government.\n\nThough the American Civil Liberties Union is handling the oral arguments on IRAP’s behalf, Ms. Heller planned to attend the hearing on Monday.\n\n“It’s a really good time to be leading an army of lawyers on behalf of refugee rights,” she said. “Expect a lot more lawsuits.”", "authors": ["Miriam Jordan"], "publish_date": "2017-05-07", "source": "nytimes", "top_words": ["main", "travel", "pro", "brigade", "young", "ban", "immigration", "bono", "irap", "work", "heller", "ms", "school", "bans", "firebrand", "foe", "law"], "summary": "Ms. Heller, who uses profanity when ranting and raving, kept her promise to Mr. Bronfman that she would sanitize her speech.\nAnd to those who know her best, it is not surprising that Ms. Heller has caused the administration trouble.\nA week after the presidential election, Ms. Heller called an all-staff meeting to map out a strategy for the advent of a travel ban.\nWhile Hillary Clinton called for admitting more Syrian refugees, Mr. Trump called for blocking them entirely, and the original travel ban would have done just that.\nThough the American Civil Liberties Union is handling the oral arguments on IRAP’s behalf, Ms. Heller planned to attend the hearing on Monday."}