{"url": "https://www.nytimes.com/2017/05/19/opinion/president-trump-tries-to-engage-the-muslim-world.html?mcubz=0", "id": "367", "title": "President Trump Tries to Engage the Muslim World", "text": "Photo\n\nNo American president in modern times has disparaged Islam as much as Donald Trump. From the attempted visa ban on Muslim-majority countries to his campaign claims that “Islam hates us” to his Islamaphobic advisers, the president’s record of hostility is well documented.\n\nSo his first overseas trip as president is something of a paradox, with a first stop in Saudi Arabia — a major force in the Sunni Arab world —- that includes meetings with members of the royal family, a summit meeting with other Arab leaders and a major speech on Sunday.\n\nDoes that mean Mr. Trump has changed his stripes? Given his casual approach to the truth and his malleable belief system, it’s impossible to know his true views on Islam. What we do know is that he needs all the help he can get from Muslim countries to fight the Islamic State. If he uses the speech and the trip to set a new tone with the Muslim world, that would be greatly in America’s interest.\n\nThe Saudis, who came to loathe President Barack Obama, are falling over themselves to turn the page. Mr. Trump’s decision to visit Saudi Arabia “lays to rest the notion that America is anti-Muslim,” the Saudi foreign minister, Adel al-Jubeir, told reporters early this month, ignoring the fact that the real issue is not whether America is anti-Muslim but whether Mr. Trump is. It was he, after all, who stoked xenophobic fires to win the election.\n\nAdvertisement Continue reading the main story\n\nMr. Obama worked hard to cultivate the Saudi-American relationship, selling the kingdom $115 billion in arms, providing support in the Saudi war against Iranian-backed Houthi rebels in Yemen, pushing Israeli-Palestinian peace negotiations and making Riyadh his first stop in the Arab world.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut the Saudis never forgave him for endorsing the overthrow of President Hosni Mubarak in Egypt; for refusing to intervene directly in Syria against President Bashar al-Assad; and for negotiating the nuclear deal with Iran, its Shiite enemy, even though the deal made the region safer.", "authors": ["The Editorial Board"], "publish_date": "2017-05-19", "source": "nytimes", "top_words": ["mr", "world", "trump", "york", "times", "sign", "tries", "arab", "islam", "president", "muslim", "saudi", "engage"], "summary": "PhotoNo American president in modern times has disparaged Islam as much as Donald Trump.\nDoes that mean Mr. Trump has changed his stripes?\nWhat we do know is that he needs all the help he can get from Muslim countries to fight the Islamic State.\nIf he uses the speech and the trip to set a new tone with the Muslim world, that would be greatly in America’s interest.\nView all New York Times newsletters."}