{"url": "https://www.nytimes.com/2017/06/15/opinion/the-many-reasons-why-admitting-fewer-refugees-is-wrong.html?mcubz=0", "id": "396", "title": "We Should Keep Our Word on Refugees", "text": "Photo\n\nPresident Trump’s “travel ban” has drawn much scrutiny for its attempt to prohibit citizens from six Muslim-majority countries from entering the United States. But the executive order — which this week was struck down by a second federal court and seems headed to the Supreme Court this summer — has another important part: a reduction, by more than half, of refugee admissions, to 50,000 from 110,000. This provision is bad for the country for security and economic reasons. As discussed in a forthcoming report by the Harvard Immigration and Refugee Clinical Program, it also potentially violates international commitments and American laws.\n\nYears ago, United States refugee admissions were based on geographic and ideological preferences — specifically, for refugees from Communist countries and repressive regimes in the Middle East. The Refugee Act of 1980, first introduced by Senator Edward Kennedy of Massachusetts, was intended to create a more systematic and equitable process for admitting refugees. The act changed the definition of refugee to a person with a “well-founded fear of persecution on account of race, religion, nationality, membership in a particular social group, or political opinion” — and in that way, conformed United States law to United Nations conventions and protocols.\n\nThe act affirms that it is “the historic policy of the United States to respond to the urgent needs of persons subject to persecution in their homelands,” including caring for them in asylum areas and promoting opportunities for resettlement. While a previous shutdown of all Syrian refugees resettlement was dropped from Mr. Trump’s revised executive order, a 120-day moratorium on all refugee admissions remains. This leaves vetted refugees in dangerous and uncertain conditions — seemingly in violation of the opening declaration of the Refugee Act.\n\nThe law also requires presidents to consult with Congress in setting annual targets for refugee admissions. This consultation must take place before the start of the fiscal year. The only exception to changing this determination is to increase admissions in the face of a refugee emergency, also with appropriate congressional consultation. Given that the fiscal year 2017 quotas were set at 110,000 by President Obama, in consultation with Congress, it exceeds President Trump’s authority to unilaterally change the number set by his predecessor.\n\nAdvertisement Continue reading the main story\n\nThe process of setting admissions has now begun for fiscal year 2018, which begins in October, with the recent submission to Congress of the president’s budget. The Immigration and Nationality Act requires this process to include a comprehensive proposal and report from the president regarding refugee and resettlement activity, and in-person discussions with the Judiciary Committees of both houses of Congress this fall. As the Harvard report explains, the president’s executive order would seem to violate the immigration law by prematurely and unilaterally reducing the refugee cap. It also disregards the law’s call for extending “special humanitarian concerns” to refugee populations — language that would support enhancing emergency allocations for Syrian refugees rather than decreasing the number of admissions.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe executive order also breaches United States obligations under international agreements. The United Nations 1951 Refugee Convention and 1967 protocol relating to the status of refugees are the precursors to the Refugee Act. They eliminated criteria that limited refugee status to people from certain locations and to events predating 1951. As a signatory to these acts, the United States is bound by their key principles: to not discriminate based on country of origin; to not penalize refugees for illegally entering or staying in the country; and to not expel refugees against their will to a territory where they may be threatened.", "authors": ["Georgette F. Bennett"], "publish_date": "2017-06-15", "source": "nytimes", "top_words": ["executive", "congress", "refugee", "act", "admissions", "united", "states", "word", "order", "trumps", "refugees"], "summary": "Years ago, United States refugee admissions were based on geographic and ideological preferences — specifically, for refugees from Communist countries and repressive regimes in the Middle East.\nThe Refugee Act of 1980, first introduced by Senator Edward Kennedy of Massachusetts, was intended to create a more systematic and equitable process for admitting refugees.\nWhile a previous shutdown of all Syrian refugees resettlement was dropped from Mr. Trump’s revised executive order, a 120-day moratorium on all refugee admissions remains.\nThis leaves vetted refugees in dangerous and uncertain conditions — seemingly in violation of the opening declaration of the Refugee Act.\nThe United Nations 1951 Refugee Convention and 1967 protocol relating to the status of refugees are the precursors to the Refugee Act."}