{"url": "https://www.nytimes.com/2017/03/16/us/california-today-in-persian-square-anxious-over-the-travel-ban.html?mcubz=0", "id": "317", "title": "California Today: In Persian Square, Anxious Over the Travel Ban", "text": "Photo\n\nGood morning.\n\n(Want to get California Today by email? Here’s the sign-up.)\n\nAdeel Hassan, a reporter based in New York, provides today’s introduction.\n\nThe uncertainty surrounding the Trump administration’s executive order on immigration can be felt across California, especially in the cluster of kebab houses and Iranian-American businesses known as Little Tehran or Persian Square in Los Angeles, home to the world’s largest Iranian diaspora.\n\nThe latest order, which was blocked on Wednesday, would have imposed a 90-day ban on citizens from Iran and five other predominantly Muslim countries from traveling to the U.S. The original ban, issued in January, was ultimately blocked by a federal appeals court.\n\nThe chaos over the ban’s rollout has put into flux travel plans ahead of the most important Iranian cultural holiday, Nowruz. The 13-day secular celebration of the Persian New Year begins on the first day of spring, which is Monday. Nowruz (pronounced NO-rooz) dates back thousands of years to the old Iranian solar calendar. It’s a part of the cycle of planting and harvesting and renewal.\n\nNewsletter Sign Up Continue reading the main story California Today The news and stories that matter to Californians (and anyone else interested in the state). Sign up to get it by email. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“There is lots of anxiety in the community,” said Peyman Malaz, program manager in the Los Angeles office of Pars Equality Center, an Iranian-American advocacy group. “Everyone is terrified actually. Everything is uncertain.”\n\nAdvertisement Continue reading the main story\n\nSouthern California has the nation’s biggest concentration of Iranian-Americans, numbering in the hundreds of thousands. They arrived here nearly 40 years ago, after the Islamic Revolution in 1979, in search of social, political and religious freedom. Many of them have family members back in their homeland, and fears of traveling are preventing some of them from reuniting, dampening a holiday centered on family, gifts and joy.", "authors": ["Mike Mcphate", "California Today"], "publish_date": "2017-03-16", "source": "nytimes", "top_words": ["travel", "email", "ban", "thousands", "anxious", "square", "iranian", "traveling", "persian", "sign", "reading", "today", "york", "california"], "summary": "(Want to get California Today by email?\nThe chaos over the ban’s rollout has put into flux travel plans ahead of the most important Iranian cultural holiday, Nowruz.\nThe 13-day secular celebration of the Persian New Year begins on the first day of spring, which is Monday.\nNewsletter Sign Up Continue reading the main story California Today The news and stories that matter to Californians (and anyone else interested in the state).\nEverything is uncertain.”Advertisement Continue reading the main storySouthern California has the nation’s biggest concentration of Iranian-Americans, numbering in the hundreds of thousands."}