{"url": "https://www.nytimes.com/2017/04/26/us/politics/ivanka-trump-syria-refugees-humanitarian-crisis.html?mcubz=0", "id": "350", "title": "Ivanka Trump Parts Ways With Her Father on Syrian Refugees", "text": "A spokeswoman for Ms. Trump did not respond to questions about her position on immigration — or about whether her remarks were intended to pressure her father.\n\nBut two advisers to Mr. Trump, who declined to be identified talking about an internal White House dispute, described the statement as a political misstep. Her comments, they said, revealed a simmering private policy debate in the White House that pits Ms. Trump and her husband, Jared Kushner, against hard-core nationalists like the president’s chief strategist, Stephen K. Bannon, and the policy adviser Stephen Miller, who see the crackdown on immigration from Muslim nations as fulfillment of a core campaign promise to Mr. Trump’s white working-class base.\n\nBreitbart News, the conservative website formerly run by Mr. Bannon, posted an article about her remarks that sat atop its list of most-read stories on Wednesday. It was followed by thousands of comments questioning Ms. Trump’s commitment to the populist causes that propelled her rougher-hewn father to the White House.\n\nThe United States admitted more than 13,000 refugees from Syria in 2016, before Mr. Trump proposed restrictions. Despite his hard line, support has been rising for admitting more migrants from the Middle East country, now in its seventh year of civil war; 58 percent of registered voters in a recent Quinnipiac University poll favored an increase in immigration from Syria, 14 percent more than in a survey conducted in late 2015.\n\nIn the days after Mr. Trump’s election, Democrats and some moderate Republicans expressed hope that Ms. Trump and Mr. Kushner would act as a moderating and stabilizing force in a West Wing dominated by the mercurial Mr. Bannon, who viewed himself as a disrupter intent on dismantling major components of the federal government.\n\nThat liberal crown has never fit perfectly: The husband-and-wife team, while powerful and socially progressive, have mostly been reluctant to challenge the president publicly and have lost significant battles, most recently an attempt to preserve federal funding for Planned Parenthood.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nQuestions about Ms. Trump’s ambiguous West Wing arrangement took center stage during the Berlin trip to attend the G-20 women’s conference, where German political and media figures questioned whether her ascent was a product of merit or dynastic privilege.\n\nAdvertisement Continue reading the main story\n\nAt one point, Ms. Trump was booed and hissed as she sought to defend her father’s record on empowering women, and at times she struggled to define precisely what her responsibilities in the West Wing entailed.\n\n“I am listening and I am learning and I am defining ways in which I think I will be able to have an impact,” she said.\n\nA person close to Ms. Trump said she took the mixed reception in stride, and said she was not surprised that her father’s critics would vent their ire on her.\n\nMs. Trump was deeply moved by televised images of children dying from a sarin gas attack this month in Idlib Province in northern Syria. But she denied a claim by her brother, Eric, that her reaction influenced the president’s decision to launch a retaliatory missile strike on a government air base in Syria. In Berlin, Ms. Trump told reporters that this was a “flawed interpretation.”\n\nBut even the unveiling of her first major initiative — to support female entrepreneurs — hit another bump in Berlin.\n\nWhite House officials were taken by surprise when Chancellor Angela Merkel of Germany announced at the Berlin summit meeting Ms. Trump’s project, a World Bank fund to provide female entrepreneurs with financial and logistical services. The money would be part of a donor trust fund and go to women in developing countries, according to a World Bank official who briefed reporters on Wednesday.\n\nMs. Trump — who will promote the initiative through public and media appearances — will not solicit funds or have authority over how the money is spent, according to a senior administration official, who declined to be identified by name when briefing reporters because the program was still being developed. Funding decisions will be made by corporate donors and the participating countries, including Canada, Germany and several Middle Eastern nations.\n\nThe fund was Ms. Trump’s idea, and was passed to the World Bank’s president, Jim Yong Kim, before he mentioned it to Ms. Merkel, the administration official said.\n\nAdvertisement Continue reading the main story\n\nMs. Trump’s position on Syrian refugees reflects a minority view within the White House, where she has taken on the role of trying quietly to affect her father’s policies on the margins instead of applying the public pressure it often takes to sway the cable TV-focused president.\n\nBut it also represented a view that her father himself once held.\n\nIn a September 2015 interview with Bill O’Reilly, then a host at Fox News, Mr. Trump said he believed the United States needed to accept some refugees from Syria. “I hate the concept of it, but on a humanitarian basis, with what’s happening, you have to,” Mr. Trump said.\n\nAt another point he called it an “unbelievable humanitarian problem.”\n\nBut soon after, Mr. Trump backtracked, and said he did not want to see new refugees coming in.\n\nHis daughter’s comments not only roiled a White House that has been fighting a court battle to enact his executive order, the blocking of which Mr. Trump has viewed as an unacceptable defeat, but were also another reminder to her West Wing rivals that Ms. Trump is going to be treated as a policy adviser in her official government capacity.", "authors": ["Glenn Thrush", "Maggie Haberman"], "publish_date": "2017-04-26", "source": "nytimes", "top_words": ["syrian", "parts", "trump", "ivanka", "ways", "wing", "trumps", "syria", "ms", "west", "refugees", "house", "white", "mr", "father"], "summary": "A spokeswoman for Ms. Trump did not respond to questions about her position on immigration — or about whether her remarks were intended to pressure her father.\nBut two advisers to Mr. Trump, who declined to be identified talking about an internal White House dispute, described the statement as a political misstep.\nIt was followed by thousands of comments questioning Ms. Trump’s commitment to the populist causes that propelled her rougher-hewn father to the White House.\nThe United States admitted more than 13,000 refugees from Syria in 2016, before Mr. Trump proposed restrictions.\n“I hate the concept of it, but on a humanitarian basis, with what’s happening, you have to,” Mr. Trump said."}