{"url": "https://www.nytimes.com/2017/07/05/world/middleeast/laptop-ban-emirates-turkey.html?mcubz=0", "id": "32", "title": "Emirates and Turkish Airlines Say Laptop Ban Is Lifted on Their U.S. Flights", "text": "The agency wants all carriers and airports with flights to the United States to increase the use of canine screening, install devices to detect trace amounts of explosives, and start interviewing passengers, if they are not doing so already.\n\n“Effective immediately, the electronics ban has been lifted for Emirates’ flights from Dubai International Airport to the U.S.A.,” Emirates said in a statement, adding that it had been working with the local authorities to put in place new security guidelines for all flights to the United States.\n\nSaudia, the national carrier of Saudi Arabia, said it expected the laptop ban to be lifted on its flights by July 19, Reuters reported, citing the state news agency SPA.\n\nThe original ban on devices applied to direct flights to the United States from 10 cities in eight countries: Amman, Jordan; Cairo; Istanbul; Jidda and Riyadh in Saudi Arabia; Kuwait City; Casablanca, Morocco; Doha, Qatar; and Dubai and Abu Dhabi in the United Arab Emirates.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nAn official for Qatar Airways who has been briefed on the matter, but who spoke on the condition of anonymity because he was not authorized to discuss it publicly, said the United States was trying to compel all affected airports to comply with new security procedures.\n\nThe T.S.A. told the airports last Thursday that they had 21 days, the official said, to put in place explosive trace detection screening for all United States-bound passengers and their bags — whether in the main cabin or in the hold.\n\nThat type of screening is already carried out at some airports, like Hamad International in Doha, on a random basis, but the Qatar Airways official said the United States was demanding the stricter approach at all airports on the list because of concerns about terrorism.\n\nQatar has sought to have the ban lifted on its flights to the United States from the affected airports. The spokesman for the T.S.A. said on Wednesday afternoon that this effort was still pending.\n\nAdvertisement Continue reading the main story\n\nUgur Cebeci, a Turkish aviation expert, said that Ataturk Airport in Istanbul had upgraded security measures to meet the demands of the United States — only the latest generation of devices can detect plastic explosives, he said — and acknowledged that American concerns were legitimate.\n\nStill, he said, many in Turkey are skeptical about the circumstances surrounding the restrictions. “American companies find it difficult to compete in this region with Turkish Airlines and numerous Gulf airlines,” he said. “The Trump administration has been pressured by American companies for leverage in competition, so the real purpose of the ban is open to debate.”\n\nIn late May, the United States said it was considering a ban on electronic devices larger than cellphones in passenger cabins on direct flights to the United States from more foreign airports. But a month later, the Homeland Security Department said passengers would be subject to stricter screening of luggage and electronic devices.\n\nIn recent years, extremist groups have staged attacks on transportation hubs, including at an airport in Brussels and in Istanbul, and militants bombed a Russian airliner in Egypt in October 2015.", "authors": ["Dan Bilefsky"], "publish_date": "2017-07-05", "source": "nytimes", "top_words": ["turkish", "passengers", "qatar", "screening", "airports", "ban", "security", "united", "states", "flights", "emirates", "airlines", "laptop", "devices", "lifted", "say"], "summary": "“Effective immediately, the electronics ban has been lifted for Emirates’ flights from Dubai International Airport to the U.S.A.,” Emirates said in a statement, adding that it had been working with the local authorities to put in place new security guidelines for all flights to the United States.\nSaudia, the national carrier of Saudi Arabia, said it expected the laptop ban to be lifted on its flights by July 19, Reuters reported, citing the state news agency SPA.\nQatar has sought to have the ban lifted on its flights to the United States from the affected airports.\n“American companies find it difficult to compete in this region with Turkish Airlines and numerous Gulf airlines,” he said.\nBut a month later, the Homeland Security Department said passengers would be subject to stricter screening of luggage and electronic devices."}