{"url": "https://www.nytimes.com/2017/06/26/opinion/travel-ban-supreme-court-trump.html?mcubz=0", "id": "399", "title": "Opinion | The Travel Ban at the Supreme Court", "text": "Editorial The Travel Ban at the Supreme Court Image Credit Ariel Davis\n\nPresident Trump cares a lot about winning, or at least the appearance of it. So he was predictably quick to sound off in triumph after the Supreme Court announced on Monday morning that in October it would consider the legality of his revised travel ban and will allow the ban to take partial effect in the meantime. The justices’ decision, he said, was “a clear victory for our national security.”\n\nIn reality, “victory” for anyone in this case is far from clear.\n\nMr. Trump, who had called during the campaign for “a total and complete shutdown of Muslims entering the United States,” issued his first travel ban in January, but it was quickly blocked by the courts.\n\nA revised version, issued in March, barred visitors from six Muslim-majority countries from entering the United States for 90 days and suspended the refugee program for 120 days. Key parts of it were again struck down by two federal appeals courts. One of the two courts, the United States Court of Appeals for the Fourth Circuit, recalled Mr. Trump’s own incendiary campaign statements in ruling that the order violated the First Amendment’s ban on government establishment of religion and that it “drips with religious intolerance, animus and discrimination.”\n\nOn Monday, the justices agreed to review both appellate decisions, but their unsigned opinion did not address the merits of those cases. They ruled that until they hear the case in early fall, the ban will apply only to foreigners with no connections to America and not to those “who have a credible claim of a bona fide relationship” here.\n\nWhat’s a “bona fide” relationship? It’s a good question, and one that will be litigated aggressively over the summer. The court provided general guidelines — say, a family member of someone living in the country, a student admitted to a university or a worker with an employment offer in hand. Relationships that exist only to get around the ban are not acceptable — for example, between refugees and the immigrant-rights groups that reach out to them as potential clients.\n\nThat approach did not satisfy Justices Clarence Thomas, Samuel Alito and Neil Gorsuch, who argued in partial dissent that the “bona fide” standard was “unworkable” and will result in a “flood of litigation” in the lower federal courts. The dissenters would have allowed the ban to take effect in its entirety.\n\nAll the legal jockeying shouldn’t obscure the fundamental foolishness of the policy itself. Despite Mr. Trump’s groundless claim that the ban is necessary to protect national security, no one from the affected countries has been responsible for a fatal terror attack in the United States in the past two decades. This includes the past five months, during which the White House has repeatedly insisted on the ban’s importance even as it has shown little urgency in filing its appeals.\n\nNow the administration has the summer to conduct its vetting review, which was the original rationale for the travel ban — the government needed time to “figure out what is going on,” as Mr. Trump once put it. By October, the ban will have expired and the review should be complete. And by then Mr. Trump might conceivably have developed a factual basis for a policy that continues to bar people from certain countries, which would trigger a whole new round of litigation.\n\nRelated Coverage Supreme Court Takes Up Travel Ban Case, and Allows Parts to Go Ahead Image\n\nSign up for the Opinion Today newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, The Times editorial board and contributing writers from around the world. SEE SAMPLE Please verify you’re not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. * Required field You agree to receive occasional updates and special offers for The New York Times products and services. * Required field Thank you for subscribing. View all New York Times newsletters. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. Sign Up", "authors": ["The Editorial Board"], "publish_date": "2017-06-26", "source": "nytimes", "top_words": ["travel", "trump", "ban", "supreme", "court", "opinion", "united", "times", "states", "york", "mr"], "summary": "Editorial The Travel Ban at the Supreme Court Image Credit Ariel DavisPresident Trump cares a lot about winning, or at least the appearance of it.\nSo he was predictably quick to sound off in triumph after the Supreme Court announced on Monday morning that in October it would consider the legality of his revised travel ban and will allow the ban to take partial effect in the meantime.\nMr. Trump, who had called during the campaign for “a total and complete shutdown of Muslims entering the United States,” issued his first travel ban in January, but it was quickly blocked by the courts.\nRelated Coverage Supreme Court Takes Up Travel Ban Case, and Allows Parts to Go Ahead ImageSign up for the Opinion Today newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, The Times editorial board and contributing writers from around the world.\n* Required field You agree to receive occasional updates and special offers for The New York Times products and services."}