{"url": "https://www.nytimes.com/2017/05/31/opinion/trump-travel-ban-appeals-court.html?mcubz=0", "id": "379", "title": "Should the President’s Words Matter in Court?", "text": "It is generally a mistake for a court to give legal force to statements whose goals are those of political mobilization or persuasion — or anything other than the articulation of considered legal positions. In most cases, the authoritative statements of the legal positions of the United States are contained in official settings and documents like the arguments and briefs presented to courts by the Department of Justice. Privileging such documents ensures that the careful processes and expertise they reflect are not overshadowed by casual presidential utterances or ill-considered tweets.\n\nThe judges who have objected to using Mr. Trump’s words against him in the travel ban litigation have been motivated by such concerns. Alex Kozinski, a judge on the United States Court of Appeals for the Ninth Circuit, which in February affirmed an order halting the initial travel ban, took particular issue with his colleagues’ use of campaign speech, noting that “the panel has approved open season on anything a politician or his staff may have said.” Judge Paul V. Niemeyer of the Fourth Circuit, dissenting from last week’s opinion, agreed, expressing alarm that in the future a court could “have free rein to select whichever expression of a candidate’s developing ideas best supports its desired conclusion.”\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Nicholas Kristof Newsletter Receive emails about each column and other occasional commentary. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThese judges are right to be cautious: We don’t want to give every tweet on every topic the color of law. And to a point they’re correct on the merits: The speech of a president should not usually be relevant to a court’s determination of the meaning or lawfulness of government action.\n\nThe Supreme Court, for example, acted properly in disregarding President Barack Obama’s statement that the Affordable Care Act’s individual mandate was “absolutely not a tax increase.” When the case came before the Supreme Court, Justice Antonin Scalia did press the federal government’s lawyer to explain the president’s remarks. But in the end, none of the opinions in the case even mentioned the remarks, presumably because the court concluded they were irrelevant to the constitutional question of Congress’s power to regulate health care. Most presidential speech isn’t legally significant.\n\nAgain, there are important exceptions. The Supreme Court has long held that in the context of religious discrimination claims, proof of government purpose is required to establish a constitutional violation. And countless courts have relied on statements by government officials in such cases. In 1993, in a case concerning whether a city ordinance in Florida impeded the free exercise of religion, the Supreme Court held that government purpose could be gleaned from “contemporaneous statements made by members of the decision-making body.”\n\nGiving decisive weight to all presidential statements would be a bad idea. It would unduly empower the president, allowing him to circumvent internal executive-branch processes, and it would also unduly disempower him, preventing him from speaking freely about topics that might have litigation consequences. Each effect would be problematic, whether we’re talking about President Trump or any other president.\n\nIn the case of the travel ban, however, given the relevance of Mr. Trump’s words to determining its purpose, the courts can rule that the president’s speech is germane in this particular instance — without opening Pandora’s box.", "authors": ["Kate Shaw"], "publish_date": "2017-05-31", "source": "nytimes", "top_words": ["matter", "travel", "case", "courts", "purpose", "supreme", "speech", "court", "statements", "words", "sign", "president", "presidents"], "summary": "Privileging such documents ensures that the careful processes and expertise they reflect are not overshadowed by casual presidential utterances or ill-considered tweets.\nThe judges who have objected to using Mr. Trump’s words against him in the travel ban litigation have been motivated by such concerns.\nThe Supreme Court, for example, acted properly in disregarding President Barack Obama’s statement that the Affordable Care Act’s individual mandate was “absolutely not a tax increase.” When the case came before the Supreme Court, Justice Antonin Scalia did press the federal government’s lawyer to explain the president’s remarks.\nThe Supreme Court has long held that in the context of religious discrimination claims, proof of government purpose is required to establish a constitutional violation.\nIn the case of the travel ban, however, given the relevance of Mr. Trump’s words to determining its purpose, the courts can rule that the president’s speech is germane in this particular instance — without opening Pandora’s box."}