{"url": "https://www.nytimes.com/interactive/2017/02/06/us/politics/why-trump-chose-the-seven-countries.html?mcubz=0", "id": "464", "title": "In One Facebook Post, Three Misleading Statements by President Trump About His Immigration Order", "text": "President Trump and his aides have repeatedly suggested that the executive order temporarily barring refugees and blocking citizens of seven Muslim-majority countries from entering the United States is an outgrowth of Obama administration policy.\n\nMr. Trump’s statement on Facebook, Jan. 29\n\n“The seven countries named in the Executive Order are the same countries previously identified by the Obama administration as sources of terror.”\n\nWhat really happened\n\nThe seven countries were largely chosen by the Republican-led Congress.\n\nAfter the terrorist attacks in Paris and San Bernardino, Calif., at the end of 2015, Congress passed legislation requiring that all people with passports from Iran, Iraq, Syria or Sudan apply for visas to enter the United States.\n\nBefore that legislation, some citizens of those four countries who also had passports in countries like Britain or Japan could enter the United States without a visa by using their other passport.\n\nThe legislation also required anyone who had recently traveled to the four countries to get a visa before entering the United States, no matter what passport they held.\n\nTwo months after Congress passed the legislation, the Department of Homeland Security, using criteria designated by Congress, added Libya, Somalia and Yemen to the list of countries for which recent visitors would be required to get visas to enter the United States.\n\nThe seven countries\n\nASIA Med. Sea SYRIA IRAN IRAQ LIBYA SUDAN Indian Ocean YEMEN SOMALIA AFRICA IRAN SYRIA IRAQ LIBYA SUDAN YEMEN SOMALIA By The New York Times\n\nUnlike the newly signed executive order, the visa restrictions did not bar anyone from coming into the United States, said Michelle Mittelstadt of the Migration Policy Institute, a nonpartisan research group.\n\nIn a political environment in which some Republicans were seeking to end the United States’ refugee program and to bar Muslim immigrants, Obama administration officials said the visa waiver restrictions were the least harmful effort they could support that would satisfy Congress.\n\n“This was really a congressional effort that we ended up negotiating to what we thought was a more rational place,” Avril D. Haines, Mr. Obama’s deputy national security adviser, said in an interview. She said they wanted to focus the law on catching foreign fighters who might have visited those countries.\n\nWhile the State Department designates all seven countries as terrorist safe havens or state sponsors of terrorism, the United States receives more visitors from other nations linked to terrorism.\n\nVisitors to the United States from terrorist safe havens or sponsors of terrorism, 2015\n\nThe vast majority of people who have carried out deadly jihadist-inspired attacks in the United States were citizens of Saudi Arabia, the United Arab Emirates, Pakistan, Egypt and Lebanon. Several of the attackers were born in the United States.\n\nThe United States shares intelligence with many of these countries to fight terrorism.\n\nCountries of origin for deadly jihadist-inspired attackers in the U.S. since 2001, including 9/11\n\nRussia Kyrgyzstan United States Egypt Pakistan Saudi Arabia BANNED COUNTRIES Russia United States Kyrg. Egypt Pakistan Saudi Arabia BANNED COUNTRIES Russia United States KyrG. Egypt Pakistan Saudi Arabia BANNED COUNTRIES Note: Tamerlan Tsarnaev, a suspect in the Boston Marathon bombings, was born in Kalmykia, which is in Russia.\n\nMr. Trump’s statement on Facebook, Jan. 29\n\n“My policy is similar to what President Obama did in 2011 when he banned visas for refugees from Iraq for six months.”\n\nWhat really happened\n\nObama never barred Iraqi refugees.\n\nMr. Trump is probably referring to action that Mr. Obama took after two Iraqi refugees living in Bowling Green, Ky., were indicted on federal terrorism charges that they were plotting to send weapons and money to Al Qaeda in Iraq with the aim of killing American soldiers there.\n\nThe Obama administration reviewed and tightened screening procedures for Iraqi refugees, which delayed arrivals, but it never stopped the program or barred refugees from Iraq. In fiscal year 2011, 9,388 Iraqi refugees were admitted to the United States, according to the State Department.\n\nMr. Trump’s executive order bars all refugees for 120 days, and Syrian refugees indefinitely.\n\nIraqi refugees arriving in the United States\n\n20,000 15,000 10,000 5,000 FY 2007 2009 2011 2013 2016 20,000 15,000 10,000 5,000 FY 2007 2009 2011 2013 2016\n\nMr. Trump’s statement on Facebook, Jan. 29\n\n“To be clear, this is not a Muslim ban, as the media is falsely reporting. This is not about religion — this is about terror and keeping our country safe.”\n\nWhat really happened\n\nAfter he signed the order, Mr. Trump said that Christians would be given priority once the United States resumed taking in refugees.\n\nMr. Trump has said that the travel ban does not target Muslims, noting there are more than 40 majority-Muslim countries worldwide that are not affected.\n\nMuslim-majority countries\n\nBANNED COUNTRIES BANNED COUNTRIES BANNED COUNTRIES\n\nBut Mr. Trump said in an interview with the Christian Broadcasting Network that Christians would be given priority once the United States resumed taking in refugees.\n\nThe White House has said Mr. Trump simply wants to give preference to persecuted minorities. And in majority-Muslim countries, Christians are often religious minorities.\n\nDuring the campaign Mr. Trump framed the plan as a temporary ban on all Muslim visitors. He also recently described the executive order as a “ban.”\n\nSome religious leaders think that is still his intent.\n\n“Is the intent of the ban religious? Without a hesitation,” said Omid Safi, the director of the Duke Islamic Studies Center. “This is not something I’m having to read between the lines.”\n\nNot only are the seven countries in the ban majority Muslim, all are almost completely Muslim.\n\nShare of Muslims in each banned country\n\n10% 50% 90% Iran Yemen Iraq Somalia Sudan Libya Syria 10% 50% 90% Iran Yemen Iraq Somalia Sudan Libya Syria\n\n“We need to stand up against anything that pits Christians and Muslims against each other,” said Jen Smyers, the associate director for immigration and refugee policy at Church World Service, a ministry affiliated with dozens of Christian denominations.\n\nReligious leaders, both Muslim and Christian, said that temporarily suspending the refugee program and barring Syrian refugees indefinitely shut the door to the most vulnerable people. More than 3,500 religious leaders have signed a letter voicing support for the United States refugee program.", "authors": ["Haeyoun Park", "Karen Yourish", "Gardiner Harris"], "publish_date": "2017-02-06", "source": "nytimes", "top_words": ["seven", "facebook", "trump", "immigration", "post", "iraq", "refugees", "united", "states", "misleading", "countries", "obama", "statements", "banned", "order", "president"], "summary": "Visitors to the United States from terrorist safe havens or sponsors of terrorism, 2015The vast majority of people who have carried out deadly jihadist-inspired attacks in the United States were citizens of Saudi Arabia, the United Arab Emirates, Pakistan, Egypt and Lebanon.\nCountries of origin for deadly jihadist-inspired attackers in the U.S. since 2001, including 9/11Russia Kyrgyzstan United States Egypt Pakistan Saudi Arabia BANNED COUNTRIES Russia United States Kyrg.\nEgypt Pakistan Saudi Arabia BANNED COUNTRIES Note: Tamerlan Tsarnaev, a suspect in the Boston Marathon bombings, was born in Kalmykia, which is in Russia.\n“This is not something I’m having to read between the lines.”Not only are the seven countries in the ban majority Muslim, all are almost completely Muslim.\nMore than 3,500 religious leaders have signed a letter voicing support for the United States refugee program."}