{"url": "https://www.nytimes.com/2017/08/22/magazine/should-i-turn-in-my-tax-cheating-relative.html?mcubz=0", "id": "430", "title": "Should I Turn in My Tax-Cheating Relative?", "text": "To compound the school’s possible misconduct, they may be taking advantage of the parents’ ignorance of students’ rights or fear of being found out by immigration authorities. If I report this to the state, it may get the school in trouble. Since I am convinced they fill a great need in the community and accomplish much good, I am reluctant to take any steps to report this. Meanwhile, this student has lost another year in which she should have made great strides in learning to read. What is my ethical responsibility? Name Withheld, Minnesota\n\nTeaching is a profession. Among its ethical norms is that your primary responsibility is to your students. If a school’s management betrays the needs of its students, a teacher can’t just sit back and watch — and the same goes for a tutor. You raised the right issues, and you were told they’d be dealt with. Now you know that promise was broken. On the other hand, this is not your only tutee, and the school is, you say, good for many students, all things considered. (Indeed, given that four tutors have worked with this girl throughout the week, the school hasn’t entirely neglected her needs.) I’d say you have identified exactly the two conflicting ethical demands here.\n\nHave you considered contacting the girl’s parents to discuss her situation? They are better placed to push for more action than you are, unless, as you suspect, they have a well-founded fear that in drawing attention to themselves, they risk deportation. But the school should have little interest in reporting them to the immigration authorities. So you can probably reassure them on that point. They could also contact an organization like Family Voices of Minnesota, which offers resources for children with special needs, or a similar group. It would get people involved whose aim will be not to threaten the school’s survival but to press it to do the right thing.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nEvery year my place of employment holds a survey on employee engagement. This year, we have a new manager. In the past, previous managers have done some ‘‘survey prep’’ by holding discussions in staff meetings. We were asked to think back on activities over the last year that would support positive scores to each survey question. It was clear to me that this type of meeting was intended to raise scores from our unit. But the discussions were robust, everyone participated and I found myself thinking, Oh, yeah, I forgot about that positive initiative from 10 months ago.\n\nAdvertisement Continue reading the main story\n\nThis year the new manager had public, one-on-one discussions out in the open, where it was easy to overhear. They went something like this: ‘‘Employee X, you’ve worked here for five years, correct? So I assume that you are completely satisfied and ready to submit straight 5s (out of 5). If not, we need to have a discussion about why you aren’t ranking 5s, don’t we?’’ The tone was patronizing and imperious. It made me very uncomfortable, even though the new manager did not have this conversation with me directly. I am very happy in my position, but there is always room for improvement, and I did not give very many 5s. I answered the survey honestly.\n\nWas it ethical for her to have a discussion that was really a directive? Should I have said something to her? Scores (and year-over-year improvement in scores) are often wielded as a sign of the company leadership’s success. Name Withheld\n\nSurvey prep, huh? Ours is a world where SAT cramming has become an industry and even little kids train for kindergarten-entrance exams. So it was bound to come to this. If you can test it, you can game it. I assume that the survey is anonymous, so that managers don’t know who gave which scores. Otherwise you would have been more cautious in your own scoring (and your company would be wasting its time with these surveys). But the new boss, you make plain, isn’t as subtle as the old ones. Provided that her suggestions didn’t come with threats, what they mainly were was stupid. Bullying people who are about to assess you confidentially is not a good idea. If the questionnaire allows for free-form comments, that would have been a good place to complain about her campaigning. Given her tone, I doubt this is the kind of boss it would be wise to address directly.\n\nI work as a graduate research assistant to a professor while I earn my master’s degree. I am required to work 20 hours a week. The actual time slots I work are up to me to determine. Additionally, graduate assistants are allowed to work on their own research or homework when they are not asked to do work for a professor. Unlike other people on my research team, I have taken to coming in very late to the office, and I receive few work projects. I have not been asked to come into work at different times. I complete all projects I have been assigned well and quickly. Am I treating my employer ethically by setting my own schedule such that I am unavailable to receive project assignments in person much of the day? I know other members on my research team are assigned more work than I am. Name Withheld\n\nGiven the sparsity of your assignments, I wonder if you’re working the 20 hours for which you’re being paid. Even supposing that everything you’re doing is permitted under your terms of employment, though, you’re not fairly sharing the burdens with your co-workers. If your employer hasn’t noticed the discrepancy between the demands on you and the demands on others, it would be an honorable move to point this out.", "authors": ["Kwame Anthony Appiah", "The Ethicist"], "publish_date": "2017-08-22", "source": "nytimes", "top_words": ["turn", "survey", "good", "ethical", "taxcheating", "research", "youre", "work", "scores", "school", "sign", "students", "relative"], "summary": "On the other hand, this is not your only tutee, and the school is, you say, good for many students, all things considered.\n(Indeed, given that four tutors have worked with this girl throughout the week, the school hasn’t entirely neglected her needs.)\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box.\nWe were asked to think back on activities over the last year that would support positive scores to each survey question.\nName WithheldGiven the sparsity of your assignments, I wonder if you’re working the 20 hours for which you’re being paid."}