{"url": "https://www.nytimes.com/2017/06/29/briefing/travel-ban-george-pell-hong-kong.html?mcubz=0", "id": "408", "title": "Travel Ban, George Pell, Hong Kong: Your Thursday Briefing", "text": "We visited Mr. McConnell’s home state, Kentucky, where many aren’t sure what to oppose more: Obamacare or Republicans’ proposed replacement.\n\nPhoto\n\nAnd we spoke to Democrats from conservative states who thought they might find common ground with President Trump. That hasn’t happened.\n\n• Cardinal is charged with sexual assault.\n\nGeorge Pell, Australia’s senior Roman Catholic prelate and a top adviser to Pope Francis, has been charged with sexual assault, the Australian police said.\n\nThe Holy See announced today that Cardinal Pell had been granted a leave of absence so that he could return to Australia to defend himself.\n\nPhoto\n\n• World roundup.\n\n• A White House warning succeeded in stopping a chemical weapons attack by the Syrian government, U.S. officials said.\n\n• President Trump accepted an invitation from President Emmanuel Macron of France to join Bastille Day celebrations next month.\n\nAdvertisement Continue reading the main story\n\n• The recently deposed crown prince of Saudi Arabia, Mohammed bin Nayef, is said to have been barred from leaving the kingdom and confined to his palace.\n\n• A bungee jump instructor in Spain could face criminal charges after a Dutch teenager plunged to her death in 2015, mistaking his command in English of “no jump” for “now jump.”\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n• “The Daily,” your audio news report.\n\nIn today’s show, we discuss the American military’s actions in Syria, and how it may be sliding into a far bigger role in the civil war than it intended.\n\nListen on a computer, an iOS device or an Android device.\n\nBusiness\n\n• Walgreens and Rite Aid said today that they had called off their planned merger. Instead, Rite Aid will sell more than 2,100 drugstores and three distribution centers to Walgreens for about $5 billion.\n\n• Central bankers from around the world discussed whether artificial intelligence could eliminate huge numbers of jobs.\n\n• “Is he strange? Yes.” The lawyer for the former hedge fund manager Martin Shkreli, whose fraud trial started on Wednesday, portrayed his client as odd but brilliant.\n\nMr. Shkreli is best known for initiating a steep increase in the price of a lifesaving drug.\n\n• U.S. stocks were up on Wednesday. Here’s a snapshot of global markets.\n\nMarket Snapshot View Full Overview\n\nSmarter Living\n\n• Smarter Living introduced its weekly newsletter on Monday, delivering tips for living a better, more fulfilling life straight to your inbox. Sign up here, and catch up on the first edition.\n\nAdvertisement Continue reading the main story\n\n• Recipe of the day: For grilled steak, this marinade of soy sauce, ginger, garlic, honey and lime is worth adding to your rotation.\n\nNoteworthy\n\n• A 6-year-old trailblazer.\n\nIn today’s 360 video, visit the elementary school in New Orleans that Ruby Bridges attended in 1960, becoming the first black student to do so.\n\nVideo\n\n• Partisan writing you shouldn’t miss.\n\nRead about how the other side thinks: Writers from across the political spectrum discuss the Supreme Court’s recent decisions.\n\n• The promise of Hong Kong fades.\n\nWhen the British colony returned to Chinese rule 20 years ago, it was seen as a prosperous and modern example that Beijing could emulate.\n\nBut the city’s democratic evolution, sought by a majority of the population, has stalled.\n\nThe Chinese president, Xi Jinping, arrived in the territory today for ceremonies marking the anniversary. Follow our live briefing.\n\n• A bright side for the Knicks, maybe.\n\nThe team ousted Phil Jackson, its president, on Wednesday and needs years of rebuilding without interference, our sports columnist writes. (Gone, too, is Jackson’s much-maligned triangle offense.)\n\n• Best of late-night TV.\n\nOn “Full Frontal,” Samantha Bee expressed concerns about the Senate health care bill. “It turns out, 13 rich white guys alone in a room isn’t how good legislation happens.”\n\n• Quotation of the day.\n\n“I made eye contact with a couple of people, and they made a sad face. I guess it was a nice human moment.”\n\nAdvertisement Continue reading the main story\n\n— KC Brown, a subway rider who thought she had a second chance to board a crowded train when the doors reopened, but the car was too full.\n\nBack Story\n\nEstonia, the smallest of the three Baltic States, takes on a big task for the first time this week: the rotating presidency of the Council of the European Union.\n\nThe six-month role will give the country an outsize voice in European politics, and leaders will converge on Tallinn, the capital, for meetings.\n\nPhoto\n\nA few facts about the nation: It’s a former Soviet republic, with a population of about 1.3 million. It prides itself on embracing life online and has declared internet access a human right.\n\nEstonians helped create well-known services like Skype and Kazaa, an early file-sharing website.\n\nOn the physical side, the country has an unusual sport: “kiiking,” or extreme swinging.\n\nIn kiiking (pronounced KEY-king), participants are tied to the base of a rigid swing and try to generate enough momentum to complete a full rotation. (Hard to envision? Here’s a video.)\n\nKiiking, pioneered by Ado Kosk in the 1990s, emerged from a tradition of building large wooden swings for community festivities.\n\n“Swinging is in our blood,” said Ants Tamme, director of the Estonian Kiiking Federation.\n\n“It’s all about your fears,” said Mr. Tamme, once a record-holder. “If you overcome your fears, it’s easy.”\n\nAdvertisement Continue reading the main story\n\nPatrick Boehler contributed reporting.\n\n_____\n\nPhotographs may appear out of order for some readers. Viewing this version of the briefing should help.\n\nYour Morning Briefing is published weekdays at 6 a.m. Eastern and updated on the web all morning.\n\nWhat would you like to see here? Contact us at briefing@nytimes.com.\n\nYou can sign up here to get the briefing delivered to your inbox. Check out our full range of free newsletters here.", "authors": ["Chris Stanford"], "publish_date": "2017-06-29", "source": "nytimes", "top_words": ["main", "today", "travel", "living", "george", "ban", "kiiking", "inbox", "pell", "president", "hong", "kong", "reading", "continue", "sign", "briefing"], "summary": "George Pell, Australia’s senior Roman Catholic prelate and a top adviser to Pope Francis, has been charged with sexual assault, the Australian police said.\nAdvertisement Continue reading the main story• The recently deposed crown prince of Saudi Arabia, Mohammed bin Nayef, is said to have been barred from leaving the kingdom and confined to his palace.\nAdvertisement Continue reading the main story• Recipe of the day: For grilled steak, this marinade of soy sauce, ginger, garlic, honey and lime is worth adding to your rotation.\n“If you overcome your fears, it’s easy.”Advertisement Continue reading the main storyPatrick Boehler contributed reporting.\nYou can sign up here to get the briefing delivered to your inbox."}