{"url": "https://www.nytimes.com/2017/06/27/briefing/donald-trump-theresa-may-angela-merkel.html?mcubz=0", "id": "401", "title": "Donald Trump, Theresa May, Angela Merkel: Your Tuesday Briefing", "text": "Undocumented immigrants in the United States appear to be avoiding medical treatment, out of fear they might be deported.\n\n_____\n\nPhoto\n\n• In Britain, the Conservatives signed a deal with Northern Ireland’s Democratic Unionist Party that will allow Prime Minister Theresa May to govern, after she lost her majority in the recent general election.\n\nAnd Mrs. May pledged that E.U. citizens currently living legally in Britain would not be asked to leave the country after its exit from the bloc.\n\nSeparately, the authorities are racing to identify and evacuate dozens of high-rises wrapped in the same kind of combustible cladding as Grenfell Tower in London, where a fire killed at least 79 people.\n\nA regulatory gap allowed the cladding’s American manufacturer to sell the product for use in towers in Britain, despite a ban in the U.S.\n\n_____\n\nPhoto\n\n• Climate conundrum: The amount of carbon dioxide humans are pumping into the air seems to have stabilized — but data gathered at the world’s monitoring stations (like the one above in Australia) shows that excess carbon dioxide is still on the rise.\n\nOne terrifying possibility is that the world’s natural sponges for the greenhouse gas, like the ocean, are no longer able to keep up.\n\nAdvertisement Continue reading the main story\n\n_____\n\nPhoto\n\n• We bring you news of the great male skirt rebellion of 2017.\n\nFrench bus drivers suffering through last week’s heat wave were among the men conducting a sartorial revolt against dress codes barring shorts.\n\nOur top fashion critic says the design crowd actually seems to be far more comfortable with skirts than shorts on men. “Odds are, we are going to see more of it,” she predicts. “Employers had better get ready.”\n\n_____\n\nPhoto\n\n• Finally, The New York Times has set up the Reader Center, a forum for our journalists to speak directly to you about our coverage.\n\nIn one of the first such posts, a top editor addresses a frequent complaint that we are overly focused on U.S. politics.\n\nYou can contact the Reader Center at nytnews@nytimes.com.\n\n_____\n\nNewsletter Sign Up Continue reading the main story Morning Briefing What you need to know to start your day, delivered to your inbox. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBusiness\n\nPhoto\n\n• European Union officials are expected to issue a record fine of at least $1.2 billion against Google as soon as today for breaking the region’s competition rules. Above, Margrethe Vestager, the bloc’s competition chief.\n\n• There was widespread criticism of Italy’s decision to use billions in taxpayer money to wind down two banks, and of the E.U.’s swift approval.\n\n• American hedge funds are taking their aggressive strategies to Europe, where companies have fewer tools to thwart activist investors.\n\n• Amazon’s newest Echo smart speaker has a touch screen.\n\n• Here’s a snapshot of global markets.\n\nMarket Snapshot View Full Overview\n\nIn the News\n\nPhoto\n\n• Chancellor Angela Merkel of Germany softened her opposition to gay marriage, saying Conservative lawmakers could deviate from the party’s position in a future “vote of conscience.” [Deutsche Welle]\n\nAdvertisement Continue reading the main story\n\n• In France, a court rejected a request to establish a shelter for migrants but ordered the local authorities to allow the distribution of aid. [France 24/Le Monde]\n\n• In Moscow, a jury could soon reach a verdict in the trial of five men accused of killing Boris Nemtsov, a leading Russian opposition figure, in 2015. [TASS]\n\n• A Swedish tourist kidnapped by Islamist militants in Mali in 2011 has returned home. A South African fellow traveler remains missing. [Radio Sweden]\n\n• Liu Xiaobo, the jailed Chinese Nobel Peace laureate, has been transferred to a hospital to be treated for late-stage cancer. [The New York Times]\n\n• In Brazil, President Michel Temer was charged with corruption. [The New York Times]\n\n• A court in Madrid ruled that exhuming Salvador Dalí’s corpse was the only way to resolve a woman’s claim that she is the Surrealist painter’s daughter. [The New York Times]\n\nSmarter Living\n\nPhoto\n\nTips, both new and old, for a more fulfilling life.\n\n• Give biking to work a try. Start with our guide.\n\n• If you find yourself nodding off at your desk today, take a nap. It’ll do wonders for your productivity.\n\nAdvertisement Continue reading the main story\n\n• Recipe of the day: A cucumber and yogurt salad — sprinkled with dill and sour cherries — is a great complement to a hearty main dish.\n\nNoteworthy\n\nPhoto\n\n• New Zealand won the America’s Cup, the most prestigious prize in yachting. The Kiwis took calculated risks to overcome tight budget constraints.\n\n• Thousands of patients may receive incorrect cancer diagnoses each year because of biopsy mix-ups. And here’s how to make sense of shifting advice on prostate cancer screenings.\n\n• In the French village of Courances, about an hour’s drive south of Paris, a furniture designer and a restaurateur find silence (for her) and outstanding produce (for him).\n\nBack Story\n\nPhoto\n\nToday is Seven Sleepers’ Day, which both celebrates an ancient legend and supposedly predicts the weather in the German-speaking parts of Europe.\n\nThe legend stretches back centuries. It involves a group of seven youths who escaped religious persecution by hiding in a cave, where they slept for hundreds of years before awakening.\n\nMore practically speaking, the day’s weather is thought to foretell conditions for the rest of the summer, similar to the way Groundhog Day predicts the arrival of spring in the U.S.\n\nAbove, a hiker on Herzogstand Mountain in southern Germany.\n\nAccording to one saying, “If Seven Sleepers is wet, it rains unceasingly.” More precisely, if it rains on June 27, it will pour for seven weeks.\n\nAdvertisement Continue reading the main story\n\nThe day’s predictive power is helped, as Germany’s weather service explains, by the jet stream, which stabilizes around this time, providing, with some variation, a consistent forecast.\n\n(Confusing matters, the day’s name in German is Siebenschläfertag, but it did not get that name from Siebenschläfer, a word for a common European dormouse that hibernates for about seven months.)\n\nPalko Karasz contributed reporting.\n\n_____\n\nThis briefing was prepared for the European morning. We also have briefings timed for the Australian, Asian and American mornings. You can sign up for these and other Times newsletters here.\n\nYour Morning Briefing is published weekday mornings and updated online.\n\nWhat would you like to see here? Contact us at europebriefing@nytimes.com.", "authors": ["Patrick Boehler"], "publish_date": "2017-06-27", "source": "nytimes", "top_words": ["main", "seven", "predicts", "theresa", "trump", "day", "weather", "donald", "merkel", "times", "reading", "sign", "angela", "briefing", "york", "continue"], "summary": "Advertisement Continue reading the main story_____Photo• We bring you news of the great male skirt rebellion of 2017.\n“Employers had better get ready.”_____Photo• Finally, The New York Times has set up the Reader Center, a forum for our journalists to speak directly to you about our coverage.\n_____Newsletter Sign Up Continue reading the main story Morning Briefing What you need to know to start your day, delivered to your inbox.\nView all New York Times newsletters.\n[The New York Times]• In Brazil, President Michel Temer was charged with corruption."}