{"url": "https://www.nytimes.com/2017/08/27/us/politics/trump-law-order-police-arpaio.html?mcubz=0", "id": "437", "title": "Trump’s Brand of Law and Order Leaves Leeway on the Law", "text": "At a rally in Phoenix last week, where Mr. Trump signaled that a pardon was coming, the president said that Mr. Arpaio, who repeatedly engaged in racial profiling as he defied a court order, had been convicted simply for doing his job.\n\nIn his words and acts, critics and experts said, Mr. Trump has sent a permissive message to people in law enforcement that they can bend the law, if not break it.\n\n“Arpaio is a public official accused of racial profiling, and in the pardon statement, he was praised for his actions,” said Michael Waldman, the president of the Brennan Center for Justice at New York University.\n\nMr. Waldman drew a line from the pardon to Mr. Trump’s statements last month to police officers on Long Island in which he appeared to encourage local law enforcement officials to give suspects rougher treatment. The president made those comments despite years of wrenching debate over a string of cases of police shootings of unarmed black men.\n\n“When the president says, ‘Make sure to hit the heads of people on the door of the police car,’ or pardons a sheriff accused of racial profiling, it redefines the law as just brute force,” Mr. Waldman said.\n\nOfficials in the executive branch and in individual agencies have started to speak out with increasing, and surprising, frequency. A senior Justice Department official wrote a memo after Mr. Trump’s Long Island speech, stating strongly that the agency does not condone brutality. So did several police departments across the country.\n\nMr. Trump, who spent his early adult years in the crime-ravaged, racially volatile crucible of New York City in the 1970s and 1980s, sees life through the prism of strength versus weakness. On Twitter, as Hurricane Harvey ravaged Texas, Mr. Trump said he had unleashed the force of federal aid. On Sunday morning, as the rains continued, the president tweeted an endorsement of a book by another hard-line law enforcement official accused of civil rights violations: Sheriff David A. Clarke of Milwaukee County, Wis., whom he called “a great guy.”\n\nAdvertisement Continue reading the main story\n\nWhile Mr. Trump has spoken often of the significance of the rule of law, his actions have raised questions about his commitment to hallmarks of the American system like due process, equal protection under the law, independence of judicial proceedings from political considerations, and respect for orders from the courts.\n\n“I don’t think you have to be a champion of it; all you need to do is comply with it,” said Charles Fried, a Harvard Law School professor who was a solicitor general under President Ronald Reagan.\n\n“And he shows himself absolutely unwilling to respect it,” Mr. Fried said, citing the pardon as a particular thumb in the eye of a judge. “It’s a use of authority specifically to undermine the only weapon that a judge has in this kind of ultimate confrontation.”\n\nThe White House declined to address the criticisms on the record, but one official said the president’s actions on immigration enforcement, in particular, had re-established the rule of law instead of ignoring it, lifted the morale of the police, and restored the focus on combating illegal immigration to states instead of the federal government.\n\nAs a candidate, Mr. Trump enthusiastically endorsed a brutal interrogation technique declared illegal under international law. “Torture works,” Mr. Trump said at a South Carolina event in early 2016, a statement he tried to modify when some of his outside advisers threatened to leave his campaign.\n\nWhen protests erupted at his rallies, he repeatedly waxed nostalgic about the “good old days” when people could take such matters into their own hands. He endorsed stop-and-frisk policing, and said immigration by Muslims should be banned to protect Americans’ safety. He argued to Bill O’Reilly, then a Fox News host, that immigrants in the country illegally may not be entitled to due process at all.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nOn the same program, Mr. Trump insisted, despite established law, that the 14th Amendment does not guarantee citizenship to people born in the United States if their parents are here illegally.\n\nAfter proposing a wall along the southern border, he repeatedly attacked a federal judge of Mexican descent who was overseeing a case involving Mr. Trump’s private company. A “so-called judge,” he called him.\n\n“Those were rhetorical excesses. This is a use of power to disarm and make empty the actions of a judge,” Mr. Fried said. “You come with a certain level of constitutional literacy, and he is totally illiterate in these domains. You think every day it can’t get worse, and then it does.”\n\nAdvertisement Continue reading the main story\n\nMore recently, Mr. Trump described himself as “liberating” towns from the scourge of gangs of undocumented immigrants. He has expressed anger with the attorney general, Jeff Sessions, one of his earliest supporters, for agreeing to take the job when he knew he might recuse himself from inquiries related to possible collusion between Russian officials and the Trump campaign. And he asked Mr. Sessions in the spring if the federal charges could be dropped against Mr. Arpaio, and was promptly told no.\n\n“You get the sense that this is kind of New York wheeler-dealer territory, where you say whatever pops in your mouth to get through the negotiation,” Mr. Waldman said.\n\nRobert Bauer, who was White House counsel under President Barack Obama, said: “It’s very difficult to say that he stands for law and order — in fact, in many respects he’s kind of the president of disorder. He’s lurching around and basically responding to what he sees as his personal or legal imperative at any given moment.”\n\nThe historian Douglas Brinkley recalled dining with Mr. Trump at Mar-a-Lago in late 2016, after the election, and hearing the president-elect describe dining privately with Richard M. Nixon in New York after his presidency had ended.\n\n“In his mind, a tough president was Nixon,” Mr. Brinkley said. “He creates a kind of fantasy world, and so he wants to be seen as one of the tough guys.”\n\nThe pardon, the conservative Washington Examiner said in an editorial, showed “once again Trump really means ‘busting heads’ when he says ‘law and order.’”\n\nThe editorial added: “But ‘law and order,’ if the words have any meaning, has to apply to government actors as well. Lawless sheriffs promote disorder, and that’s what Arpaio did to get himself convicted.”\n\nMr. Arpaio said in an interview on Sunday that Mr. Trump’s experience with the judiciary as it ruled against his travel ban targeting Muslim nations had led him to be suspicious of the motives of some judges.\n\nAdvertisement Continue reading the main story\n\n“He understands that some courts are biased,” Mr. Arpaio said. “I can confirm that with my situation, believe me.”\n\nMr. Arpaio said his pardon merely showed Mr. Trump’s faith in the prerogatives of police officers. “He’s not using me to show he’s tough,” Mr. Arpaio said. “He is enforcing the rule of law.”\n\n“I really believe in his heart that he likes what I did and he believes I got the raw deal,” he said.\n\nOn Sunday, on Fox News, the secretary of state, Rex W. Tillerson, was asked whether the president spoke for American values. Mr. Tillerson demurred.\n\n“The president speaks for himself,” Mr. Tillerson said.", "authors": ["Maggie Haberman"], "publish_date": "2017-08-27", "source": "nytimes", "top_words": ["leaves", "mr", "waldman", "trump", "brand", "pardon", "judge", "leeway", "trumps", "york", "order", "president", "arpaio", "law"], "summary": "A senior Justice Department official wrote a memo after Mr. Trump’s Long Island speech, stating strongly that the agency does not condone brutality.\nOn Twitter, as Hurricane Harvey ravaged Texas, Mr. Trump said he had unleashed the force of federal aid.\nAs a candidate, Mr. Trump enthusiastically endorsed a brutal interrogation technique declared illegal under international law.\nThis is a use of power to disarm and make empty the actions of a judge,” Mr. Fried said.\nSessions in the spring if the federal charges could be dropped against Mr. Arpaio, and was promptly told no."}