{"url": "https://www.nytimes.com/2017/06/27/us/trump-travel-ban-refugees-supreme-court.html?mcubz=0", "id": "405", "title": "With 3 Words, Supreme Court Opens a World of Uncertainty for Refugees", "text": "On Monday, the Supreme Court threw into question whether such refugees, who are among the most vulnerable people seeking a haven after fleeing persecution or conflict, will be approved for resettlement in the United States.\n\nIn agreeing to hear two cases on President Trump’s travel ban, the court introduced a new phrase to the fraught discussion of refugees and Muslim immigrants: “bona fide relationship.”\n\nThose who can show a “bona fide relationship” with a “person or entity” in the United States will not be affected by Mr. Trump’s 120-day halt to refugee admissions or his 90-day ban on travel from six majority-Muslim countries, according to the court’s order. Those refugees or travelers must be admitted, at least for now.\n\nHowever, those who have no family, business or other ties can be prohibited, the court said.\n\nThe justices gave some examples of a bona fide relationship: visiting relatives in the United States, attending a university or taking a job offer.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Race/Related Newsletter Join a deep and provocative exploration of race with a diverse group of New York Times journalists. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nOn a conference call Monday, lawyers who have fought the Trump administration argued that other refugees and travelers should also be allowed in because, like Mr. Dagoum, they often have ties to a nonprofit organization that has been helping them even before they land in the United States.\n\n“Anyone who has an existing relationship with a nonprofit, frankly tens of thousands of refugees,” should be seen as having bona fide ties, said Becca Heller, director of the International Refugee Assistance Project.\n\nRepresentatives of some resettlement agencies said they were awaiting guidance from the State Department. Heather Nauert, a State Department spokeswoman, said on Tuesday that the department would consult with the Justice Department on how to define “bona fide relationship,” a process she expected to take two more days. Meanwhile, anyone already approved for travel to the United States by July 6 would be allowed in, she said.\n\nAdvertisement Continue reading the main story\n\nMr. Trump, who hailed Monday’s decision, has said he issued the ban to give his administration time to review its vetting procedures, while opponents contend that the move discriminates against Muslims. The justices will consider the constitutionality of the ban in the fall, but in their order Monday, they signaled that foreigners without American ties were the ones least likely to gain any protection from the court.\n\nAlthough the administration has not said how it would interpret “bona fide relationship,” it is conceivable that it will take a relatively narrow view of the phrase and decide that anyone without a family, university or employment connection can be barred.\n\nThat could lead to another round of lawsuits from opponents of the ban, the very situation that Justice Clarence Thomas warned of in a partial dissent in which he called the standard “unworkable.”\n\n“The compromise also will invite a flood of litigation until this case is finally resolved on the merits, as parties and courts struggle to determine what exactly constitutes a ‘bona fide relationship,’” Justice Thomas wrote. He argued that all refugees and travelers from the six countries should be temporarily barred.\n\nStephen Yale-Loehr, an immigration law professor at Cornell University, said, “At the very least, there will be delays in refugees’ coming to the United States until we get clarifications from the State Department or the federal court.”\n\nClarity on that issue is crucial for the Lutheran Immigration and Refugee Service, which resettled about 13,300 refugees last year.\n\nPhoto\n\nFor example, its affiliate in Fayetteville relies on 13 local congregations whose members have been preparing for the new arrivals.\n\n“They have been waiting for families for months,” said Emily Crane Linn, resettlement director at the affiliate, Canopy Northwest Arkansas. “They have garages filled with furnishings for their apartments.”\n\nAdvertisement Continue reading the main story\n\nThe first wave of refugees from any particular country rarely have family ties. Thus, a majority of those arriving from Syria and the Democratic Republic of Congo, two of the most common nationalities of refugees in recent years, are so-called free cases.\n\nAs the number of refugees from a country grows, they become sponsors of relatives applying to join them. Until then, the families require intense case management from resettlement agency staff, to show them where to buy groceries, how to ride the bus and how to perform other mundane tasks.\n\nDr. Heval Kelli, a Syrian refugee, moved to the United States with his family in 2001, knowing no one in his new country. He was greeted by members of a local Episcopal church when he arrived in Clarkston, Ga.\n\n“They brought furniture and food, sat on the ground with us, took us shopping to Walmart,” said Dr. Kelli, 34. “That was the first time I went to Walmart.”\n\nHe eventually attended medical school at Morehouse and completed a residency at Emory, where he is now training to be a cardiologist.\n\nMr. Dagoum, who settled in New Haven, now works at a granite company, packing and shipping marble and tiles. His wife is studying English at a local college.\n\nIntegrated Refugee and Immigrant Services, the nonprofit agency that helped Mr. Dagoum, serves mostly people without family connections in the United States.\n\nLinda Bronstein, a senior case manager at the agency, called these “classic refugee cases.”\n\n“All of a sudden, we’re saying these refugees might not be allowed here,” she said.", "authors": ["Miriam Jordan"], "publish_date": "2017-06-27", "source": "nytimes", "top_words": ["fide", "relationship", "uncertainty", "world", "family", "supreme", "bona", "opens", "refugee", "court", "united", "states", "ties", "words", "refugees", "department"], "summary": "On Monday, the Supreme Court threw into question whether such refugees, who are among the most vulnerable people seeking a haven after fleeing persecution or conflict, will be approved for resettlement in the United States.\nThe justices gave some examples of a bona fide relationship: visiting relatives in the United States, attending a university or taking a job offer.\nMeanwhile, anyone already approved for travel to the United States by July 6 would be allowed in, she said.\n“They have garages filled with furnishings for their apartments.”Advertisement Continue reading the main storyThe first wave of refugees from any particular country rarely have family ties.\nIntegrated Refugee and Immigrant Services, the nonprofit agency that helped Mr. Dagoum, serves mostly people without family connections in the United States."}