{"url": "https://www.nytimes.com/2017/06/29/us/politics/travel-ban-trump-muslims.html?mcubz=0", "id": "409", "title": "Administration Moves to Carry Out Partial Travel Ban", "text": "“It remains clear that President Trump’s purpose is to disparage and condemn Muslims,” said Omar Jadwat, director of the A.C.L.U.’s Immigrants’ Rights Project, adding that the government’s new ban on entry “does not comport with the Supreme Court’s order, is arbitrary and is not tied to any legitimate government purpose.”\n\nOne week after taking office, Mr. Trump shut down travel from seven mostly Muslim countries, including Iraq, and blocked entry by all refugees, saying that a “pause” was necessary to evaluate the vetting of visitors from places the government deemed dangerous.\n\nCritics assailed that first order as a veiled attempt to make good on Mr. Trump’s campaign promise to impose a “Muslim ban.” After courts blocked it, the president issued a modified order directed at six countries, not including Iraq. That order was blocked as well, with federal appeals courts ruling that it discriminated based on religion, in violation of the First Amendment, and exceeded the president’s statutory authority.\n\nThe decision Thursday by the administration to revive and aggressively enforce another version of the president’s travel ban is certain to keep the intense debate about America’s borders going into the Supreme Court’s fall term, when the justices are scheduled to decide the legal fate of Mr. Trump’s efforts to restrict entry by particular groups.\n\n\n\nOfficials said they were determined to “meet the intent of the presidential directive” within the boundaries set by the Supreme Court, which issued an interim opinion when it agreed to consider the issue in its next term. Administration officials said their definition of a “family connection” was based on existing immigration law and directions from the court.\n\nHours before the new guidelines went into effect Thursday evening, officials predicted little of the chaos that engulfed airports in January, when the president issued his original travel ban. This time, officials said, people already booked to travel to the United States would be allowed to enter. And they made it clear that legal permanent residents were not affected by the ban.\n\nBut the administration’s newest move could prompt another wave of litigation as advocates for those trying to enter the United States ask courts to halt enforcement of the ban. Already, lawyers in Washington have asked the court to allow the entry of refugees with no “credible claim of a bona fide relationship with a person or entity in the United States.”\n\nAdvertisement Continue reading the main story\n\nOther lawyers representing people who have been blocked from visiting the United States described the government’s actions as meanspirited and said they made unreasonable distinctions about family relations.\n\n“Allowing a U.S. citizen to bring their Syrian mother-in-law but not their Syrian brother-in-law doesn’t make us any safer, and doesn’t even really make any sense,” said Gadeir Abbas, a staff lawyer at the Council on American-Islamic Relations.\n\nMr. Trump has said that his travel ban does not directly target Muslims, although the six countries on the list that the president has deemed dangerous — Iran, Libya, Somalia, Sudan, Syria and Yemen — are majority Muslim.\n\nMohammad Javad Zarif, Iran’s foreign minister, condemned the administration’s move. “U.S. now bans Iranian grandmothers from seeing their grandchildren, in a truly shameful exhibition of blind hostility to all Iranians,” he tweeted.\n\nFor refugees fleeing civil wars and violence around the world, the administration’s action on Thursday means that a 120-day ban on entry from all countries will most likely bar many of them from finding safety in the United States.\n\nAs of Wednesday night, 49,009 refugees had been allowed into the United States so far this fiscal year, which ends Oct. 1. Officials predicted that the new 50,000 cap would be reached by July 6, so refugees who are planning to travel after that date will not automatically be allowed into the country. Travel arrangements for refugees beyond July 6 will not be allowed until the State Department makes an assessment, officials said.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Race/Related Newsletter Join a deep and provocative exploration of race with a diverse group of New York Times journalists. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nEven after the 50,000 limit is reached, however, refugees with family ties that meet the new guidelines will be allowed into the United States, officials said.\n\n“The U.S. government is once again unfairly changing the rules on refugees who, after fleeing for their lives, are now struggling to eat and to stay alive while they try to follow those rules,” said Mark Hetfield, president and chief executive of HIAS, a refugee and resettlement agency.\n\nAdvertisement Continue reading the main story\n\nLawyers for refugees said they interpreted the Supreme Court’s interim opinion as saying that refugees who have a longstanding connection to one of the refugee placement agencies would qualify to enter the United States.\n\nBut administration officials said the opposite on Thursday, telling reporters that the yearslong process that refugees undergo to be vetted and connected with communities in the United States did not, by itself, constitute a “bona fide relationship” with an institution in the United States.\n\nRefugee agencies argued in a letter sent Wednesday to Secretary of State Rex W. Tillerson that their clients should pass muster.\n\n“The order stated that a bona fide relationship with an entity should be ‘formal, documented and formed in the ordinary course, rather than for the purpose of evading E.O.-2,’” Hans van de Weerd, chairman of the Refugee Council USA, the coordinating body for agencies that handle resettlement, wrote in the letter, referring to the president’s executive order. He added that refugee agencies only accept applicants who have already proven that “he or she has ties to the United States.”\n\nAdvocates for refugees and others also complained on Thursday that the administration had little evidence for how the travel ban would protect citizens and others living in the United States.\n\nNo Americans have been killed by terrorist attacks on United States soil undertaken by anyone from the six targeted countries since at least 1975, according to a Cato Institute study, and at a midday news conference, top officials from the departments of State, Homeland Security and Justice would not say how the president’s executive order would make the country safer.\n\nIn a briefing later in the afternoon, Heather Nauert, the State Department’s spokeswoman, said those officials were career employees charged with carrying out the order, not defending its politics. When asked to defend the order herself, Ms. Nauert, a political appointee, was halting in her response.\n\n“With some of these countries, we would take issue certainly with the government of Iran, and some of the nations there can be concerns,” she said. “And the American public could have legitimate concerns about their safety when we open our doors. And we want to open our doors to people who are willing to go through proper screening measures and who want to be here and want to be productive members of our society.”", "authors": ["Gardiner Harris", "Michael D. Shear", "Ron Nixon"], "publish_date": "2017-06-29", "source": "nytimes", "top_words": ["travel", "moves", "carry", "courts", "ban", "partial", "order", "officials", "united", "states", "countries", "refugees", "president", "administration"], "summary": "Administration officials said their definition of a “family connection” was based on existing immigration law and directions from the court.\nHours before the new guidelines went into effect Thursday evening, officials predicted little of the chaos that engulfed airports in January, when the president issued his original travel ban.\nThis time, officials said, people already booked to travel to the United States would be allowed to enter.\nAs of Wednesday night, 49,009 refugees had been allowed into the United States so far this fiscal year, which ends Oct. 1.\nEven after the 50,000 limit is reached, however, refugees with family ties that meet the new guidelines will be allowed into the United States, officials said."}