{"url": "https://www.nytimes.com/2016/11/18/us/politics/japanese-internment-muslim-registry.html?mcubz=0", "id": "48", "title": "Trump Camp’s Talk of Registry and Japanese Internment Raises Muslims’ Fears", "text": "Mr. Higbie, a former Navy SEAL who served two tours in Iraq, denied that, but said, “We need to protect America first.”\n\nHe stood by his comments in a phone interview on Thursday morning, saying that he had been alluding to the fact that the Supreme Court had “upheld things as horrific as Japanese internment camps.”\n\n“There is historical, factual precedent to do things that are not politically popular and sometimes not right, in the interest of national security,” he said, adding that he “fundamentally” disagreed with “the internment camp mantra and doing it at all.”\n\nHe clarified that he was not a constitutional lawyer and was working from a layman’s understanding of the 1944 Supreme Court ruling that the order for internment camps was constitutional. He said he hoped to be involved in the Trump administration but had engaged in no “formal conversations” with the president-elect’s team.\n\nOn Thursday, a spokeswoman for Mr. Trump did not reply to a request for comment. That night, a CNN reporter wrote on Twitter that Jason Miller, a spokesman for the Trump transition team, had issued the following statement: “President-elect Trump has never advocated for any registry or system that tracks individuals based on their religion, and to imply otherwise is completely false. The national registry of foreign visitors from countries with high terrorism activity that was in place during the Bush and Obama administrations gave intelligence and law enforcement communities additional tools to keep our country safe, but the President-elect plans on releasing his own vetting policies after he is sworn in.”\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nA spokeswoman for Mr. Kobach declined to comment.\n\nA spokesman for the Great America PAC said Mr. Higbie had stopped working for the fund-raising group on the day after the election.\n\nMr. Higbie’s comments were met with furious criticism by civil rights activists, Muslim organizations and politicians.\n\nAdvertisement Continue reading the main story\n\nRepresentative Mark Takano, a Japanese-American and Democrat from California whose parents and grandparents were imprisoned during World War II, said in a statement on Thursday that the comments reflected “an alarming resurgence of racism and xenophobia in our political discourse.” He called on Mr. Trump to denounce them.\n\nRobert S. McCaw, a spokesman for the Council on American-Islamic Relations, the nation’s largest Muslim civil rights group, called the reference to internment camps as a precedent “absolutely deplorable” and said that it would “return America to one of the darkest chapters of its history.”\n\nMr. McCaw noted that Congress had formally apologized for the Japanese-American internment in a law signed by President Ronald Reagan.\n\n“I can’t see how it would now be right to do the same thing to Muslims,” Mr. McCaw said.\n\nPhoto\n\nMr. Kobach, who is Kansas’ secretary of state, was referring to the National Security Entry-Exit Registration System, which he helped create while working at the Justice Department. The program was first proposed in 2002, and significant portions of it were suspended nine years later. Mr. Kobach, who has degrees from Harvard, Oxford and Yale, had helped to create and carry out the system when he worked for Attorney General John Ashcroft.\n\nThe policy came under heavy criticism while it was in effect and afterward. In a 2012 report, the Center for Immigrants’ Rights at the Pennsylvania State University’s law school called it a “tool that allowed the government to systematically target Arabs, Middle Easterners, Muslims and South Asians” and a “clear example of discriminatory and arbitrary racial profiling.”\n\n“Within its first year of operation, the registration system resulted in the apprehension of numerous suspected terrorists,” according to his Kansas government biography.\n\nThat program was not as broad or sweeping as the database of Muslim residents that Mr. Trump had said he would “certainly implement” during the Republican primaries. He later backed off the idea after criticism.\n\nOn social media, many non-Muslims have reacted to Mr. Kobach’s comments by saying that they will simply “register as Muslim.” The official Twitter account of the Anti-Defamation League posted a statement from its chief executive, Jonathan Greenblatt, saying that “if one day Muslims will be forced to register, that is the day that this proud Jew will register as a Muslim.”\n\nThat seems unlikely to work; such a registry would apply only to visitors from certain countries.\n\nMr. McCaw, the spokesman for CAIR, said that the proposals advanced by Mr. Higbie and Mr. Kobach might seem to be different in degree, but that the two ideas — a database of names and internment camps based on religious or ethnic heritage — were inexorably linked.\n\nAdvertisement Continue reading the main story\n\n“I really do feel as though the prospect of internment is always tied to registries of people,” he said.", "authors": ["Jonah Engel Bromwich"], "publish_date": "2016-11-18", "source": "nytimes", "top_words": ["mr", "spokesman", "trump", "day", "japanese", "comments", "mccaw", "kobach", "registry", "camps", "talk", "system", "internment", "muslim", "muslims", "fears", "raises"], "summary": "On Thursday, a spokeswoman for Mr. Trump did not reply to a request for comment.\nA spokeswoman for Mr. Kobach declined to comment.\n“I can’t see how it would now be right to do the same thing to Muslims,” Mr. McCaw said.\nMr. Kobach, who has degrees from Harvard, Oxford and Yale, had helped to create and carry out the system when he worked for Attorney General John Ashcroft.\nThat program was not as broad or sweeping as the database of Muslim residents that Mr. Trump had said he would “certainly implement” during the Republican primaries."}