{"url": "https://www.nytimes.com/2017/07/19/us/politics/trump-travel-ban-supreme-court.html?mcubz=0", "id": "424", "title": "Trump Refugee Restrictions Allowed for Now; Ban on Grandparents Is Rejected", "text": "The Trump administration interpreted the Supreme Court’s decision as excluding most refugees and entry only of American residents’ parents, children, spouses, parents-in-law, sons- and daughters-in-law, people engaged to be married and siblings.\n\nLast week, Judge Derrick K. Watson of Federal District Court in Honolulu ruled that the administration’s approach had disregarded the language and logic of the Supreme Court’s ruling, fairness and the conventional understanding of who counts as a close family member.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Race/Related Newsletter Join a deep and provocative exploration of race with a diverse group of New York Times journalists. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“Common sense, for instance, dictates that close family members be defined to include grandparents,” Judge Watson wrote. “Indeed, grandparents are the epitome of close family members. The government’s definition excludes them. That simply cannot be.”\n\nThe next day, Attorney General Jeff Sessions criticized the ruling as undermining national security, creating confusion and violating respect for separation of powers.\n\n“The district court has improperly substituted its policy preferences for the national security judgments of the executive branch in a time of grave threats, defying both the lawful prerogatives of the executive branch and the directive of the Supreme Court,” Mr. Sessions said in a statement.\n\nLater that day, the administration filed a motion asking the Supreme Court to clarify its decision. It said the justices should act immediately, without waiting for a ruling from the appeals court.\n\nThe administration said it was entitled to exclude refugees whom resettlement agencies had planned to help move to the United States. Judge Watson disagreed, writing that the Supreme Court had meant to allow such people to enter the country.\n\nAdvertisement Continue reading the main story\n\n“An assurance from a United States refugee resettlement agency, in fact, meets each of the Supreme Court’s touchstones,” he wrote. “It is formal, it is a documented contract, it is binding, it triggers responsibilities and obligations, including compensation, it is issued specific to an individual refugee only when that refugee has been approved for entry by the Department of Homeland Security.”\n\nIn its Supreme Court brief, the Justice Department said that Judge Watson’s ruling “would render the refugee portion of this court’s decision effectively meaningless.”\n\nLawyers for Hawaii who are challenging the travel ban disputed that assertion. They said about 24,000 refugees had a formal assurance of help from a settlement agency, while another 175,000 in the pipeline did not.\n\n“Many of those refugees — as well as countless visa applicants from the targeted nations — will be unable to demonstrate any other form of bona fide relationship with an American party, meaning that they will be absolutely barred from entering the country in the next several months,” the Hawaii lawyers wrote.\n\nThey also said Judge Watson’s order did nothing to stop the administration from enforcing its travel ban against an estimated 85 percent of refugees, or to exclude extended family members “who indisputably lack close relationships with American individuals and entities.”\n\nOn Wednesday, the Supreme Court rejected the administration’s request for clarity on the scope of last month’s decision. The justices said that the appeal in the case should follow the ordinary course and that the United States Court of Appeals for the Ninth Circuit, in San Francisco, should first address the question.\n\nIn temporarily blocking the part of Judge Watson’s order concerning refugees, the Supreme Court indicated that the government’s arguments had weight. In declining to disturb the part of the order that allowed relatives to enter, the Supreme Court suggested that the administration might have overreached.\n\nChallenges to Mr. Trump’s travel bans have been ricocheting around the federal courts for almost as long as he has been president.\n\nHis first ban, issued in January, caused chaos at the nation’s airports until it was blocked by the courts. Rather than appealing to the Supreme Court, the administration issued a revised executive order in March. But that order, too, was blocked by federal appeals courts, which ruled that it violated the Constitution by discriminating based on religion and that it exceeded Mr. Trump’s authority.\n\nAdvertisement Continue reading the main story\n\nThe Supreme Court is scheduled to hear arguments on October 10.\n\nIn a partial dissent from the Supreme Court’s decision last month, Justice Thomas said the line the court had drawn, allowing those with “bona fide relationships” to enter the country, was unworkable. He predicted — accurately — that the court’s compromise would “invite a flood of litigation until this case is finally resolved on the merits, as parties and courts struggle to determine what exactly constitutes a ‘bona fide relationship.’”", "authors": ["Adam Liptak"], "publish_date": "2017-07-19", "source": "nytimes", "top_words": ["ruling", "restrictions", "courts", "trump", "allowed", "ban", "supreme", "refugee", "judge", "court", "order", "rejected", "refugees", "administration", "decision", "grandparents"], "summary": "Judge Watson disagreed, writing that the Supreme Court had meant to allow such people to enter the country.\nAdvertisement Continue reading the main story“An assurance from a United States refugee resettlement agency, in fact, meets each of the Supreme Court’s touchstones,” he wrote.\nIn temporarily blocking the part of Judge Watson’s order concerning refugees, the Supreme Court indicated that the government’s arguments had weight.\nIn declining to disturb the part of the order that allowed relatives to enter, the Supreme Court suggested that the administration might have overreached.\nAdvertisement Continue reading the main storyThe Supreme Court is scheduled to hear arguments on October 10."}