{"url": "https://www.nytimes.com/2017/08/05/opinion/sunday/white-resentment-affirmative-action.html?mcubz=0", "id": "427", "title": "The Policies of White Resentment", "text": "The last half-century hasn’t changed that. The war on drugs, for example, branded African-Americans and Latinos as felons, which stripped them of voting rights and access to housing and education just when the civil rights movement had pushed open the doors to those opportunities in the United States.\n\nSimilarly, the intensified war on immigrants comes, not coincidentally, at the moment when Latinos have gained visible political power, asserted their place in American society and achieved greater access to schools and colleges. The ICE raids have terrorized these communities, led to attendance drop-offs in schools and silenced many from even seeking their legal rights when abused.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe so-called Election Integrity Commission falls in the same category. It is a direct response to the election of Mr. Obama as president. Despite the howls from Mr. Trump and the Republicans, there was no widespread voter fraud then or now. Instead, what happened was that millions of new voters, overwhelmingly African-American, Hispanic and Asian, cast the ballots that put a black man in the White House. The punishment for participating in democracy has been a rash of voter ID laws, the purging of names from the voter rolls, redrawn district boundaries and closed and moved polling places.\n\nAffirmative action is no different. It, too, requires a narrative of white legitimate grievance, a sense of being wronged by the presence of blacks, Latinos and Asians in positions that had once been whites only. Lawsuit after lawsuit, most recently Abigail Fisher’s suit against the University of Texas, feed the myth of unqualified minorities taking a valuable resource — a college education — away from deserving whites.\n\nIn order to make that plausible, Ms. Fisher and her lawyers had to ignore the large number of whites who were admitted to the university with scores lower than hers. And they had to ignore the sizable number of blacks and Latinos who were denied admission although their SAT scores and grade point averages were higher than hers. They also had to ignore Texas’ unsavory racial history and its impact. The Brown decision came down in 1954, yet the Dallas public school system remained under a federal desegregation order from 1971 to 2003.\n\nThe university was slow to end its whites-only admissions policy, and its practice of automatically admitting the top 10 percent of each Texas public high school’s graduating class has actually led to an overrepresentation of whites. Meanwhile, African-Americans represent only 4 percent of the University of Texas student body, despite making up about 14 percent of the state’s graduating high school students.\n\nAlthough you will never hear this from Mr. Sessions, men are the greatest beneficiaries of affirmative action in college admissions: Their combination of test scores, grades and achievements is simply no match for that of women, whose academic profiles are much stronger. Yet to provide some semblance of gender balance on campuses, admissions directors have to dig down deep into the applicant pool to cobble together enough males to form an incoming class.\n\nAdvertisement Continue reading the main story\n\nPart of what has been essential in this narrative of affirmative action as theft of white resources — my college acceptance, my job — is the notion of “merit,” where whites have it but others don’t. When California banned affirmative action in college admissions and relied solely on standardized test scores and grades as the definition of “qualified,” black and Latino enrollments plummeted. Whites, however, were not the beneficiaries of this “merit-based” system. Instead, Asian enrollments soared and with that came white resentment at both “the hordes of Asians” at places like the University of California, Los Angeles, and an admissions process that stressed grades over other criteria.\n\nThat white resentment simply found a new target for its ire is no coincidence; white identity is often defined by its sense of being ever under attack, with the system stacked against it. That’s why Mr. Trump’s policies are not aimed at ameliorating white resentment, but deepening it. His agenda is not, fundamentally, about creating jobs or protecting programs that benefit everyone, including whites; it’s about creating purported enemies and then attacking them.\n\nIn the end, white resentment is so myopic and selfish that it cannot see that when the larger nation is thriving, whites are, too. Instead, it favors policies and politicians that may make America white again, but also hobbled and weakened, a nation that has squandered its greatest assets — its people and its democracy.", "authors": ["Carol Anderson"], "publish_date": "2017-08-05", "source": "nytimes", "top_words": ["resentment", "latinos", "college", "policies", "university", "whites", "scores", "texas", "admissions", "white", "mr"], "summary": "Instead, Asian enrollments soared and with that came white resentment at both “the hordes of Asians” at places like the University of California, Los Angeles, and an admissions process that stressed grades over other criteria.\nThat white resentment simply found a new target for its ire is no coincidence; white identity is often defined by its sense of being ever under attack, with the system stacked against it.\nThat’s why Mr. Trump’s policies are not aimed at ameliorating white resentment, but deepening it.\nIn the end, white resentment is so myopic and selfish that it cannot see that when the larger nation is thriving, whites are, too.\nInstead, it favors policies and politicians that may make America white again, but also hobbled and weakened, a nation that has squandered its greatest assets — its people and its democracy."}