{"url": "https://www.nytimes.com/2017/07/05/magazine/all-the-presidents-lawyers.html?mcubz=0", "id": "414", "title": "All the President’s Lawyers", "text": "I had come to Goldberg’s apartment, with its sweeping views, gold-­framed paintings and ‘‘Harvard’’-­embroidered throw pillows, to get a closer look at a species that is rapidly proliferating in Washington: the Trump Lawyer. Reality-­bending litigators who favor bold claims over careful persuasion, Trump Lawyers enabled — and in many ways, defined — Trump’s surreal New York rise. Now, operating in a new and hostile environment, it’s up to them to prevent his fall.\n\nTrump’s entire career has effectively been one long legal entanglement. He filed his first major lawsuit more than 40 years ago, and it was, in fact, a countersuit. The government sued him for housing discrimination; he sued the government back for $100 million, charging defamation. (The countersuit, which Trump announced at a news conference, was dismissed, and Trump eventually signed a consent decree in which he agreed to take various steps to desegregate his properties.) Thousands of legal actions followed. Before the election, USA Today tallied up all the lawsuits that Trump and his companies were involved in over just the last 30 years. The final count was 4,095. ‘‘Does anyone know more about litigation than Trump?’’ Trump said of himself at a campaign rally in January 2016. ‘‘I’m like a Ph.D. in litigation.’’\n\nBut it’s the lawyers who get the work done, and Trump has an eye for a particular kind of talent. Goldberg led me to his dining-­room table and told me about his first encounter with Trump. It happened on Valentine’s Day in 1990. As Goldberg tells the story, he was in Greenwich Village shopping for a negligee for his wife when his pager went off. He found a pay phone and called his secretary: Donald Trump wanted to see him as soon as possible. They met that very afternoon.\n\nAdvertisement Continue reading the main story\n\nAt the time, Trump was wading into what was, at least until recently, the biggest legal battle of his life: his divorce from his first wife, Ivana. ‘‘Lawyers were making journeys to Mr. Trump’s office to represent him for nothing, just for the publicity,’’ Goldberg told me. He said he tried to talk Trump out of giving him the job: ‘‘I didn’t know the first thing about matrimonial law.’’ But Trump, who had noticed a short profile of Goldberg as part of a feature in 7 Days magazine titled ‘‘Courtroom Killers,’’ wouldn’t take no for an answer. He had found his guy.\n\nGoldberg was a tabloid celebrity in his own right, one who had defended high-­profile figures like Matthew (Matty the Horse) Ianniello, who ran what prosecutors called a ‘‘smut cartel’’ of topless bars and pornography shops in Manhattan; the gangster Meyer Lansky, who inspired, among other cinematic figures, the character of Hyman Roth in ‘‘The Godfather, Part II’’; and Bess Myerson, the former Miss America and New York City commissioner accused of conspiring to bribe a judge to reduce her boyfriend’s alimony payments. (She was later acquitted.) Goldberg leapt right into the Trump divorce, posing on the courthouse steps in Downtown Manhattan with a giant placard of a check signed by Donald to Ivana for $10 million: the amount Trump had offered her to settle the case. (The final number was $14 million.) At another point in the proceedings, the New York Post gossip columnist Cindy Adams reported that Goldberg had described himself as a ‘‘killer’’ who could ‘‘rip skin off a body.’’ Numerous cases followed, including Trump’s next divorce, from Marla Maples, and a nasty battle with the Las Vegas casino tycoon Steve Wynn (now a Trump friend and supporter).\n\nGoldberg interrupted our conversation to take a call, leaving me to thumb through a 1985 copy of House & Garden magazine that had been set out for me. It included a feature on a sumptuous Bridgehampton home he now owns, where an enormous interior brick chimney had been painted gold and where, Goldberg said, Trump had been a guest.\n\nWhen he returned, Goldberg told me that nothing compared to the rush of a criminal-­defense trial. There, before a rapt audience in a sanctum of justice, this Harvard-­trained lawyer from Brooklyn who spent his summers on the borscht belt could be at his most performative. ‘‘It’s theater in the courtroom,’’ he said. ‘‘It’s the only place where you get to emote and try to convince juries that black is white.’’\n\nFor all the uncertainty about what a Trump presidency would bring, one thing should have been clear from the start: It was going to involve a lot of lawyers.\n\nIn the most formal sense, Trump’s top lawyer is Donald McGahn, who parlayed his job as general counsel to the Trump campaign into the position of White House counsel. McGahn is the nephew of another Trump Lawyer, Patrick McGahn, known as Paddy. The well-­connected son of an Atlantic City saloonkeeper, Paddy controlled access to the city’s casinos and worked as a fixer for Trump for many years. So grateful was Trump to Paddy — until Trump sued him for overbilling, that is — that he named a bar in the Trump Taj Mahal casino Paddy’s Saloon.\n\nDonald McGahn’s client isn’t exactly the president, though; it’s the institution of the presidency. Trump’s conversations with McGahn about his personal legal affairs are not protected by attorney-­client privilege. For that, Trump would need outside counsel.\n\nEven before Trump took office, he asked Sheri Dillon, a partner at Morgan Lewis who handled his taxes, to deal with his financial disclosures. And as the investigation into Russian meddling in the 2016 election began to heat up, Trump called in further reinforcements, lawyers whose loyalty to him would not be divided. In May, he countered the appointment of Robert S. Mueller III as special investigator with the hiring of Marc Kasowitz, whose firm has handled everything from casino bankruptcies to libel suits for Trump. Kasowitz brought along one of his law-­firm partners, Michael Bowe, who made his name as a Wall Street litigator.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nIn June, Trump added Jay Sekulow to his team to advise on constitutional issues and to help with strategy and messaging. Sekulow is a well-known advocate for Christian causes who hosts a syndicated daily radio show and appears frequently on Fox News. (Sekulow’s own virtuousness has been called into question by a recent report in The Guardian that accused his Christian charity of paying $60 million to him and his family members since 2000; Sekulow’s spokesman said the charity has passed all I.R.S. audits.) To appease advisers who said he needed an experienced Washington defense lawyer, Trump added John Dowd, who oversaw Major League Baseball’s investigation into Pete Rose’s gambling. A former Marine Corps captain, Dowd had not softened with age. ‘‘This is the worst piece of whoring journalism I have read in a long time,’’ he once wrote to a Wall Street Journal reporter who was covering the insider-­trading case of one of his clients. And if he was going to be in a fight, Trump knew he needed his longtime personal attorney Michael Cohen, who has described Trump as his ‘‘patriarch.’’\n\nAdvertisement Continue reading the main story\n\nThey came from different places, but they were all Trump Lawyers, which is to say that they shared certain characteristics. Trump Lawyers seldom shape or massage their client’s rhetoric in the fashion of, say, President John F. Kennedy’s counselor, Ted Sorensen, who drafted the letter from Kennedy to Nikita Khrushchev that helped end the Cuban Missile Crisis. They bear no resemblance to David Kendall, the reserved Washington superlawyer who led the defense of President Bill Clinton during the Monica Lewinsky scandal. Trump Lawyers do not devote countless hours to construing the fine print of the law in a very particular way to prevent prosecution, as John Yoo, a lawyer in President George W. Bush’s Justice Department, did when he drafted the legal guidelines for the administration’s interrogation techniques.\n\nIndeed, Trump Lawyers don’t anticipate problems or take precautions at all. Trump Lawyers fight — occasionally in courtrooms, but mostly on TV. It didn’t matter that Kasowitz isn’t known for criminal defense — until recently, his claim to legal fame was that he negotiated the settlement that saved the maker of Chesterfield cigarettes from financial ruin — any more than it mattered that Goldberg had never handled a divorce. Like Trump, Trump Lawyers tend to have something of an attention-­grabbing rebellious streak: Sekulow, who grew up Jewish in Brooklyn, now identifies as a messianic Jew; he believes that Jesus is the messiah. Until recently, McGahn played guitar in a classic-­rock cover band. At the same time, Trump Lawyers embody the cliché of a certain type of litigator in much the same way that Trump’s properties embody the cliché of luxury. They are rainmakers; they are flamboyant; they are bare-­knuckled; they are hard-­charging.\n\nTrump Lawyers practice Trump Law. Trump Law is not about the merits of a case or even its resolution. It doesn’t matter if you’re threatening to sue, suing or being sued yourself. What matters is that you dominate, or be seen as dominating. In Trump Law, you can lose and still win, or at least declare victory, as Trump did after losing his defamation suit against the author Timothy O’Brien, claiming, falsely, that he had succeeded in his goal of costing O’Brien a lot of money. ‘‘Trump and Kasowitz saw our litigation as a form of guerrilla warfare, I think, and were less concerned about facts and the law,’’ says O’Brien, whose publisher covered all of his legal expenses. After the suit was filed, O’Brien realized that he had met Kasowitz before: The lawyer had been in the audience at one of his readings and told O’Brien afterward — elliptically at the time, ominously in retrospect — that they would be seeing each other again.\n\nTrump Law is theater. What matters most is showmanship. The proof that the president-­elect was relinquishing control of his companies before taking the oath of office was right there in the stacks of manila folders piled up beside him at the pre-­inauguration news conference inside Trump Tower. Don Jr. and Eric Trump, who would be taking over the Trump Organization, watched solemnly as Sheri Dillon gestured at the files, explaining that they contained just some of the paperwork that would ensure that President Trump would be completely isolated from the businesses. Were the pages inside actually blank? In the world of Trump Law, that’s irrelevant.\n\n‘‘One of the things you discover about being president,’’ President Barack Obama said during a lengthy news conference several days after the 2016 election, ‘‘is that there are all these rules and norms and laws, and you’ve got to pay attention to them. And the people who work for you are also subject to those rules and norms, and that’s a piece of advice that I gave to the incoming president.’’ In terms of ethics, he said: ‘‘I will put this administration against any administration in history. And the reason is because, frankly, we listened to the lawyers. We had a strong White House Counsel’s Office. We had a strong ethics office. We had people in every agency whose job it was to remind people: This is how you’re supposed to do things.’’\n\nTrump Law does not concern itself with how you’re supposed to do things. ‘‘Donald would say, ‘I hate lawyers who tell me that I can’t do this or that,’ ’’ Goldberg told me. And so Trump Lawyers don’t. It was an arrangement that worked for Trump and his legal teams for years. And so it continues in Washington. Under Trump Law, it is perfectly fine for the president of China to stay as a guest at Mar-­a-­Lago, for the lobbying arm of the Saudi government to spend hundreds of thousands of dollars at Trump’s Washington hotel, for Trump to have a private dinner with the director of the F.B.I., James Comey, even as his agency was investigating Trump’s campaign. Under Trump Law, it is O.K. for Trump not to divest himself of his assets or place them in a blind trust, and for the drafting and rollout of his Muslim travel ban to be overseen not by experienced government lawyers but by his 31-year-old senior adviser, Stephen Miller. Under Trump Law, Trump can appoint a national security adviser, Gen. Michael Flynn, who had worked secretly as a paid lobbyist for Turkey, and fire Comey, as he himself explained, to relieve the pressure of the Russia investigation.\n\nTaking Trump Law to the Oval Office has produced new and unfamiliar varieties of legal troubles. Trump’s Muslim ban is facing several constitutional challenges, and so is he, for multiple possible violations of the Emoluments Clause. Far from relieving the pressure of the Russia investigation, his firing of Comey prompted the appointment of a special counsel, who is also looking into whether Trump obstructed justice. Trump is barreling into these legal actions the same way he always has, publicly attacking not only his adversaries but also independent arbiters, calling defeats victories and staffing up with more and more Trump Lawyers.\n\nBut there may never be enough Trump Lawyers to get the job done. The work is hard, sometimes even humiliating. In fact, the one irreducible character trait of a Trump Lawyer is that he or she is willing to take on Trump as a client, one who often either doesn’t solicit their advice or simply ignores it; who subverts their legal strategy on national television; who requires them to deny facts that he has confirmed and confirm facts that he has denied; who won’t stop tweeting inflammatory, threatening and clearly false statements. It’s a lot to ask of a professional. As Robert Luskin, a veteran Washington lawyer who represented Karl Rove in the Valerie Plame investigation, explains: ‘‘There are folks who come to you because you have a certain expertise and folks who come to you because they have already figured out what they want and need, and they want to use you as a dinner fork.’’\n\nAdvertisement Continue reading the main story\n\nWashington lawyers have defended spies, embezzlers, strongmen, torturers. But the prospect of defending Trump has apparently given them pause. Brendan Sullivan of Williams & Connolly, who represented Oliver North, and Ted Olson of Gibson, Dunn, who represented the Israeli spy Jonathan Pollard, are among the veterans of Washington scandals who have reportedly rejected overtures to join Trump’s legal defense team.\n\nGoldberg, too, has been approached about taking on a role on the team. When we met, he had just returned from Washington, where he consulted with a lawyer in the White House Counsel’s Office on some of the legal questions surrounding obstruction of justice. This is a field in which Goldberg has some experience. In 1970, he defended Lansky’s muscle, Vincent (Jimmy Blue Eyes) Alo (the character Johnny Ola in ‘‘The Godfather, Part II’’), against charges that he had interfered with an S.E.C. investigation into stock fraud.\n\n‘‘He asked me whether I would be interested or involved in a major way,’’ Goldberg said of the White House lawyer he met with, before quickly telling me to forget he had even mentioned the subject. ‘‘I went not of my own accord. I’ll leave it that way. I shouldn’t say any more.’’\n\nI asked Goldberg if he was considering accepting the lawyer’s invitation. He was not. ‘‘Why would I run down there to be with those animals?’’ he said. ‘‘Because they’re animals, that’s what they are.’’ To the Trump Lawyer, the problem could never be Trump: That’s the first rule of Trump Law. Instead, Goldberg had his own explanation for Trump’s current legal difficulties: ‘‘He’s trying to break in a new pair of shoes, and they won’t let him.’’", "authors": ["Jonathan Mahler"], "publish_date": "2017-07-05", "source": "nytimes", "top_words": ["lawyers", "trump", "office", "washington", "lawyer", "goldberg", "trumps", "president", "presidents", "law", "legal"], "summary": "Reality-­bending litigators who favor bold claims over careful persuasion, Trump Lawyers enabled — and in many ways, defined — Trump’s surreal New York rise.\n‘‘Does anyone know more about litigation than Trump?’’ Trump said of himself at a campaign rally in January 2016.\n‘‘Lawyers were making journeys to Mr. Trump’s office to represent him for nothing, just for the publicity,’’ Goldberg told me.\nLike Trump, Trump Lawyers tend to have something of an attention-­grabbing rebellious streak: Sekulow, who grew up Jewish in Brooklyn, now identifies as a messianic Jew; he believes that Jesus is the messiah.\nTrump Lawyers practice Trump Law."}