{"url": "https://www.nytimes.com/2017/08/24/us/politics/trump-white-house-kelly-memos.html?mcubz=0", "id": "433", "title": "John Kelly’s Latest Mission: Controlling the Information Flow to Trump", "text": "Mr. Kelly’s predecessor, Reince Priebus, sent some similar guidelines around early in the administration, according to two officials, but they were never taken seriously. Mr. Kelly, a retired Marine general, has been treated with a different level of deference inside the building, those aides said. Staff members discovered early on that they could defy Mr. Priebus, the officials said, but crossing a Marine is a different matter.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Race/Related Newsletter Join a deep and provocative exploration of race with a diverse group of New York Times journalists. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. Kelly has made clear that one thing he will not seek to directly control is the behavior of the president, and there is a good reason for that.\n\nMr. Trump has a history of lashing out at advisers who have publicly conveyed their attempts to impose tighter procedures on him. Just before Election Day, for example, Mr. Trump blew up publicly after a New York Times report that his aides had succeeded in keeping him off Twitter for the final stages of the campaign. He tweeted several times to enforce the point.\n\nDespite Mr. Kelly’s fairly deft touch at approaching the president, Mr. Trump has shown signs of rebelling after stories have appeared describing how his chief of staff has put tighter controls in place and is imposing some discipline on White House operations. That included his news conference at Trump Tower in which he doubled down on his blame for “both sides” in the racially charged violence in Charlottesville, Va., and his campaign rally speech in Arizona on Tuesday when he accused the news media of mischaracterizing his statements.\n\nMr. Kelly had urged Mr. Trump to deliver a more somber, traditional statement the day before. And he and other advisers had urged the president to avoid taking questions from the news media at Trump Tower, a request that the president ignored. Before Mr. Trump’s rally in Arizona, aides prepared a sober set of remarks for him to deliver about unity, and sought to redirect his focus after he learned of a Times report about his relationship with Mitch McConnell, the Senate majority leader. Mr. Trump, who trusts few people and adjusts to new advisers gradually, railed at his new chief of staff over the story, according to one person close to the president.\n\nStill, the memos have brought comfort to a number of Mr. Trump’s advisers who have sought structure in a Wild West environment. And they have provided guardrails where few existed.\n\n“General Kelly is instilling processes to ensure that the president has the information and analysis he needs to make decisions,” said Sarah Huckabee Sanders, the White House press secretary.\n\nAdvertisement Continue reading the main story\n\nThe memos were follow-ups to themes that Mr. Kelly touched on during a conference call with senior staff members in which he went through a menu of items related to how the president receives information, how he makes decisions, how meetings with him are scheduled, and how speeches are scheduled and written.\n\nPhoto\n\nThe effect so far has been, at times, a more pronounced split-screen between the president’s public behavior and his staff’s more structured approach. But inside the West Wing, several aides said they felt more protected by an established process.\n\nIn one of the memos, White House aides were told that all materials prepared for the president must go first to Mr. Porter for vetting and clearance. Then Mr. Kelly must sign off on them before they go to Mr. Trump’s desk. That includes news articles, according to West Wing officials who described the memos’ content — of particular importance, given the propensity for some of Mr. Trump’s staff to slip him news accounts from dubious sources that shape his thinking or prompt him to cite unreliable or inaccurate information.\n\nThe process for documents with legal implications is somewhat more rigorous, although a version of it has been in place since Mr. Priebus was chief of staff.\n\nFor instance, the draft of an executive order will go through several stages of development, involving the White House Counsel’s Office and vetting by relevant staff and agency officials. Then it will go to Mr. Kelly for final approval before it is given to the president.\n\nMr. Priebus had tried to take firmer control of that process after Mr. Trump’s first week in office, when Stephen K. Bannon, the recently departed chief strategist, and Stephen Miller, the president’s senior policy adviser, pushed across the president’s desk two orders redesigning the National Security Council, and putting in place the first, court-contested travel ban on seven predominantly Muslim countries.\n\nIn the second memo, Mr. Kelly and Mr. Porter set up a system for deciding policy issues that have a legal aspect, such as executive orders, to ensure that all sides of the issue are heard. Any decision made in a meeting will be formalized in a memo that has to go through Mr. Porter and then Mr. Kelly for final sign-off.\n\nThat process is expected to curtail freelancing and hijacking of decisions by West Wing aides. Mr. Bannon was often accused of taking advantage of the loose process, but Mr. Trump’s son-in-law, Jared Kushner, and his daughter, Ivanka Trump, who both work in the West Wing, have also frustrated their colleagues for months by going directly to the president on specific issues.\n\nVideo\n\nOn Mr. Kelly’s first day on the job, he held a small meeting with top aides to the president after a fuller staff meeting. He told them that Oval Office access to Mr. Trump, which was once nearly universal to people coming through the West Wing, would be strictly limited to appointments only.\n\nAdvertisement Continue reading the main story\n\nThe exceptions, Mr. Kelly said, were the president’s wife and his 11-year-old son. And, he added, turning to Ivanka Trump, who was seated near him, the president’s eldest daughter, if she was speaking to him as a daughter and not a member of his staff. Mr. Kushner and Ms. Trump quickly gave in to Mr. Kelly’s new system, two White House officials said.\n\nSince Mr. Trump returned from a working vacation at his golf club in New Jersey, the newly renovated West Wing has taken on a more formal air. Not only is the door to the Oval Office closed, preventing passers-by from catching the president’s eye, but a corridor door leading to the president’s office has also been kept closed.\n\nMr. Trump, who often complained about Mr. Priebus, appears to have absorbed the need for one person to run the staff. The changes Mr. Kelly has put in place have resulted in a more streamlined, functional government, administration officials said.\n\nBut Mr. Trump, presidential experts say, has shown he is immune to efforts to bring lasting change to his own behavior. And that could ultimately undermine Mr. Kelly’s mission.\n\n“Let’s assume for the moment that Trump has learned the first big lesson of his first six months, which is that you have to empower the White House chief of staff to be a real gatekeeper,” said Chris Whipple, author of “The Gatekeepers: How the White House Chiefs of Staff Define Every Presidency.”\n\n“What he hasn’t learned, what he has shown no sign of learning, is that governing is completely different from campaigning,” Mr. Whipple said.", "authors": ["Maggie Haberman"], "publish_date": "2017-08-24", "source": "nytimes", "top_words": ["controlling", "john", "trump", "aides", "information", "mission", "house", "west", "flow", "staff", "kelly", "latest", "president", "white", "kellys", "mr", "presidents"], "summary": "Mr. Trump has a history of lashing out at advisers who have publicly conveyed their attempts to impose tighter procedures on him.\nMr. Kelly had urged Mr. Trump to deliver a more somber, traditional statement the day before.\nMr. Trump, who often complained about Mr. Priebus, appears to have absorbed the need for one person to run the staff.\nThe changes Mr. Kelly has put in place have resulted in a more streamlined, functional government, administration officials said.\nBut Mr. Trump, presidential experts say, has shown he is immune to efforts to bring lasting change to his own behavior."}