{"url": "https://www.nytimes.com/2016/10/26/nyregion/muslims-parents-donald-trump-staten-island.html?mcubz=0", "id": "41", "title": "‘I Had a Scary Dream About Donald Trump’: Muslim Parents Face a Tense Election", "text": "Ms. Elhamoui tells them the story of a terrifying night in Beirut when a bomb exploded across the street from her house. She was about 8 years old. The shrapnel hit her leg, leaving her with scars. It took years before she could sleep without holding somebody’s hand.\n\nAdvertisement Continue reading the main story\n\n“See, be thankful we brought you up here,” she said to her children on a recent afternoon, as she served them a Lebanese wheat dish called freekeh at their dining room table.\n\nThe Elcharfas’ home is dotted with references to Arab and Muslim culture. Their couches are gold-trimmed. A kitchen clock marks the Islamic call to prayer. Their children speak fluent Arabic and have taken Quran classes.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut they also could not be more stereotypically American. The four youngest children all attend public school. Abubeckr, 13, loves video games and dreams of playing in the N.B.A. Maaria puts on makeup in her pink-walled bedroom, and Zaynub, a gymnast, does flips in the kitchen, wearing a pink shirt that says, “Leave sparkles wherever you go.”\n\nMr. Elcharfa often tells his children they are American first, before they are Lebanese.\n\n“We tell them this is your country,” he said. “You’re lucky you’re born here.”\n\nBut sometimes, in school, classmates only see the children’s Muslim names and Arab heritage. In the hallways in Abubeckr’s school, boys will sometimes make sounds of bombs exploding and yell out “Allahu akbar” — Arabic for “God is great” — as he walks by. On the bus after school, a classmate once said to him, “You’re a terrorist, and your mom is a mastermind bomber.”\n\nHe told the principal the next day, but he did not tell his parents. He is used to the jeering at this point, Abubeckr said, and does not want his mother to “make it a bigger deal than it is.” His father has taught him to tell an adult, but not to react physically or verbally. “If you ignore it, it’s better,” Abubeckr said.\n\nBut Mr. Elcharfa sees the taunts taking a toll on his children. They frequently ask him not to speak in Arabic in front of their friends. After the explosion in the Chelsea neighborhood of Manhattan last month, his 15-year-old, Ismail, told him, “That’s your Islam, Baba.”\n\nAbubeckr, who was in Italian class when he heard the news, thought to himself, It was a Muslim, wasn’t it? “I was like, here we go again,” he said, recounting that day while sitting with his father in the family’s living room.\n\n“Why do you say a Muslim; why don’t you say a person?” Mr. Elcharfa asked his son.\n\nThese are the moments that worry Mr. Elcharfa and his wife. They fret that their children are starting to distance themselves from their religion and their culture. These are also the moments when the couple’s parenting styles clash.\n\nAdvertisement Continue reading the main story\n\nMr. Elcharfa wants his children to be freethinkers. He does not want them to be practicing Muslims simply because they inherited the religion from their parents. Sometimes, he said, he wishes their religion could be hidden from view. He said he felt pangs of regret for giving them Muslim names: “Why didn’t I name them Tony or George?”\n\nHis wife scoffs at such comments.", "authors": ["Samantha Schmidt"], "publish_date": "2016-10-26", "source": "nytimes", "top_words": ["main", "trump", "tell", "scary", "face", "election", "elcharfa", "donald", "youre", "religion", "parents", "school", "reading", "children", "muslim", "mr", "dream", "tense"], "summary": "Newsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box.\n“You’re lucky you’re born here.”But sometimes, in school, classmates only see the children’s Muslim names and Arab heritage.\nBut Mr. Elcharfa sees the taunts taking a toll on his children.\n“Why do you say a Muslim; why don’t you say a person?” Mr. Elcharfa asked his son.\nThese are the moments that worry Mr. Elcharfa and his wife."}