{"url": "https://www.nytimes.com/2016/11/14/us/politics/donald-trumps-long-to-do-list-for-day-1.html?mcubz=0", "id": "46", "title": "Donald Trump’s Long To-Do List for Day 1", "text": "Here is what Mr. Trump has said he will do:\n\nImmigration\n\nNowhere has Mr. Trump been more specific than in his desire to deal with immigration on his first day. During a campaign rally on Aug. 31 in Phoenix, he told the crowd that he would instruct his administration to begin deporting illegal immigrants with criminal records immediately.\n\nPhoto\n\n“We will begin moving them out, Day 1,” he said. “My first hour in office, those people are gone.”\n\nIn fact, immigration enforcement agents at the Department of Homeland Security are already under a mandate from Mr. Obama to deport criminals. The executive actions the president took in late 2014 order officials to focus on deporting “national security threats, convicted felons, gang members and illegal entrants apprehended at the border.”\n\nBut Mr. Trump does have wide latitude to direct an even more aggressive deportation effort, and he appears determined to do so quickly. He has said he will immediately end Mr. Obama’s program that protects undocumented immigrants who were brought to the United States as young children. But it is unclear whether Mr. Trump will seek to quickly deport the 700,000 or so people who signed up for the program, or merely refuse to accept new applicants.\n\nHe has said he also plans on Day 1 to suspend immigration from “terror-prone” countries, and to impose “extreme vetting” on others. And he has said he will immediately inform sanctuary cities — about two dozen American cities where officials have pledged not to prosecute people solely for being undocumented — that they will lose federal funding.\n\nEconomy and Trade\n\nMuch of Mr. Trump’s campaign was built on a promise to help struggling American workers who are frustrated by the loss of jobs, especially in the heartland.\n\nPhoto\n\nThe president-elect has said he intends to take several actions to pursue those policies on his first day, including announcing his intention to renegotiate or withdraw from the North American Free Trade Agreement and to stop pursuing adoption of the Trans-Pacific Partnership. Both actions are well within Mr. Trump’s powers as president.\n\nAdvertisement Continue reading the main story\n\nHe has promised to pick up the phone and order his Treasury secretary to label China a currency manipulator, and to tell his commerce secretary to begin identifying foreign trade abuses.\n\nHe has also said he will call chief executives of major companies who have announced plans to move jobs overseas to warn them that he will impose 35 percent tariffs if they proceed. That promise may be difficult to keep: Tariffs require congressional approval, and the Constitution bans the imposition of taxes or tariffs specifically aimed at a single company.\n\nThe Environment\n\nThe president-elect has taken direct aim at Mr. Obama’s actions on the environment and climate.\n\nPhoto\n\nMr. Trump has said that on his first day in office, he will lift Obama-era rules that restrict where oil drilling and other energy production are done, although Mr. Trump may find it harder to change those plans than he thinks. In July, for example, Mr. Obama’s administration issued regulations making it harder to drill for oil in the Arctic by requiring extensive plans for containing spills. Undoing final regulations like the Arctic drilling rules would require a long legal process.\n\nIt may be easier to reconsider Mr. Obama’s ruling against construction of the Keystone XL pipeline, which would bring petroleum from Canada’s oil sands to Gulf Coast refineries. Mr. Trump has said he will indicate on his first day his desire to approve the pipeline. And he has promised to call United Nations officials the same day to inform them he is canceling United States’ financial commitments to United Nations climate change programs.\n\nOther Day 1 Promises\n\nAt some point that day, Mr. Trump has said, he will convene a meeting of senior Pentagon officials to discuss the threat posed by the Islamic State and other terrorist groups. “I am also going to convene my top generals and give them a simple instruction: They will have 30 days to submit to the Oval Office a plan for defeating ISIS,” as the Islamic State is also known, Mr. Trump said in Greenville, N.C., during the campaign.\n\nPhoto\n\nThe president-elect has also promised to act to get rid of gun-free zones around schools and other facilities, a nod to Second Amendment supporters. “My first day, it gets signed, O.K.?” he said at a January rally. “My first day. There’s no more gun-free zones.”\n\nBut that may be a tough promise to keep. Gun-free zones are a result of a 1990 law proposed by Joseph R. Biden Jr., then a senator, and ending them would require legislation that Congress is unlikely to pass on Mr. Trump’s first day in office.\n\nIt will be easier to make good on his promises to attack corruption in Washington. He has said he will propose term limits for members of Congress, impose restrictions on the creation of new regulations, and limit the lobbying activities of White House and congressional officials after they leave office.", "authors": ["Michael D. Shear"], "publish_date": "2016-11-14", "source": "nytimes", "top_words": ["long", "list", "day", "trump", "plans", "office", "obamas", "officials", "donald", "united", "trumps", "actions", "todo", "mr"], "summary": "Here is what Mr. Trump has said he will do:ImmigrationNowhere has Mr. Trump been more specific than in his desire to deal with immigration on his first day.\nEconomy and TradeMuch of Mr. Trump’s campaign was built on a promise to help struggling American workers who are frustrated by the loss of jobs, especially in the heartland.\nThe EnvironmentThe president-elect has taken direct aim at Mr. Obama’s actions on the environment and climate.\nMr. Trump has said he will indicate on his first day his desire to approve the pipeline.\nOther Day 1 PromisesAt some point that day, Mr. Trump has said, he will convene a meeting of senior Pentagon officials to discuss the threat posed by the Islamic State and other terrorist groups."}