{"url": "https://www.nytimes.com/2017/07/06/opinion/gorsuch-trump-supreme-court.html?mcubz=0", "id": "417", "title": "Trump’s Life-Tenured Judicial Avatar", "text": "A majority of the Supreme Court agreed, overturning a contrary ruling by the Arkansas Supreme Court. Quoting from the decision that established the constitutional right to same-sex marriage — Obergefell v. Hodges, decided two years earlier to the day — the justices’ unsigned opinion declared that “the Constitution entitles same-sex couples to civil marriage ‘on the same terms and conditions as opposite-sex couples,’ ” and noted that the Obergefell decision itself named birth and death certificates as among the rights and benefits of marriage “to which same-sex couples, no less than opposite-sex couples, must have access.”\n\nMost often these days, the Supreme Court uses the device of the unsigned “per curiam” opinion, meaning “by the court,” when a lower court grants habeas corpus to a criminal defendant and a majority of justices finds the error so clear as to warrant summary reversal without the need for full briefing and argument. The decision in the Arkansas case was a per curiam ruling that Chief Justice Roberts, a vigorous dissenter from the Obergefell decision, may or may not have joined; as Joshua Matz pointed out on the Take Care blog, it’s not always the case that justices who dissent from an anonymous per curiam ruling identify themselves.\n\nThree dissenting justices did identify themselves: Justice Thomas, Justice Samuel A. Alito Jr. and Justice Gorsuch, who wrote for the three. What the majority found to have been obvious in the Obergefell decision — in which all current members of the court but Justice Gorsuch participated — he found lacking. “Nothing in Obergefell spoke (let alone clearly) to the question,” he wrote. The parenthetical “(let alone clearly)” either was or was not a sly dig at Justice Anthony M. Kennedy’s majority opinion in the marriage case: It has been widely criticized, and not only on the right, for grandiloquence that outstripped rigorous constitutional analysis. In any event, Justice Gorsuch’s five-paragraph opinion addressed itself solely to the way the court dealt with the Arkansas case. “It seems far from clear what here warrants the strong medicine of summary reversal,” he wrote.\n\nBy sticking to the procedural issue, his opinion skirted, albeit barely, a declaration of his own view of the merits. This raises the question: Why write at all? If he wasn’t willing to argue or even engage with the majority on the merits of what the right to same-sex marriage entails, why bother to dissent? It was, I think, an odd judicial game of show-and-don’t-tell, a way to demonstrate his alliance with the court’s right flank without speaking quotably to the hot-button social issue at hand.\n\nJustice Gorsuch showed no such diffidence in expressing his views on a case the court decided on the merits on the term’s last day: Trinity Lutheran Church v. Comer, in which the court held that a state could not make churches ineligible for certain public grant programs (in this instance, a grant for using recycled tires as playground surfaces). Justice Gorsuch joined the majority opinion by Chief Justice Roberts except for one important footnote that appeared to limit significantly the scope of the decision. The chief justice’s footnote said: “This case involves express discrimination based on religious identity with respect to playground resurfacing. We do not address religious uses of funding or other forms of discrimination.”\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut wait, Justice Gorsuch said in his separate opinion. “I worry,” he said, that “some might mistakenly read” the footnote “to suggest that only ‘playground resurfacing’ cases, or only those with some association with children’s safety or health, or perhaps some other social good we find sufficiently worthy, are governed by the legal rules recounted in and faithfully applied by the court’s opinion.” He continued, quoting a 2004 decision: “Such a reading would be unreasonable for our cases are ‘governed by general principles, rather than ad hoc improvisations.’ And the general principles here do not permit discrimination against religious exercise — whether on the playground or anywhere else.”\n\nThere’s little doubt that the chief justice inserted that footnote late in the decisional process to satisfy a demand by one or more members of his majority, most likely Justice Kagan, maybe Justice Kennedy. Assuming Justice Gorsuch realizes that compromises of this sort are the stuff of life on a multi-member court, did he really need to call the chief justice out on it with his patronizing public reminder about how the Supreme Court articulates “general principles”? Did he think the chief justice didn’t know that already? Or perhaps he just wanted to underscore the strong suggestion in his separate opinion that he interprets the First Amendment’s Free Exercise clause as the Supreme Court never has, to entitle churches to public money on the same basis as secular institutions, even if the money will be put directly to religious uses (read, parochial school support).\n\nAdvertisement Continue reading the main story\n\nJustice Ruth Bader Ginsburg was also on the receiving end of a public lecture by her new colleague. The case was a particularly obscure one, concerning how particular rulings of a federal agency are to be appealed by federal Civil Service employees. Six justices agreed with Justice Ginsburg that the proper venue was Federal District Court. That’s not precisely how the statute reads, Justice Ginsburg acknowledged, but it was “the more sensible reading” that avoided making courts wrestle with an “unworkable” distinction between the two types of cases at issue.\n\nOh, no, said Justice Gorsuch in dissent. “If a statute needs repair, there’s a constitutionally prescribed way to do it. It’s called legislation.” He went on: “To be sure, the demands of bicameralism and presentment are real and the process can be protracted. But the difficulty of making new laws isn’t some bug in the constitutional design: it’s the point of the design, the better to preserve liberty.”\n\nReally? The effort by seven Supreme Court justices to make sense of an impossibly complex statute rather than throw up their hands is a threat to “liberty”? Those same justices, including the chief justice of the United States, needed a lesson in how a bill becomes a law? This case, argued on the morning of April 17, happened to be the very first case Neil Gorsuch heard as a Supreme Court justice. He dominated the first half of the argument, pounding away at Christopher Landau, an experienced member of the Supreme Court bar who eventually won the case. “We’re not asking the court to break any new ground,” Mr. Landau said at one point. “No, just to continue to make it up,” was Justice Gorsuch’s response from the bench.\n\nJustice Thomas joined Justice Gorsuch’s dissenting opinion. And Justice Gorsuch joined an opinion by Justice Thomas, dissenting from the court’s refusal to hear a challenge to California’s restrictions on the concealed carrying of firearms. In their dissenting opinion, the two called “indefensible” the lower court’s decision to uphold the statute, and they said the Supreme Court’s failure to take up any gun cases for the past seven years was “inexcusable.”\n\nMore consequential was Justice Gorsuch’s vote with Justice Thomas’s separate opinion in dissent from the court’s interim ruling on the Trump administration’s Muslim travel ban. The majority, in an unsigned opinion, allowed the ban to apply for the time being only to people from the six affected Muslim-majority countries who lack a “bona fide connection” to the United States. Justices Thomas, Alito and Gorsuch would have lifted a lower court’s injunction in its entirety, permitting the travel ban to apply to all residents of the six countries.\n\nThe opinion that Justice Gorsuch signed contained an odd line: “I agree with the court’s implication that the government has made a strong showing that it is likely to succeed on the merits.” In fact, the implication from the majority’s refusal to leave the injunction in place only for those who were most unlikely to get visas to enter the United States even without the travel ban is exactly the opposite.\n\nAnd there was a further oddity. Typically when a dissenting opinion refers to something in the majority opinion, the dissenting justice includes a citation to the point at issue. But in the Thomas opinion, there was no citation to a place in the majority opinion where the pro-government “implication” could be found. Indeed, there could not have been a citation because there was no such implication. Although the majority opinion was unsigned, it’s safe to assume that Chief Justice Roberts joined it; certainly, he would have spoken if he thought the court was set on the wrong course.\n\nAfter the term ended, voices on the right predictably cheered Justice Gorsuch’s performance. “Gorsuch proves a solid conservative on court’s final day,” read a statement from the Committee for Justice, a strong supporter of his nomination. The right has reason to cheer, of course, but also reason to be wary when the new kid on the block overplays his hand. Early in Justice Antonin Scalia’s tenure, he lashed out at Justice Sandra Day O’Connor for refusing to join him in voting to overturn Roe v. Wade when the opportunity presented itself in the 1989 Webster case. In his opinion in that case, he called his senior colleague’s position “irrational” and said she “cannot be taken seriously.” If Justice Scalia thought that he would persuade Justice O’Connor by belittling her, he placed a bad bet; three years later, she voted with the 5 to 4 majority to uphold the right to abortion.\n\nAnd while liberals have every reason to gnash their teeth over the justice who holds the seat that should have been Merrick Garland’s, they can perhaps take some comfort in the unexpected daylight that has opened between him and two of the court’s other conservatives, Chief Justice Roberts and Justice Kennedy. My concern when Justice Gorsuch joined the court was how like Chief Justice Roberts he seemed in demeanor and professional trajectory. I could see him as a natural ally who would bolster the chief justice’s most conservative instincts. It now seems just as likely that Neil Gorsuch’s main effect on John Roberts will be to get on his nerves.", "authors": ["Linda Greenhouse"], "publish_date": "2017-07-06", "source": "nytimes", "top_words": ["avatar", "case", "courts", "judicial", "majority", "supreme", "court", "opinion", "trumps", "gorsuch", "chief", "justice", "lifetenured", "justices"], "summary": "A majority of the Supreme Court agreed, overturning a contrary ruling by the Arkansas Supreme Court.\nThree dissenting justices did identify themselves: Justice Thomas, Justice Samuel A. Alito Jr. and Justice Gorsuch, who wrote for the three.\nJustice Gorsuch joined the majority opinion by Chief Justice Roberts except for one important footnote that appeared to limit significantly the scope of the decision.\nMy concern when Justice Gorsuch joined the court was how like Chief Justice Roberts he seemed in demeanor and professional trajectory.\nI could see him as a natural ally who would bolster the chief justice’s most conservative instincts."}