{"url": "https://www.nytimes.com/2017/08/17/us/politics/trump-tweet-pershing-fact-check.html?mcubz=0", "id": "428", "title": "Study Pershing, Trump Said. But the Story Doesn’t Add Up.", "text": "Photo\n\nWithin hours of the rampage in Barcelona on Thursday, President Trump urged those who seek to combat terrorism to “study what General Pershing of the United States did to terrorists when caught.”\n\n“There was no more Radical Islamic Terror for 35 years!” he added in his Twitter post.\n\nThe White House did not respond to a request to clarify what should be studied. However, Mr. Trump has previously referred to a long-debunked fable about how Gen. John J. “Black Jack” Pershing crushed a rebellion in the predominantly Muslim Moro Province of the Philippines after the Spanish-American War.\n\nDuring a February 2016 campaign stop in South Carolina, Mr. Trump claimed that Pershing captured “50 terrorists” and shot all but one with bullets smeared in pig’s blood.\n\nThe survivor was ordered to spread the tale of the episode, Mr. Trump said, “And for 25 years, there wasn’t a problem.” (Mr. Trump’s tweet on Thursday added 10 years to this alleged peace.)\n\nAdvertisement Continue reading the main story\n\nVarious versions of this myth began circulating around the time of the Sept. 11, 2001, attacks, often in email chains and on discussion boards online.", "authors": ["Linda Qiu"], "publish_date": "2017-08-17", "source": "nytimes", "top_words": ["warduring", "added", "wasnt", "trump", "versions", "urged", "doesnt", "terrorists", "study", "white", "mr", "add", "pershing"], "summary": "PhotoWithin hours of the rampage in Barcelona on Thursday, President Trump urged those who seek to combat terrorism to “study what General Pershing of the United States did to terrorists when caught.”“There was no more Radical Islamic Terror for 35 years!” he added in his Twitter post.\nHowever, Mr. Trump has previously referred to a long-debunked fable about how Gen. John J.\n“Black Jack” Pershing crushed a rebellion in the predominantly Muslim Moro Province of the Philippines after the Spanish-American War.\nDuring a February 2016 campaign stop in South Carolina, Mr. Trump claimed that Pershing captured “50 terrorists” and shot all but one with bullets smeared in pig’s blood.\nThe survivor was ordered to spread the tale of the episode, Mr. Trump said, “And for 25 years, there wasn’t a problem.” (Mr. Trump’s tweet on Thursday added 10 years to this alleged peace.)"}