{"url": "https://www.nytimes.com/interactive/2017/01/30/us/politics/trump-immigration-ban-demographics.html?mcubz=0", "id": "460", "title": "Immigrants From Banned Nations: Educated, Mostly Citizens and Found in Every State", "text": "Immigration from the seven countries targeted by President Trump has been going on for decades but has never been much more than a trickle. Altogether, immigrants and visitors from those countries are about 2 percent of all foreign-born people living in the United States.\n\nEurope ASIA Iran Syria Libya Iraq Yemen Sudan Somalia AFRICA Syria Iran Libya Iraq Yemen Sudan Somalia\n\nMost of these people are naturalized citizens and are not directly affected by the ban. But the status of tens of thousands of those with permanent resident status is not as clear, as administration officials have said they may be subject to greater scrutiny if they travel abroad.\n\nAnd visa holders may not be able to return to the United States if they go out of the country.\n\nHere’s a look at who these people are and how they have settled in the United States.\n\nMany Have College Degrees\n\nAs a whole, residents from the seven predominantly Muslim countries, especially Iranians and the small group of Libyans, are better educated than the rest of America. People from Syria and Sudan also tend to be better educated than the national average.\n\nCountry Less than high school High school/some college Bachelor’s degree Advanced degree Iran 10 % 36 % 27 % 27 % Iraq 26 % 43 % 21 % 0 9 % Libya 10 % 31 % 32 % 27 % Somalia 40 % 49 % 0 9 % 0 3 % Sudan 17 % 46 % 22 % 14 % Syria 24 % 38 % 19 % 18 % Yemen 46 % 41 % 0 8 % 0 4 %\n\nPercentage with a bachelor’s degree or higher 0 20 40 60 80 100% U.S. average Iran Iraq Libya Somalia Sudan Syria Yemen 20 40 60 80 100%\n\nSome Have Prospered\n\nResidents from Iran, Syria and Libya, who are more likely than the population as a whole to be managers, engineers and teachers, make close to or above the median income for the entire American population.\n\nSomalis and Sudanese are overrepresented in blue-collar jobs in manufacturing and transportation, and make less. The median income of Somalis is less than half the United States average.\n\nIran Iraq Libya U.S. median: $54,645 Somalia Sudan Syria Yemen 20,000 40,000 $60,000 Iran Iraq Libya U.S. median: $54,645 Somalia Sudan Syria Yemen 20,000 40,000 $60,000\n\nIraqis, Somalis and Sudanese Are More Recent Arrivals\n\nThe pattern is roughly commensurate with how long immigrant communities have been in the United States, with nearly half of Iranians moving there before 1990. Nearly two-thirds of Iraqis, Somalis and Sudanese have arrived since 2000.\n\nIran Iraq Libya Somalia Sudan Syria Yemen 100,000 75,000 50,000 25,000 80 90 00 Before 1980s 2010 or later Iran Iraq Libya Somalia 100,000 75,000 50,000 25,000 80 90 00 Before 1980s 2010 or later Sudan Syria Yemen 50,000 25,000 Libya Iran Iraq 100 In thousands 75 50 25 80 90 00 Before 1980s 2010 or later Somalia Syria Sudan 50 25 Yemen 50 25 Iran Iraq Somalia Syria Yemen Libya Sudan 100,000 75,000 50,000 25,000 80 90 00 Before 1980s 2010 or later\n\nMost Are Now Citizens\n\nMost United States residents from these seven countries have become citizens, a rate higher than that of the foreign-born population in the country as a whole. A small number, about 10,000, have served in the American military.\n\nIran All foreign-born residents: 46.6% Iraq Libya Somalia Sudan Syria Yemen 20 40 60 80 100% naturalized Iran Iraq All foreign-born residents: 46.6% naturalized Libya Somalia Sudan Syria Yemen 20 40 60 80 100%\n\nThey Have Settled in Every State\n\nSouthern California has absorbed the largest number of residents from these countries, followed by the Detroit area – both places with substantial Arab and Muslim communities. But some of the groups, especially the large contingent of Somalis, are widely dispersed.\n\nMain areas where residents from each group live\n\nSomalis Population: 83,843 Iranians Population: 383,527\n\nHundreds of thousands of Iranians live in suburbs north of Los Angeles, areas that have also drawn many Iraqis, Syrians and Yemenis.\n\nIraqis Population: 199,380 Syrians Population: 84,035 Yemenis Population: 50,501\n\nThousands of Iraqis and Yemenis have settled in the Detroit area. A large contingent of Syrians lives in Brooklyn, but they have also settled in Burbank and Glendale, Calif., and the Detroit area.\n\nSudanese Population: 40,663 Libyans Population: 14,505\n\nSomalis and Sudanese have settled in a very different pattern, and tend to be more isolated. Minneapolis has the most Somali-born residents, but Columbus, Ohio, and Seattle also have significant communities. Des Moines has a large number of Sudanese residents, who are also numerous in Texas and Virginia.\n\nThree Were Involved in Attacks\n\nOf the more than 856,000 immigrants, visa holders and green-card holders originally from the countries affected by the ban, just three are known to have carried out violent attacks inside the United States since Sept. 11, 2001, according to David Sterman, an analyst at the New America think tank who maintains a database of terrorist attacks in the United States.\n\nOne of the attackers was born in Iran and was a naturalized citizen when he drove his S.U.V. into a crowd at the University of North Carolina at Chapel Hill in 2006.\n\nThe two others were born in Somalia and entered the United States as refugees. One of them stabbed at least 10 people in a mall in Minnesota. The other rammed a car into pedestrians on a sidewalk and stabbed students at the campus of Ohio State University. Both attacks occurred in 2016.", "authors": ["Ford Fessenden", "Jasmine C. Lee", "Sergio Peçanha", "Anjali Singhvi"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["iran", "residents", "citizens", "immigrants", "yemen", "state", "libya", "somalia", "iraq", "united", "syria", "banned", "nations", "population", "sudan", "educated"], "summary": "Altogether, immigrants and visitors from those countries are about 2 percent of all foreign-born people living in the United States.\nEurope ASIA Iran Syria Libya Iraq Yemen Sudan Somalia AFRICA Syria Iran Libya Iraq Yemen Sudan SomaliaMost of these people are naturalized citizens and are not directly affected by the ban.\nPeople from Syria and Sudan also tend to be better educated than the national average.\nIraqis Population: 199,380 Syrians Population: 84,035 Yemenis Population: 50,501Thousands of Iraqis and Yemenis have settled in the Detroit area.\nThe other rammed a car into pedestrians on a sidewalk and stabbed students at the campus of Ohio State University."}