{"url": "https://www.nytimes.com/2017/06/27/opinion/your-travel-ban-isnt-safe-yet-mr-trump.html?mcubz=0", "id": "404", "title": "Your Travel Ban Isn’t Safe Yet, Mr. Trump", "text": "Photo\n\nYesterday President Trump tweeted that he was “grateful” for the Supreme Court’s unanimous opinion on his travel ban, which allowed some of it to stand pending the court’s review this fall. But he shouldn’t celebrate just yet: The decision is a loss, not a win, a distinction totally lost on our rapid-fire media.\n\nRead carefully, the opinion makes it clear that most of the Supreme Court justices think Mr. Trump’s executive order, which restricts travel from six Muslim-majority countries, is likely to be struck down if the court hears the case in the fall, as scheduled.\n\nFor the past six months, Mr. Trump’s ban has been on hold, battered repeatedly in a series of lawsuits. The Fourth Circuit Court of Appeals ruled that the ban likely violates the Constitution’s prohibition on favoring or disfavoring certain religions (the Establishment Clause), while the Ninth Circuit held that the ban likely violates an immigration law that prohibits “discriminating on the basis of nationality.” Both courts ruled that the ban should be suspended in its entirety.\n\nMr. Trump is partly correct that the Supreme Court yesterday reached a different conclusion from those of the lower courts. Pending a full review in the fall, it left part of the ban in place, but only for people outside the United States who lack a relationship — family, educational or business ties — inside the country.\n\nAdvertisement Continue reading the main story\n\nThe Supreme Court’s decisions are sometimes opaque, and in this opinion, there is more than meets the eye. The court made it clear that the Fourth and Ninth Circuits were correct to suspend the ban for those nationals who have “bona fide” relationships here in the country. That is a long list: families, university students and professors, business owners and partners. In drawing that line, the Supreme Court handed a major victory to the plaintiffs who brought these cases — people with families affected by the ban and the Hawaii attorney general, who sued, in part, on behalf of the state’s university and its students.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut the real blow to the administration is hiding between the lines. Already, the court’s logic suggests that it is strongly leaning toward striking down much of the ban when it hears oral argument this October. To enjoin an executive order — as the Fourth and Ninth Circuits did — a court must be convinced that the policy has a “substantial likelihood” of being illegal. By keeping some of the injunctions against the travel ban in place pending the oral arguments scheduled for the fall, the Supreme Court was indicating that it agreed with the lower courts: The justices would not have kept the lower court’s injunctions against the ban at all unless they agreed that the ban, at least in part, was likely to be found illegal.", "authors": ["Corey Brettschneider"], "publish_date": "2017-06-27", "source": "nytimes", "top_words": ["likely", "travel", "courts", "trump", "ban", "supreme", "court", "opinion", "fall", "sign", "safe", "mr", "isnt", "pending"], "summary": "PhotoYesterday President Trump tweeted that he was “grateful” for the Supreme Court’s unanimous opinion on his travel ban, which allowed some of it to stand pending the court’s review this fall.\nFor the past six months, Mr. Trump’s ban has been on hold, battered repeatedly in a series of lawsuits.\nMr. Trump is partly correct that the Supreme Court yesterday reached a different conclusion from those of the lower courts.\nAdvertisement Continue reading the main storyThe Supreme Court’s decisions are sometimes opaque, and in this opinion, there is more than meets the eye.\nAlready, the court’s logic suggests that it is strongly leaning toward striking down much of the ban when it hears oral argument this October."}