{"url": "https://www.nytimes.com/2017/07/04/us/iraqi-christians-deport.html?mcubz=0", "id": "412", "title": "After Backing Trump, Christians Who Fled Iraq Fall Into His Dragnet", "text": "“Christians in the Middle East have been executed in large numbers. We cannot allow this horror to continue!” Mr. Trump said on Twitter in January, returning to a campaign-trail refrain that had captured Chaldean hearts and ballots across this stretch of Macomb and Oakland Counties. As the Chaldeans like to say, once with pride, now with fury, the area helped tip Michigan to Mr. Trump in November.\n\nSoon after the June 11 immigration raids, a local Chaldean noted the disconnect between tweet and deed. “Then why are you deporting them?” he wrote on Twitter, bracketing the question with a snarl of English, Aramaic and Arabic that would be unprintable in any language.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Race/Related Newsletter Join a deep and provocative exploration of race with a diverse group of New York Times journalists. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“Everyone thought this could not apply to us,” said Nadine Yousif, a lawyer with CODE Legal Aid, a local organization coordinating the community’s response to the raids.\n\nThe immigration authorities give the same explanation they have given for the arrests of tens of thousands of Latinos and other immigrants without legal status since Mr. Trump took office: These people, too, are what the government refers to as “criminal aliens.”\n\nThough most of them came here legally, as refugees or through relatives who were American citizens, their green cards were revoked after criminal convictions on charges including theft, drug possession, rape and murder.\n\n“The operation in this region was specifically conducted to address the very real public safety threat represented by the criminal aliens arrested,” said Rebecca Adducci, an Immigration and Customs Enforcement official in Detroit.\n\nThe men had been allowed to stay, in some cases for decades, because the Iraqi government had refused to issue travel documents for them to return.\n\nAdvertisement Continue reading the main story\n\nThat changed in March, when Iraq agreed to begin accepting deportees in exchange for being dropped from the list of countries affected by Mr. Trump’s revised travel ban, which barred citizens of several predominantly Muslim countries from entering the United States.\n\nPhoto\n\nMr. Trump “broke his promise,” said Nahrain Hamama, 54, whose husband has been detained.\n\nIf the administration reverses course, however, “then I would consider voting for him again,” she added.\n\nBesides the 114 Iraqis arrested around Detroit, immigration agents have also picked up 85 Iraqis in other parts of the country since May, including Shiite Muslims and members of other religious and ethnic groups, such as Kurds and Yazidis.\n\nA federal judge in Michigan last week blocked the government from deporting any of them for two weeks while he weighs whether he has the authority to hear their immigration cases.\n\nThe Iraqis argue that near-certain torture or even death awaits them in Iraq, where the Islamic State has targeted Christians, Shiites and other religious groups. Arabic-language news channels and social media regularly bring word of ancestral villages razed, Christian cemeteries shattered and Chaldean churches shuttered. Though their villages were recently liberated, most Christians have stayed away out of fear, taking refuge in Iraqi Kurdistan.\n\nChaldeans, who practice Eastern Rite Catholicism, descend from the ancient Assyrians of what is now northern Iraq, where they are increasingly rare. Since 2007, nearly 30,000 Chaldeans have poured into the Detroit area, following waves of Iraqi Christian arrivals that began early in the last century and intensified after Saddam Hussein came to power in 1979. The number of Christians in Iraq has tumbled from about 1.4 million in 1987 to an estimated 250,000 last year, leaders of the community in the Detroit area said.\n\nMany of the Michigan Chaldeans speak little or no Arabic. Tattoos of the Virgin Mary and crosses stipple their shoulders and wrists.\n\n“The second they step foot out of the airport,” after deportation to Iraq, “they’re targets,” said Wisam Naoum, a lawyer turned community activist.\n\nPhoto\n\nChaldeans had written off the Obama administration because of what they saw as its failure to accept more Iraqi Christian refugees. But Mr. Trump’s original travel ban, issued in January, offered an implicit exception for Christians in the Middle East, allowing persecuted religious minorities to enter as refugees even as it barred people from Muslim-majority countries.\n\nAdvertisement Continue reading the main story\n\n(When Mr. Trump revised the travel ban, he dropped the exception in an attempt to neutralize lawsuits claiming that the ban discriminated against Muslims. The Supreme Court agreed last week to hear the case.)\n\nIt took only a day of arrests for Detroit’s Chaldeans to lurch from security to panic.\n\n“We anticipated they’d be picking up the worst of the worst,” said Martin Manna, the president of the Chaldean Community Foundation, a social services organization, where even citizens and green card holders are calling to ask if they should worry. “Not people like Sam Hamama.”\n\nUsama Hamama, 54, a partner in a local supermarket who goes by Sam, was getting ready for church with his wife and four children when immigration agents knocked on the door of his spacious home in a quiet West Bloomfield subdivision. He had just enough time to collect his medications and say goodbye before being taken into custody.\n\nMr. Hamama, who arrived in the United States from Baghdad when he was 11, was convicted of a weapons possession charge after he flashed an unloaded gun during a road-rage confrontation with another driver in 1988. He was ordered deported in 1994.\n\nHis children view him differently. “I would never use the word ‘felon’ or ‘criminal’ or ‘alien’ for my dad,” said Britanny Hamama, 20, his eldest child.\n\nLike many other Chaldeans, his wife was drawn to Mr. Trump by his opposition to abortion, his economic message and his promises of succor for Christians in the Middle East. But she could not bring herself to vote after Mr. Hamama warned her that their family could be snarled in Mr. Trump’s immigration crackdown.\n\nPhoto\n\nAnother detainee, Najah Konja, was checking his emails over a cup of coffee on his back porch, looking out over the pond out back, when the doorbell sounded on June 11.\n\nAdvertisement Continue reading the main story\n\nMr. Konja, who goes by Nick, fled Iraq with his family at age 15, and later served 22 years in federal prison for selling cocaine. His green card was revoked, but since he could not be deported, he was able to stay, rise up the ranks at a chain of tobacco stores called Wild Bill’s, become engaged and buy a house.\n\nUnlike some other ex-felons, he said, he had bettered himself and contributed to the local economy. “I wasn’t born here, but I’m more American than them,” said Mr. Konja, 55, speaking by phone from a jail in Port Huron, Mich.\n\nStill, Mr. Konja and his family do not blame Mr. Trump. “A lot of this stuff, it probably doesn’t even get to his desk,” he said.\n\nFor other families, the separation from fathers and husbands has forced them into a rueful reckoning: The immigration crackdown they had always associated with other people had, somehow, leapt from the southern border to their subdivisions.\n\n“What’s the difference between a Mexican and a Chaldean?” said Nicole Sabatine, whose husband, Atheer Fawzi Ali, 41, was detained in June. “When people, Mexicans, whatever, have kids here, taking their parent away is not the answer.”\n\nMr. Ali’s family fled Iraq in the early 1990s after his father, an army officer, defied an order from Saddam Hussein. He lost his green card after breaking into a car as a teenager.\n\nThat Sunday in June, he had just enough time to say goodbye to his 12-year-old daughter, Natalia, before turning himself in.\n\n“I’ll always be there for you,” he told her. “Even if I’m in Iraq.”", "authors": ["Vivian Yee"], "publish_date": "2017-07-04", "source": "nytimes", "top_words": ["travel", "trump", "immigration", "dragnet", "iraq", "chaldean", "fall", "chaldeans", "christians", "fled", "hamama", "mr", "backing", "continue"], "summary": "We cannot allow this horror to continue!” Mr. Trump said on Twitter in January, returning to a campaign-trail refrain that had captured Chaldean hearts and ballots across this stretch of Macomb and Oakland Counties.\nAs the Chaldeans like to say, once with pride, now with fury, the area helped tip Michigan to Mr. Trump in November.\nLike many other Chaldeans, his wife was drawn to Mr. Trump by his opposition to abortion, his economic message and his promises of succor for Christians in the Middle East.\nBut she could not bring herself to vote after Mr. Hamama warned her that their family could be snarled in Mr. Trump’s immigration crackdown.\nStill, Mr. Konja and his family do not blame Mr. Trump."}