{"url": "https://www.nytimes.com/2016/11/16/world/europe/germany-bans-true-religion-islamist-group-and-raids-mosques.html?mcubz=0", "id": "47", "title": "Germany Bans ‘True Religion’ Muslim Group and Raids Mosques", "text": "“The translations of the Quran are being distributed along with messages of hatred and unconstitutional ideologies,” Mr. de Maizière said. “Teenagers are being radicalized with conspiracy theories.”\n\nThe move comes a week after the authorities arrested five men who were accused of aiding the Islamic State in Germany by recruiting members and providing financial and logistical help.\n\nThe True Religion is the sixth Islamist organization to be banned in Germany since 2012, under an effort to ensure domestic security and to prevent radicalized young people from leaving the country to fight for extremists abroad.\n\nGermany has been gripped by a wave of small-scale terrorist attacks this year, including three that were claimed by the Islamic State: the knifing of a policeman in February, an ax attack by a young refugee, and a suicide bombing, both in July. (The only deaths in those assaults were those of the attackers.)\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMost of the nearly one million migrants and refugees who arrived in Germany last year were Muslims. Security officials have been concerned that those who become frustrated or disillusioned at the difficulty of starting a new life in Europe could provide fertile ground for radical Islamists seeking to recruit members.\n\nThe campaign to hand out the Qurans to passers-by was the idea of Ibrahim Abou-Nagie, a Palestinian who preaches a conservative brand of Islam known as Salafism. German security officials said he was not in Germany at the time of the raids. Mr. de Maizière declined to comment on Mr. Abou-Nagie’s possible whereabouts.\n\nMr. Abou-Nagie, who has lived in Germany for more than 30 years, has been on the radar of German security officials since 2005, when he set up a website that officials say spreads extremist propaganda. An attempt to prosecute Mr. Abou-Nagie in 2012 on charges of incitement of religious hatred failed.\n\nEven as they are carrying out a sweeping effort to prevent radical Muslims from committing terrorist acts, the German authorities are also working to stop violence by far-right extremists. There was a 42 percent increase in the number of violent acts committed by the far right in 2015, according to the country’s domestic intelligence service, the Federal Office for the Protection of the Constitution.\n\nAdvertisement Continue reading the main story\n\nOn Tuesday, federal prosecutors said they had charged eight men from the eastern state of Saxony with forming a far-right terrorist organization known as the Freital Group, after the city near Dresden where many of the group’s attacks were carried out. The charges were brought by the state court in Dresden last Wednesday, the prosecutors said.\n\n“The aim of the organization was to carry out explosive attacks on shelters for asylum seekers, as well as homes, offices and automobiles of political dissidents,” the prosecutors said in a statement. “Through these actions, the suspects wanted to create an atmosphere of fear and repression.”\n\nOthers from the group are already facing charges, including attempted murder, carrying out an explosion and vandalism, over a series of attacks that began in late July 2015 and continued through November of that year. Those assaults involved lobbing explosives at the offices of the Left Party and at a refugee shelter in Freital.", "authors": ["Melissa Eddy"], "publish_date": "2016-11-16", "source": "nytimes", "top_words": ["raids", "true", "bans", "mr", "state", "security", "terrorist", "officials", "german", "religion", "group", "organization", "germany", "muslim", "attacks", "mosques", "prosecutors"], "summary": "“The translations of the Quran are being distributed along with messages of hatred and unconstitutional ideologies,” Mr. de Maizière said.\nMost of the nearly one million migrants and refugees who arrived in Germany last year were Muslims.\nSecurity officials have been concerned that those who become frustrated or disillusioned at the difficulty of starting a new life in Europe could provide fertile ground for radical Islamists seeking to recruit members.\nGerman security officials said he was not in Germany at the time of the raids.\nMr. Abou-Nagie, who has lived in Germany for more than 30 years, has been on the radar of German security officials since 2005, when he set up a website that officials say spreads extremist propaganda."}