{"url": "http://nytlive.nytimes.com/womenintheworld/2017/01/30/donald-trumps-travel-ban-feels-like-its-keeping-us-safe-from-an-invented-threat/?mcubz=0", "id": "4", "title": "Donald Trump’s travel ban feels like it’s ‘keeping us safe’ from an invented threat", "text": "Hoshneara Begum, an immigrant from Bangladesh who is now an American citizen, at a protest against President Donald Trump's immigration ban on nationals from seven predominantly Muslim countries, at Battery Park in New York, Jan. 29, 2017. (Yana Paskova/The New York Times)\n\nPresident Donald Trump’s travel ban on citizens from seven Muslim-majority countries seems intended not to protect Americans, but to foster irrational fear. His executive action feels like a time honored political trick: Invent a threat, then project the image of a “strong” leader who is “keeping us safe” from it. But Trump has presented no facts connecting new arrivals from these countries — or legal, vetted green card holders, for that matter — to terrorism.\n\nTrump has had help in magnifying the threat posed by immigrants from Muslim-majority lands. When terrorists are not Muslims, by the logic of much Western media coverage, they are individuals who should be judged for their actions. A Muslim terrorist, on the other hand, is said to represent 1.6 billion people from various nationalities, ethnic origins, historical backgrounds, and different ways of practicing the religion. The over-simplification that equates Islam to terrorism and assumes that entire populations are necessarily dangerous to America is a marketing campaign, not a step toward peace.\n\nPresident Trump said his policy will treat Christian populations from countries such as Iraq and Syria differently from their Muslim populations. And yet, historically, within these countries themselves, Muslims and Christians have tended to identify themselves by nationality first, religion second. When I was growing up in Iraq, for example, it didn’t occur to us to rank citizenship based on religion. The same applied to Syria, and to Arab countries where Muslims and Christians, and people of other religions, co-existed peacefully for centuries. The categorization and separation of Christian and Muslim populations appears to be a divide-and-conquer approach that plays into an Islam-is-violent worldview. Once again, this has been promoted in the Western media for years by the likes of Bill Maher, who hyped himself as an instant authority figure on Islam and has joked often about the issue.\n\nMr. Trump’s policy is legalizing such “innocent” jokes and sensational coverage. But the evidence is not on Trump’s side. According to statistics compiled by Alex Nowrasteh for the libertarian Cato Institute, between 1975 and 2015, no foreign national from any of the seven countries on Trump’s list — Iran, Iraq, Libya, Somalia, Sudan, Syria, and Yemen — committed a fatal terrorist attack on U.S. territory. Iran may be in constant tension with the U.S., and given to burning U.S. flags on its own soil, but that country is responsible for no terrorist acts in America.\n\nThis is not to say that no terrorism emanates from any of these countries, just as it is impossible to say the same about any country in the world. But given the selectivity of Trump’s list, it is tempting to conclude that it was compiled as part of a deal with U.S. allies in the region — allies such as Saudi Arabia, Pakistan and Egypt. This is an irony, given that these countries’ nationals have committed fatal terrorist acts on U.S. soil.\n\nIt is lazy to demonize entire countries and religions. Unfortunately, though, many Americans do not distinguish between ISIS and Islam, do not realize that ISIS members are targeting Muslims first and foremost. ISIS views not only non-Muslims, but also Muslims who do not share their unique and malevolent re-interpretation of the religion, as infidels. Muslim Shia, in particular, are seen as infidels by ISIS. Shia women have been raped and enslaved, just as Yazidi women have been, as both Yazidi and Shia women have reported after escaping ISIS capture.\n\nHalf of the countries targeted by Trump suffered severe humanitarian crises as a result of wars that left their people hungry, destroyed their homes and livelihoods, and made them desperate for asylum in exile. In Yemen, the U.N. estimates 10,000 people have been killed in a war led by Saudi Arabia since 2015. In Syria, the U.N. estimates at least 400,000 people have been killed since 2011, and in my home country, Iraq, hundreds of thousands of people have been killed since the U.S. led invasion in 2003 — a war that gave rise to ISIS itself.\n\nOn a recent visit to Iraq, I met people who welcomed a Trump presidency — mostly because, in their estimation, he says it as the world outside of the U.S. sees it. “We always knew that all America wants is our oil. At least Mr. Trump is saying it as it is,” Ali, a college professor, told me in Baghdad.\n\nNow it is up to Americans to show the world which is the legitimate American value system: One that divides and conquers, and randomly demonizes entire cultures, or one that actually believes in individualism, equality, freedom and justice for all — justice for each. The unique, singular men, women, and children on Mr. Trump’s list may be prevented from entering America — whether temporarily or for the long haul. But the most devastating impact of this policy will be on America itself. Let us remember that this narrative of Islam as a violent religion and thus a threat to America was not invented by Mr. Trump. Many others have helped shape that phobia in recent years, and countering it will require American determination.\n\nZainab Salbi is an author and media commentator and the founder of Women for Women International — a grassroots humanitarian and development organization dedicated to serving women survivors of war. Salbi is an editor at large for Women in the World, reporting on the intersection of Middle Eastern and Western cultures. For more information on Salbi’s work visit www.zainabsalbi.com.", "authors": ["Zainab Salbi"], "publish_date": "2017-01-30", "source": "nytimes", "top_words": ["america", "travel", "isis", "women", "trump", "muslims", "ban", "iraq", "donald", "trumps", "countries", "invented", "feels", "religion", "safe", "muslim", "keeping", "threat"], "summary": "Hoshneara Begum, an immigrant from Bangladesh who is now an American citizen, at a protest against President Donald Trump's immigration ban on nationals from seven predominantly Muslim countries, at Battery Park in New York, Jan. 29, 2017.\n(Yana Paskova/The New York Times)President Donald Trump’s travel ban on citizens from seven Muslim-majority countries seems intended not to protect Americans, but to foster irrational fear.\nHis executive action feels like a time honored political trick: Invent a threat, then project the image of a “strong” leader who is “keeping us safe” from it.\nAnd yet, historically, within these countries themselves, Muslims and Christians have tended to identify themselves by nationality first, religion second.\nThe same applied to Syria, and to Arab countries where Muslims and Christians, and people of other religions, co-existed peacefully for centuries."}