{"url": "https://www.nytimes.com/2017/08/28/technology/dara-khosrowshahi-uber-ceo.html?mcubz=0", "id": "439", "title": "Uber’s C.E.O. Pick, Dara Khosrowshahi, Steps Into Brighter Spotlight", "text": "There is also the wild card of Mr. Kalanick, who might seize on any trouble to mount a comeback. And finally, he will have to manage all this under a much brighter spotlight than he has worked under before.\n\nMr. Khosrowshahi was a long-shot candidate whose name did not become public until he had the job. Expedia is based in Bellevue, Wash., which makes him a Silicon Valley outsider. He had not commented on his new job as of Monday afternoon.\n\nAt the same time in June that Mr. Kalanick was noisily being ejected from his company, Mr. Khosrowshahi had a problem of his own — his parents. Glassdoor, a site where employees rank their companies, released its 2017 list of the top chief executives. Mr. Khosrowshahi’s score had dropped.\n\nHis parents weighed in with that combination of celebration and criticism that many immigrant children know well. As Mr. Khosrowshahi reported on Twitter, his mother said, “Nice! You made the top 100!” But his father pointed out: “#39 is good but you were #11 in 2015.”\n\nHis parents, Lili and Gary (short for Asghar) Khosrowshahi, were prosperous members of the Iranian elite in the 1960s and 1970s. Gary was an executive at an industrial conglomerate, where he worked with relatives. They fled as the government of Shah Mohammed Reza Pahlavi collapsed.\n\nThe family made it to Tarrytown, N.Y., and lived with relatives. “For the grown-ups, it was a difficult transition,” Dara Khosrowshahi told Bloomberg Businessweek this year. “The kids were able to party together, so it was fun.”\n\nFour years later, Gary went back to Iran to take care of his ailing father, and he was detained for six years before he could return. Lili raised three children alone.\n\nAdvertisement Continue reading the main story\n\n“His mom raised him to be direct with people,” said Mr. Partovi, the cousin. “By far the biggest challenge he faced, which is what all of us faced, was having to come to a new country and assimilate. Being an Iranian in America in the 1980s was not pleasant. People were singing ‘Bomb bomb bomb Iran.’ ”\n\nNewsletter Sign Up Continue reading the main story Interested in All Things Tech? The Bits newsletter will keep you updated on the latest from Silicon Valley and the technology industry. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut the tense environment also pushed them to succeed.\n\nMr. Partovi and his twin brother Ali were early investors in Facebook, Dropbox, Airbnb and, as it happens, Uber; Dara’s brother, Kaveh Khosrowshahi, is a managing director at the investment firm Allen & Company; another cousin, Farzad “Fuzzy” Khosrowshahi, played a major role in the creation of Google Docs; yet another cousin, Amir Khosrowshahi, is an executive at Intel; and Avid Larizadeh Duggan, also a cousin, is a general partner at Google Ventures.\n\nMr. Khosrowshahi, in 2015, was the highest-paid executive in America as calculated by Equilar. Thanks to a large stock option grant, he made $94.6 million. In 2016, without the grant, his pay was $2.5 million.\n\nMr. Khosrowshahi, in addition to running Expedia since 2005, joined the board of The New York Times Company in 2015.\n\nHis route to success took him to the investment firm of Allen & Company, where he spent most of the 1990s as an analyst. Barry Diller was a client, and Mr. Khosrowshahi eventually went to work for the media mogul.\n\nIn 2001, Mr. Diller acquired Expedia, a travel booking site founded by Microsoft. Four years later, Mr. Khosrowshahi became Expedia’s chief executive. The site has flourished, acquiring three major competitors in 2015 alone. Shares in the company, which is now publicly traded, have risen 35 percent over the last year, despite competition from Priceline on one flank and Airbnb on another.\n\n“If Dara does leave us, it will be to my great regret but also my blessing — he’s devoted 12 great years to building this company and if this is what he wants for his next adventure it will be with my best wishes,” Mr. Diller said in a note to Expedia employees on Monday.\n\nUber, like Expedia a decade ago, has enormous promise but also faces enormous challenges. Mr. Khosrowshahi’s supporters believe he can fix the problems.\n\nAdvertisement Continue reading the main story\n\n“He’s a global travel executive — he understands competitive dynamics, geopolitical challenges, and the operating challenges of running a sprawling global travel company,” said Brad Gerstner, founder of Altimeter Capital, an investor in Uber as well as Expedia.\n\nUnder Mr. Kalanick, some Uber executives were considered untouchable, which contributed to a poisonous atmosphere. Shana Fisher, who worked with Mr. Khosrowshahi at Mr. Diller’s IAC and is now a venture capitalist, said, “People don’t get an excuse with Dara. They have to be good and good. Good and good. He doesn’t have tolerance for less than that.”\n\nMr. Khosrowshahi’s experiences as an immigrant gave him a personal perspective on the executive order that President Trump signed restricting travel from seven predominantly Muslim countries this year.\n\nExpedia, along with Amazon, gave early support to a lawsuit filed by Washington State’s attorney general objecting to the travel ban. Around the same time, Mr. Khosrowshahi described his early experience as an immigrant in an email to employees.\n\n“We sure didn’t feel like refugees, but in hindsight I guess we were — my father and mother left everything behind to come here — to be safe and give their boys a chance to rebuild a life,” he wrote.\n\nHe has repeatedly expressed concerns about Mr. Trump, most recently on Aug. 15, when he tweeted: “I keep waiting for the moment when our Prez will rise to the expectations of his office and he fails, repeatedly.”\n\nLili and Gary are clearly watching their son rise to their own expectations. After he was interviewed by Jim Cramer, the host of the financial TV show “Mad Money,” in May, Dara posted on Twitter: “didn’t screw it up (according to mom).”", "authors": ["David Streitfeld", "Nellie Bowles"], "publish_date": "2017-08-28", "source": "nytimes", "top_words": ["executive", "travel", "mr", "good", "spotlight", "cousin", "pick", "brighter", "gary", "khosrowshahi", "company", "ubers", "dara", "ceo", "expedia", "steps"], "summary": "Mr. Khosrowshahi was a long-shot candidate whose name did not become public until he had the job.\nAt the same time in June that Mr. Kalanick was noisily being ejected from his company, Mr. Khosrowshahi had a problem of his own — his parents.\n“For the grown-ups, it was a difficult transition,” Dara Khosrowshahi told Bloomberg Businessweek this year.\nBarry Diller was a client, and Mr. Khosrowshahi eventually went to work for the media mogul.\nAround the same time, Mr. Khosrowshahi described his early experience as an immigrant in an email to employees."}