{"url": "https://www.nytimes.com/interactive/2017/01/25/us/politics/trump-refugee-plan.html?mcubz=0", "id": "452", "title": "How Trump’s Executive Order Will Affect the U.S. Refugee Program", "text": "President Trump on Friday issued an executive order focused on “protecting the nation from foreign terrorist entry into the United States.” The document includes several immigration-related measures, including a 90-day ban on individuals from Iraq, Syria, Iran, Sudan, Libya, Somalia or Yemen — all predominantly Muslim countries — from entering the United States.\n\nIt also makes several significant changes to the nation’s refugee program:\n\nSuspends the refugee admissions program for 120 days\n\nThe order suspends the program while a review of the screening process takes place. It resumes the program for certain countries only after the secretary of homeland security, the secretary of state and the director of national intelligence have determined security procedures are adequate in those countries.\n\nCuts the number of refugees admitted in 2017 in half\n\nAdmitted so far Ceiling under Trump Ceiling under Obama 29,895 50,000 110,000 Admitted so far Ceiling under Trump Ceiling under Obama 29,895 50,000 110,000 Admitted so far Ceiling under Trump Ceiling under Obama 29,895 50,000 110,000 The number admitted so far is for the first four months of the 2017 fiscal year, through Jan. 20.\n\nThe program will be capped at 50,000 refugees for the 2017 fiscal year, down from the 110,000 ceiling put in place under President Barack Obama. Nearly 30,000 have already been admitted since October, the start of the fiscal year. The order directs the secretary of state and the secretary of Homeland Security to prioritize refugee claims made by persecuted members of religious minorities.\n\nIndefinitely blocks all refugees from Syria\n\nThe order also suspends the entry of Syrian refugees until the president determines that their admission would be “consistent with the national interest.”\n\nTop 15 countries of origin for refugees admitted in the 2016 fiscal year 5,000 10,000 15,000 Dem. Rep. of Congo Syria Burma Iraq Somalia Bhutan Iran Afghanistan Ukraine Eritrea Sudan Ethiopia Burundi Pakistan Colombia 5,000 10,000 15,000 Dem. Rep. of Congo Syria Burma Iraq Somalia Bhutan Iran Afghanistan Ukraine Eritrea Sudan Ethiopia Burundi Pakistan Colombia 5,000 10,000 15,000 Dem. Rep. of Congo Syria Burma Iraq Somalia Bhutan Iran Afghanistan Ukraine Eritrea Sudan Ethiopia Burundi Pakistan Colombia 5,000 10,000 15,000 Dem. Rep. of Congo Syria Burma Iraq Somalia Bhutan Iran Afghanistan Ukraine Eritrea Sudan Ethiopia Burundi Pakistan Colombia\n\nLast year 16,370 refugees to the United States came from the Democratic Republic of Congo, the most of any nation, followed by Syria, with 12,587 refugees out of a total of nearly 85,000.\n\nThe United States has admitted far larger numbers in the past. In 1980, more than 200,000 refugees were admitted, many from Vietnam.\n\nRefugees admitted to the U.S. each fiscal year 200,000 150,000 100,000 Other regions Near East/South Asia 50,000 Africa ’75 ’80 ’85 ’90 ’95 ’00 ’05 ’10 ’16 200,000 150,000 100,000 Other regions Near East/ South Asia 50,000 Africa ’75 ’85 ’95 ’05 ’16 200,000 150,000 100,000 Other regions 50,000 Near East/South Asia Africa ’75 ’80 ’85 ’90 ’95 ’00 ’05 ’10 ’16\n\nThe number of Syrian refugees admitted to the United States rose substantially under a resettlement program announced by the Obama administration in 2015. Under pressure from Europe and countries confronting the global migration crisis, Mr. Obama raised the number of Syrian refugees who would be offered legal status to at least 10,000 in the 2016 fiscal year. The administration reached that goal ahead of schedule after a slow start.\n\n3,000 2,500 2,000 1,500 1,000 Syrian refugees admitted each month 500 2012 2013 2014 2015 2016 3,000 2,500 2,000 Syrian refugees admitted each month 1,500 1,000 500 2012 2013 2014 2015 2016 3,000 2,500 2,000 Syrian refugees admitted each month 1,500 1,000 500 2012 2013 2014 2015 2016 3,000 2,500 2,000 1,500 1,000 Syrian refugees admitted each month 500 2012 2013 2014 2015 2016\n\nSuspends entry into the U.S. from seven countries for 90 days\n\nIn addition to the refugee measures, the order also bans visitors from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen into the United States for 90 days. Each of these predominantly Muslim countries is either on the State Department’s list of state sponsors of terrorism or on a Department of Homeland Security list of other countries of concern.\n\nIn 2015, about 84,000 people from those countries entered the U.S. on tourist, business, student or other visas. Most were from Iran and Iraq.", "authors": ["Alicia Parlapiano", "Haeyoun Park", "Sergio Peçanha"], "publish_date": "2017-01-25", "source": "nytimes", "top_words": ["executive", "syrian", "iran", "admitted", "50000", "affect", "refugee", "iraq", "refugees", "united", "trumps", "countries", "syria", "ceiling", "order", "program"], "summary": "It also makes several significant changes to the nation’s refugee program:Suspends the refugee admissions program for 120 daysThe order suspends the program while a review of the screening process takes place.\nThe program will be capped at 50,000 refugees for the 2017 fiscal year, down from the 110,000 ceiling put in place under President Barack Obama.\nThe order directs the secretary of state and the secretary of Homeland Security to prioritize refugee claims made by persecuted members of religious minorities.\nRep. of Congo Syria Burma Iraq Somalia Bhutan Iran Afghanistan Ukraine Eritrea Sudan Ethiopia Burundi Pakistan Colombia 5,000 10,000 15,000 Dem.\nRep. of Congo Syria Burma Iraq Somalia Bhutan Iran Afghanistan Ukraine Eritrea Sudan Ethiopia Burundi Pakistan Colombia 5,000 10,000 15,000 Dem."}