{"url": "https://www.nytimes.com/2017/07/19/opinion/travel-ban-upheld-supreme-court.html?mcubz=0", "id": "423", "title": "The Dark History of Defining ‘Family’", "text": "The Trump administration lost another round on Wednesday in its continuing legal battle over its travel ban against people from six majority-Muslim countries and all refugees. The Supreme Court let stand — pending full review of the ban in October — a Federal District Court ruling in Hawaii that included grandparents and other close relatives of those in the United States within the scope of exemptions to the ban.\n\nLast month, the Supreme Court authorized the administration to implement the ban but instructed the government to exempt people with “bona fide” relationships to relatives and institutions (like employers and universities) in the United States. The State Department issued guidelines that narrowly defined those family relations as spouses, parents and parents-in-law, children and siblings. It excluded grandparents, aunts and uncles, nephews and nieces, and brothers- and sisters-in-law. It also excluded all refugees.\n\nThese rules struck many as arbitrary and needlessly cruel. The exclusion of grandparents seemed particularly capricious and nonsensical, as did the allowance of a sibling, say, but not that sibling’s spouse. In countries like Syria, where families have been torn asunder by war, a cousin in America may be someone’s only lifeline to safety.\n\nIn response, the administration said that it was merely following established immigration law. That’s true to the extent that only certain immediate relations are eligible for family-sponsored visas for permanent residence. But the travel ban goes far beyond the treasured green card. It applies those rules to people who would otherwise be eligible for entry, including refugees who have been cleared and accepted by a resettlement agency, and short-term visitors, such as tourists, businessmen and grandparents coming for a family visit.\n\nPhoto\n\nIt is true, however, that efforts to define and manipulate the definition of “family” in immigration matters are not new. For more than 100 years the government has done so, often reflecting political exigency and racial bias rather than the real needs and desires of families.\n\nAdvertisement Continue reading the main story\n\nAlthough the United States purports to promote family unification in its immigration policy, it has usually defined “family” as narrowly as possible, limited to the nuclear family of two heterosexual parents and their children. (Only recently have we recognized same-sex spouses.) But the nuclear family is not the normative family unit in much of the world — or for many in the United States, for that matter. In addition, the government has used an arbitrary distinction between citizens and permanent residents to make the rules narrower still. Those definitions have effectively served only one purpose: to constrain the volume of immigration.", "authors": ["Mae Ngai"], "publish_date": "2017-07-19", "source": "nytimes", "top_words": ["true", "defining", "dark", "family", "immigration", "ban", "rules", "court", "united", "history", "states", "administration", "grandparents"], "summary": "The State Department issued guidelines that narrowly defined those family relations as spouses, parents and parents-in-law, children and siblings.\nPhotoIt is true, however, that efforts to define and manipulate the definition of “family” in immigration matters are not new.\nAdvertisement Continue reading the main storyAlthough the United States purports to promote family unification in its immigration policy, it has usually defined “family” as narrowly as possible, limited to the nuclear family of two heterosexual parents and their children.\nBut the nuclear family is not the normative family unit in much of the world — or for many in the United States, for that matter.\nIn addition, the government has used an arbitrary distinction between citizens and permanent residents to make the rules narrower still."}