{"url": "https://www.nytimes.com/2017/06/28/us/politics/foreign-passengers-security-measures-laptops.html?mcubz=0", "id": "406", "title": "Passengers Flying Into U.S. to Face More Scrutiny, but Laptops Allowed", "text": "Photo\n\nWASHINGTON — Passengers flying to the United States from foreign airports will undergo more rigorous screening of their baggage and electronic devices, but they will be allowed to bring laptops and tablets onto planes in their carry-on bags, the Department of Homeland Security announced on Wednesday.\n\nAfter months of discussions with aviation officials in Europe about banning large electronic devices, homeland security officials ultimately abandoned the idea in favor of more robust screening measures. In March, the department imposed a limited ban barring passengers traveling through airports in 10 Muslim-majority countries from carrying devices larger than cellphones aboard direct inbound flights.\n\nNow, agency officials said, the ban on those airlines will be lifted if they carry out the new security measures.\n\nThe officials, during a background briefing with reporters, did not elaborate on what the new intensive measures would include other than more bomb-sniffing dogs and new scanning equipment.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nOfficials also said they would seek to expand the preclearance program, where United States customs officers at foreign airports check photo IDs and travel documents before allowing passengers to board planes for the United States.\n\nAdvertisement Continue reading the main story\n\nOfficials did not give a time frame for airlines to put the new measures in place or when passengers could expect to see the changes, but said airlines would be allowed sufficient time to carry out the measures.", "authors": ["Ron Nixon"], "publish_date": "2017-06-28", "source": "nytimes", "top_words": ["passengers", "allowed", "airports", "laptops", "security", "face", "officials", "united", "states", "york", "scrutiny", "measures", "devices", "airlines", "flying"], "summary": "PhotoWASHINGTON — Passengers flying to the United States from foreign airports will undergo more rigorous screening of their baggage and electronic devices, but they will be allowed to bring laptops and tablets onto planes in their carry-on bags, the Department of Homeland Security announced on Wednesday.\nAfter months of discussions with aviation officials in Europe about banning large electronic devices, homeland security officials ultimately abandoned the idea in favor of more robust screening measures.\nIn March, the department imposed a limited ban barring passengers traveling through airports in 10 Muslim-majority countries from carrying devices larger than cellphones aboard direct inbound flights.\nNow, agency officials said, the ban on those airlines will be lifted if they carry out the new security measures.\nOfficials also said they would seek to expand the preclearance program, where United States customs officers at foreign airports check photo IDs and travel documents before allowing passengers to board planes for the United States."}