{"url": "https://www.nytimes.com/interactive/2017/06/29/us/politics/supreme-court-trump-travel-ban.html?mcubz=0", "id": "472", "title": "The Supreme Court Partially Allowed Trump’s Travel Ban. Who Is Still Barred?", "text": "Portions of President Trump’s travel ban went into effect at the end of June, after the Supreme Court temporarily lifted legal blocks on the ban and agreed to review the case this fall.\n\nThe court granted an exception for people with “bona fide relationships” in the United States. Last week, a federal judge in Hawaii challenged the Trump administration's definition of the term, opening the gates for grandparents and other close relatives, as well as thousands of refugees who have been cleared to enter the United States.\n\nOn Wednesday, the Supreme Court weighed in again, rejecting part of the Hawaii judge’s order and allowing the administration to temporarily enforce its restrictions on refugees.\n\nALLOWED\n\nPeople With ‘Bona Fide’ Relationships in the U.S.\n\nIn June, the Supreme Court lifted the suspensions that federal judges had put on Mr. Trump’s travel ban order in March, but only partially: People from the affected countries who have “a credible claim of a bona fide relationship with a person or entity in the United States” will still be allowed to enter the country.\n\nThe justices said their intention was to not burden American parties who have relationships with foreigners. They offered some examples of who would be allowed, including “close family,” students and workers offered employment.\n\nBut the court did not precisely explain the meaning of “bona fide relationship.” According to a diplomatic cable obtained by The New York Times, the Trump administration has defined “close family” as a “parent (including parent-in-law), spouse, child, adult son or daughter, son-in-law, daughter-in-law, sibling, whether whole or half. This includes step relationships.” The administration later added people who are engaged to be married to the list of sufficient connections.\n\nBut the federal judge in Hawaii said that the administration could not exclude other extended family members, including “grandparents, grandchildren, brothers-in-law, sisters-in-law, aunts, uncles, nieces, nephews and cousins.” On Wednesday, the Supreme Court temporarily let that portion of the Hawaii court order stand.\n\nBARRED\n\nEveryone Else From Six Countries\n\nEurope ASIA Iran Syria Libya Yemen Sudan Somalia AFRICA Syria Iran Libya Yemen Sudan Somalia\n\nThe president’s order prohibits for 90 days the entry of travelers from six predominantly Muslim countries: Iran, Libya, Somalia, Sudan, Syria and Yemen. The Supreme Court’s action in June means that this ban will only apply to those without bona fide relationships in the United States.\n\nMeanwhile, American officials will conduct a review into screening procedures in place to prevent threats. Travelers from countries that do not provide sufficient information for screening by the end of the review may still be barred from entering the United States.\n\nIn its opinion, the court said the administration could complete its review over the summer, so it is possible that the case could become moot by the time it is argued in the fall.\n\nDEPENDS\n\nRefugees\n\nThe president’s order also includes a ban on all refugees to the United States for 120 days. After that, the administration will determine from which countries it will reinstate admissions.\n\nMr. Trump’s order allows case-by-case exceptions for some refugees, and refugees already admitted to the country will be allowed. The court’s exception for those with a bona fide relationship also applies to refugees, but according to independent estimates, about 40 percent of refugees who come to the country have no family ties here.\n\nA State Department official originally said that refugees’ ties to a nonprofit organization that helped them resettle was “not sufficient” to qualify as a bona fide relationship. The federal judge in Hawaii ruled that the administration could not exclude refugees with ties to a resettlement agency that was committed to receiving them, but the Supreme Court on Wednesday temporarily blocked that part of the ruling.\n\nThe president’s order cuts the refugee program in half, capping it at 50,000 people for the 2017 fiscal year, down from the 110,000 ceiling put in place under President Barack Obama. But the cap will not apply to refugees who can claim a bona fide relationship.\n\nALLOWED\n\nStudents and Workers Without Current Visas\n\nMr. Trump’s order applies to people who do not have current visas, including temporary, non-immigrant visas for students and workers. But these groups already get those visas based on relationships the administration has defined as bona fide, so they will be allowed in.\n\nThere were about 13,000 temporary visits by citizens from the six targeted countries in the 2015 fiscal year in those categories.\n\nDEPENDS\n\nTourists and business travelers\n\nLike students and workers, most visitors coming to the United States for recreational and business purposes must obtain non-immigrant visas. Those from the six countries will be allowed only if they already have a qualifying bona fide relationship in the United States.\n\nThat includes “close family” or a relationship with a “U.S. entity”; for example, the administration said that a “lecturer invited to address an audience” would qualify.\n\nThere were 49,412 visits by citizens from the six targeted countries on the B-1 and B-2 visas in 2015.\n\nDEPENDS\n\nNew Immigrants\n\nMr. Trump’s order also applies to people from the six countries newly arriving on immigrant visas. But most of these visas are granted based on employment or family status that would qualify them to enter under the court’s opinion.\n\nA small percentage of new immigrants are awarded “diversity visas” through a lottery, so it is possible that they would not have bona fide relationships that would allow them to enter.\n\nPeople issued immigrant visas become legal permanent residents on arrival in the United States and are issued a green card soon after. In 2015, green cards were issued to 31,258 people from these six countries. In general, about half of recent new legal permanent residents have been new arrivals to the country, and the other half have had their status adjusted after living in the United States.\n\nALLOWED\n\nGreen Card Holders, Dual Nationals and Diplomats\n\nMr. Trump’s order explicitly says green card holders from the targeted countries will be allowed. From 1999 to 2015, 2.6 percent of new legal permanent residents were from the six affected countries.\n\nThe president’s order also does not apply to American citizens, or to dual nationals who enter the United States presenting their passport from a country not under the ban.\n\nPeople on certain types of diplomatic or government visas are also still allowed. Nearly 1,400 admissions from the six countries were made on these visas in 2015:\n\nDiplomats and other officials Diplomats and officials (and their families) on A-1 and A-2 visas International representatives Representatives of foreign governments or international organizations holding G-1, G-2, G-3 or G-4 visas Visitors to the United Nations People with C-2 visas to travel to the United Nations or officials in transit with C-3 visas NATO officials Officials (and their families) on North Atlantic Treaty Organization visas\n\nHow the Ban Has Evolved\n\nAfter a panel of federal judges blocked key parts of a January order banning travel from seven predominantly Muslim countries, Mr. Trump issued a narrower revised version in March, which, among other changes, removed Iraq from the list of barred countries and took out language prioritizing refugees in minority religious groups.", "authors": ["Alicia Parlapiano", "Anjali Singhvi"], "publish_date": "2017-06-29", "source": "nytimes", "top_words": ["partially", "fide", "travel", "allowed", "ban", "supreme", "visas", "bona", "court", "refugees", "united", "barred", "trumps", "countries", "relationships", "order", "administration"], "summary": "The court granted an exception for people with “bona fide relationships” in the United States.\nALLOWEDPeople With ‘Bona Fide’ Relationships in the U.S.\nThe Supreme Court’s action in June means that this ban will only apply to those without bona fide relationships in the United States.\nMr. Trump’s order allows case-by-case exceptions for some refugees, and refugees already admitted to the country will be allowed.\nThose from the six countries will be allowed only if they already have a qualifying bona fide relationship in the United States."}