{"url": "https://www.nytimes.com/2017/06/28/us/politics/homeland-security-prepares-to-issue-travel-restrictions.html?mcubz=0", "id": "407", "title": "Stepsister, Yes; Grandma, No: U.S. Sets Guidelines for Revised Travel Ban", "text": "Photo\n\nWASHINGTON — Stepsiblings and half-siblings are allowed, but not nieces or nephews. Sons- and daughters-in-law are in, but brothers- and sisters-in-law are not. Parents, including in-laws, are considered “close family,” but grandparents are not.\n\nThe State Department issued new guidelines Wednesday night to American embassies and consulates on applying a limited travel ban against foreign visitors from six predominantly Muslim countries. Enforcement of the guidelines will begin at 8 p.m. Eastern on Thursday.\n\nThe guidelines followed the Supreme Court’s decision on Monday to allow parts of the Trump administration’s revised travel ban to move forward, while also imposing certain limits, as the court prepares to hear arguments in October on the scope of presidential power over border security and immigration.\n\nThe court said the ban could not be imposed on anyone who had “a credible claim of a bona fide relationship with a person or entity in the United States.”\n\nAdvertisement Continue reading the main story\n\nThe meaning of “bona fide relationship” was not precisely explained, and the phrase has created much uncertainty for migrants and others seeking to travel to the United States from the six countries — Iran, Libya, Somalia, Sudan, Syria and Yemen — covered by the revised travel ban that President Trump issued in March. (An earlier version of the ban included Iraq.)\n\nThe Trump administration has now made the definition explicit.\n\nAccording to a diplomatic cable obtained by The New York Times, “close family” is “defined as a parent (including parent-in-law), spouse, child, adult son or daughter, son-in-law, daughter-in-law, sibling, whether whole or half. This includes step relationships.”", "authors": ["Gardiner Harris", "Ron Nixon"], "publish_date": "2017-06-28", "source": "nytimes", "top_words": ["fide", "travel", "relationship", "revised", "trump", "ban", "including", "stepsister", "sets", "united", "yes", "issued", "guidelines", "grandma"], "summary": "Sons- and daughters-in-law are in, but brothers- and sisters-in-law are not.\nParents, including in-laws, are considered “close family,” but grandparents are not.\nThe State Department issued new guidelines Wednesday night to American embassies and consulates on applying a limited travel ban against foreign visitors from six predominantly Muslim countries.\nEnforcement of the guidelines will begin at 8 p.m. Eastern on Thursday.\nThe guidelines followed the Supreme Court’s decision on Monday to allow parts of the Trump administration’s revised travel ban to move forward, while also imposing certain limits, as the court prepares to hear arguments in October on the scope of presidential power over border security and immigration."}