{"url": "https://www.nytimes.com/interactive/2016/07/22/us/politics/trump-immigration-ban-how-could-it-work.html?mcubz=0", "id": "446", "title": "Millions Could Be Blocked From Entering the U.S. Depending on How Trump Would Enforce a Ban on Muslim Immigration", "text": "It was a little over a year ago that Donald J. Trump first proposed barring Muslims from entering the United States.\n\nIn subsequent statements during the campaign, Mr. Trump and his staff made several confusing pivots on the issue, at one point tying the ban to countries that had been “compromised by terrorism.”\n\nWhat follows is an examination of some of those statements and an analysis of how many people could be blocked from entering the United States each year depending on how a ban would be enforced.\n\n“A total and complete shutdown of Muslims entering the United States.”\n\nSeveral days after the shootings in San Bernardino, Calif., Mr. Trump called for the United States to bar all Muslims from entering the country until the nation’s leaders can “figure out what is going on.”\n\nHow would such a ban work? The United States does not screen for religion upon entry, but one way could be to create a list of countries that would be subject to such a ban, perhaps by focusing on those with large shares of Muslims.\n\nIf a ban, for example, included immigration by people from majority-Muslim countries, more than one million people from at least 46 countries would be prevented from entering the United States annually as legal permanent residents or temporary immigrants, such as students, guest workers, diplomats or tourists.\n\nBarring immigrants from countries where more than 50 percent of the population is Muslim would keep out about 1 million people each year.\n\nNorth America Europe Russia Canada Asia Britain Turkey Japan Mexico Cuba France Indonesia Egypt South America Brazil Africa Australia Most Middle Eastern countries would be excluded, as well as Afghanistan.\n\nNorth America Europe Canada Russia Asia Britain China Germany Japan Turkey Mexico Malaysia Cuba France Saudi Arabia Indonesia Egypt Morocco South America Australia New Zealand Brazil Africa South Africa Most Middle Eastern countries would be excluded, as well as Afghanistan.\n\nFinland Norway Europe Canada Russia North America Asia Britain Ireland China Germany Turkey Japan India Mexico Malaysia Cuba France Italy Saudi Arabia Indonesia Spain Philippines Most Middle Eastern countries would be excluded, as well as Afghanistan. Egypt Morocco South America Australia New Zealand Africa Brazil South Africa\n\nFinland Norway Europe Canada Russia Sweden North America Asia Ireland Britain South Korea China Germany Japan Turkey India Mexico Malaysia Israel Cuba Taiwan France Singapore Italy Saudi Arabia Indonesia Greece Spain Philippines Most Middle Eastern countries would be excluded, as well as Afghanistan. Egypt Morocco South America Australia New Zealand Brazil Africa South Africa\n\nSquares sized by the average number of immigrants and visitors who entered the United States from that country in the last 10 years.\n\nIf Mr. Trump’s ban applied to countries with a much larger share of Muslims, like 90 percent, the list would dwindle to 29 countries. But it would still include Iraq, Saudi Arabia and Egypt – countries that are working with the United States to combat jihadist terrorists.\n\nBarring immigrants from countries where more than 90 percent of the population is Muslim would keep out about 675,000 people each year.\n\nNorth America Europe Russia Canada Asia Britain China Turkey Japan Mexico Cuba France Saudi Arabia Philippines Egypt South America Africa Brazil Australia\n\nNorth America Europe Russia Canada Asia Britain China Germany Japan Turkey Mexico India Cuba France Saudi Arabia Philippines Egypt Morocco South America New Zealand Brazil Africa South Africa Australia\n\nFinland Norway Europe Canada Russia North America Asia Britain Ireland South Korea China Germany Turkey Japan Mexico India Israel Cuba Taiwan France Singapore Saudi Arabia Italy Indonesia Spain Greece Philippines Egypt Morocco South America New Zealand Brazil Africa South Africa Australia\n\nFinland Norway Europe Canada Russia Sweden North America Asia Ireland Britain South Korea China Germany Japan Turkey India Mexico Malaysia Israel Cuba Taiwan France Singapore Saudi Arabia Italy Indonesia Greece Spain Philippines Egypt Morocco South America Australia New Zealand Brazil Africa South Africa\n\nUnder the current immigration system, enforcing a ban on Muslims would prove difficult because it is nearly impossible to determine the religions of people traveling to the United States unless they volunteer that information.\n\n“How would you screen Muslims?” said Muzaffar Chishti, a director at the Migration Policy Institute. “There’s no mention of religion on the passport. If you go by name, clearly a lot of Muslims don’t have Muslim-sounding names, and a lot of non-Muslims have Muslim-sounding names.”\n\nUnited States immigration law does not take religion into account in the approval of visas, and current applications do not include questions about religious identity or affiliation, a State Department official said.\n\nMr. Trump’s ban would rely on a law that gives the president authority to prevent the entry of any class of people who would be “detrimental to the interests of the United States.” By proclamation, he or she can suspend their entry or impose restrictions, according to the law.\n\nIn 2011, President Obama used the law to suspend the entry of people who “participate in serious human rights and humanitarian law violations.” But a ban of a magnitude proposed by Mr. Trump has not happened before, Mr. Chishti said.\n\nTen months after the ban was proposed, Mike Pence, Mr. Trump’s running mate, said a temporary ban on Muslim immigration was no longer Mr. Trump’s position.\n\n“I will suspend immigration from areas of the world where there is a proven history of terrorism.”\n\nIn a speech after the Orlando massacre, Mr. Trump removed the reference to religion and instead proposed barring people from regions of the world with a “proven history of terrorism” against the United States and its allies.\n\nMr. Trump did not say whether the proposal was a replacement for the Muslim ban or an extension of it. He also did not specify what qualified as a “proven history of terrorism.”\n\nOne possible approach would be screening out the home countries of people who have launched jihadist-inspired strikes in the United States, including the Sept. 11, 2001, attacks.\n\nBarring immigrants from countries where jihadist-inspired attackers against the United States were born would keep out about 5.5 million people each year.\n\nNorth America Europe Canada Russia Asia Britain China Germany Japan Mexico Cuba France Saudi Arabia Egypt South America Brazil Africa Australia\n\nNorth America Norway Europe Canada Russia Asia Britain China Germany Japan Mexico India Cuba France Saudi Arabia Italy Spain Philippines Egypt Ethiopia Nigeria South America Brazil South Africa Africa Australia\n\nFinland Norway Europe Canada Russia North America Asia Ireland Britain South Korea China Germany Japan Turkey India Mexico Israel Cuba Taiwan France Singapore Saudi Arabia Italy Indonesia Greece Spain Philippines Egypt South America Ethiopia Nigeria Australia New Zealand Brazil Africa South Africa\n\nFinland Norway Europe Canada Russia Sweden North America Asia Ireland Britain South Korea China Germany Turkey Japan India Mexico Malaysia Israel Cuba Taiwan France Singapore Saudi Arabia Italy Indonesia Greece Spain Philippines Egypt South America Ethiopia Nigeria Australia New Zealand Brazil Africa South Africa\n\nSuch a list would include about 12 countries, but past acts of terrorism suggest that it would not be a blanket solution.\n\nAlthough the Sept. 11 attackers entered the United States using tourist, business or student visas, half of the attacks since 2001 have been committed by people born in the United States. And one of the attackers – Richard Reid, known as the shoe bomber – was a British citizen, and would not have needed a visa to enter the United States.\n\nThe last time the United States did anything close to what Mr. Trump is proposing was when the Bush administration introduced a program after the Sept. 11 attacks that required adult men from 25 countries known to have a Qaeda presence to be fingerprinted, registered and interviewed, Mr. Chishti said.\n\nEven this controversial program did not bar groups of people from entering the country; it only screened them.\n\n“We must suspend immigration from regions linked with terrorism until a proven vetting method is in place.”\n\nIn June, Mr. Trump told Bloomberg News that he would “limit specific terrorist countries.” He did not offer the names of countries, but said, “We know who those terrorist countries are.”\n\nIf Mr. Trump meant a list including all the countries from which foreign fighters have gone to Syria and Iraq to join the Islamic State and other extremist groups, there are more than 80 of them, and they include many of United States’ European allies.\n\nBarring immigrants from countries from which foreign fighters have departed to Iraq and Syria would keep out about 29 million people each year.\n\nNorth America Europe Germany Asia Russia Canada China Britain Japan Ireland Mexico France Israel India Italy Spain Egypt South America Brazil New Zealand Africa Australia\n\nNorth America Europe Germany Netherlands Russia Canada Asia Britain Turkey China Ireland Japan Mexico India Cuba Israel Italy France Philippines Spain South America New Zealand Brazil Africa South Africa Australia\n\nFinland Norway Europe Netherlands Canada Russia North America Sweden Asia Ireland Britain Turkey China Germany Japan Ukraine India Mexico Cuba France Israel Singapore Italy Spain Greece Philippines Egypt Morocco South America Australia New Zealand Brazil Africa South Africa\n\nFinland Norway Europe Netherlands Canada Russia Sweden North America Asia Ireland Britain South Korea China Turkey Germany Japan Ukraine Belgium India Mexico Malaysia Israel Cuba Taiwan France Singapore Italy Saudi Arabia Indonesia Greece Spain Philippines Egypt Morocco South America Australia New Zealand Brazil Africa South Africa\n\nBut while in Scotland in June, Mr. Trump said he would not have a problem with a Muslim from a place like Scotland entering the United States.\n\n“We must immediately suspend immigration from any nation that has been compromised by terrorism.”\n\nIn his speech accepting the Republican nomination for president, Mr. Trump emphasized the need for a “proven” vetting mechanism and said that he would bar immigrants from countries that have been “compromised by terrorism.”\n\n“We don’t want them in our country,” he said.\n\nHis campaign later said this would include countries like Libya and Syria, and ones that have a history of sending terrorists to the United States.\n\nOne way of implementing this would be to bar immigration from countries that the State Department calls terrorist havens or state sponsors of terrorism.\n\nBarring immigrants from countries the State Department calls terrorist havens or state sponsors of terrorism would keep out about 2 million people each year.\n\nIn August, Mr. Trump also said that “members or sympathizers of terrorist groups” as well as anyone with “hostile attitudes to our principles” would not be admitted into the country, and he called for new screening procedures.\n\nAlthough it’s possible for a president to temporarily suspend immigration from certain parts of the world, it would be a slow process and take an ambitious bureaucratic effort.\n\nAny broad ban could incite retaliation against Americans traveling and living abroad, separate families, hinder national security efforts and disrupt business and trade.", "authors": ["Haeyoun Park"], "publish_date": "2016-07-22", "source": "nytimes", "top_words": ["america", "africa", "trump", "ban", "mexico", "immigration", "france", "japan", "united", "millions", "entering", "south", "countries", "russia", "depending", "blocked", "states", "muslim", "enforce"], "summary": "It was a little over a year ago that Donald J. Trump first proposed barring Muslims from entering the United States.\nBut it would still include Iraq, Saudi Arabia and Egypt – countries that are working with the United States to combat jihadist terrorists.\nBarring immigrants from countries where jihadist-inspired attackers against the United States were born would keep out about 5.5 million people each year.\nAlthough the Sept. 11 attackers entered the United States using tourist, business or student visas, half of the attacks since 2001 have been committed by people born in the United States.\nAnd one of the attackers – Richard Reid, known as the shoe bomber – was a British citizen, and would not have needed a visa to enter the United States."}