{"url": "https://www.nytimes.com/2017/07/20/business/laptop-ban-air-travel.html?mcubz=0", "id": "425", "title": "Laptop Ban on Planes Is Lifted, U.S. Officials Confirm", "text": "Laptop Ban on Planes Is Lifted, U.S. Officials Confirm Image Passengers waiting to board an Emirates Airlines flight in Dubai. Credit Kamran Jebreili/Associated Press\n\nThe laptop ban is over.\n\nPassengers flying into the United States from airports in 10 Muslim-majority countries affected by the ban may now take their laptops and other large electronic devices into the cabin with them, the Department of Homeland Security confirmed on Thursday.\n\nSecurity officials imposed the ban in March, warning then that the Islamic State was developing bombs that could be hidden in portable electronic devices. But the airlines and airports affected by the ban have all complied with the initial phase of the new Homeland Security standards, allowing the prohibition to be lifted, the department said.\n\nThe ban on portable devices created a headache for carriers flying into the United States from the affected airports. Many airline passengers expect to use laptops and tablets as a matter of course, for both entertainment and to get work done. Analysts feared it would reduce the number of people visiting the United States from the 10 countries, which stretched from North Africa to the Mideast and into Turkey.\n\nThe commercial aviation industry expressed alarm after security officials said in May that they were considering expanding the ban to all flights to the United States from Europe, a huge market for both leisure and business travelers.\n\nInstead of carrying out that broader ban, John F. Kelly, the Homeland Security secretary, announced last month that there would be new security standards for carriers flying into the United States. The first phase of those new rules required airports with carriers flying to American destinations to quickly demonstrate that they had the ability to screen passengers for trace amounts of explosives.\n\nMore than 280 airports — including the 10 targeted by the original laptop ban — complied with that rule, officials said Thursday.\n\n“The quick and decisive action taken by airlines, nations, and stakeholders are a testament to our shared commitment to raising the bar on global aviation security,” David Lapan, a spokesman for the Department of Homeland Security, said.\n\nThe ban originally applied to airports in Amman, Jordan; Cairo; Istanbul; Jidda and Riyadh in Saudi Arabia; Kuwait City; Casablanca, Morocco; Doha, Qatar; and Dubai and Abu Dhabi in the United Arab Emirates.\n\nIt affected specific airlines that use the airports in those countries as hubs, including Qatar Airways, which dominates the airport in Doha, and Emirates Airlines, which is based in Dubai.\n\nOver the last few weeks, both the Transportation Security Administration and airlines have periodically announced that airports on the ban list met the new security rules, allowing passengers to carry on the electronic devices again. Customers of these airlines used social media to express relief as the news broke.\n\nYay!! Less boredom in the 11 hours flight — Hadeel Ali Alzoubi (@Hadeelali7) July 9, 2017\n\nHaha. It is definitely a good news. — Swastik Pokhrel (@swastikpokhrel) July 9, 2017\n\nIn addition to adding explosive-detection equipment, airlines must, by this fall, demonstrate that they have the ability to conduct tougher security checks, including interviewing passengers as part of the screening, The Times has previously reported.\n\nOfficials at Homeland Security have said they want to improve the overall level of aviation security around the globe.\n\n“We are raising aviation security as opposed to just going after one single threat,” Mr. Kelly, the Homeland Security secretary, said recently at an event in Colorado.\n\nOrder Reprints | Today’s Paper | Subscribe A version of this article appears in print on , on Page B 3 of the New York edition with the headline: Homeland Security Lifts Laptop Ban on Planes Coming From Muslim Nations\n\n\n\n\n\n\n\nThe All-New DealBook Our columnist Andrew Ross Sorkin and his Times colleagues help you make sense of major business and policy headlines — and the power-brokers who shape them. Please verify you’re not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. * Required field You agree to receive occasional updates and special offers for The New York Times products and services. * Required field Thank you for subscribing. View all New York Times newsletters. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. Sign Up", "authors": ["Micah Maidenberg"], "publish_date": "2017-07-20", "source": "nytimes", "top_words": ["passengers", "airports", "ban", "homeland", "confirm", "security", "officials", "united", "states", "times", "airlines", "laptop", "york", "lifted", "planes"], "summary": "Laptop Ban on Planes Is Lifted, U.S. Officials Confirm Image Passengers waiting to board an Emirates Airlines flight in Dubai.\nThe ban on portable devices created a headache for carriers flying into the United States from the affected airports.\nMore than 280 airports — including the 10 targeted by the original laptop ban — complied with that rule, officials said Thursday.\nOfficials at Homeland Security have said they want to improve the overall level of aviation security around the globe.\n* Required field You agree to receive occasional updates and special offers for The New York Times products and services."}