{"url": "https://www.nytimes.com/2016/11/26/us/politics/donald-trumps-republicans-senate.html?mcubz=0", "id": "57", "title": "Trump’s Next Battle: Keeping These Republican Senators Happy", "text": "They will differ issue by issue, and they will certainly side much more often than not with the Republican majority. And don’t count on them to block cabinet nominees such as their Republican colleague Jeff Sessions of Alabama, Mr. Trump’s choice for attorney general, despite criticism of his civil rights record. They know and like Mr. Sessions.\n\nThey are poised to challenge the new administration and their colleagues on policy areas in which they deeply disagree or on some of the more extreme proposals that arose from the Trump campaign.\n\n“If the president came forth with a legislative proposal that would ban all Muslims from coming into the United States, I would obviously oppose something like that,” said Ms. Collins, a centrist who wrote an op-ed article in August announcing that she would not vote for Mr. Trump because he did not represent historical Republican values.\n\nPhoto\n\nShe and others in this group are fully capable of building bipartisan coalitions large enough to assert control over an issue and push legislation in one direction or another, siphoning some authority from the leadership. Though House conservatives are agitating to eliminate the filibuster, most of the senators in this group would be reluctant to support such a move since they derive some of their own clout from the threat of that procedural tool.\n\nHere’s a look at how the others besides Mr. Graham and Ms. Collins figure to be at the center of activity.\n\nMr. Alexander: As chairman of the Senate health committee, he will be pivotal in any action Congress takes to overturn the Affordable Care Act, and he has urged caution to his colleagues. He has forged a close relationship with Senator Chuck Schumer of New York, the new Democratic leader, and has worked well with Senator Patty Murray of Washington, the senior Democrat on the committee and now No. 3 in her party’s leadership. He left the Republican leadership a few years ago because he felt constrained by a role requiring party-line allegiance.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMr. McCain: He has already made clear that he will oppose any effort by the Trump administration to reinstate interrogation methods, like waterboarding, that have been deemed to be torture. Given his distrust of President Vladimir V. Putin of Russia, he, along with Mr. Graham, will serve as a check on efforts to foster closer ties with Russia. As chairman of the Armed Services Committee, he will wield tremendous influence over Pentagon policy. Newly re-elected at age 80, Mr. McCain most likely ran his last race, freeing him from electoral concerns about a backlash from the right.\n\nMs. Murkowski: As chairwoman of the energy committee, she is a strong advocate of domestic oil and gas production, but has also raised concerns about man-made climate change and its increasing impact on her state’s environment. Like Ms. Collins, she has a voting record in support of abortion rights, and she can be more of a libertarian than a conservative. Perhaps most important, she won re-election in 2010 as a write-in candidate and clashed with the party leadership, making her something of a free agent.\n\nAdvertisement Continue reading the main story\n\nMr. Flake: One of the most outspoken Trump foes in the Senate, he took Mr. Trump on directly at a private party meeting. Both in the House and the Senate, Mr. Flake has challenged his leadership, and in some cases has won, notably on his crusade against the home-state projects known as earmarks. A champion of immigration reform, he is up for re-election in 2018 and is likely to be hit from right and left.\n\nMr. Paul: He has already threatened to filibuster Mr. Trump’s cabinet picks, and he previously raised the alarm about the reach of government surveillance programs, which could put him at odds with the new administration. He has urged restraint with American military power, putting him distinctly at odds with Mr. McCain and Mr. Graham in that area.\n\nMr. Sasse: A persistent detractor of Mr. Trump throughout the campaign, he seems most likely to challenge Mr. Trump in cases of perceived abuse of executive power. In a Nebraska op-ed article after the election, he urged a search for common ground with Mr. Trump, but warned that there would be disagreements. “There are absolutely some things that worry me,” he wrote.\n\nThe question for these Republicans is how many of those worrisome things will pop up and how far will they go to oppose them.", "authors": ["Carl Hulse", "On Washington"], "publish_date": "2016-11-26", "source": "nytimes", "top_words": ["republican", "battle", "trump", "urged", "oppose", "senate", "happy", "trumps", "york", "senators", "committee", "ms", "leadership", "keeping", "mr"], "summary": "They will differ issue by issue, and they will certainly side much more often than not with the Republican majority.\nHe left the Republican leadership a few years ago because he felt constrained by a role requiring party-line allegiance.\nAdvertisement Continue reading the main storyMr. Flake: One of the most outspoken Trump foes in the Senate, he took Mr. Trump on directly at a private party meeting.\nMr. Sasse: A persistent detractor of Mr. Trump throughout the campaign, he seems most likely to challenge Mr. Trump in cases of perceived abuse of executive power.\nIn a Nebraska op-ed article after the election, he urged a search for common ground with Mr. Trump, but warned that there would be disagreements."}