{"url": "https://www.nytimes.com/2016/11/21/nyregion/mayor-de-blasio-vows-to-shield-new-yorkers-from-trumps-policies.html?mcubz=0", "id": "54", "title": "Mayor de Blasio Vows to Shield New Yorkers From Trump’s Policies", "text": "Mr. de Blasio’s speech, delivered as he has begun his own re-election campaign, included several instances of call-and-response with the friendly crowd drawn from the full panoply of New York diversity, both in the seats and on the dais. An openly lesbian Protestant chaplain from the Fire Department helped to open the gathering along with an imam from the Police Department.\n\nMr. de Blasio spoke from a lectern adorned with a hashtag — #AlwaysNewYork — meant to inspire tales of solidarity and pride in New York values. He reminded the audience that Mr. Trump defended those values in abstract on the campaign trail during the Republican primary contests.\n\n“We ain’t changing,” Mr. de Blasio said, before listing his promises to defend New Yorkers from deportation, unconstitutional police practices and any cuts to federal funding for Planned Parenthood. “We will ensure women receive the health care they need.”\n\nFormer city lawyers said the mayor could rely on the federalism of the Constitution as well as established case law to challenge undesired programs from Washington. It could be many more months, if not years, before the issues would be resolved in court.\n\n“There is important value in reassuring people that the city and the state maintain considerable sovereignty over its own policy,” said Victor A. Kovner, a partner at Davis Wright Tremaine and a former city corporation counsel.\n\nThe federal government may have broad authority over immigration, said Michael A. Cardozo, a partner at Proskauer who served as the corporation counsel under Mayor Michael R. Bloomberg, a Republican turned political independent. “But those laws do not give the federal government carte blanche to do whatever it wants with an immigrant.”\n\nSince the presidential election provided a shock to residents in the city and in many areas of the state, Mr. de Blasio and Mr. Cuomo have offered similar messages, appealing to Mr. Trump’s New York roots while also presenting themselves as defenders of their constituents who are worried about a new administration that neither of them supported during the campaign.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe speeches were met with derision from state Republicans on Monday. Edward F. Cox, the chairman of the state Republican Party, in a statement accused both of a “naked and unseemly fight” to position themselves for a future presidential run.\n\nAdvertisement Continue reading the main story\n\n“These two scorpions in a bottle are each trying to outdo one another with slanderous fear-mongering hyperbole,\" he said.\n\nAsked about Mr. de Blasio’s attempt to calm fearful New Yorkers, Kellyanne Conway, a top adviser to Mr. Trump, mocked the mayor to reporters outside Trump Tower: “Fearful of the jobs he’s killed? Fearful of the bike lanes?”\n\nThat sentiment was repeated in the response to Mr. de Blasio’s hashtag, which for much of Monday provided a forum on Twitter for those opposed to his handling of the city to vent frustrations, as well as for supporters.\n\n“Mayor de Blasio rolled over for the N.Y.P.D. after they did a back-turning protest,” one user wrote. “You think he won’t roll over for Trump?”\n\n“So proud to be a New Yorker,” another wrote. “They should both be impeached,” another said of the mayor and the governor.\n\nEven with a shared antagonist in Mr. Trump, Mr. de Blasio and Mr. Cuomo have not been able to bridge the gap between them that, those close to both men say, has seemingly widened beyond repair. They have not held an event together since the election and have appeared content to go their own way in assuaging the concerns of New Yorkers, even as they end up finding very similar ways of doing so.\n\n“We will stand up and say, ‘Yes we are black, white and brown — but we are one,’” Mr. Cuomo said in his speech.\n\nMr. de Blasio said in his remarks the next day, “To all Latinos who heard their culture denigrated — we stand by you.”\n\n“Yes we are Christian, Muslim and Jews, but we are one,” Mr. Cuomo said.\n\n“To all the Muslims who have heard their faith belittled — we stand by you,” Mr. de Blasio said.\n\nAdvertisement Continue reading the main story\n\n“And that is the New York way,” Mr. Cuomo said.\n\n“We are always New York,” Mr. de Blasio ended.", "authors": ["J. David Goodman"], "publish_date": "2016-11-21", "source": "nytimes", "top_words": ["yorkers", "shield", "policies", "blasio", "trump", "state", "stand", "trumps", "city", "cuomo", "mayor", "york", "vows", "mr"], "summary": "He reminded the audience that Mr. Trump defended those values in abstract on the campaign trail during the Republican primary contests.\nEven with a shared antagonist in Mr. Trump, Mr. de Blasio and Mr. Cuomo have not been able to bridge the gap between them that, those close to both men say, has seemingly widened beyond repair.\n“To all the Muslims who have heard their faith belittled — we stand by you,” Mr. de Blasio said.\nAdvertisement Continue reading the main story“And that is the New York way,” Mr. Cuomo said.\n“We are always New York,” Mr. de Blasio ended."}