{"url": "http://nytlive.nytimes.com/womenintheworld/2017/01/31/trump-administrations-1st-military-raid-results-in-death-of-8-year-old-american-girl/?mcubz=0", "id": "5", "title": "Trump administration’s 1st military raid results in death of 8-year-old American girl", "text": "The first military raid carried out under President Donald Trump’s administration resulted in deadly consequences for an 8-year-old American girl and a U.S. Navy SEAL. Three al Qaeda operatives were also killed in the clandestine strike, military officials said, according to NBC News.\n\nThe strike was carried out in southern Yemen over the weekend and was put together by the Joint Special Operations Command and carried out by the elite SEAL Team 6, the same unit that famously killed Osama bin Laden.\n\n“Almost everything went wrong,” one military official told NBC News. First, the helicopter the SEAL team members were riding in made a hard landing, causing injuries to two of the SEALs. Then a firefight with enemy combatants broke out, leaving U.S. Chief Petty Officer William “Ryan” Owens dead.\n\nIt was in that firefight that Nawar al-Awlaki, also known as Nora, was killed, though the details of exactly how she died are in dispute. Nora, 8, is the daughter of Anwar al-Awlaki, the U.S. born Muslim cleric-turned al Qaeda extremist who was killed in 2011 by a U.S. drone strike. The U.S. official said Nora and several Yemeni women were also killed in the raid, but that some of the women had opened fire on the SEALs.\n\nNasser al-Awlaki, the girl’s grandfather, gave NBC News a different version of events of what took place. “My granddaughter was staying for a while with her mother, so when the attack came, they were sitting in the house, and a bullet struck her in her neck at 2:30 past midnight. Other children in the same house were killed,” he said. Nora died from her injuries two hours after suffering the gunshot wound, he said. The grandfather went on to say that the SEALs burned the home after raiding it, and that Nora’s mother escaped the raid with only a minor injury. The U.S. has also killed Anwar al-Awlaki’s father and son in previous drone strikes.\n\nThe grandfather said his daughter and granddaughter were in the region because they fled the fighting in Sa’ana, Yemen’s capital, where a civil war has been raging for nearly two years. Photos of Nora began surfacing on social media over the last 24 hours, showing a smiley little girl. Other images, the authenticity of which couldn’t be confirmed, purported to show the girl’s dead body. The news of Nora’s death comes amid global controversy over Trump’s travel ban, temporarily barring entry to the U.S. by citizens of seven predominantly Muslim countries. Yemen is one of the nations on the list.\n\nRead the full story at NBC News.\n\nRelated\n\nEmaciated teen whose heartbreaking photos made her the ‘face of famine’ in Yemen is recovering\n\nTrump fires acting attorney general who defied him on controversial travel ban\n\nDonald Trump’s travel ban feels like it’s ‘keeping us safe’ from an invented threat", "authors": ["Witw Staff"], "publish_date": "2017-01-31", "source": "nytimes", "top_words": ["girl", "death", "results", "8yearold", "travel", "trump", "raid", "nora", "yemen", "administrations", "seal", "strike", "nbc", "trumps", "killed", "military", "american", "1st"], "summary": "The first military raid carried out under President Donald Trump’s administration resulted in deadly consequences for an 8-year-old American girl and a U.S. Navy SEAL.\nThree al Qaeda operatives were also killed in the clandestine strike, military officials said, according to NBC News.\n“Almost everything went wrong,” one military official told NBC News.\nPhotos of Nora began surfacing on social media over the last 24 hours, showing a smiley little girl.\nThe news of Nora’s death comes amid global controversy over Trump’s travel ban, temporarily barring entry to the U.S. by citizens of seven predominantly Muslim countries."}