{"url": "https://www.nytimes.com/2016/11/28/business/delta-air-lines-bans-trump-supporter-for-life-after-rude-remarks.html?mcubz=0", "id": "58", "title": "Delta Air Lines Bans Disruptive Donald Trump Supporter for Life", "text": "Ms. Baum told The Morning Call that as the man became animated, jumping out of his seat, she began recording him with her cellphone. In the video, the man is seen clapping his hands and shouting at other passengers.\n\nPhoto\n\nHe says in part: “Donald Trump, baby! We got some Hillary bitches on here?”\n\nThe man also yelled: “Donald Trump! It’s your president. Every goddamn one of you. If you don’t like it, too bad.”\n\nA Daily Beast writer was also provided with a copy of the video.\n\nMs. Baum said the man was briefly removed from the plane and then allowed back on the flight before it took off. She said she reported him to the authorities when the plane landed.\n\nAfter the video was posted online, Delta Air Lines issued a statement on Nov. 26, apologizing to customers for the disruption and saying, “We have followed up with the teams involved and all agree that this customer should not have been allowed to continue on the flight.”\n\nMr. Bastian said in the statement on Monday: “After questioning the customer, our team members made the best decision they could given the information they had and allowed him to remain on the flight.”\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nHe added, “If our colleagues had witnessed firsthand what was shown in the video, there is no question they would have removed him from the aircraft. He will never again be allowed on a Delta plane.”\n\nThe video was shared widely online, with many commentators noting that the man, who is white, was not ejected from the flight, but that passengers who are Muslim, Sikh, African-American and other races and ethnicities have been subjected to extra scrutiny or outright removal by various airlines while engaging in routine activities.\n\nIt was not immediately clear what, if any measures, were taken at the airport in Allentown when the man disembarked. Assistant Chief Gail Struss of the Allentown Police Department said in an email on Monday: “It’s possible we were called, but no report was taken by us that I can find. We would have referred the caller to the airport police.”\n\nOfficers at the Police Department at the Lehigh-Northampton Airport Authority were not dispatched to respond to any passenger disturbance on Nov. 22, a spokesman, Colin Riccobon, said in an email.", "authors": ["Christine Hauser"], "publish_date": "2016-11-28", "source": "nytimes", "top_words": ["disruptive", "lines", "airport", "trump", "allowed", "email", "life", "statement", "man", "donald", "delta", "taken", "sign", "air", "supporter", "bans", "york", "video"], "summary": "In the video, the man is seen clapping his hands and shouting at other passengers.\nWe got some Hillary bitches on here?”The man also yelled: “Donald Trump!\nIf you don’t like it, too bad.”A Daily Beast writer was also provided with a copy of the video.\nSign Up You agree to receive occasional updates and special offers for The New York Times's products and services.\nIt was not immediately clear what, if any measures, were taken at the airport in Allentown when the man disembarked."}