{"url": "https://www.nytimes.com/2017/01/10/world/europe/swiss-muslim-girls-must-attend-swim-classes-with-boys-court-says.html?mcubz=0", "id": "65", "title": "Muslim Girls in Switzerland Must Attend Swim Classes With Boys, Court Says", "text": "The case was the latest to pit freedom of religion against the imperative of social integration, and to raise the question of whether — and how much — a government should accommodate the religious views of Muslim citizens and residents, many of them immigrants.\n\nThe ruling could set an important precedent in other cases in which religious and secular values or norms come into conflict.\n\nThe decision comes as Europe has been struggling to integrate migrants, many from majority-Muslim countries where religious and social mores, particularly around gender and sexuality, can be at odds with liberal and secular norms of the societies where they have sought refuge.\n\nFar-right political parties with anti-immigrant bents, from the National Front in France to the Danish People’s Party in Denmark and the Swiss People’s Party in Switzerland, have argued that too many Muslims have not managed to assimilate.\n\nIn May, the authorities in the canton of Basel-Landschaft — which is next to the canton of Basel-Stadt, where the swimming case occurred — ruled that two Syrian immigrant brothers, who studied at a public school in the small town of Therwil, could not refuse to shake their teacher’s hand on religious grounds. Their refusal to do so had provoked a national uproar.\n\nThe challenge of integrating immigrants has spilled over into culture, and, at times, helped fan a simmering culture war. In Denmark, pork meatballs and other pork dishes that are popular staples became part of a debate on national identity last year after the central Danish town of Randers voted in January to require public day care centers and kindergartens to include the meat on their lunch menus.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nSupporters of the proposal said that serving traditional Danish food such as pork was essential to help preserve national identity. Critics said the proposal did nothing more than stigmatize Muslims, who had made no attempts to ban pork from school menus.\n\nGermany was shaken during New Year’s Eve in Cologne in 2015 when young men, many of them of North African origin, committed sexual assaults during the street celebrations there. The attacks became an uncomfortable symbol of the challenges of integration in the country.\n\nAdvertisement Continue reading the main story\n\nIn France, the clash between secularism and religious conservatism came into sharp relief this summer when nearly 30 towns, mainly in the country’s southeast, introduced burkini bans, suggesting that the garments impinged upon French culture and way of life.\n\nIn the case of the swimming classes in Switzerland, the authorities ruled that lessons mixing boys and girls were an important part of the school curriculum; they did allow that the girls could apply for an exemption on religious grounds, but only if they had gone through puberty, which was not the case for the daughters of Mr. Osmanoglu and Ms. Kocabas.\n\nThe parents argued that even though the Quran does not require girls’ bodies to be covered until puberty, “their belief commanded them to prepare their daughters for the precepts that would be applied to them from puberty” onward, according to the court’s summary of the case.\n\nThe decision, by a chamber of seven judges, did not dispute that the denial of the parents’ request interfered with their religious freedom, but it emphasized that the need for social cohesion and integration trumped the family’s wishes. The court also noted that schools play “a special role in the process of social integration, particularly where children of foreign origin were concerned,” and that, as such, ensuring the girls’ “successful social integration according to local customs and mores” took precedence over religious concerns.\n\nThe parents have three months to appeal the court’s decision. Representatives of the family could not be reached for comment on Tuesday.\n\nIn Switzerland, politicians and civic groups across the political spectrum welcomed the ruling, calling it an important validation of the supremacy of secularism and the rule of law, even as some Muslims complained that it reflected growing intolerance for religious minorities.\n\n“The swimming pool verdict unfortunately is what we expected,” Qaasim Illi, a board member of the Swiss Central Islamic Council, wrote on Twitter. “Tolerance toward the religious is diminishing throughout Europe.”", "authors": ["Dan Bilefsky"], "publish_date": "2017-01-10", "source": "nytimes", "top_words": ["case", "national", "swimming", "classes", "pork", "court", "attend", "integration", "girls", "religious", "school", "swim", "switzerland", "social", "muslim", "boys"], "summary": "The ruling could set an important precedent in other cases in which religious and secular values or norms come into conflict.\nThe challenge of integrating immigrants has spilled over into culture, and, at times, helped fan a simmering culture war.\nSupporters of the proposal said that serving traditional Danish food such as pork was essential to help preserve national identity.\nCritics said the proposal did nothing more than stigmatize Muslims, who had made no attempts to ban pork from school menus.\nThe court also noted that schools play “a special role in the process of social integration, particularly where children of foreign origin were concerned,” and that, as such, ensuring the girls’ “successful social integration according to local customs and mores” took precedence over religious concerns."}