{"url": "https://www.nytimes.com/2016/12/21/us/politics/donald-trump-syria-policy.html?mcubz=0", "id": "61", "title": "Trump Suggests Berlin Attack Affirms His Plan to Bar Muslims", "text": "“We know he’s got some instincts and predilections, but there is no coherent Trump foreign-policy doctrine, and we’re not likely to see one,” said Eliot A. Cohen, a professor of strategic studies at Johns Hopkins University who worked for President George W. Bush and has been a vocal critic of Mr. Trump.\n\n“They’re in the fun phase now,” Mr. Cohen added, “but they’re in for a whole bunch of rude awakenings.”\n\nOne area where Mr. Trump and his advisers have been unswerving is their repeated denunciation of “radical Islamic terrorism.”\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nBut his position on barring Muslim immigrants has gone through various modifications since December 2015, when he first called for a “total and complete shutdown of Muslims entering the United States until our country’s representatives can figure out what is going on.”\n\nPhilip D. Zelikow, who served in the administrations of both Presidents Bush and now teaches at the University of Virginia, said there were three guiding themes in Mr. Trump’s foreign policy: economic nationalism, a war against “radical Islamic terrorism,” and a “deliberate aloofness” toward the actions of other countries — for example, Russia. “Beyond that,” Mr. Zelikow said, “there is an ambient prickliness. We could end up picking fights with three-quarters of the world.”\n\nOn Wednesday, Mr. Trump and his national security adviser, Michael T. Flynn, met with a delegation of generals and admirals from the Pentagon’s joint staff at the president-elect’s Palm Beach club. A day earlier, Mr. Flynn met in Washington with Vice President-elect Mike Pence and Mr. Trump’s nominees for secretary of defense, Gen. James N. Mattis; secretary of state, Rex W. Tillerson; and secretary of Homeland Security, John F. Kelly.\n\nThe military officers at the meeting focus mostly on the acquisition of equipment, including the F-35 Joint Strike Fighter, whose costs Mr. Trump recently complained had spiraled “out of control.” This suggests that his first major Pentagon briefing was about hardware and budgets, not military operations.\n\nAdvertisement Continue reading the main story\n\nAdvisers to Mr. Trump did not discuss the meetings or say how he planned to respond to the attack in Germany, as well as ones in Turkey and Switzerland. In a Twitter post on Monday, the president-elect said that terrorism was “getting worse” and that “the civilized world must change thinking!”\n\nThat has left analysts to pore over Mr. Trump’s recent pronouncements to figure out how they might alter the policy followed by the Obama administration. His call for safe zones, which he made during a rally in Hershey, Pa., last week, suggested to some that he would seek a more activist role in Syria, probably working with Russia, which has had an antagonistic relationship with President Obama.\n\n“Why is he saying this?” asked Andrew J. Tabler, an expert on Syria at the Washington Institute for Near East Policy. Referring to Syria’s president, Bashar al-Assad, he said, “The answer is, he’s getting briefings that show that Bashar Assad is so depleted in manpower that it will take years, not months, for him to reconquer his territory.”\n\n“The fact that he said that says to me that he recognizes that Syria is going to be a divided country,” Mr. Tabler said.\n\nDuring the presidential campaign, Mr. Trump sent mixed messages on Syria. He called for the creation of “a big, beautiful safe zone” in the country to stem the tide of refugees from Syria to Europe. But he also said the United States should resist getting drawn into the grinding conflict against Mr. Assad because the real enemy was the Islamic State.\n\nWhen Hillary Clinton, his opponent, called for the imposition of a no-fly zone over Syria, Mr. Trump warned that it could lead to “World War III” with Russia. Analysts point out, however, that securing a safe zone would probably require some kind of a no-fly zone. They also said it was not clear why a gulf nation like Saudi Arabia would agree to deploy troops or pay for such a zone.\n\nGot a confidential news tip? The New York Times would like to hear from readers who want to share messages and materials with our journalists.\n\nMr. Trump’s handling of the drone episode with China was similarly inconsistent. His initial Twitter post, “China steals United States Navy research drone in international waters — rips it out of water and takes it to China in unprecedented act,” suggested he viewed it as a grave affront.\n\nBut after the Chinese agreed to return the submersible drone to a Navy ship off the Philippines, he wrote, “We should tell China that we don’t want the drone they stole back.”\n\nAdvertisement Continue reading the main story\n\nThe Obama administration’s response, by contrast, was so muted that some analysts in the region worried that it might embolden China to act more boldly in the South China Sea. Some speculated that the Chinese were twitting Mr. Trump after his own provocative actions toward them.\n\nMr. Trump accepted a congratulatory phone call from the president of Taiwan this month — the first such leader-to-leader exchange between Taiwan and the United States in nearly four decades — and declared that he viewed the “One China” policy as a bargaining chip with Beijing.\n\nMr. Obama said in a news conference last week: “The idea of ‘One China’ is at the heart of their conception as a nation. And so, if you are going to upend this understanding, you have to have thought through the consequences, because the Chinese will not treat it the way they’ll treat some other issues.”", "authors": ["Mark Landler"], "publish_date": "2016-12-21", "source": "nytimes", "top_words": ["affirms", "trump", "bar", "policy", "suggests", "plan", "china", "zone", "united", "syria", "trumps", "berlin", "states", "president", "muslims", "mr", "attack"], "summary": "Advertisement Continue reading the main storyAdvisers to Mr. Trump did not discuss the meetings or say how he planned to respond to the attack in Germany, as well as ones in Turkey and Switzerland.\nDuring the presidential campaign, Mr. Trump sent mixed messages on Syria.\nWhen Hillary Clinton, his opponent, called for the imposition of a no-fly zone over Syria, Mr. Trump warned that it could lead to “World War III” with Russia.\nMr. Trump’s handling of the drone episode with China was similarly inconsistent.\nSome speculated that the Chinese were twitting Mr. Trump after his own provocative actions toward them."}