{"url": "https://www.nytimes.com/2017/01/10/us/politics/trump-confirmation-hearings.html?mcubz=0", "id": "64", "title": "Hearing Highlights: Sessions Questioned on Links to Xenophobia", "text": "Mr. Sessions said he does not necessarily share the views of every political donor or organization he has received an award from.\n\nA change in tone on marijuana\n\nMr. Sessions came of age in the Justice Department at the height of the crack epidemic. He has described himself as a lieutenant in the war on drugs, said he was “heartbroken” when President Obama compared marijuana to alcohol, and criticized the administration for not enforcing drug laws in states like Colorado that have legalized marijuana. He said in 2015:\n\nIt’s still a federal offense to deal in marijuana in the United States, and so even though a state doesn’t have that law, the federal government does. They said, ‘Well, if you don’t enforce it, we won’t enforce it.’ Another relaxation of federal law.\n\nFlash forward to Tuesday. Mr. Sessions sidestepped questions about whether he would put the weight of the Justice Department behind drug prosecution in those states. Doing so would set up a huge fight over states’ rights and federal drug policy. “I know it won’t be an easy decision,” he said.\n\nNo vitriol\n\nSenate Democrats do not have the votes, by themselves, to prevent Mr. Sessions from becoming attorney general, and they have spared their colleague any vitriol, doing little to undermine his confirmation. Mr. Sessions was prepared to face renewed questions about race and comments he was accused of making in the 1980s regarding the N.A.A.C.P., the American Civil Liberties Union and “un-American” views. Liberal activists have repeatedly disrupted the hearing, screaming “K.K.K.” or “racist.” But the questioning from Democrats has mostly focused on his Senate record and whether he would enforce laws that he disagreed with. He has said he would.\n\nPhoto\n\nIn short, there is no indication so far that his confirmation is in jeopardy.\n\nNo workaround on waterboarding\n\nMr. Sessions, who has supported the use of waterboarding as an interrogation tactic, said that current law makes it “absolutely improper and illegal.” That’s important because it suggests that Mr. Sessions sees no workaround that would allow Mr. Trump to reinstate such tactics. Mr. Sessions has previously said he supported the Justice Department legal analysis that authorized harsh interrogation in C.I.A. prisons, and has said that waterboarding works. By saying that the law against waterboarding is clear, Mr. Sessions makes it much harder, if not impossible, for Mr. Trump to bring it back.\n\nNo support for Muslim ban\n\nIn response to a question about whether he supported a temporary ban on Muslim immigration, as Mr. Trump has suggested, Mr. Sessions said he did not. “I have no belief and do not support the idea that Muslims as a religious groups should be denied admission to the United States,” he said. But he noted that Mr. Trump has since clarified that the restriction should be on immigration from countries that support terrorism. He said religious views — where, for example, they include justification for violence against Americans — should be considered as part of the visa progress.\n\nWould you support a law that says, ‘You can’t come to America because you’re a Muslim’? asked Senator Lindsey Graham, Republican of South Carolina.\n\n“No,” Mr. Sessions replied.\n\nA promise to recuse\n\nMr. Sessions was a top surrogate for Mr. Trump during a campaign in which “lock her up!” was a rallying cry against Mrs. Clinton. Mr. Sessions said that if there were lingering investigations into Mrs. Clinton’s use of a private email server or her family foundation, he would recuse himself.\n\nAdvertisement Continue reading the main story\n\n“You intend to recuse yourself from both the Clinton email matter and any investigation involving the Clinton foundation, if there are any?” asked Senator Charles E. Grassley, Republican of Iowa.\n\n“Yes,” Mr. Sessions said. “This country doesn’t punish its political enemies.”\n\nPhoto\n\nA more forceful denial\n\nMr. Sessions last faced the Judiciary Committee three decades ago, for a seat on the federal bench. His nomination failed, in part over allegations that he had described civil rights groups as “un-American” and that he had suggested a white lawyer was a disgrace to his race for representing African-Americans. At the time, he said his comments were misunderstood or taken out of context. He offered a more forceful denial this time: “I never declared that the N.A.A.C.P. was ‘un-American’ or that a civil rights attorney was a ‘disgrace to his race,’” Mr. Sessions said.\n\nIn 1986 he described it this way:\n\nThe N.A.A.C.P. and other civil rights organizations, when they leave the basic discriminatory questions and start getting into matters such as foreign policy and things of that nature and other political issues — and that is probably something I should not have said, but I really did not mean any harm by it.\n\nAnd here’s how he described the “disgrace to his race” exchange.\n\nPhoto\n\nOffering assurances\n\nMr. Sessions assured his Senate colleagues that he would strictly adhere to the Constitution and stand up to the president if needed. He’s been consistent for years that senators should apply that test to Justice Department nominees.\n\nThe Republican theme of the hearing is that Mr. Sessions is a known entity, and he reinforced that in his opening remarks. “You know who I am,” he said. “You know what I believe in.”\n\nThe bottom line\n\nMr. Sessions has been in the Senate for nearly 20 years and is liked by his colleagues. Moderate Republicans and at least one Democrat have said they will vote for him, which all but guarantees his confirmation. And General Kelly is likely to be easily confirmed. That does not mean Democrats will hold their fire, but they are likely to mount their most vigorous offensive against other nominees, including Representative Tom Price, a Georgia Republican who is Mr. Trump’s choice to be health secretary.\n\n‘Straight-talking, candid, courageous’\n\nWhile Mr. Sessions faced some tough questioning, the early going for General Kelly was more gentle. Mr. Gates, a former defense secretary under Mr. Obama and George W. Bush, introduced General Kelly as a “straight-talking, candid, courageous leader who will say exactly what he thinks.” But what sets him apart, Mr. Gates said, is his character.\n\nPhoto\n\n“To put it quite simply, he is one of the finest people I have ever known,” he said. “I would trust him with my life.”\n\nSenator Claire McCaskill of Missouri, the committee’s top Democrat, asked Mr. Kelly to be ready to take tough questions, but thanked him for providing the disclosures necessary by the Office of Government Ethics, whose review was completed this week.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nShe asked Mr. Kelly to hew closely to what he had described as his greatest strength: speaking truth to power.\n\nAdvertisement Continue reading the main story\n\n“That was music to my ears,” Ms. McCaskill said. “I believe very much in that principle, and I think we all anticipate that you will need it in your next job.”\n\n“Given your experience, I expect you to be up to that challenge,” she added. “And I think if you’re backing down, you’ll probably hear from me.”\n\nKelly says more than a wall is needed\n\nIn response to questions from Senator John McCain, Republican of Arizona, about Mr. Trump’s proposal to build a wall on the southern border, General Kelly said a physical barrier wasn’t going to stem the problem.\n\n“If you were to build a wall from the Pacific to Mexico, you would still have to have it backed up by people, by sensors, by other technologies,” he said.\n\nSubdued tone\n\nThe Kelly hearing was remarkable for its subdued tone, with Republicans and Democrats alike cordially asking Mr. Kelly about Mr. Trump’s more contentious stances, like forcing Muslims to register with the federal government.\n\nOne by one, he put their concerns to rest in a measured tone. It apparently proved too subdued for the protest group Code Pink. A couple of activists listened in their bright pink capes mere hours after disrupting the confirmation hearing for Mr. Sessions. More than an hour after the hearing started, they quietly collected their belongings and left the hearing room without any demonstration.", "authors": ["Matt Apuzzo", "Eric Lichtblau", "Emmarie Huetteman"], "publish_date": "2017-01-10", "source": "nytimes", "top_words": ["questions", "republican", "trump", "sessions", "questioned", "links", "general", "highlights", "kelly", "federal", "states", "hearing", "xenophobia", "mr"], "summary": "Sessions makes it much harder, if not impossible, for Mr. Trump to bring it back.\nNo support for Muslim banIn response to a question about whether he supported a temporary ban on Muslim immigration, as Mr. Trump has suggested, Mr.\nBut he noted that Mr. Trump has since clarified that the restriction should be on immigration from countries that support terrorism.\nSessions was a top surrogate for Mr. Trump during a campaign in which “lock her up!” was a rallying cry against Mrs. Clinton.\nShe asked Mr. Kelly to hew closely to what he had described as his greatest strength: speaking truth to power."}