{"url": "https://www.nytimes.com/2017/01/24/world/europe/mark-rutte-netherlands-muslim-immigrants-trump.html?mcubz=0", "id": "68", "title": "Dutch Leader Takes Trump-Like Turn in Face of Hard-Right Challenge", "text": "Mr. Rutte has led his center-right People’s Party for Freedom and Democracy since 2006, and he has been credited for changes that have helped lift his country — whose economy’s performance is closely tied to the fortunes of neighboring Germany — out of the doldrums after the 2008-9 economic crisis.\n\nMr. Rutte’s party faces a strong challenge from the far-right Party for Freedom, whose longtime leader, Geert Wilders, has a record of inflammatory remarks and was convicted last month of inciting discrimination for denigrating Moroccans before municipal elections in 2014.\n\nDespite the conviction, Mr. Wilders faced no criminal penalties or fines, and voters do not seem to have been turned off by his condemnations of what he calls Islamic extremism. A poll published on Sunday estimated that the Party for Freedom would come in first place, with 33 seats in the 150-seat Parliament, ahead of Mr. Rutte’s party, which was projected to win 24 seats.\n\nThe letter from Mr. Rutte, which was published online on Sunday, seemed like an effort to head off that challenge by embracing some of Mr. Wilders’s populist messages.\n\n“If you reject our country so fundamentally, I’d prefer you leave,” Mr. Rutte wrote in the letter. “I have the same feeling. Act normal or leave.”\n\nThe letter stunned members of the Dutch establishment.\n\n“Just not normal,” the newspaper NRC Handelsblad said in an editorial, turning Mr. Rutte’s words against him. It condemned the remarks as simplistic and opportunistic, and warned that they risked scapegoating Muslims.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nWriting in the newspaper Trouw, a columnist, Sylvain Ephimenco, called Mr. Rutte an “amateur populist.” In the centrist newspaper De Volkskrant, another journalist, Bert Wagendorp, mused that Mr. Rutte’s message sounded as if it had come from a focus group.\n\nMr. Wilders dismissed Mr. Rutte’s letter as an act of deceit, declaring in a video posted online: “Stop deceiving your own people. It was you who caused the loss of our freedom, our security and our culture.”\n\nAdvertisement Continue reading the main story\n\nMr. Wilders, who supports shutting down mosques and closing the borders to asylum seekers, wrote on Twitter, “The man of open borders, asylum tsunami, mass immigration, Islamization, lies and deceit.”\n\nAnalysts said Mr. Rutte’s statement was not only a response to the polls, but also part of a broader strategy to reconnect with angry and disaffected voters who have been fleeing mainstream parties. While traditional center-left and social-democratic voters seem to be most open to the messages of the far right, center-right parties like Mr. Rutte’s are taking heed.\n\nIn France and Germany, which are both holding national elections this year, center-right leaders have tacked right. François Fillon, a former prime minister who will be the center-right’s standard-bearer in the French election, has promised a strict stance on Islam and immigration. Even Chancellor Angela Merkel of Germany, while steadfastly defending her government’s decision to welcome hundreds of thousands of refugees and asylum seekers, recently took a hard line on the full-face veil worn by some Muslim women.\n\nThe debate over Islam in political life has a particularly strong resonance in the Netherlands.\n\nIn 2002, Pim Fortuyn, an openly gay politician who was typically described as a right-wing populist despite resisting such categorization, was assassinated by a Dutch citizen angered by Mr. Fortuyn’s anti-immigrant message.\n\nLater, Ayaan Hirsi Ali, a Somali-born activist who served in the Dutch Parliament, attracted global attention for her characterization of Islam as oppressive and violent. Ms. Hirsi Ali, who has renounced her Muslim faith, subsequently resigned from the Parliament during a controversy about her citizenship and moved to the United States, where she runs a foundation dedicated to protecting women’s and girls’ rights.\n\n“It is clear to the liberal party that they need to regain some of the votes that they virtually lost to the P.V.V., and part of their strategy is to be tough on immigration,” said Claes de Vreese, a political analyst at the University of Amsterdam, using the Dutch initials for Mr. Wilders’s party and the word liberal in the classical European sense of the word — supportive of free markets and individual liberties.\n\nIn previous years, the most important issue in the election would have been the economy, Mr. de Vreese said, but since the economy has been doing well over the past six months, the nation is more focused on immigration and integration, as well as on health care.", "authors": ["Ceylan Yeginsu"], "publish_date": "2017-01-24", "source": "nytimes", "top_words": ["turn", "wilders", "party", "challenge", "hardright", "ruttes", "immigration", "face", "rutte", "freedom", "dutch", "voters", "takes", "leader", "trumplike", "mr", "letter"], "summary": "A poll published on Sunday estimated that the Party for Freedom would come in first place, with 33 seats in the 150-seat Parliament, ahead of Mr. Rutte’s party, which was projected to win 24 seats.\nThe letter from Mr. Rutte, which was published online on Sunday, seemed like an effort to head off that challenge by embracing some of Mr. Wilders’s populist messages.\n“If you reject our country so fundamentally, I’d prefer you leave,” Mr. Rutte wrote in the letter.\n“Just not normal,” the newspaper NRC Handelsblad said in an editorial, turning Mr. Rutte’s words against him.\nMr. Wilders dismissed Mr. Rutte’s letter as an act of deceit, declaring in a video posted online: “Stop deceiving your own people."}