{"url": "https://www.nytimes.com/2017/01/27/opinion/the-closing-of-trumps-america.html?mcubz=0", "id": "77", "title": "The Closing of Trump’s America", "text": "This is worse than had seemed possible: Trump’s inexhaustible obsession with the crowd size at the inauguration; his constant untruths; his perverse inability to accept that he won the election, to the point that he wants to investigate the popular vote that he lost; his startling lust for torture, walls, banishment and carnage.\n\n“The world is a total mess,” he told David Muir of ABC. Funny, I travel the world and that was not my impression a week ago.\n\nThe president does not like Muslims. That, too, is clear. It was obvious when he called during the campaign for a temporary ban on Muslims entering the United States. It was obvious when he showed contempt for the parents of a fallen Muslim American soldier killed in Iraq. It is obvious now as he attempts to justify a planned suspension of visas for Syrians, Iranians, Iraqis and citizens of four other majority Muslim Middle Eastern and African countries, as well as a temporary ban on almost all refugees.\n\nA rough translation of “America First” is Muslims last. “It’s not the Muslim ban,” Trump insisted to Muir. No. It’s just a ban on lots of Muslims.\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Opinion Today Newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, the Times editorial board and contributing writers from around the world. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nTrump said, in the ABC interview, that the people to be barred “are going to come in and cause us tremendous problems.” He declared: “They’re ISIS.”\n\nThere is no credible evidence for this wild claim, a smear on entire populations. (Saudi Arabia, the source of most 9/11 terrorists, is unsurprisingly not on the list.)\n\nIn their overwhelming majority refugees are fleeing violence in their homelands, not plotting it against the United States. They do not put their little children in dinghies on the high seas because they have a choice but because they have no choice.\n\nAdvertisement Continue reading the main story\n\nScreening to get into the United States is already rigorous, one reason only a tiny fraction of some 5 million Syrian refugees have come here.\n\nA Cato Institute study of refugees admitted to the United States between 1975 and 2015 found that the chance of an American being killed in a terrorist attack committed by a refugee is 1 in 3.64 billion.\n\nThis is policy fed by anger and prejudice, not reason. The wall announcement has already provoked a damaging clash with Mexico. The proposed visa and refugee measures are not about keeping America safe. They are conceived to nurture an atmosphere of nationalist xenophobia.\n\nTrump has been right to call jihadi Islamist terrorism by its name. But conflating a religion of 1.6 billion people with it is no way to fight it. As for his promise of safe areas within Syria, we will see.\n\nI am lucky enough to live in Brooklyn Heights with a view out over the East River to lower Manhattan and the Statue of Liberty. So while watching President Donald Trump’s dark inaugural speech a week ago I was able at the same time to glance out at the torch that symbolizes American openness and generosity of spirit.\n\nAs Trump’s “AMERICA FIRST,” “AMERICA FIRST” echoed across my living room I thought of Emma Lazarus’ words inscribed on the pedestal of the statue:\n\n“Give me your tired, your poor,\n\nYour huddled masses yearning to breathe free,\n\nThe wretched refuse of your teeming shore.”\n\nFriedrich Trump, a penniless German immigrant, was one of those “huddled masses” back in 1885. Lucky he did not attempt to enter the America taking shape under his grandson.\n\nOver time, but not without struggle, I believe the ideals represented by the torch will prove stronger than Trump’s fear-filled jingoistic darkness. America cannot be itself without these ideals, and Americans will fight to preserve them. It is, after all, how they became who they are.", "authors": ["Roger Cohen"], "publish_date": "2017-01-27", "source": "nytimes", "top_words": ["america", "world", "ban", "refugees", "united", "closing", "trumps", "sign", "obvious", "states", "muslims"], "summary": "It was obvious when he called during the campaign for a temporary ban on Muslims entering the United States.\nIn their overwhelming majority refugees are fleeing violence in their homelands, not plotting it against the United States.\nAs Trump’s “AMERICA FIRST,” “AMERICA FIRST” echoed across my living room I thought of Emma Lazarus’ words inscribed on the pedestal of the statue:“Give me your tired, your poor,Your huddled masses yearning to breathe free,The wretched refuse of your teeming shore.”Friedrich Trump, a penniless German immigrant, was one of those “huddled masses” back in 1885.\nLucky he did not attempt to enter the America taking shape under his grandson.\nOver time, but not without struggle, I believe the ideals represented by the torch will prove stronger than Trump’s fear-filled jingoistic darkness."}