{"url": "https://www.nytimes.com/2017/01/25/us/politics/cia-detainee-prisons.html?mcubz=0", "id": "70", "title": "Trump Poised to Lift Ban on C.I.A. ‘Black Site’ Prisons", "text": "Specifically, the draft order would revoke two executive orders about detainees that Mr. Obama issued in January 2009, shortly after his inauguration. One was Mr. Obama’s directive to close the Guantánamo prison and the other was his directive to end C.I.A. prisons, grant Red Cross access to all detainees and limit interrogators to the Army Field Manual techniques.\n\nIn their place, Mr. Trump’s draft order would resurrect a 2007 executive order issued by President Bush. It responded to a 2006 Supreme Court ruling about the Geneva Conventions that had put C.I.A. interrogators at risk of prosecution for war crimes, leading to a temporary halt of the agency’s “enhanced” interrogations program.\n\nMr. Bush’s 2007 order enabled the agency to resume a form of the program by specifically listing what sorts of prisoner abuses counted as war crimes. That made it safe for interrogators to use other tactics, like extended sleep deprivation, that were not on the list. Mr. Obama revoked that order as part of his 2009 overhaul of detention legal policy.\n\nOne of the Obama orders Mr. Trump’s draft order would revoke also limited interrogators to using techniques listed in the Army Field Manual. But in 2015, Congress enacted a statute locking down that rule as a matter of law, as well as a requirement to let the Red Cross visit detainees. Those limits would remain in place for the time being.\n\nLasting Scars Articles in this series examine the American legacy of brutal interrogations.\n\nStill, the draft order says high-level Trump administration officials should conduct several reviews and make recommendations to Mr. Trump. One was whether to change the field manual, to the extent permitted by law. Another was “whether to reinitiate a program of interrogation of high-value alien terrorists to be operated outside the United States” by the C.I.A., including any “legislative proposals” necessary to permit the resumption of such a program.\n\nAdvertisement Continue reading the main story\n\nIt was not clear whether the C.I.A. would be enthusiastic about resuming a role in detaining and interrogating terrorism suspects after its scorching experience over the past decade. In written answers to questions by the Senate Intelligence Committee, Mr. Trump’s C.I.A. director, Mike Pompeo, said he would review whether a rewrite of the field manual was needed and left the door open to seeking a change in the law “if experts believed current law was an impediment to gathering vital intelligence to protect the country.”\n\nMr. Trump’s order says no detainee should be tortured or otherwise subjected to cruel, inhuman or degrading treatment “as prescribed by U.S. law,” but it makes no mention of international law commitments binding the United States to adhere to humane standards even if Congress were to relax domestic legal limits on interrogations, such as the Convention Against Torture or the Geneva Conventions.\n\nAnother core national security legal principle for Mr. Obama was to use civilian courts, not military commissions, whenever possible in terrorism cases — and to exclusively use civilian law enforcement agencies and procedures, not the military, to handle cases arising on domestic soil. The draft order also signals that the Trump administration may shift that approach as well.\n\nNewsletter Sign Up Continue reading the main story Get the Morning Briefing by Email What you need to know to start your day, delivered to your inbox Monday through Friday. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nIn 2012, after Congress enacted a statute mandating that the military initially take custody of all foreign Qaeda suspects, Mr. Obama issued a directive that pre-emptively waived that rule for most domestic circumstances, such as if the F.B.I. had arrested the suspect and was already in the process of an interrogation.\n\nBut Mr. Trump’s draft order calls for the attorney general, in consultation with other national-security officials, to review that directive and recommend modifications to it within 120 days.\n\nMany Republicans — including Senator Jeff Sessions, Mr. Trump’s attorney general nominee — criticized the Obama administration’s approach as weak, even though the civilian court system has regularly convicted terrorists at trial while the military commissions system has proved to be dysfunctional. During the campaign, Mr. Trump said he would prefer to prosecute terrorism suspects at Guantánamo — including American citizens, although the law currently limits the commissions system to foreign defendants.\n\nAgainst that backdrop, Mr. Trump’s draft order would direct Defense Secretary James N. Mattis, along with the attorney general and the director of national intelligence, to “review the military commissions system and recommend to the president how best to employ the system going forward to provide for the swift and just trial and punishment of unlawful enemy combatants detained in the armed conflict with violent Islamist extremists.”\n\nTom Malinowski, who was assistant secretary of state for human rights in the Obama administration, said the draft order showed that everyone who thought the office of the presidency or the advice of cabinet secretaries like Mr. Mattis would temper Mr. Trump “is being shown wrong again.”\n\n“He’ll listen to his worst instincts over his best advisers unless restrained by law,” Mr. Malinowski said.", "authors": ["Charlie Savage"], "publish_date": "2017-01-25", "source": "nytimes", "top_words": ["prisons", "site", "trump", "ban", "black", "cia", "law", "trumps", "obama", "system", "military", "lift", "order", "poised", "draft", "mr"], "summary": "Specifically, the draft order would revoke two executive orders about detainees that Mr. Obama issued in January 2009, shortly after his inauguration.\nIn their place, Mr. Trump’s draft order would resurrect a 2007 executive order issued by President Bush.\nOne of the Obama orders Mr. Trump’s draft order would revoke also limited interrogators to using techniques listed in the Army Field Manual.\nStill, the draft order says high-level Trump administration officials should conduct several reviews and make recommendations to Mr. Trump.\nIn written answers to questions by the Senate Intelligence Committee, Mr. Trump’s C.I.A."}