{"url": "https://www.nytimes.com/2017/01/27/opinion/trumps-immigration-ban-is-illegal.html?mcubz=0", "id": "78", "title": "Trump’s Immigration Ban Is Illegal", "text": "President Trump signed an executive order on Friday that purports to bar for at least 90 days almost all permanent immigration from seven majority-Muslim countries, including Syria and Iraq, and asserts the power to extend the ban indefinitely.\n\nBut the order is illegal. More than 50 years ago, Congress outlawed such discrimination against immigrants based on national origin.\n\nThat decision came after a long and shameful history in this country of barring immigrants based on where they came from. Starting in the late 19th century, laws excluded all Chinese, almost all Japanese, then all Asians in the so-called Asiatic Barred Zone. Finally, in 1924, Congress created a comprehensive “national-origins system,” skewing immigration quotas to benefit Western Europeans and to exclude most Eastern Europeans, almost all Asians, and Africans.\n\nMr. Trump appears to want to reinstate a new type of Asiatic Barred Zone by executive order, but there is just one problem: The Immigration and Nationality Act of 1965 banned all discrimination against immigrants on the basis of national origin, replacing the old prejudicial system and giving each country an equal shot at the quotas. In signing the new law, President Lyndon B. Johnson said that “the harsh injustice” of the national-origins quota system had been “abolished.”\n\nPhoto\n\nNonetheless, Mr. Trump asserts that he still has the power to discriminate, pointing to a 1952 law that allows the president the ability to “suspend the entry” of “any class of aliens” that he finds are detrimental to the interest of the United States.\n\nAdvertisement Continue reading the main story\n\nBut the president ignores the fact that Congress then restricted this power in 1965, stating plainly that no person could be “discriminated against in the issuance of an immigrant visa because of the person’s race, sex, nationality, place of birth or place of residence.” The only exceptions are those provided for by Congress (such as the preference for Cuban asylum seekers).", "authors": ["David J. Bier"], "publish_date": "2017-01-27", "source": "nytimes", "top_words": ["illegal", "congress", "trump", "ban", "immigrants", "immigration", "zone", "trumps", "quotas", "system", "order", "president", "power"], "summary": "President Trump signed an executive order on Friday that purports to bar for at least 90 days almost all permanent immigration from seven majority-Muslim countries, including Syria and Iraq, and asserts the power to extend the ban indefinitely.\nMore than 50 years ago, Congress outlawed such discrimination against immigrants based on national origin.\nThat decision came after a long and shameful history in this country of barring immigrants based on where they came from.\nStarting in the late 19th century, laws excluded all Chinese, almost all Japanese, then all Asians in the so-called Asiatic Barred Zone.\nFinally, in 1924, Congress created a comprehensive “national-origins system,” skewing immigration quotas to benefit Western Europeans and to exclude most Eastern Europeans, almost all Asians, and Africans."}