{"url": "https://www.nytimes.com/2017/01/26/movies/taraneh-alidoosti-boycott-oscars-trump-iranian-film.html?mcubz=0", "id": "72", "title": "Star of Iranian Film Says She Will Boycott Oscars Over Trump’s Visa Ban", "text": "Photo\n\nPARIS — The Iranian actress Taraneh Alidoosti, a co-star of “The Salesman,” an Iranian film up for the foreign-language Academy Award, said Thursday that she would boycott the Oscars ceremony to protest President Trump’s announcement that he would issue a temporary ban on visas to citizens from seven predominantly Muslim countries.\n\n[ Read our review of “The Salesman” ]\n\nMr. Trump said this week that he would issue an executive order to suspend immigration for at least 30 days for citizens of Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen. It remains unclear how and whether the ban would take effect.\n\nMs. Alidoosti made her intentions clear on her Twitter feed, writing: “Trump’s visa ban for Iranians is racist. Whether this will include a cultural event or not, I won’t attend the #AcademyAwards 2017 in protest.”\n\nIn an email interview, she said that she would not attend the Oscars ceremony on Feb. 26 even if it turned out the proposed ban did not affect her ability to get a visa.\n\nAdvertisement Continue reading the main story\n\n“I decided not to go even if I could, because it hurts me deeply to see ordinary people of my country being rejected for what might be their legal right to have access to their children abroad or to their school classes as students,” Ms. Alidoosti said.", "authors": ["Rachel Donadio", "The Carpetbagger"], "publish_date": "2017-01-26", "source": "nytimes", "top_words": ["film", "salesman", "citizens", "ban", "star", "ceremony", "oscars", "attend", "iranian", "trumps", "boycott", "issue", "alidoosti", "visa"], "summary": "PhotoPARIS — The Iranian actress Taraneh Alidoosti, a co-star of “The Salesman,” an Iranian film up for the foreign-language Academy Award, said Thursday that she would boycott the Oscars ceremony to protest President Trump’s announcement that he would issue a temporary ban on visas to citizens from seven predominantly Muslim countries.\n[ Read our review of “The Salesman” ]Mr. Trump said this week that he would issue an executive order to suspend immigration for at least 30 days for citizens of Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\nIt remains unclear how and whether the ban would take effect.\nMs. Alidoosti made her intentions clear on her Twitter feed, writing: “Trump’s visa ban for Iranians is racist.\nWhether this will include a cultural event or not, I won’t attend the #AcademyAwards 2017 in protest.”In an email interview, she said that she would not attend the Oscars ceremony on Feb. 26 even if it turned out the proposed ban did not affect her ability to get a visa."}