{"url": "https://www.nytimes.com/2017/01/26/opinion/i-think-islam-hates-us.html?mcubz=0", "id": "74", "title": "Opinion | ‘I Think Islam Hates Us’", "text": "Editorial ‘I Think Islam Hates Us’ Image Credit Tyler Comrie\n\nEradicating “radical Islamic terrorism” from the face of the earth has been President Trump’s mantra, first in the campaign, then in his Inaugural Address and remarks a day later to the C.I.A.\n\nNo one would argue with fighting back against the Islamic State, also known as ISIS, and other terrorist groups that threaten the United States, Europe, the Middle East and beyond. For eight years, President Barack Obama did just that, using a multilayered approach that included launching thousands of air and drone strikes in at least a half dozen countries and killing countless militants, among them Osama bin Laden. While Mr. Obama made significant progress in degrading this threat — the Islamic State has lost considerable territory in both Iraq and Syria — he did not put an end to violent extremism. Mr. Trump is now pledging to do more and better.\n\nThe problem is that his approach, as we know it, is more likely to further inflame anti-American sentiment around the world than to make the United States safer. Mr. Trump has not explained how he would destroy the terrorist danger. But his use of slogans like “radical Islam,” which echo the views of his closest advisers, implies a naïve reading of the threat from about 40,000 extremists, while demonizing and alienating many of the world’s 1.6 billion Muslims.\n\nMr. Trump’s Plans\n\nThe emerging details suggest that Mr. Trump’s plans to eradicate violent extremists are not only at odds with Mr. Obama’s; they trample on American values and international law. It was reported on Wednesday that Mr. Trump was planning to block Syrians and others from “terror prone” nations from entering the United States, at least temporarily, even though Washington already vets visitors from such countries. While people from Syria, Iran, Sudan, Libya, Somalia, Yemen and Iraq would be blocked by a monthlong ban, Mr. Trump appears, inexplicably, to be exempting Afghanistan and Saudi Arabia, home of 15 of the 19 extremists who hijacked the planes on Sept. 11. Refugee admissions would be halted for 120 days while screening procedures are reviewed, with the number allowed in cut from 110,000 to 50,000.\n\nAnother draft executive order would allow the C.I.A. to revive the once-secret program under which terrorism suspects were interrogated in “black site” prisons overseas, which were shut down by Mr. Obama in 2009. The order would also re-examine the use of torture, which was widely condemned in the Bush era and is opposed by Mr. Trump’s own defense secretary.\n\nMr. Trump would also keep open the prison at Guantánamo Bay, which Mr. Obama tried to close, and reportedly is considering designating the Muslim Brotherhood, which is involved in Muslim politics in a number of countries, as a terrorist organization. Some experts see the move as a chance for the Trump administration to limit Muslim political activity in the United States. But since President Recep Tayyip Erdogan of Turkey, a NATO ally, sympathizes with the Muslim Brotherhood, such a step would further complicate that fraught alliance.\n\nTaken together, Mr. Trump’s plans would damage America’s credibility as guardian of human rights, anger allies and undermine civil liberties at home. They will also inspire fear in law-abiding Muslims everywhere, but especially those in America, whose help is crucial to identifying and pre-empting young people tempted by extremism.\n\nAt the C.I.A. meeting, Mr. Trump hinted at a yet more radical step. During the campaign, he often lamented that America did not take possession of Iraq’s oil after the 2003 invasion. On Saturday, he went further and said “maybe we’ll have another chance,” suggesting he may be considering another invasion to seize Iraq’s oil, a violation of international law. Such a move, against an ally no less, could incite extremist attacks against the United States. Mr. Trump seemed not to realize that ISIS gets most of its oil revenue from Syria.\n\nSources of Inspiration\n\nTo understand Mr. Trump’s thinking, one might look to his national security adviser, retired Lt. Gen. Michael Flynn, author of the book “The Field of Fight.” Mr. Flynn was fired from his job as head of the Defense Intelligence Agency in the Obama administration. He has trafficked in fake news and been part of the world of conspiracy theorists who trade in fantasies that Shariah law is being imposed on Americans.\n\nA fearful tone permeates Mr. Flynn’s book, which warns, “We’re in a world war against a messianic mass movement of evil people, most of them inspired by a totalitarian ideology: Radical Islam.” For Mr. Flynn and fellow radicals, the fight isn’t against a small number of religious fanatics who seek to attack the West and its Arab allies, but an entire religion.\n\nMr. Obama and former President George W. Bush generally agreed that terrorists had perverted the teachings of Islam, not that Islam was the problem. For them and most national security experts, containing terrorism meant focusing on individuals and groups that were intent on doing harm to America — namely Al Qaeda and groups like ISIS — while not turning all Muslims into the enemy.\n\nNot so Mr. Trump, who said last year, “I think Islam hates us,” and Mr. Flynn, who has decried Islamism as a “vicious cancer.” Both Mr. Flynn and Sebastian Gorka, the national security editor at the alt-right website Breitbart News, who may be considered for a position in the Trump administration as a counterterrorism adviser and wrote a book titled ”Defeating Jihad,” characterize “radical Islam” to be as grave a threat as Hitler in World War II and the Soviet Union in the Cold War.\n\nIn his book, Mr. Flynn labels as extremist enemies a wide range of groups, including not just Sunni Muslim groups like ISIS and Al Qaeda, but countless others and many countries, like North Korea, Shiite-majority Iran, China, Syria, Venezuela and Russia. Mr. Flynn seems to be advocating a shotgun approach toward a target that requires precision.\n\nMr. Flynn also hints that the battlefield could expand beyond current conflicts in the Middle East, writing that “we must engage the violent Islamists wherever they are” and promising “severe consequences” for Saudi Arabia and other countries if they continue aiding terrorist groups. He is especially alarmed about Iran and argues that Washington “should consider how to change Iran from within.”\n\nThe president has a responsibility to defend the country against extremist threats, but the ideas of Mr. Flynn and others, if adopted, seem like a recipe for endless world war. It is especially hard to see how destabilizing Iran, one of the few intact countries in the Middle East, would advance American interests at a time the region is in chaos.\n\nThe United States undoubtedly must find more effective ways to defeat terrorists, including by undermining their message. If Mr. Trump can do that, it will be to his credit. But to a great extent success will depend on long-term cooperation from Muslim leaders and allies.\n\nFollow The New York Times Opinion section on Facebook and Twitter (@NYTOpinion), and sign up for the Opinion Today newsletter.\n\nOrder Reprints | Today’s Paper | Subscribe A version of this article appears in print on , on Page A 28 of the New York edition with the headline: ‘I Think Islam Hates Us’\n\n\n\n\n\n\n\n\n\nSign up for the Opinion Today newsletter Every weekday, get thought-provoking commentary from Op-Ed columnists, The Times editorial board and contributing writers from around the world. SEE SAMPLE Please verify you’re not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. * Required field You agree to receive occasional updates and special offers for The New York Times products and services. * Required field Thank you for subscribing. View all New York Times newsletters. An error has occurred. Please try again later. You are already subscribed to this email. View all New York Times newsletters. Sign Up", "authors": ["The Editorial Board"], "publish_date": "2017-01-26", "source": "nytimes", "top_words": ["world", "trump", "flynn", "think", "hates", "opinion", "united", "trumps", "obama", "islam", "states", "muslim", "mr"], "summary": "Mr. Trump has not explained how he would destroy the terrorist danger.\nMr. Trump’s PlansThe emerging details suggest that Mr. Trump’s plans to eradicate violent extremists are not only at odds with Mr. Obama’s; they trample on American values and international law.\nTaken together, Mr. Trump’s plans would damage America’s credibility as guardian of human rights, anger allies and undermine civil liberties at home.\nMr. Obama and former President George W. Bush generally agreed that terrorists had perverted the teachings of Islam, not that Islam was the problem.\nThe United States undoubtedly must find more effective ways to defeat terrorists, including by undermining their message."}