{"url": "https://www.nytimes.com/2017/01/28/sports/trump-refugee-ban.html?mcubz=0", "id": "87", "title": "Trump’s Immigration Order Could Have a Big Impact on Sports", "text": "“Most of our athletes from St. Lucia train in the States,” Mr. Peterkin said. “We don’t have an issue because we’re not on that list of seven, but if we were — there go hopes and dreams.”\n\nOn Saturday evening, a federal judge blocked part of the executive order, but that decision appeared unrelated to the elements of the ban that troubled sports officials.\n\nThe most immediate effect may come in wrestling, given that one of the nations affected by Mr. Trump’s ban is Iran, which has long had a congenial relationship with the United States in that sport. Iran said on Saturday that it would stop American citizens from entering the country, in retaliation for Mr. Trump’s order.\n\nThe United States freestyle wrestling team is scheduled to participate in a World Cup competition in Iran on Feb. 8. Steve Fraser, the chief fund-raiser for U.S.A. Wrestling and a 1984 Greco-Roman Olympic champion, said on Saturday that the president of Iran’s wrestling federation was scheduled to meet this weekend with government officials there in an attempt to make sure the Americans would still be invited to the meet.\n\n“There’s some nervousness by us that the Iranian government might say, ‘We can’t get visas to go there, so no Americans can come here, either,’” Mr. Fraser said.\n\nWhile Olympic boycotts have resulted from tense political differences between nations, opposing countries have also long found common ground on playing fields, on the track and in sports arenas. One of the most celebrated examples is the so-called Ping-Pong diplomacy that helped foster the relationship between the United States and China in the 1970s.\n\nIn wrestling, the United States, Iran, Cuba and Russia banded together in 2013 to persuade the I.O.C. to keep the sport in the Summer Games. American wrestlers and officials are warmly welcomed in Iran, and Iranian wrestlers compete regularly in the United States. They may be invited to meets in May in New York and in June in Los Angeles, Mr. Fraser said. There is uncertainty now, however, about whether they would be granted P1 visas, commonly known as sports visas, to compete.\n\nAdvertisement Continue reading the main story\n\nIn 2014, Christina Kelley, the chief international ambassador for U.S.A. Wrestling, became one of the few women allowed into a wrestling arena in Iran since the 1979 Islamic Revolution. She said on Saturday that she was frustrated by Mr. Trump’s decision.\n\n“I don’t think our current president has any clue what the State Department and what sports diplomats and cultural exchanges do for our country and for the safety of our people around the world,” Ms. Kelley said.\n\nThe ban on visitors from the seven nations — Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen — comes at a delicate time for the U.S.O.C. Los Angeles is seeking to host the 2024 Summer Games, and it will learn in September whether it, Paris or Budapest will get the Games.\n\n(There is some speculation that the I.O.C. will award the 2024 Games to Paris and the 2028 Games to Los Angeles, but the U.S.O.C. remains committed to the bid for the 2024 Games.)\n\nDavid Wallechinsky, an American member of the I.O.C.’s cultural and heritage commission and the president of the International Society of Olympic Historians, said the election of Mr. Trump in November had hurt Los Angeles’s bid with I.O.C. delegates because Mr. Trump was perceived as being “anti-Muslim, anti-woman and anti-Latino.”\n\nNewsletter Sign Up Continue reading the main story Sign Up for the Sports Newsletter Get the big sports news, highlights and analysis from Times journalists, with distinctive takes on games and some behind-the-scenes surprises, delivered to your inbox every week. Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\n“This is worse,” Mr. Wallechinsky said of the Muslim ban, adding, “I would consider it a blow to the Los Angeles bid — not fatal but a blow.”\n\nAt a meeting at the I.O.C.’s headquarters in Lausanne, Switzerland, several days after the American presidential election, Mr. Wallechinsky was asked repeatedly, “What is wrong with your country?” he said.\n\nHe said he sought to assure I.O.C. officials by explaining that three-quarters of the voters in Los Angeles had voted against Mr. Trump, describing the city to them as a “a multicultural, Trump-free zone.”\n\nAdvertisement Continue reading the main story\n\nThe United States is expected to bid to host the world’s other major sporting event, the World Cup, in 2026. In June, Sunil Gulati, president of the United States Soccer Federation, told reporters that a Trump presidency could complicate an American bid, especially if it were a joint bid with Mexico, given Mr. Trump’s plans to build a wall across America’s southern border.\n\n“I think a co-hosted World Cup with Mexico would be trickier if Secretary Clinton isn’t in the White House,” Mr. Gulati said at the time, in a reference to Hillary Clinton, who lost the election to Mr. Trump.\n\nAfter Mr. Trump won the election, Mr. Gulati modified his remarks, saying, “It’s not going to dissuade us or persuade us to bid.” International perceptions of the Trump administration “matter, for sure,” Mr. Gulati said, “but I think those will be developed in the months to come.”\n\nU.S. Soccer said Saturday it would have no immediate comment as it examined Mr. Trump’s order.\n\nMany questions remained unanswered about the ability of a number of athletes to travel. Two N.B.A. players, Thon Maker and Luol Deng, were born in Sudan, one of the seven countries listed in Mr. Trump’s executive order. (Both, however, were born in Wau, now part of South Sudan, which gained its independence from Sudan in 2011.)\n\nMr. Maker’s family fled Sudan when he was 5 and eventually settled in Australia. Mr. Maker, who plays for the Milwaukee Bucks, moved to the United States to play high school basketball in Louisiana, eventually moved to Canada and is an Australian citizen who holds a passport from that country. It was unclear how people with dual citizenship would be treated under the order.\n\nMr. Deng, a forward for the Los Angeles Lakers, has lived in the United States for 17 years. His family fled to Egypt when he was 5 to escape the Sudanese civil war. Mr. Deng came to the United States when he was 14 and attended high school in New Jersey, and he later became a British citizen.\n\nThe N.B.A. also holds an annual Basketball Without Borders camp, and it is expected to be held in New Orleans during the league’s All-Star weekend in February. While rosters have not been released, last year’s camp involved players from 25 countries, including Amir Reza Shah-Ravesh from Iran.\n\nMajor League Soccer has two American-born players with familial ties to two of the nations facing bans. Steve Beitashour of Toronto has played for Iran’s national team, and Justin Meram of Columbus has played for Iraq. League officials were looking into the matter on Saturday.\n\nAdvertisement Continue reading the main story\n\nMo Farah of Britain, who was born in Somalia and has won four Olympic gold medals on the track at 5,000 meters and 10,000 meters, is a Nike-sponsored athlete coached by Alberto Salazar.\n\nEarly Sunday morning Mr. Farah’s Facebook page had a post that, among other things, said: “On 1st January this year, Her Majesty The Queen made me a Knight of the Realm. On 27th January, President Donald Trump seems to have made me an alien. I am a British citizen who has lived in America for the past six years - working hard, contributing to society, paying my taxes and bringing up our four children in the place they now call home. Now, me and many others like me are being told that we may not be welcome.”\n\nAbdi Abdirahman, a four-time Olympian for the United States who finished third in the 2016 New York City Marathon, was also born in Somalia, and the race regularly attracts runners from around the globe. The 2016 race featured three runners from Iran, nine from Syria and one from Sudan in the field of about 50,000 runners.\n\n“Our goal is always to recruit the world’s best and cleanest athletes, regardless of where they’re from,” Chris Weiller, a spokesman for New York Road Runners, which organizes the marathon, said in an email.\n\nJackie Brock-Doyle, a spokeswoman for track and field’s world governing body, the International Association of Athletics Federations, said, “We clearly need to understand the implications of this new U.S. immigration policy and will be seeking assurances that it will not adversely affect” the sport’s world championships, scheduled to be held in Eugene, Ore., in 2021.\n\nPhil Andrews, the chief executive of U.S.A. Weightlifting, said officials were trying to figure out the impact of Mr. Trump’s ban on the world weight-lifting championships, scheduled for November in Anaheim, Calif., and on the American team’s participation at a competition in Iran.\n\n“Our view is that politics and sport should be separate,” Mr. Andrews said, stressing sports diplomacy among nations. “We sincerely hope to peacefully welcome these seven nations to Anaheim this November. It is unimaginable to be able to host a true world event without their participation.”", "authors": ["Jeré Longman"], "publish_date": "2017-01-28", "source": "nytimes", "top_words": ["iran", "world", "wrestling", "trump", "los", "immigration", "big", "united", "states", "trumps", "bid", "impact", "order", "mr"], "summary": "Iran said on Saturday that it would stop American citizens from entering the country, in retaliation for Mr. Trump’s order.\nOne of the most celebrated examples is the so-called Ping-Pong diplomacy that helped foster the relationship between the United States and China in the 1970s.\nIn wrestling, the United States, Iran, Cuba and Russia banded together in 2013 to persuade the I.O.C.\nShe said on Saturday that she was frustrated by Mr. Trump’s decision.\nplayers, Thon Maker and Luol Deng, were born in Sudan, one of the seven countries listed in Mr. Trump’s executive order."}