{"url": "https://www.nytimes.com/2017/01/27/world/middleeast/muslims-trump-visa-restrictions-.html?mcubz=0", "id": "81", "title": "Fears That Trump’s Visa Ban Betrays Friends and Bolsters Enemies", "text": "“I think this is going to alienate the whole Muslim world,” said Mouwafak al-Rubaie, a lawmaker and former Iraqi national security adviser in Iraq.\n\n“Terrorists can say, ‘See, their aim is not terror but Muslims,’ ” said Ilter Turan, a professor of international relations at Bilgi University in Istanbul.\n\nFor years, American policy in much of the Muslim world has been an exercise in pragmatism, framed by a transactional ethos and the bloodshed of several wars.\n\nYet even as President George W. Bush and then President Barack Obama launched military action or covert strikes, they publicly stressed their commitment to religious tolerance, and that there was no American war on Islam.\n\nNow, according to some of America’s most experienced veterans of Arab diplomacy, that important distinction has been compromised — and along with it America’s relationship with the very people it is seeking to befriend.\n\n“The Islamic State says it is leading the war against the U.S.,” said Ryan C. Crocker, who served as the United States ambassador to five Muslim countries, including Afghanistan, Iraq and Lebanon, between 1990 and 2012. “Now it only has to pump out our press releases to prove that.”\n\nMr. Trump’s executive order will alienate the pro-Western elites that Americans turn to for help in Muslim countries, Mr. Crocker said. And it broke promises to people who have risked their lives to help American soldiers or diplomats.\n\nAdvertisement Continue reading the main story\n\n“You know, we can be cynical about these things, but values count,” Mr. Crocker said. “This is a core identity of ours that we are repudiating in a very callous fashion. What do we do — get a new inscription on the Statue of Liberty?”\n\nThe ban on entry to the United States will affect citizens of Syria, Iran, Iraq, Somalia, Sudan, Libya and Yemen, who will be prohibited from entering the country for 90 days until the Trump administration tightens up visa controls that many feel are already excessively stringent.\n\nRefugees from Syria, whom Mr. Trump portrayed during his election campaign as potential Islamic State infiltrators, will be barred indefinitely from the country.\n\nBut even in countries not directly affected by the ban, it sent a dispiriting signal.\n\n“It gives the impression that America is no longer the country it used to be,” said Ammar Ali Hassan, a prominent Egyptian novelist. “It is no longer open to skilled people from across the world. It is no longer the land of dreams.”\n\nMuslims in many Western countries have felt the brunt of paranoia and racial discrimination as Islamic State attacks have continued in the past year and the public furor over immigration has grown.\n\nIn France, armed policemen confronted a Muslim woman on a beach and forced her to remove her clothing as part of a ban on burka-like swimsuits. Hate speech against Muslims soared in Britain after the vote in June to leave the European Union. There have been numerous reports of Muslims being harassed in the United States since Mr. Trump’s election.\n\nNow Muslims from abroad face the prospect of “extreme vetting” to enter the country — if they can secure a visa at all.\n\nOn Wednesday, Mr. Trump, in his first television interview as president, framed his policy in the tones of a wider religious conflict when he referred to the Islamic State as a product of the Middle Ages that singles out Christians for execution, though the group has killed countless Muslims around the world.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nOn Friday, Mr. Trump said that once the United States resumed the intake of refugees, Christians would receive priority. Until recently, “If you were a Muslim you could come in, but if you were a Christian, it was almost impossible,” he told Christian Broadcasting News.\n\nAdvertisement Continue reading the main story\n\nIn fact, the United States accepts tens of thousands of Christian refugees. According to the Pew Research Center, almost as many Christian refugees (37,521) were admitted as Muslim refugees (38,901) in the 2016 fiscal year.\n\nMany Muslims have long viewed America’s vision of itself as hypocritical and its idealism as degraded. After years of grinding war in countries like Afghanistan and Iraq, there is a growing belief that even many Americans do not truly believe talk about America being a “shining city on the hill” that seeks to do good in the world.\n\n“Trump has dispensed with the politeness, but that wasn’t fooling people before,” said Karl Sharro, a Lebanese-Iraqi architect and commentator who is based in London. “In being honest about these draconian measures, a lot of people will say that at least we know where we stand now.”\n\nIn a recent article for Politico, Mr. Sharro drew on the growing similarities between the United States’ political scene and that of many Arab countries, with allegations of vote rigging, feuds involving the security services, accusations of foreign meddling and vicious arguments between the country’s leader and the media.\n\n“I just collected what everyone is saying in Arab countries,” he said. “It’s a kind of schadenfreude.”\n\nMr. Sharro said he was insulted by suggestions that the visa ban might help create a new cadre of radicalized Muslims.\n\n“The assumption that these people are going to flip into terrorists and start attacking the United States is driven by some very condescending liberal assumptions,” he said.\n\nVisiting the United States can already be a demeaning process for many Muslims. Refugees have to go through an exhaustive 18-month security clearance program, while visitors on tourist or business visas have complained of being sometimes singled out at American airports.\n\nAdvertisement Continue reading the main story\n\n“Only Americans suffer from the delusion that Muslims are not already being extensively racially profiled at immigration counters when they enter the United States,” said Ali Dayan Hasan, a human rights consultant from Pakistan who has regularly visited the United States since 2001.\n\nNotably, even though Mr. Trump’s ban is ostensibly based on security concerns, it excludes countries like Saudi Arabia, the United Arab Emirates and Pakistan, whose citizens have been responsible for some of the most serious terrorist plots against the United States since 2001. Those countries are harder to push around. Pakistan has nuclear weapons, Saudi Arabia is a major source of oil, and the United Arab Emirates is a major source of investment. Mr. Trump’s company has a golf club in Dubai and holdings related to a possible hotel venture in Saudi Arabia.\n\nArab leaders in countries unaffected by the visa ban may not respond with outright criticism of the United States, possibly waiting to see what active steps Mr. Trump takes in the region’s many crises.\n\nThere is also a question of moral debt. Many Iraqis and Afghans who have worked for the United States since 2001, often as interpreters, say they were promised resettlement in the United States to save them from attack at home. During the Obama administration, a program to grant special visas to interpreters was continued, even as the process was delayed by resistance in Congress and ever stricter security screening procedures.\n\nThe new measures announced by Mr. Trump now place those promises in jeopardy, said Mr. Crocker, who since retiring from the foreign service has helped several interpreters get resettled in the United States. The measures, he said, also send an ominous message to anyone who might consider working for the American government in the future.\n\n“We are effectively saying to past, current and potential future interpreters,” he said, “that we want them to work with us and risk their lives in the field — confident in the knowledge that they will be hung out to dry.”", "authors": ["Declan Walsh"], "publish_date": "2017-01-27", "source": "nytimes", "top_words": ["mr", "betrays", "trump", "ban", "security", "refugees", "bolsters", "united", "trumps", "friends", "enemies", "countries", "states", "muslim", "muslims", "fears", "visa"], "summary": "“Now it only has to pump out our press releases to prove that.”Mr. Trump’s executive order will alienate the pro-Western elites that Americans turn to for help in Muslim countries, Mr. Crocker said.\nThere have been numerous reports of Muslims being harassed in the United States since Mr. Trump’s election.\nOn Friday, Mr. Trump said that once the United States resumed the intake of refugees, Christians would receive priority.\nAccording to the Pew Research Center, almost as many Christian refugees (37,521) were admitted as Muslim refugees (38,901) in the 2016 fiscal year.\nMany Iraqis and Afghans who have worked for the United States since 2001, often as interpreters, say they were promised resettlement in the United States to save them from attack at home."}