{"url": "https://www.nytimes.com/2017/01/27/world/middleeast/trump-visa-muslim-ban.html?mcubz=0", "id": "82", "title": "In Iran, Shock and Bewilderment Over Trump Visa Crackdown", "text": "During the 90-day period, the Trump administration will assess if the foreign governments on the list are providing enough information about citizens seeking visas to enable the United States to assess whether they pose a terrorism risk. If the governments do not comply, they will be given 60 days to do so; failing that, their citizens will be barred from entering the United States.\n\nGovernment reaction to the order has been cautious. But there is little doubt that the demand for information will be a challenge for Iran, which sends far more people to the United States each year, around 35,000, than any other country on the list.\n\nWhile Iran willingly allows its citizens to travel to the United States, it is ideologically opposed to sharing information with Washington. But if it does not, many of its citizens will be cut off from visiting relatives who are among the estimated one million Iranian-Americans living in America.\n\nThe visa ban will provide an early indication of where relations between Tehran and the Trump administration are headed, one analyst said.\n\nPhoto\n\n“Trump will regard the Iranian reaction as a test,” said Farshad Ghorbanpour, who is close to the government of President Hassan Rouhani. “If Iran doesn’t comply, they won’t do so either on other issues. We will see in 30 days.”\n\nAnother analyst doubted the government would comply with the order.\n\n“We are not obliged to give information about our citizens to the Trump administration,” said Hamidreza Taraghi, considered a hard-liner. “Such a move would be unjustifiable.”\n\nIn the United States, Americans of Iranian descent expressed shock and dismay at news of Mr. Trump’s impending policy change, and were particularly concerned about their relatives and friends in Iran.\n\nAdvertisement Continue reading the main story\n\nTrita Parsi, president of the National Iranian American Council, a Washington-based advocacy group, said many Iranian citizens with valid green cards and American visas were distraught. Those outside the United States are fretting they will not be allowed in, and those already in the country fear they will not be able to leave, even temporarily, because they will be barred from returning.\n\n“There is a sense of bewilderment, as well as a sense of injustice,” over why Iran was even included on the list of targeted countries, Mr. Parsi said. No Iranian has been accused of an attack on the American homeland. By contrast, he said, the Sept. 11 attackers included citizens from countries which are not on the list — and “the United States has produced more ISIS fighters than Iran has.”\n\nIran’s most popular actress, Taraneh Alidoosti, announced on Twitter that she was canceling her trip to the Academy Awards ceremony in Los Angeles on Feb. 26, after reports that Mr. Trump was about to sign the sweeping executive order.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nMs. Alidoosti plays a leading role in ‘‘The Salesman,’’ directed by the acclaimed Iranian director Asghar Farhadi and nominated for best foreign film. She almost certainly could have obtained a visa as a ‘‘culturally unique artist,’’ but said she no longer felt like making the trip.\n\n“This is not about me or the Academy Awards, it’s about having a discussion about this decision,” Ms. Alidoosti said. “This is such a bizarre ban, it is uprooting people’s lives in ways not imaginable.”\n\nIn 2015, according to the Department of Homeland Security, a total of 35,266 nonimmigrant visas were granted to Iranians to enter the United States, compared with 21,381 for Iraq; 16,010 for Syria; 5,549 for Yemen; 4,792 for Sudan; 2,879 for Libya and 359 for Somalia.\n\nAs there is no American embassy or consulate in Iran, Iranians must travel to Ankara, Turkey, Dushanbe in Tajikistan or to Dubai, in the United Arab Emirates, to apply for a visa. The State Department says that more than 40 percent of all applications are rejected. There are numerous agencies in Iran and other countries that mediate and assist Iranians seeking appointments.\n\n“Let’s hope this is fake news,” said Ali Reza Falahati, who runs a mediation agency in Ankara. “People are constantly calling to ask us if their appointments are canceled. They paid visa fees, $160, and booked tickets and hotels. I just hope this will be all right.”\n\nOne woman in Tehran, a 28-year-old restaurant manager, nearly broke down in tears when hearing news of the ban.\n\nAdvertisement Continue reading the main story\n\nShe said she had been waiting for a green card and that she and her husband had been planning for years to move to Orlando, Fla., where her mother, father and brother live. They even postponed having a baby, she said, and now regretted having waited for so long.\n\nThe effects of the measure were felt in Africa, too.\n\nMany people in Mogadishu, Somalia, used the same word to describe Mr. Trump. “He’s a dabaal,” said Guled Hassan, a Somali university student. “Dabaal” is the Somali word for a fool.\n\nOn Thursday, Mr. Hussan and his friends, who were hanging out in a park near Mogadishu’s crumbling seashore, slurping mango shakes, were paying extra close attention to the news streaming into their phones. Just about all of them had heard that Mr. Trump might ban visas for Somalis.\n\nJust about all of them said they wanted to go to the United States, and they mostly agreed the visa ban was “stupid” and \"unfair.”\n\nNo Somalis doubt that their country has a terrorism problem. Just the day before, more than a dozen people were killed in a double bombing at a Mogadishu hotel. The Shabab, a Somali militant group, took credit for the attack and remains one of the world’s most bloodthirsty and dangerous terrorist organizations, having killed thousands across several countries in eastern Africa.\n\nBut the consensus was that Mr. Trump was punishing all Somalis for the potential misdeeds of a few. “He won the election by saying he would chase away black people,” said Bilal Guled Mohamed, a college student.\n\nAnother young man, Abdul Karim Hilowle, asked, “What’s the difference between Somalis already in the U.S. and those who want to go now?”", "authors": ["Thomas Erdbrink", "Jeffrey Gettleman"], "publish_date": "2017-01-27", "source": "nytimes", "top_words": ["iran", "trump", "citizens", "visas", "information", "united", "iranian", "shock", "crackdown", "states", "mr", "bewilderment", "visa"], "summary": "While Iran willingly allows its citizens to travel to the United States, it is ideologically opposed to sharing information with Washington.\nThe visa ban will provide an early indication of where relations between Tehran and the Trump administration are headed, one analyst said.\nMany people in Mogadishu, Somalia, used the same word to describe Mr. Trump.\nJust about all of them had heard that Mr. Trump might ban visas for Somalis.\nBut the consensus was that Mr. Trump was punishing all Somalis for the potential misdeeds of a few."}