{"url": "https://www.nytimes.com/2017/01/28/opinion/donald-trumps-muslim-ban-is-cowardly-and-dangerous.html?mcubz=0", "id": "85", "title": "Donald Trump’s Muslim Ban Is Cowardly and Dangerous", "text": "Photo\n\nFirst, reflect on the cruelty of President Trump’s decision on Friday to indefinitely suspend the resettlement of Syrian refugees and temporarily ban people from seven predominantly Muslim nations from entering the United States. It took just hours to begin witnessing the injury and suffering this ban inflicts on families that had every reason to believe they had outrun carnage and despotism in their homelands to arrive in a singularly hopeful nation.\n\nThe first casualties of this bigoted, cowardly, self-defeating policy were detained early Saturday at American airports just hours after the executive order, ludicrously titled “Protecting the Nation From Foreign Terrorist Entry Into the United States,” went into effect. A federal judge in Brooklyn on Saturday evening issued an emergency stay, ordering that those stuck at the airports not be returned to their home countries. But the future of all the others subject to the executive order is far from settled.\n\nIt must have felt like the worst trick of fate for these refugees to hit the wall of Donald Trump’s political posturing at the very last step of a yearslong, rigorous vetting process. This ban will also disrupt the lives and careers of potentially hundreds of thousands of immigrants who have been cleared to live in America under visas. On Saturday, as mass protests against that ban were held in various cities, the White House scaled back the reach of the policy, though not by much, exempting legal permanent residents.\n\nThat the order, breathtaking in scope and inflammatory in tone, was issued on Holocaust Remembrance Day spoke of the president’s callousness and indifference to history, to America’s deepest lessons about its own values.\n\nAdvertisement Continue reading the main story\n\nThe order lacks any logic. It invokes the attacks of Sept. 11 as a rationale, while exempting the countries of origin of all the hijackers who carried out that plot and also, perhaps not coincidentally, several countries where the Trump family does business. The document does not explicitly mention any religion, yet it sets a blatantly unconstitutional standard by excluding Muslims while giving government officials the discretion to admit people of other faiths.", "authors": ["The Editorial Board"], "publish_date": "2017-01-28", "source": "nytimes", "top_words": ["cowardly", "ban", "refugees", "donald", "united", "trumps", "countries", "dangerous", "states", "issued", "order", "muslim", "hours", "policy"], "summary": "PhotoFirst, reflect on the cruelty of President Trump’s decision on Friday to indefinitely suspend the resettlement of Syrian refugees and temporarily ban people from seven predominantly Muslim nations from entering the United States.\nThe first casualties of this bigoted, cowardly, self-defeating policy were detained early Saturday at American airports just hours after the executive order, ludicrously titled “Protecting the Nation From Foreign Terrorist Entry Into the United States,” went into effect.\nBut the future of all the others subject to the executive order is far from settled.\nIt must have felt like the worst trick of fate for these refugees to hit the wall of Donald Trump’s political posturing at the very last step of a yearslong, rigorous vetting process.\nThis ban will also disrupt the lives and careers of potentially hundreds of thousands of immigrants who have been cleared to live in America under visas."}