{"url": "https://www.nytimes.com/2017/01/28/arts/trump-muslim-ban-oscars-iranian-director.html?mcubz=0", "id": "83", "title": "Trump’s Visa Ban May Keep Nominated Iranian Director From Attending Oscars", "text": "Mr. Parsi added that he had not meant to imply that the United States government had requested that Mr. Farhadi not come to the Oscars ceremony, but to call attention to the ban itself.\n\nAffected by Trump’s order? Are you affected by President Trump’s executive order on immigration, or do you know someone who is? If you have information, please contact us at immigration@nytimes.com.\n\n“It is so stunning and shocking — so profoundly un-American — that people have a hard time wrapping their heads around it,” Mr. Parsi said.\n\nIt was unclear whether Mr. Farhadi would request an exemption to the visa ban or be granted one by the United States government.\n\nEarlier this week, one of the stars of “The Salesman,” Taraneh Alidoosti, said in a message on Twitter that she would boycott the Oscars to protest the visa ban, which she called “racist.” The ban was not policy at the time.\n\n“I decided not to go even if I could, because it hurts me deeply to see ordinary people of my country being rejected for what might be their legal right to have access to their children abroad or to their school classes as students,” Ms. Alidoosti told The New York Times in an interview.\n\nThe government of Iran approved the “The Salesman” for submission to the Academy Awards; it is one of five films vying for best foreign-language film. The film tells the story of a couple in Tehran whose lives are upended when they move from one apartment to another while they are acting in an amateur production of “Death of a Salesman,” a play by Arthur Miller.\n\nIn a statement, the Academy of Motion Picture Arts and Sciences said it was “extremely troubling” that Mr. Farhadi and the cast and crew of “The Salesman,” could be “barred from entering the country because of their religion or country of origin.”\n\nThe Academy gives an allotment of tickets to distributors and representatives of all nominated films, who are responsible for securing visas when necessary.\n\nAdvertisement Continue reading the main story\n\nThe proposed ban has affected those connected to other films. The Iraqi director Hussein Hassan withdrew his visa application to the United States, where he was expected to attend the United States premiere of his film “Reseba — The Dark Wind” at the Miami Film Festival, Variety reported.", "authors": ["Rachel Donadio"], "publish_date": "2017-01-28", "source": "nytimes", "top_words": ["salesman", "film", "ban", "oscars", "attending", "farhadi", "iranian", "united", "trumps", "nominated", "country", "director", "states", "films", "mr", "visa"], "summary": "Mr. Parsi added that he had not meant to imply that the United States government had requested that Mr. Farhadi not come to the Oscars ceremony, but to call attention to the ban itself.\nIt was unclear whether Mr. Farhadi would request an exemption to the visa ban or be granted one by the United States government.\nEarlier this week, one of the stars of “The Salesman,” Taraneh Alidoosti, said in a message on Twitter that she would boycott the Oscars to protest the visa ban, which she called “racist.” The ban was not policy at the time.\nAdvertisement Continue reading the main storyThe proposed ban has affected those connected to other films.\nThe Iraqi director Hussein Hassan withdrew his visa application to the United States, where he was expected to attend the United States premiere of his film “Reseba — The Dark Wind” at the Miami Film Festival, Variety reported."}