{"url": "https://www.nytimes.com/2017/01/28/nyregion/jfk-protests-trump-refugee-ban.html?mcubz=0", "id": "84", "title": "Protest Grows ‘Out of Nowhere’ at Kennedy Airport After Iraqis Are Detained", "text": "Video\n\nIt began in the morning, with a small crowd chanting and holding cardboard signs outside Kennedy International Airport, upset by the news that two Iraqi refugees had been detained inside because of President Trump’s executive order.\n\nBy the end of the day, the scattershot group had swelled to an enormous crowd.\n\nThey filled the sidewalks outside the terminal and packed three stories of a parking garage across the street, a mass of people driven by emotion to this far-flung corner of the city, singing, chanting and unfurling banners.\n\nThis was the most public expression of the intense reaction generated across the country by Mr. Trump’s polarizing decision. While those in some areas of the country were cheered by the executive order, the reaction was markedly different for many in New York. References to the Statue of Liberty and its famous inscription became a rallying cry.\n\nSimilar protests erupted at airports around the country.\n\nWord of the protest at Kennedy first filtered out on social media from the immigrant-advocacy groups Make the Road New York and the New York Immigration Coalition. It seemed like it might stay small.\n\nAdvertisement Continue reading the main story\n\nBut the drama seemed to rise throughout the day.\n\nThere was the release of Hameed Khalid Darweesh, one of the two Iraqi refugees who had been detained, who said the United States was the greatest country in the world.\n\nPhoto\n\n“This is the humanity, this is the soul of America,” he said, surrounded by reporters and a handful of protesters holding supportive signs. “This is what pushed me to move, leave my country and come here.”", "authors": ["Eli Rosenberg"], "publish_date": "2017-01-28", "source": "nytimes", "top_words": ["reaction", "airport", "grows", "iraqi", "kennedy", "iraqis", "refugees", "outside", "protest", "country", "trumps", "holding", "signs", "york", "detained"], "summary": "VideoIt began in the morning, with a small crowd chanting and holding cardboard signs outside Kennedy International Airport, upset by the news that two Iraqi refugees had been detained inside because of President Trump’s executive order.\nThis was the most public expression of the intense reaction generated across the country by Mr. Trump’s polarizing decision.\nWord of the protest at Kennedy first filtered out on social media from the immigrant-advocacy groups Make the Road New York and the New York Immigration Coalition.\nThere was the release of Hameed Khalid Darweesh, one of the two Iraqi refugees who had been detained, who said the United States was the greatest country in the world.\nPhoto“This is the humanity, this is the soul of America,” he said, surrounded by reporters and a handful of protesters holding supportive signs."}