{"url": "https://www.nytimes.com/2017/01/28/us/refugee-ban-injects-chaos-into-iraqi-familys-reunion.html?mcubz=0", "id": "95", "title": "Refugee Ban Injects Chaos Into Iraqi Family’s Reunion", "text": "Photo\n\nHOUSTON — One day in November, a 7-year-old Iraqi boy wrote a postcard to Santa Claus, drew small hearts at each corner and dropped it into a red holiday mailbox at a suburban mall here. The card had the penmanship of a first grader, yet the longing of a refugee: He asked not for toys but to make his family — separated and devastated by war and violence — whole.\n\n“Dear Santa, can you Bring my Dad from Sweden pls,” the boy wrote. His father, whom the boy had not seen in person for three years, was living in Stockholm while waiting for the United States to officially declare him a refugee and to allow him to reunite with his wife, son and other relatives now living in the Houston area.\n\nOn Friday, the boy’s mother kept a secret from him: His wish was about to come true. His father, a Baghdad-born accountant named Haider Sameer Abdulkhaleq Alshawi, had received the necessary paperwork and was on a flight to Kennedy International Airport in New York, the first leg of a journey to Houston.\n\nBut a few strokes of a presidential pen threw the lives of Mr. Alshawi and his family into chaos.\n\nWhile Mr. Alshawi, 33, was on the plane, President Trump signed an executive order suspending the entry of all refugees into the United States for 120 days. Mr. Alshawi was detained at Kennedy by the authorities on Friday evening, setting off a legal battle as lawyers for him and another detained Iraqi refugee sought their release.\n\nAdvertisement Continue reading the main story\n\n“I’m really breaking down because I don’t know what to do,” said Mr. Alshawi’s wife, tears streaming down her cheeks, as she sat in the living room of her sister’s house in a Houston suburb on Saturday morning. “It’s not fair.”", "authors": ["Manny Fernandez"], "publish_date": "2017-01-28", "source": "nytimes", "top_words": ["familys", "santa", "living", "iraqi", "wrote", "ban", "reunion", "wife", "refugee", "chaos", "boy", "united", "injects", "states", "mr", "alshawi"], "summary": "PhotoHOUSTON — One day in November, a 7-year-old Iraqi boy wrote a postcard to Santa Claus, drew small hearts at each corner and dropped it into a red holiday mailbox at a suburban mall here.\n“Dear Santa, can you Bring my Dad from Sweden pls,” the boy wrote.\nBut a few strokes of a presidential pen threw the lives of Mr. Alshawi and his family into chaos.\nWhile Mr. Alshawi, 33, was on the plane, President Trump signed an executive order suspending the entry of all refugees into the United States for 120 days.\nMr. Alshawi was detained at Kennedy by the authorities on Friday evening, setting off a legal battle as lawyers for him and another detained Iraqi refugee sought their release."}