{"url": "https://www.nytimes.com/2017/01/28/us/trumps-immigration-ban-disapproval-applause.html?mcubz=0", "id": "98", "title": "Trump’s Immigration Ban Draws Deep Anger and Muted Praise", "text": "Iran’s Ministry of Foreign Affairs called the executive order “a clear insult to the Islamic world,” a violation of international law, and “a great gift to extremists and their supporters.” It warned that Iran “will take reciprocal measures in order to safeguard the rights of its citizens.”\n\nVideo\n\nStéphane Dujarric, a spokesman for the United Nations, said, “We hope that these measures are temporary, as refugee protection needs have never been greater.” And Prime Minister Justin Trudeau of Canada used his Twitter feed to reiterate his government’s open policy toward refugees, particularly those from Syria.\n\n“To those fleeing persecution, terror & war, Canadians will welcome you, regardless of your faith,” Mr. Trudeau wrote. “Diversity is our strength.”\n\nInternational reaction, though, was far from uniform. Politicians who have called for restricting Muslim immigration have gained support in a number of European countries, and one of them, Geert Wilders of the Netherlands, praised Mr. Trump on Twitter: “I would do the same. Hope you’ll add more Islamic countries like Saudi Arabia soon.”\n\nStill, some immigration policy experts in the United States questioned the logic behind the action. They noted that terrorists who had carried out attacks in the United States had not entered as refugees, and that Muslim attackers had been born here or came from countries like Pakistan or Saudi Arabia — which were not on the list of seven mostly Muslim countries that the administration has singled out for a halt to entry.\n\n“Foreigners from those seven nations have killed zero Americans in terrorist attacks on U.S. soil between 1975 and the end of 2015,” Alex Nowrasteh, an immigration policy analyst at the libertarian Cato Institute, wrote on the group’s website.\n\nThe president’s executive order, issued on Friday, brought a positive, if muted, reaction from some Republicans, and could prove popular politically.\n\nAdvertisement Continue reading the main story\n\nMichael Banerian, 22, who was a Trump elector in the Electoral College, and is the youth vice chairman of the Michigan Republican Party, said he saw the president’s more narrowly tailored order as common sense. “I feel that it’s a necessary step for us to take for the security of our nation,” he said. “I don’t think it’s un-American. I think it’s very reasonable.”\n\nAffected by Trump’s order? Are you affected by President Trump’s executive order on immigration, or do you know someone who is? If you have information, please contact us at immigration@nytimes.com.\n\nKathleen Ganci, 67, whose husband, Peter J. Ganci Jr., the highest-ranking uniformed officer of the New York Fire Department, was killed in the Sept. 11, 2001, attacks, said she supported the order, too.\n\n“I don’t care how difficult it makes it for these people to come over,” she said. “I don’t want other Americans to go through what I did — because we have to care for our own first, before we care for others.”\n\nAnd Mark Krikorian, executive director of the Center for Immigration Studies, a group that seeks to restrict immigration, said it makes sense to suspend the refugee program temporarily, examine it, “and at least begin to initiate some changes.”\n\n“I don’t know what form those changes will take, and I’m not sure the administration knows yet,” he said.\n\nThe executive order put an indefinite halt to citizens of Syria, a country racked by civil war and an immense refugee crisis, entering the United States. It suspended immigration for 90 days from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen. It also suspended the nation’s program for admitting refugees from anywhere in the world for 120 days, while the government comes up with a stricter process for vetting them, but allowed for exceptions for persecuted religious minorities, like Christians in Muslim countries.\n\nMr. Trump said the moves were needed to protect the United States from infiltration by “radical Islamic terrorists.” Mr. Ryan released a statement saying, “President Trump is right to make sure we are doing everything possible to know exactly who is entering our country.”\n\nMany other leading congressional Republicans did not make statements on the matter, including Mitch McConnell, the Senate majority leader.\n\nVideo\n\nBy Saturday afternoon, members of Congress were hearing from constituents whose friends or relatives were detained at airports.\n\nAdvertisement Continue reading the main story\n\nTwo Republicans who did not support Mr. Trump’s candidacy, Senator Ben Sasse of Nebraska and Representative Charlie Dent of Pennsylvania, criticized Mr. Trump’s order. Mr. Sasse called it overly broad, saying that it risks playing into the hands of jihadist groups that portray the United States as anti-Muslim.\n\nMr. Dent said he was awakened by his college-aged son, whose Syrian-American friend had six family members being held at Philadelphia’s airport on Saturday morning, though they had valid documents to enter the country. The congressman said that despite his attempts to intervene with government officials, the family was placed on a flight bound for Qatar.\n\n“This is ridiculous,” he said. “The order was rushed through without any nuances toward immigration policy, and this can be life or death for some people.”\n\nThe response from Democrats was scathing. “This administration has mistaken cruelty for strength and prejudice for strategy,” said Nancy Pelosi, the Democratic House minority leader. On Twitter, Senator Chris Murphy, Democrat of Connecticut, wrote, “To my colleagues: don’t ever again lecture me on American moral leadership if you chose to be silent today.”\n\nThe reaction was also largely negative from leaders of Silicon Valley, which relies heavily on employees from abroad, and has many companies founded by immigrants or their children. A Google representative said, “We’re concerned about the impact of this order and any proposals that could impose restrictions on Googlers and their families, or that could create barriers to bringing great talent to the U.S.”\n\nGoogle’s chief executive, Sundar Pichai, a naturalized United States citizen who was born in India, sent a memo to the company’s workers saying that as many as 187 of its employees were affected.\n\nIn a note to his employees, Apple’s chief executive, Tim Cook, said, “Apple would not exist without immigration, let alone thrive and innovate the way we do.” Mr. Trump’s order, he said, “is not a policy we support.”\n\nAdvertisement Continue reading the main story\n\nFacebook’s founder, Mark Zuckerberg, wrote on the site that the nation should “keep our doors open to refugees and those who need help.”\n\nSome colleges and universities had urged students who might be affected by Mr. Trump’s policies to return to the United States before Inauguration Day if they were abroad, or to remain in the country if they were already here.\n\nThe seven countries covered by the temporary ban have about 13,000 citizens who are college or graduate students in the United States, said the American Council on Education. The group said it was unclear how many were stuck abroad. “It is clearly up to the federal government to decide how to safeguard our nation, but at the same time, it is in America’s interest to remain the destination of choice for the world’s students and scholars,” said Terry W. Hartle, the group’s executive vice president.\n\nThe president’s action poses a particular challenge to Christian leaders whose followers have largely supported Mr. Trump, but whose organizations are among the most active on behalf of refugees.\n\nJen Smyers, director of policy and advocacy for the immigration and refugee program of Church World Service, said that the executive order was “akin to President Trump taking a wrecking ball to the Statue of Liberty.”\n\nAs reports circulated about travelers being stopped upon arrival, protests broke out at several airports, including San Francisco International, O’Hare in Chicago, Dulles outside Washington and Kennedy in New York.\n\nBy sundown the boisterous crowd shouting “Let them in!” at Kennedy’s Terminal 4 had spread along the parking apron, the ramp to the elevator and on three floors of the adjoining parking deck. Airport officials briefly closed the shuttle train to Kennedy before Gov. Andrew M. Cuomo, in a show of solidarity with protesters, ordered it reopened.\n\nOne of the protesters, Jacki Esposito, an immigration lawyer from Brooklyn, said of the officials deciding the refugees’ fate: “We want to let them know we are watching.”", "authors": ["Richard Pérez-Peña"], "publish_date": "2017-01-28", "source": "nytimes", "top_words": ["executive", "trump", "ban", "immigration", "policy", "anger", "refugees", "muted", "united", "states", "trumps", "draws", "praise", "order", "mr", "deep"], "summary": "Hope you’ll add more Islamic countries like Saudi Arabia soon.”Still, some immigration policy experts in the United States questioned the logic behind the action.\nThe president’s executive order, issued on Friday, brought a positive, if muted, reaction from some Republicans, and could prove popular politically.\nI think it’s very reasonable.”Affected by Trump’s order?\nAre you affected by President Trump’s executive order on immigration, or do you know someone who is?\nAdvertisement Continue reading the main storyTwo Republicans who did not support Mr. Trump’s candidacy, Senator Ben Sasse of Nebraska and Representative Charlie Dent of Pennsylvania, criticized Mr. Trump’s order."}