{"url": "https://www.nytimes.com/2017/01/28/us/politics/trump-toughens-some-facets-of-lobbying-ban-and-weakens-others.html?mcubz=0", "id": "94", "title": "Trump Toughens Some Facets of Lobbying Ban and Weakens Others", "text": "The other memo directed the Pentagon to come up with a “comprehensive plan” in the next 30 days to defeat the Islamic State.\n\nIn a subtle change, the Trump administration also apparently did away with the acronym used by the Obama administration to refer to the terrorist group — ISIL, which stands for the Islamic State in Iraq and the Levant.\n\nThe documents that Mr. Trump signed on Saturday referred to the group as ISIS, shorthand for the Islamic State in Iraq and Syria. The Levant denotes an area larger than Syria.\n\nMr. Trump’s ethics policy also has provisions that will affect officials while they are working in the government. As part of the order he signed, executive branch employees will be barred for two years from working on any “particular matter” that they had been involved in while in the private sector. That is the same amount of time that Mr. Obama imposed on officials who worked for him.\n\nMr. Trump’s measure would prohibit Rex W. Tillerson, who has been nominated to serve as secretary of state, from playing any role in matters related to Exxon Mobil, where until recently he had served as chief executive.\n\nNewsletter Sign Up Continue reading the main story Please verify you're not a robot by clicking the box. Invalid email address. Please re-enter. You must select a newsletter to subscribe to. Sign Up You agree to receive occasional updates and special offers for The New York Times's products and services. Thank you for subscribing. An error has occurred. Please try again later. View all New York Times newsletters.\n\nThe provision may also limit matters that Scott Pruitt, who has been nominated to lead the Environmental Protection Agency, can take up. Mr. Pruitt, who served as Oklahoma’s attorney general, has repeatedly sued the agency.\n\nNorman L. Eisen, the ethics lawyer when Mr. Obama arrived in the White House and the chief author of the rules that Mr. Trump is now replacing, commended much of Mr. Trump’s order.\n\nBut Mr. Eisen and other ethics experts noted that rules banning lobbyists from taking any job with an agency they had tried to influence in the past two years had been removed. Also, the new rules allow departing executive branch employees to take private sector jobs and then informally lobby the administration, as long as they are not registered as a lobbyist, a type of activity previously prohibited for two years. Registration is required once a person does a certain amount of work for a client.\n\nAdvertisement Continue reading the main story\n\n“There is much to like,” Mr. Eisen said of the new executive order. “But it gives nonlobbyists too much leeway when they leave. That is where the biggest problem in the system is: unregistered, shadow lobbyists. They should be getting more regulation, not less.”\n\nHe also said, “Trump kept the Obama limits on the revolving door coming into government, but eliminated Obama’s revolving door protections for nonlobbyists leaving government.”\n\nThe Islamic State directive calls on Defense Secretary Jim Mattis to devise a more aggressive plan to destroy the group. During the campaign, Mr. Trump widely criticized the handling of the operations by the Obama administration and the military. At one point, he said that he knew “more about ISIS than the generals do.”\n\nMr. Trump said during the campaign that he would ask for the 30-day review. He claimed that he had a secret plan to defeat ISIS.\n\nBecause Mr. Trump had been explicit about his intention to ask for the review, military planners have been drafting classified options to provide to Mr. Trump.\n\nAmong the measures that Mr. Mattis may ultimately recommend are using American artillery on the ground in Syria and using Army attack helicopters to help with the invasion of the group’s de facto capital, Raqqa.", "authors": ["Michael S. Schmidt", "Eric Lipton"], "publish_date": "2017-01-28", "source": "nytimes", "top_words": ["administration", "trump", "toughens", "weakens", "ban", "state", "facets", "rules", "plan", "obama", "trumps", "group", "lobbying", "islamic", "mr"], "summary": "The documents that Mr. Trump signed on Saturday referred to the group as ISIS, shorthand for the Islamic State in Iraq and Syria.\nMr. Trump’s ethics policy also has provisions that will affect officials while they are working in the government.\nThat is the same amount of time that Mr. Obama imposed on officials who worked for him.\nDuring the campaign, Mr. Trump widely criticized the handling of the operations by the Obama administration and the military.\nBecause Mr. Trump had been explicit about his intention to ask for the review, military planners have been drafting classified options to provide to Mr. Trump."}