{"url": "http://www.cnn.com/2017/01/30/politics/trump-ban-boosts-isis-recruitment/index.html", "id": "176", "title": "Trump ban is boon for ISIS recruitment, experts say", "text": "(CNN) President Donald Trump's travel ban on seven Muslim-majority nations will be used by ISIS as a recruitment tool, giving the militant group a major propaganda boost, former jihadists have told CNN.\n\nThe executive order, which blocks all immigrants and visa holders who are citizens of Iran, Iraq, Syria, Sudan, Libya, Yemen and Somalia, reinforces ISIS' narrative, according to former jihadi Abu Abdullah.\n\n\"It can play into their propaganda, to make it clear for anyone who could be in doubt, that it's a war on Islam and all Muslims,\" Abdullah told CNN over a messaging service. The names of the now-defected foreign fighters in this story have been changed to protect their identities.\n\nAnother former jihadi said the wedge being driven between Muslims living in the West and their governments is exactly what ISIS wants.\n\n\"[Trump's] helped ISIS a lot, he's basically being a tool for them in a way,\" Abu Obaida, a British former Jabhat al-Nusra fighter in Syria, told CNN via direct message. \"On social media right now there's a lot of people quoting Anwar al-Awlaki (the late spokesperson for al Qaeda in the Arabian Peninsula) and his last speech when he said that America will turn on the Muslims.\"\n\nPresident Donald Trump holds up a signed executive memorandum calling on the Pentagon to \"develop a comprehensive plan to defeat ISIS.\"\n\nJihadist sympathizers hail Trump's ban on social media\n\nAs Obaida indicated, sympathizers of Islamist militant groups are already hailing Trump's ban online.\n\nIn conversation on social media, various jihadists have said the executive action unveiled America's \"hatred towards Muslims,\" according to US-based SITE monitoring service. A pro-ISIS account on Telegram -- an encrypted app favored by the militant group -- praised Trump as \"the best caller to Islam,\" signaling the President's ban would attract new believers.\n\n\"When US President Donald Trump says 'We don't want them here' and bans the Muslim immigrants from Muslim countries, there is one thing that comes to our mind,\" stated one account on Facebook, sharing an image of Awlaki, who was killed in a 2011 US drone strike in Yemen, with his quote.\n\nHe's a caricature of the evil crusader that they want to convince everyone exists. Charlie Winter\n\nCharlie Winter, senior fellow at the International Centre for the Study of Radicalisation and Political Violence at King's College London, who has studied ISIS propaganda for years, told CNN he has not yet seen the ban appear in official releases from the militant group. But Winter said the policy is \"far more potent than any video or other piece of propaganda\" the group could put out.\n\n\"He's a caricature of the evil crusader that they want to convince everyone exists,\" Winter said.\n\nTrump has already featured briefly in at least two propaganda videos released by ISIS, as well as one clip published by the Somali terrorist group al-Shabaab. President Obama was also shown in similar videos.\n\n'Sweet music' to ears of Islamist militants\n\nMembers of the Iraqi forces in Mosul watch Donald Trump giving a speech after he won the US president elections.\n\nIt's not just ISIS that might capitalize on the ban, al Qaeda is likely to use it, too.\n\n\"By banning Muslims, lumping them with radical Islamism, Donald Trump provides ammunition and motivation for al Qaeda and ISIS,\" said Fawaz Gerges, chairman of contemporary Middle East studies at the London School of Economics and author of \"ISIS: A History.\"\n\nGerges said that to group more than 1 billion Muslims with Islamic extremists is \"foolishly counterproductive\" to the battle against ISIS.\n\nTrump has said this is not a Muslim ban. Responding to the outcry over the executive order, the President wrote: \"This is not about religion -- this is about terror and keeping our country safe.\"\n\nBut Gerges said Trump has provided ideological inspiration to ISIS, and also contributed to deepening anti-American sentiments throughout the Muslim world.\n\n\"The policy can easily be interpreted, and is being interpreted, as a ban against Muslims,\" Gerges said. \"If you are serious about defeating ISIS, the last thing you want to do is portray the fight as Islam vs. the West.\"\n\nIf you are serious about defeating ISIS, the last thing you want to do is portray the fight as Islam vs. the West. Fawaz Gerges\n\nIn the years since 9/11, the Bush and Obama administrations were careful not to mix up a \"war on terror\" with a war with Islam. But the Trump team put the fight against \"radical Islamic terrorism\" at the heart of its campaign. This, paired with Trump's previous calls for a \"Muslim registry,\" set the stage for the President's travel ban.\n\nClint Watts, a former FBI counterterrorism special agent and US Army infantry officer, said, as a result of Trump's rhetoric, the US administration will have a harder time partnering with Muslim-majority countries in the region to fight ISIS and other terror groups.\n\n\"This isn't an isolated policy. Moving the embassy to Jerusalem. Calls for bringing back torture. All of these in combination amplify the rhetoric,\" Watts said. \"Not only are we increasing recruitment, but we're making it harder for our partners around the world to fight with us against terrorism.\"\n\nA lifeline for ISIS\n\nAn Iraqi special forces soldier looks on as residents flee Mosul.\n\nBy most accounts, Trump entered office to a diminished ISIS threat . A survey by IHS Conflict Monitor released earlier this month suggested the group has lost nearly a quarter of its territory in Iraq and Syria last year alone, and more than a third since its peak. Its finances have also taken a hit and 180 \"senior\" leaders have been taken out by airstrikes, according to the US-led coalition.\n\nIraqi-led forces trying to retake Mosul from ISIS have made significant gains since launching the offensive late last year.\n\nGOP Sen. John McCain blasted Trump's executive order in an interview with CBS on Sunday, saying he was worried about how the ban would be received in Iraq, where American forces are fighting alongside Iraqi troops to retake Mosul from ISIS.\n\nMcCain, chairman of the Senate Armed Services Committee, added that the ban would only \"give ISIS some more propaganda.\"\n\n\"The Islamic State is on the back foot militarily, it's losing territory. This kind of action more than makes up for that,\" Winter said. \"Even if ISIS loses Mosul and Raqqa, the ideology will live on because of statements like these, policies like these.\"", "authors": ["Eliza Mackintosh", "Charlie Winter", "Fawaz Gerges"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["muslim", "isis", "trump", "ban", "recruitment", "trumps", "group", "experts", "boon", "islam", "president", "muslims", "propaganda", "say"], "summary": "President Donald Trump holds up a signed executive memorandum calling on the Pentagon to \"develop a comprehensive plan to defeat ISIS.\"\nJihadist sympathizers hail Trump's ban on social mediaAs Obaida indicated, sympathizers of Islamist militant groups are already hailing Trump's ban online.\nTrump has said this is not a Muslim ban.\nBut Gerges said Trump has provided ideological inspiration to ISIS, and also contributed to deepening anti-American sentiments throughout the Muslim world.\nMcCain, chairman of the Senate Armed Services Committee, added that the ban would only \"give ISIS some more propaganda.\""}