{"url": "http://www.cnn.com/2017/01/31/opinions/travel-ban-gayle-lemmon-opinion/index.html", "id": "183", "title": "Trump's travel ban is alienating people who risked their lives for America", "text": "Gayle Tzemach Lemmon is a senior fellow at the Council on Foreign Relations and author of the New York Times best-seller, \"Ashley's War: The Untold Story of a Team of Women Soldiers on the Special Ops Battlefield.\" The opinions expressed in this commentary are hers.\n\n(CNN) The executive order signed Friday by President Trump banning refugees from the US may have been designed to put America's safety first, but it defies America's promise to leave no one behind. And in the process, the order sows confusion and leaves American lives hanging in the balance.\n\nTalk to veterans of the post-9/11 wars and you feel immediately the urgency of their desire to reverse this order that is now turning away Iraqis and Afghans who risked their lives for America.\n\nTo address some of the questions around just who is included in this temporary ban on visitors from seven countries -- including Syria and Iraq -- Defense Secretary James Mattis is now preparing a list of Iraqis who served with the US military and who the Pentagon believes should be allowed to enter America without facing a ban.\n\n\"There are a number of people in Iraq who have worked for us in a partnership role, whether fighting alongside us or working as translators, often doing so at great peril to themselves,\" Pentagon spokesman Capt. Jeff Davis told reporters about the list of names the Pentagon is gathering. \"We are ensuring that those who have demonstrated their commitment tangibly to fight alongside us and support us, that those names are known in whatever process there is going forward.\"\n\nAlso clear is their disbelief at the enormity of the public relations disaster that America has inflicted upon itself as US service members fight ISIS and the Taliban, the fear for those Americans who remain in combat and may have to face this order's consequences firsthand and on-the-ground -- and their amazement at a country so divorced from its wars that it wouldn't realize the consequences of banning people from some of the very nations in which Americans now are serving.\n\nThese wars have been invisible for much of the country, with only US soldiers, veterans and Afghans and Iraqis living daily with their consequences. Now these conflicts have spilled onto the front pages once again -- with the whole world watching.\n\nAmerica is a country at war that refuses to act like a country at war. This has been the case for years as less than 1% of the nation fights 100% of its wars. Now some who have fought in those wars are having a say in standing up to an executive order in which they do not believe. And America must ask itself whether it feels safer if its veterans don't.\n\nJUST WATCHED What would Jesus do about the travel ban? Replay More Videos ... MUST WATCH What would Jesus do about the travel ban? 02:57\n\nAmong the advocates for the Iraqis and Afghans who risked their lives for America is Jason Gorey, who was deployed to both Iraq and Afghanistan. Gorey considers himself a conservative Republican -- and a Trump supporter. He volunteered for President Trump's campaign.\n\nHe is also helping those who helped America as the chief operating officer of No One Left Behind, a group dedicated to helping Afghan and Iraqi combat interpreters resettle in the US through the special immigrant visa (SIV) program born in 2006.\n\nGorey's colleagues camped out all weekend at Washington Dulles International airport waiting for Iraqis and Afghans who went through years of vetting -- from recommendation letters to paper documents and background checks, in-person interviews, fingerprints and medical exams -- to arrive.\n\nMore than two dozen of his group's clients were either pulled off flights or saw their flights canceled despite having all the paperwork they needed, Gorey claims.\n\n\"It is really disappointing to me as a veteran,\" Gorey says. \"I consider the combat interpreters fellow veterans, and I have heard that over and over again from many men and women who have served. For a lot of us, it feels like we are leaving fellow vets behind.\"\n\nHe says he believes those who wrote the executive order \"didn't fully understand some of the consequences of the policy.\"\n\nThose consequences can be felt immediately -- and they make America less safe. America is judged worldwide by how it treats its allies, and YouTube and social media is and will be blaring with headlines of America abandoning those it promised to support.\n\nAnd there are personal consequences and life-and-death stakes as those men and women who received US visas face threats to their lives back at home.\n\n\"We are letting our enemy in Iraq and Afghanistan -- ISIS and the Taliban -- hunt fellow veterans. Hunt and kill,\" Gorey says. \"It is a promise we made to protect them and we have to keep it.\"\n\nFollow CNN Opinion Join us on Twitter and Facebook\n\nThat is why the executive order has real-life security implications that are both great and immediate.\n\nAnd a country at war must understand that what starts at home doesn't stay there.\n\nThe world is watching to see not just how America fights ISIS or the Taliban, but also how it honors its commitment to those who joined the United States in those battles.", "authors": ["Gayle Tzemach Lemmon"], "publish_date": "2017-01-31", "source": "cnn", "top_words": ["america", "consequences", "lives", "travel", "veterans", "ban", "gorey", "alienating", "iraqis", "wars", "trumps", "country", "risked", "war", "order"], "summary": "And in the process, the order sows confusion and leaves American lives hanging in the balance.\nTalk to veterans of the post-9/11 wars and you feel immediately the urgency of their desire to reverse this order that is now turning away Iraqis and Afghans who risked their lives for America.\nAmerica is a country at war that refuses to act like a country at war.\n02:57Among the advocates for the Iraqis and Afghans who risked their lives for America is Jason Gorey, who was deployed to both Iraq and Afghanistan.\nAnd a country at war must understand that what starts at home doesn't stay there."}