{"url": "http://www.cnn.com/2017/02/01/opinions/isis-use-travel-ban-to-radicalize-opinion/index.html", "id": "194", "title": "How Trump may be inadvertently helping ISIS", "text": "Julia Ebner is a policy analyst at Quilliam, a counter-extremism think tank in London. Jonathan Russell is Quilliam's head of policy. The opinions in this article belong to the authors.\n\n(CNN) Trump's travel ban does not only lack compassion, precision and potentially legal grounding , but it is also strategic suicide.\n\nThe policy is fundamentally counter-productive to its declared goal of making America -- and the rest of the world -- \"safe again.\" It may in fact even increase the risk of terrorist attacks on US ground.\n\nBy taking a short-sighted approach to homeland security that betrays the values on which the US was founded, the Trump administration risks an inadvertent collaboration with Islamist extremists.\n\nA look at jihadist channels on Telegram, the encrypted instant messaging app, which have celebrated the executive order and the subsequent chaos, confirms this. For example, one post called Trump \"the best caller to Islam.\"\n\nAfter Trump's victory, the IS-supporting Telegram group Contestants of Jihad shared a picture of Trump holding a sign that quoted Sahih al-Bukhari Book Number 59 Hadith: \"The Prophet said when the power of authority comes in the hands of unfit persons, then wait for our (Doomsday).\"\n\nMeanwhile, the al Qaeda affiliate Ansar al-Sharia in the Arabian Peninsula predicted that \"Americans will remember 11/9 the way they remember 9/11,\" referring to the day after the 2016 US elections and the day that saw the biggest terrorist attack on American soil respectively.\n\nBy validating Islamist extremist narratives of the West being at war with Islam, the ban acts as a powerful recruiting incentive. It risks driving integrated Muslims towards vulnerability and vulnerable Muslims into the hands of extremists.\n\nResearch by Quilliam , the counter-extremism think tank for which we work, has shown that by exploiting widespread grievances and anger resulting from discriminatory policies, Islamist extremists have been able to widen their echo chambers and gain support.\n\nIn the past, anti-Muslim statements and policies by Western policymakers have consistently fed into their victimhood narratives and have permanently damaged the reputation and legitimacy of the US government's larger counterterrorism approach.\n\nThe travel ban would be likely to become a key strategic component of ISIS to discredit Western legislation and politics and to demonize the US.\n\nISIS supporters regularly point to both American and European \"imperialist\" foreign policy and anti-Muslim national policies as manifestations of the Western evil. Chats within their online echo chambers reveal that what they call the \"blessed ban\" has become their new favorite example.\n\nSimilar to jihadists' use of the \"blessed invasion\" of Iraq as a key recruiting argument, the ban can easily be used to prove that there is an ongoing \"war on Muslims\" by the \"Crusader\" nations.\n\nISIS knows that the ban will likely facilitate their efforts to lure Muslims into extremist networks permanently. These policies tend to live on in the memories of Muslim-majority communities and on extremist propaganda platforms for a long time.\n\n\"Fighting fire with fire\" -- as Trump advocated in his first televised interview as President last week -- would thus most likely burn us rather than the terrorists.\n\nIf the new administration wants to reduce the terrorist threat within the US, it will need to embrace a values-based counter-extremism policy. Policies that discriminate against ethnic or religious minorities tend to speed up the dynamics of reciprocal radicalization.\n\nEnraging people on the opposite side of the spectrum has in the past been a crucial driver of domestic radicalization rates -- for both far-right and Islamist extremism.\n\nThe records of both successful and foiled attacks on US territory show that in fact the biggest threat that the US faces may in fact come from home-grown terrorism -- whether far-right, anti-government or jihadist in nature.\n\nWithin its first week in office, the Trump administration has been busy locating problems outside -- and solutions within -- the country.\n\nBut in the case of terrorism, the problem may lie within its own borders. Meanwhile, part of the policy solution -- international cooperation and solidarity -- may be found abroad. Moreover, governments could focus on capacity building projects that encourage grassroots initiatives and empower civil society to counter violent extremism and terrorism.\n\nInstead of tearing apart families through banning orders, they could bring together families through supporting civil society projects such as Families Against Terrorism and Extremism (FATE).\n\nWhile ISIS has both physically and virtually been losing ground to the global coalition, its ideological appeal has not diminished, and is far from extinct. This is because ISIS has passed the stage where it needs to undertake active radicalizing efforts itself to recruit.\n\nJust like billionaires who can rely on their banked money to work for itself, ISIS can today rely on its vast network to continue growing its support base.\n\nThe series of attacks in France and Germany in the summer of 2016 were not centrally coordinated by ISIS. They demonstrated the effectiveness of the new strategy outlined by now deceased ISIS spokesperson Al-Adnani last spring: using self-starter attacks and creating self-sustaining guerrilla warfare.\n\nLoose and often highly localized Islamist extremist networks have made sure to spread the group's messages within their own communities, often by playing on state- or society-led anti-Muslim rhetoric and actions. In fact, many don't even need to promote ISIS, they can simply amplify the problems and hamstring the solutions.\n\nFollow CNN Opinion Join us on Twitter and Facebook\n\nThus, fighting extremism with extreme responses -- such as \"extreme vetting\" -- can hardly be a sustainable solution.\n\nCivil society currently has no better prevention tool against jihadist terrorism than to show its solidarity with those Muslim-majority countries that have been affected by the ban and to condemn any policies that drive our societies further apart.\n\nJust like men should protest for the rights of women and heterosexuals for the rights of homosexuals, non-Muslims should defend the rights of Muslims.\n\nWhether Democrat or Republican, Muslim or non-Muslim, white, black or brown -- standing up for the rights of our friends, colleagues and neighbors is more than a moral obligation. It is a strategic necessity for anyone concerned about safety.", "authors": ["Julia Ebner", "Jonathan Russell"], "publish_date": "2017-02-01", "source": "cnn", "top_words": ["isis", "trump", "policies", "ban", "terrorism", "helping", "rights", "fact", "inadvertently", "muslims", "policy", "islamist"], "summary": "ISIS supporters regularly point to both American and European \"imperialist\" foreign policy and anti-Muslim national policies as manifestations of the Western evil.\nISIS knows that the ban will likely facilitate their efforts to lure Muslims into extremist networks permanently.\nWithin its first week in office, the Trump administration has been busy locating problems outside -- and solutions within -- the country.\nThis is because ISIS has passed the stage where it needs to undertake active radicalizing efforts itself to recruit.\nIn fact, many don't even need to promote ISIS, they can simply amplify the problems and hamstring the solutions."}