{"url": "http://www.cnn.com/2017/02/01/opinions/trump-refugee-ban-bringing-religious-faiths-together-feiler/index.html", "id": "195", "title": "Trump refugee ban bringing religious faiths together", "text": "Bruce Feiler is the author of six consecutive New York Times best-sellers, including \"Walking the Bible\" and \"Abraham.\" His new book, \"The First Love Story: Adam, Eve, and Us,\" will be published in March. The opinions expressed in this commentary are his.\n\n(CNN) President Trump's dramatic executive order blocking Syrian refugees from the United States and suspending immigration from some Muslim-majority countries has had a tumultuous impact. Children have been separated from their parents, teachers have been kept from their schools, Christian families have been turned away from American airports. Everyone from politicians to corporate executives has denounced the move. Scores of protests erupted around the country. The scope of the outrage appears to have caught even the White House by surprise.\n\nYet lost in the turmoil is one critical but overlooked benefit to all this upheaval: The president's action -- and the backlash that followed -- are the biggest boon to interfaith relations in decades. The idea that thousands of people would take to the streets in impromptu, grass-roots protests to defend not their own religious traditions but those of a beleaguered minority is relatively unheard of in the long history of religion. That the religion being defended is not just any tradition, but one widely disparaged in recent years from pulpits and campaign platforms as evil incarnate makes it even more remarkable.\n\nJust look at the signs the protesters have been carrying: \"FIRST THEY CAME FOR THE MUSLIMS... THIS TIME WE SAID, 'HELL NO!'\" \"TODAY WE ARE ALL MUSLIM.\" \"STOP PRETENDING YOUR ISLAMOPHOBIA IS PATRIOTISM.\" \" JESUS WAS A REFUGEE .\"\n\n(The expression \"First they came\" is a reference to Martin Neimoller's famous poem famous poem about the Holocaust, with its incantation, \"First they came for the Socialists,\" but I did nothing, then they came for the Trade Unionists, but I did nothing, then they came for the Jews.)\n\nLay people have not been the only ones expressing outrage. Religious leaders, precisely those people who usually stay out of such fights so as not to antagonize their own followers, have been out front and vocal . And not just the usual ones.\n\n-- The United States Conference of Bishops lambasted the move. \"We believe in assisting all, regardless of their religious beliefs,\" said one bishop.\n\n-- The National Association of Evangelicals criticized any discrimination against the most vulnerable, without regard to \"ethnicity, country of origin, religion, gender or gender identity.\"\n\n-- The head of the Southern Baptists called on the president to affirm his commitment to protecting the downtrodden, including \"Christian, Jewish, Muslim, Yazidi or other.\"\n\n-- Reform Jewish leaders denounced \"in the strongest terms the horrifying executive order.\"\n\n-- Even deeply conservative Focus on the Family expressed cautious support for admitting any persecuted people, \"even Muslims,\" into the United States.\n\nIt would be hard to overstate how rare this ecumenical unanimity is. Religious leaders are not used to rallying to the defense of their rivals.\n\nOne reason for this universality: Support for the vulnerable, especially refugees, is one of the foundational beliefs of biblical ideology. The edict \"Love the stranger because you were a stranger once yourself\" is the single most common idea in the Hebrew Bible, used 36 times. Jesus picked up and enhanced this idea, making it a central pillar of his teaching and the Christian church for the next 20 centuries.\n\nNo wonder 550 Catholics attended Mass outside the White House this week in support of refugees. As Father Jim Martin, SJ, tweeted : \"If you reject the migrant and refugee, you reject Christ himself, who asked us, who implored us, who ordered us, to see him in the stranger.\"\n\nSo why have there been so few occasions for inter-religious cooperation? What came to be called the \" interfaith movement \" began in the late 19th century, largely as a way to build bridges among Protestants. Not until after World War II were Catholics and Jews added to this effort in a meaningful way. The term \" Judeo-Christian \" did not become popular until the 1950s. After 9/11, Muslims have been slowly included in these conversations, and the term \"Abrahamic\" gained widespread use.\n\nStill, these gains have been fitful. Bitter wars in the Middle East, coupled with repeated terrorist attacks around the globe, have left even those respectful of different traditions feeling angry, confused and fearful of speaking out. Efforts toward coexistence, while much healthier than a generation ago, have stalled in recent years.\n\nFollow CNN Opinion Join us on Twitter and Facebook\n\nTen years ago, during a visit to the Oval Office, I asked President George W. Bush, who had read my book \"Abraham: A Journey to the Heart of Three Faiths\" and expressed interest in religious dialogue, why he didn't organize an event at the White House. \"In my experience, these things are better off not being done by the President but by the grass-roots,\" he told me.\n\nThe new President may have shown how true that is. By bringing overtones of religious intolerance to the White House, he has finally roused the grass-roots. For a movement in need of signature moments, the impact has the potential to be profound.", "authors": ["Bruce Feiler"], "publish_date": "2017-02-01", "source": "cnn", "top_words": ["came", "muslims", "trump", "faiths", "ban", "refugee", "bringing", "support", "house", "united", "religion", "religious", "refugees", "president", "white"], "summary": "The scope of the outrage appears to have caught even the White House by surprise.\n-- Even deeply conservative Focus on the Family expressed cautious support for admitting any persecuted people, \"even Muslims,\" into the United States.\nOne reason for this universality: Support for the vulnerable, especially refugees, is one of the foundational beliefs of biblical ideology.\nNo wonder 550 Catholics attended Mass outside the White House this week in support of refugees.\nBy bringing overtones of religious intolerance to the White House, he has finally roused the grass-roots."}