{"url": "http://www.cnn.com/2017/01/31/entertainment/james-corden-travel-ban-video-response/index.html", "id": "182", "title": "James Corden takes on travel ban", "text": "Story highlights James Corden is the latest celebrity to speak out about President Donald Trump's travel ban\n\nIn a video shown on his late-night show Monday, Corden said travel should be \"easy for all legal immigrants\"\n\n(CNN) James Corden is the latest celebrity to protest President Donald Trump's travel ban -- and he did so basically without saying a word.\n\nIn a video package that aired before his Monday night episode of \"The Late Late Show,\" Corden chronicled his somewhat mundane experience while traveling out of Los Angeles to make a point.\n\nIn the video, Corden arrives at the airport (some protestors can be spotted as he enters the building), goes through security, casually orders a grilled cheese sandwich once past the screening area, and exchanges pleasantries with a flight attendant while boarding his flight.\n\nThe video ends with text notifying viewers that Corden's shows for the week have been pre-taped as he is away from Los Angeles.\n\n\"Freedom of movement should be this easy for all legal immigrants,\" it added, referring to Corden's experience. \"Not just the white and Christian ones.\"\n\nRead More", "authors": ["Sandra Gonzalez"], "publish_date": "2017-01-31", "source": "cnn", "top_words": ["travel", "ban", "los", "james", "corden", "trumps", "late", "takes", "latest", "president", "video", "legal"], "summary": "Story highlights James Corden is the latest celebrity to speak out about President Donald Trump's travel banIn a video shown on his late-night show Monday, Corden said travel should be \"easy for all legal immigrants\"(CNN) James Corden is the latest celebrity to protest President Donald Trump's travel ban -- and he did so basically without saying a word.\nIn a video package that aired before his Monday night episode of \"The Late Late Show,\" Corden chronicled his somewhat mundane experience while traveling out of Los Angeles to make a point.\nIn the video, Corden arrives at the airport (some protestors can be spotted as he enters the building), goes through security, casually orders a grilled cheese sandwich once past the screening area, and exchanges pleasantries with a flight attendant while boarding his flight.\nThe video ends with text notifying viewers that Corden's shows for the week have been pre-taped as he is away from Los Angeles.\n\"Freedom of movement should be this easy for all legal immigrants,\" it added, referring to Corden's experience."}