{"url": "http://www.cnn.com/2017/01/30/politics/immigration-stats-by-the-numbers-trnd/index.html", "id": "169", "title": "Chances of a refugee killing you and other immigration stats", "text": "(CNN) President Donald Trump has announced a new executive order on immigration . It is a slightly more lenient version of the extremely controversial \"travel ban\" he issued in February -- Iraq has been exempted, leaving six instead of seven Muslim-majority countries on the list.\n\nPeople from the six countries who hold visas or are lawful permanent residents of the United States are also exempt.\n\nTrumps first \"travel ban\" sparked international ire and was eventually blocked by a federal court. This new ban is different, but it's sure to keep the spotlight on the future of immigration and Islam in America. It's time to step back and look at some numbers that put this issue in context.\n\nMillions of people travel in and out of the US every year\n\nThe top nationalities of these visitors are: Mexico, Canada, the UK, Japan and China.\n\nRefugees come from some surprising places\n\ndifferent backgrounds and parts of the world. 2016 saw a record number of Muslim refugees being let into the US . However refugees in general come from severalandof the world.\n\nWould you have guessed, for instance, that the top three countries from which refugees came last year were, in order, the Democratic Republic of the Congo, Syria, and Myanmar?\n\nNew citizens also come from some surprising places\n\nimmigrants who eventually become citizens. That's what naturalization is -- Mexico was the top place of birth for citizens naturalized in 2015. The other top two countries where these new US citizens were born? India and the Philippines. Let's take a look atThat's whatis -- becoming a full US citizen through a rigorous naturalization process was theof birth for citizens naturalized in 2015. The other top two countries where these new US citizens were born?and the\n\nMuslims make up a small portion of immigrants, and an even smaller portion of the population\n\na 10th of immigrants coming to the US are Muslim. They also estimate there are about 3.3 million people who practice Islam in the US. Another interesting tidbit from their report: They estimate the number of Americans who convert to Islam is about equal to the number of Muslim-Americans who convert to another faith or no longer identify with Islam. According to the Pew Research Center , Aboutof immigrants coming to the US are. They also estimate there are aboutwhoin the US. Another interesting tidbit from their report: They estimate the number ofisto the number of Muslim-Americans whoor no longer identify with Islam.\n\nThe 'travel ban' targets Muslim-majority countries\n\nThe new executive order lists six countries, all of which are predominantly Muslim: Iran, Syria, Sudan, Libya, Yemen and Somalia.\n\nThese countries represent a tiny number of new refugees\n\nTrump's initial executive order included an indefinite ban on Syrian refugees. This new order reduces the ban on Syrian refugees to 120 days\n\n2016 marked the highest number of Syrian refugees admitted into the US. The 12,587 refugees accounted for 14% of all refugees admitted. That number is dwarfed by the overall estimated number of Syrian refugees -- about 11 million in the past six years -- as well as the number of refugees who flee to Europe. According to Eurostat, 350,000 Syrians applied for asylum in EU countries in 2015. marked theadmitted into the US. Therefugees accounted forof all refugees admitted. That number isby theof Syrian refugees -- aboutin the past six years -- as well as the number of refugees who flee to Europe. According to Eurostat,applied for asylum inin 2015.\n\nPeople from the 'travel ban' countries are barely involved in terrorism in the US\n\nnot one person from the seven countries included in the initial ban has killed anyone in a terror attack on US soil in the last 40 years. This includes refugees, as well. When we say barely, we mean BARELY. According to the CATO Institute from the seven countries included in the initial ban hasin a terror attack on US soil in the last. This includes refugees, as well.\n\nDuring this time, only 17 people from the seven original nations combined have been convicted of directly planning or implementing a terrorist attack.\n\nTerrorism is real, but the odds are extraordinary\n\nterrorism is a serious global issue, one that most leaders and citizens agree needs to be taken seriously. However, when the risk is boiled down to a matter of immigrants, refugees, and American citizens, the threat becomes infinitesimally small. According to a review by the CATO Institute,one in 3.6 million. The breakdown includes attacks over a 41-year period and includes the 9/11 attack, in which 3,000 people died. Once you narrow it to refugees and and illegal immigrants, the threat is even smaller. Internationalis a serious, one that most leaders and citizens agree needs to be taken seriously. However, when the risk is boiled down to a matter of, refugees, and American citizens, the threat becomes. According to a review by the CATO Institute, the chances of an American dying in a terrorist attack committed by a foreigner in the US stands at about. The breakdown includesover aand includes the, in which 3,000 people died. Once you narrow it toand and, the threat is\n\nOther, more prevalent risks to life put it in perspective\n\nAgain, the threat of terrorism needs to be --and is -- taken seriously, but there are thousands of other phenomena that claim more American lives.\n\nEven so, the statistics above don't tell the whole story. For instance, in 2016, the number of Americans killed in terrorists attacks in the US was unusually high because of the Orlando nightclub shooting, which claimed 49 lives and is considered an act of terrorism carried out by a Muslim extremist. However, it's important to remember that attack was also the deadliest terrorist attack -- and the deadliest mass shooting -- in the US since 9/11.", "authors": ["Aj Willingham", "Paul Martucci", "Natalie Leung"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["syrian", "travel", "chances", "citizens", "ban", "immigration", "refugee", "stats", "number", "countries", "according", "killing", "threat", "refugees", "attack"], "summary": "Trumps first \"travel ban\" sparked international ire and was eventually blocked by a federal court.\nThese countries represent a tiny number of new refugeesTrump's initial executive order included an indefinite ban on Syrian refugees.\nThis new order reduces the ban on Syrian refugees to 120 days2016 marked the highest number of Syrian refugees admitted into the US.\nThat number is dwarfed by the overall estimated number of Syrian refugees -- about 11 million in the past six years -- as well as the number of refugees who flee to Europe.\nThat number isby theof Syrian refugees -- aboutin the past six years -- as well as the number of refugees who flee to Europe."}