{"url": "http://www.cnn.com/2017/01/30/politics/travel-ban-supporters-trump/index.html", "id": "175", "title": "'We love refugees, but...': Voicemails from Trump's travel ban supporters", "text": "(CNN) They say they have no problem with refugees and they're not un-American. They just want to protect the US against terror attacks, and they think President Trump's travel ban is a good first step.\n\n\"I do feel safer,\" said Dotty Rhea, 68, a retiree from Savannah, Tennessee. \"Nobody's angry with them (immigrants), nobody hates them. We just need to protect ourselves.\"\n\nTrump's executive order temporarily suspending refugees and banning immigrants from seven countries has sparked criticism and protests nationwide. But many Americans and members of Congress say they stand by the President's decision.\n\n'They can wait'\n\nSupporters of the ban point to prior terror attacks on American soil and say they want stronger vetting.\n\n\"We are just thrilled that President Trump has issued this ban and he's taking measures to protect us,\" said Debbie Meiners, 67, of Jacksonville, Florida. \"We really believe in securing our borders and being a nation of safety.\n\n\"We love refugees, but we want only those coming here who love us and want to assimilate into our culture and way of life.\"\n\nWe love refugees but we want only those coming here who love us and want to assimilate into our culture and way of life. Debbie From Florida\n\nJessica Herrmann, 50, of Coronado, California, said she is \"perfectly fine\" with immigration and has friends on all types of visas. But she thinks Trump's executive order will help ensure that nobody comes in without proper checks.\n\n\"We're not mean, we're not anti-American,\" said Herrmann, who is part of a military family. \"It's kind of sad that we're going to automatically assume that what Trump's doing is a horrible thing when we're just checking who's coming in (to the country).\"\n\nWe need to look at our country first right now... a country without borders is no longer a country. Jessica From California\n\nEven some former refugees support Trump's actions. Helen Megido, a 43-year-old registered nurse in Federal Way, Washington, is herself a refugee who came to the US from Latvia in 1989.\n\nShe said she waited six to nine months to get refugee status.\n\n\"[If] you want to get here, you wait your chance. You wait your turn,\" she said. \"If they want to get to America, 3 months, 6 months -- it's nothing. They can wait.\"\n\nI am a refugee from Latvia, I immigrated a long time ago... I went through the right way to be selected, get my documents, and I wish everybody will do the same. Helen From Washington\n\nDaniela Otero, a 37-year-old student from Rio Rancho, New Mexico, said her ancestry is Spanish and that she has Mexicans and Native Americans in her family. She said she supports Trump's policy because she wants a safer country for her children and future grandchildren.\n\n\"I think Islam is a threat to our constitutional laws. I know that a lot of people including myself feel that in ways we've been infiltrated in our government,\" she said. \"I'm fully supporting Trump on this.\"\n\nMe and my whole family support him, and we are Hispanic and Mexican and Native American and we support Donald Trump. Daniela From New Mexico\n\n'They don't have constitutional rights to be here'\n\nRobert Lastra told CNN he was born and reared in South Florida after his father fled Cuba in 1960. He said a wave of Cubans who came to Florida in 1980, many of them released convicts, ruined the place where he grew up.\n\n\"I sat there and watched my entire community turn into a literal Dodge City because of all the violence and killing and drug trade,\" said Lastra, who now lives in east Texas. \"I've seen that happening in Texas too.\"\n\nMy background is not Muslim, but it's Cuban... I am glad that Donald Trump is doing what he's doing. Robert From Texas\n\nHe supports Trump's plan to build a wall along the Texas-Mexico border, saying it will be a deterrent to people coming into the United States illegally.\n\n\"Thank god that somebody is tightening the borders and they're going to properly vet these people, even if it means keeping most of them out,\" Lastra said. \"They don't have the right to be here to begin with. They don't have constitutional rights to be here. They're here by the grace of God, just like I'm here by the grace of God.\"\n\nJames Hitt, a retired 63-year-old from Woodburn, Iowa, said it makes sense to \"vet the hell out of\" refugees and immigrants from those seven predominantly Muslim countries.\n\n\"You look at the rape crisis in Germany, in Sweden, it's almost entirely related to Middle East refugees,\" he said. \"I'm certainly more concerned about our homeless veterans than I am about refugees from Syria.\"\n\nI really like what Trump's doing. You look at the rape crisis in Europe, I don't want that for America. James From Iowa\n\nRhea, who calls herself part of \"average Middle America,\" also lived in South Florida and said she witnessed the dangers of illegal immigration when she saw people arriving on boats. Trump's executive order will make America safer, she said.\n\n\"Just as people came way back when and came through Ellis Island -- they were vetted,\" the Tennessee woman said. \"They weren't just allowed to flood our borders.\"\n\nI feel so much safer on an airplane now, I feel so much safer walking around the United States of America. Dotty From Tennessee\n\nRepublican politicians back ban\n\nTrump also has support from some -- but not all -- fellow Republicans, including Alabama Gov. Robert Bentley and House Intelligence Committee chair Rep. Devin Nunes, who called the move a \"useful\" temporary measure.\n\nPro-ban members of Congress say the top priority should be to keep Americans safe.\n\nJUST WATCHED Tears and uncertainty after travel ban Replay More Videos ... MUST WATCH Tears and uncertainty after travel ban 01:51\n\n\"I would not support a travel ban on Muslims,\" said Sen. Roy Blunt of Missouri. \"I do support increased vetting on people applying to travel from countries with extensive terrorist ties or activity. These seven countries meet that standard.\"\n\n\"We are at war with Islamic extremists and anything less than 100 percent verification of these refugees' backgrounds puts our national security at risk,\" said Sen. Steve Daines from Montana.\n\nSome conservative pundits agree. David French of the National Review argued that what's been lost in the outrage over the ban is that the mandates of the order are short-term until new screening guidelines are surmised -- and that exceptions can be made.\n\n\"We know that terrorists are trying to infiltrate the ranks of refugees and other visitors,\" French wrote. \"A short-term ban on entry from problematic countries combined with a systematic review of our security procedures is both reasonable and prudent.\"", "authors": ["Eric Levenson", "Ralph Ellis"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["america", "travel", "trump", "safer", "ban", "voicemails", "refugees", "love", "support", "say", "trumps", "supporters", "way"], "summary": "They just want to protect the US against terror attacks, and they think President Trump's travel ban is a good first step.\n\"We love refugees, but we want only those coming here who love us and want to assimilate into our culture and way of life.\"\nWe love refugees but we want only those coming here who love us and want to assimilate into our culture and way of life.\nJessica From CaliforniaEven some former refugees support Trump's actions.\nJUST WATCHED Tears and uncertainty after travel ban Replay More Videos ... MUST WATCH Tears and uncertainty after travel ban 01:51\"I would not support a travel ban on Muslims,\" said Sen. Roy Blunt of Missouri."}