{"url": "http://tech.fortune.cnn.com/2017/02/10/kellyanne-conway-hillary-clinton-donald-trump-twitter/", "id": "102", "title": "Kellyanne Conway Fires Back at Hillary Clinton’s Travel Ban Tweet", "text": "Hillary Clinton fired out a three-character tweet on Thursday that lit up Twitter and garnered an equally terse response from presidential aide Kellyanne Conway.\n\nIn a tweet that simply said “3-0,” the former Democratic presidential candidate threw some not-so-subtle shade at President Donald Trump, who continues to fight for his controversial travel ban to be reinstated. The tweet refers to the unanimous decision Thursday by a three-judge panel in federal appeals court to continue to block the order. The panel ruled that the Trump administration could not offer sufficient evidence to support a need for the ban.\n\nFollowing the ruling, Trump fired back with an all-caps tweet:\n\nSEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE! — Donald J. Trump (@realDonaldTrump) February 9, 2017\n\n“It’s a political decision, we’re going to see them in court, and I look forward to doing that,” Trump said about the decision on Thursday.\n\nAn hour later, Clinton took to Twitter to express her own views:\n\n3-0 — Hillary Clinton (@HillaryClinton) February 10, 2017\n\nBut the social media drama didn’t stop there. Conway then jumped in with some shade of her own, tweeting the three key states that Clinton lost during the election.\n\nThere’s so much happening on Twitter, it’s getting hard to keep up. In the meantime, Trump has continued tweeting about the court ruling calling it “a disgraceful decision.”", "authors": ["Polina Marinova"], "publish_date": "2017-02-10", "source": "cnn", "top_words": ["clintons", "ruling", "travel", "clinton", "presidential", "trump", "ban", "tweeting", "conway", "kellyanne", "court", "twitter", "shade", "hillary", "fires", "panel", "decision"], "summary": "Hillary Clinton fired out a three-character tweet on Thursday that lit up Twitter and garnered an equally terse response from presidential aide Kellyanne Conway.\nThe panel ruled that the Trump administration could not offer sufficient evidence to support a need for the ban.\nFollowing the ruling, Trump fired back with an all-caps tweet:SEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE!\nConway then jumped in with some shade of her own, tweeting the three key states that Clinton lost during the election.\nIn the meantime, Trump has continued tweeting about the court ruling calling it “a disgraceful decision.”"}