{"url": "http://www.cnn.com/2017/01/29/politics/donald-trump-adas-israel-preschool-condemns-travel-ban/index.html", "id": "143", "title": "Synagogue where Trump's grandchild goes to preschool condemns travel ban", "text": "Story highlights Adas Israel condemned Trump's executive order on \"extreme vetting\"\n\nIvanka Trump and Jared Kushner send one of their children to the Adas Israel preschool\n\nWashington (CNN) Amid the weekend's reaction to President Donald Trump's travel ban one may hit close to home for Ivanka Trump and Jared Kushner.\n\nAdas Israel Congregation, the Conservative synagogue in Washington's Cleveland Park neighborhood where Trump and Kushner send one of their three young children to preschool, issued a statement Sunday evening condemning the President's controversial executive order.\n\nThe child attends Gan HaYeled Preschool at Adas Israel, per a source close to the temple community.\n\nThe order, which Trump signed at the Pentagon Friday, temporarily halted US refugee entry into the US for 120 days, and barred all citizens of seven Muslim-majority nations from entering the US for three months.\n\n\"The leadership and clergy of Adas Israel Congregation stands with the entire Conservative movement and other local organizations such as the Jewish Community Relations Council of Greater Washington in advocating for the rights of immigrants, rejecting the targeting of individuals based on religion, and calling on the US government to reject policy proposals that would halt, limit, or curtail refugee resettlement in the US or prioritize certain refugees over others,\" the synagogue wrote on Facebook and in an email sent to congregants.\n\nRead More", "authors": ["Betsy Klein"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["travel", "trump", "ban", "condemns", "goes", "refugee", "israel", "preschool", "kushner", "trumps", "synagogue", "grandchild", "order", "adas", "send"], "summary": "Story highlights Adas Israel condemned Trump's executive order on \"extreme vetting\"Ivanka Trump and Jared Kushner send one of their children to the Adas Israel preschoolWashington (CNN) Amid the weekend's reaction to President Donald Trump's travel ban one may hit close to home for Ivanka Trump and Jared Kushner.\nAdas Israel Congregation, the Conservative synagogue in Washington's Cleveland Park neighborhood where Trump and Kushner send one of their three young children to preschool, issued a statement Sunday evening condemning the President's controversial executive order.\nThe child attends Gan HaYeled Preschool at Adas Israel, per a source close to the temple community.\nThe order, which Trump signed at the Pentagon Friday, temporarily halted US refugee entry into the US for 120 days, and barred all citizens of seven Muslim-majority nations from entering the US for three months.\n\"The leadership and clergy of Adas Israel Congregation stands with the entire Conservative movement and other local organizations such as the Jewish Community Relations Council of Greater Washington in advocating for the rights of immigrants, rejecting the targeting of individuals based on religion, and calling on the US government to reject policy proposals that would halt, limit, or curtail refugee resettlement in the US or prioritize certain refugees over others,\" the synagogue wrote on Facebook and in an email sent to congregants."}