{"url": "http://management.fortune.cnn.com/2017/02/07/trump-travel-ban-biotech-letter/", "id": "10", "title": "More Than 150 Biotech Leaders Sent President Trump a Letter Slamming His Travel Ban", "text": "Major CEOs from the tech and retail industries have been compelled to speak out on President Donald Trump’s executive order barring refugees and citizens of Muslim-majority nations from entering the U.S. — and smaller biotechs are following suit.\n\nOn Tuesday, Nature Biotechnology published a letter slamming Trump’s executive order, which will be argued in the 9th Circuit Court of Appeals Tuesday evening. The letter has 166 signatories, including dozens of biotech CEOs, life science venture capital enthusiasts, and world-class academics, castigating the Trump administration’s approach to immigrants. The group argues that the order undermines progress on drug development and scientific innovation.\n\nClick here to subscribe to Brainstorm Health Daily, our brand new newsletter about health innovations.\n\n“If this misguided policy is not reversed, America is at risk of losing its leadership position in one of its most important sectors, one that will shape the world in the twenty-first century,” read the letter. “Indeed, it will harm an industry dominated by smaller companies and startups, the very kind of industry the administration has said it wants to support. It will slow the fight against the many diseases that afflict us, as well as carry negative economic consequences for the United States.”\n\nThe open note goes on to cite figures about immigrant and foreign-born scientists’ contributions to the biopharma field. Alnylam (alny) CEO John Maraganore, Acorda chief Ron Cohen (who also heads the main biotech industry/lobbying group BIO), and other prominent executives helped spearhead the letter’s publication.\n\nSteven Holtzman, president and CEO of the hearing disorder-focused biotech Decibel Therapeutics, is another one of the driving forces behind Tuesday’s letter. For him, it’s personal, he explained in an interview with Fortune.\n\n“My mother came here from Cuba as a child, her father, a man who never finished grade school, seeking a better life for his family,” he said. He describes himself as a first generation immigrant (who happens to have run a half dozen biotechnology companies), and sees Trump’s immigration order as an affront to American values, even if there are a relatively modest number of life science professionals who come from the affected countries.\n\nHoltzman also believes that biotech professionals and academics are eager to tackle the immigration issue (and sign onto open letters), not just because of biopharma’s diversity but also a general appreciation that isolation can throttle scientific progress. “I’ve been so lucky to come here and run these companies that help cure diseases,” he said. “I don’t know if my story is possible in Trump’s America.”", "authors": ["Sy Mukherjee"], "publish_date": "2017-02-07", "source": "cnn", "top_words": ["travel", "slamming", "companies", "trump", "ban", "life", "150", "order", "science", "scientific", "trumps", "biotech", "smaller", "run", "leaders", "president", "sent", "letter"], "summary": "On Tuesday, Nature Biotechnology published a letter slamming Trump’s executive order, which will be argued in the 9th Circuit Court of Appeals Tuesday evening.\nThe letter has 166 signatories, including dozens of biotech CEOs, life science venture capital enthusiasts, and world-class academics, castigating the Trump administration’s approach to immigrants.\n“Indeed, it will harm an industry dominated by smaller companies and startups, the very kind of industry the administration has said it wants to support.\nSteven Holtzman, president and CEO of the hearing disorder-focused biotech Decibel Therapeutics, is another one of the driving forces behind Tuesday’s letter.\n“I’ve been so lucky to come here and run these companies that help cure diseases,” he said."}