{"url": "http://tech.fortune.cnn.com/2017/03/09/hawaii-first-legal-challenge-trump-new-travel-ban/", "id": "109", "title": "Hawaii Files First Legal Challenge to President Trump's New Travel Ban", "text": "The state of Hawaii requested emergency court intervention on Wednesday to halt a revised executive order from President Donald Trump placing U.S. entry restrictions on refugees and travelers from six Muslim-majority countries.\n\nArguing that the new travel ban violates the U.S. Constitution, the state asked a Hawaii federal court to grant a temporary restraining order that should apply nationally.\n\nU.S. District Court Judge Derrick Watson ruled earlier in the day that the state could sue over Trump’s new order, which was signed by the president on Monday.\n\nIt is the first legal challenge to the revised order.\n\nWatson said the state could revise its initial lawsuit, which had challenged Trump’s original ban signed in January.\n\nA hearing is set for March 15, a day before the new ban is to go into effect.\n\nThe government has said the president has wide authority to implement immigration policy and that the travel rules are necessary to protect against terrorist attacks.\n\nSome legal experts have said court challenges will be more difficult now because changes to the order give exemptions to more people.\n\nThe revised travel order changed and replaced the original, more sweeping ban issued on Jan. 27 that caused chaos and protests at airports and was challenged in more than two dozen lawsuits around the country. A federal judge in Seattle put the first order on hold, in a decision upheld by an appeals court in San Francisco.\n\nThe new order is much more narrowly tailored. It keeps a 90-day ban on travel to the United States by citizens of Iran, Libya, Syria, Somalia, Sudan and Yemen, but excludes Iraq and applies the restriction only to new visa applicants. It also removed an indefinite ban on all refugees from Syria.\n\nThe order no longer covers legal residents or existing visa holders, and makes waivers possible for some business, diplomatic and other travelers.\n\nImmigration advocates have said the new ban, like the original one, discriminates against Muslims.\n\nBut the first hurdle in a lawsuit is proving “standing” to sue, which means finding someone who has been harmed by the policy. With so many exemptions, legal experts have said it might be hard to find individuals that a court would rule have a right to sue.\n\nState claims harm\n\nHawaii claims its state universities would be harmed by the order because they would have trouble recruiting students and faculty. It also says the island state’s economy would be hit by a decline in tourism. The court papers cite reports that travel to the United States “took a nosedive” after Trump’s actions.\n\nThe state was joined by a new plaintiff named Ismail Elshikh, an American citizen from Egypt who is an Imam at the Muslim Association of Hawaii whose mother-in-law lives in Syria, according to the lawsuit.\n\n“This second Executive Order is infected with the same legal problems as the first Order,” the state said in court papers filed on Tuesday. The President’s order “is subjecting a portion of Hawaii’s population, including Dr. Elshikh, his family, and members of his Mosque, to discrimination and second-class treatment,” Hawaii said.\n\nThe lawsuit says that Elshikh fears his mother-in-law will not be able to enter the country under the new order. “The family is devastated,” the filing said.\n\nOne of the groups eligible for waivers under the new ban are those seeking to visit or live with a close relative and who would face hardship if denied entry.\n\nAdam Lauridsen, a San Francisco attorney representing students challenging Trump’s first order, said the waiver provisions in the new ban are similar to case-by-case exemptions allowed in the first ban. Earlier legal challenges were allowed to move forward despite those waivers, he said.\n\nIn support of its actions, the Trump administration has cited a section of law that says the president can suspend entry to the United States by “any class” of foreigners if he finds it would be “detrimental to the interests” of the country.", "authors": [], "publish_date": "2017-03-09", "source": "cnn", "top_words": ["travel", "hawaii", "ban", "challenge", "state", "court", "files", "states", "trumps", "order", "president", "legal"], "summary": "Arguing that the new travel ban violates the U.S. Constitution, the state asked a Hawaii federal court to grant a temporary restraining order that should apply nationally.\nU.S. District Court Judge Derrick Watson ruled earlier in the day that the state could sue over Trump’s new order, which was signed by the president on Monday.\nWatson said the state could revise its initial lawsuit, which had challenged Trump’s original ban signed in January.\nThe court papers cite reports that travel to the United States “took a nosedive” after Trump’s actions.\nAdam Lauridsen, a San Francisco attorney representing students challenging Trump’s first order, said the waiver provisions in the new ban are similar to case-by-case exemptions allowed in the first ban."}