{"url": "http://tech.fortune.cnn.com/2017/02/16/trump-immigration-travel-executive-order/", "id": "105", "title": "Trump Plans to Issue a New Immigration Executive Order Next Week", "text": "U.S. President Donald Trump said on Thursday he will issue a new executive order to replace his controversial directive suspending travel to the United States by citizens of seven mostly Muslim countries.\n\nAt a White House news conference on Thursday, Trump said the new order would seek to address concerns raised by federal appeals court judges, who temporarily blocked his original travel ban.\n\n“The new order is going to be very much tailored to what I consider to be a very bad decision,” Trump said, adding: “We had a bad court.”\n\nTrump gave no details about the replacement order. Legal experts said a new directive would have a better chance of withstanding courtroom scrutiny if it covered some non-Muslim countries and exempted non-citizen immigrants living in the U.S. legally.\n\nThe original order, issued on Jan. 27, triggered chaos at some U.S. and overseas airports, led to international protests, complaints from U.S. businesses and drew more than a dozen legal challenges.\n\nIn a court filing on Thursday, the Justice Department asked for a pause in proceedings before the 9th U.S. Circuit Court of Appeals, which sided with a federal court in Washington state to suspend the travel ban, while litigation over its legality according to the U.S. Constitution played out.\n\nThe Justice Department asked the court to vacate that ruling once the administration has rescinded its original order and issued a new one. In an order later on Thursday, the 9th Circuit put proceedings over the ban on hold but did not say whether it would eventually withdraw its previous ruling.\n\nThe ban has been deeply divisive in the United States, with a Reuters/Ipsos poll indicating about half of Americans supported it shortly after the order took effect.\n\nLEGAL UNCERTAINTY\n\nTrump’s decision to issue a new directive plunges court proceedings over his earlier order into uncertainty. Litigants around the country said they will carefully examine any new policy to see if it raises similar constitutional issues and will continue to pursue legal action if necessary.\n\nWashington state Attorney General Bob Ferguson, who filed the case that produced the 9th Circuit ruling, claimed victory on Thursday.\n\n“Today’s court filing by the federal government recognizes the obvious – the president’s current executive order violates the Constitution,” Ferguson said, in a statement. “President Trump could have sought review of this flawed order in the Supreme Court but declined to face yet another defeat.”\n\nTrump has said travel limitations are necessary to protect the United States from attacks by Islamist militants. His original order barred people from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen from entering the country for 90 days. Refugees were banned for 120 days, except those from Syria, who were banned indefinitely.\n\nTrump said on Thursday that the widely criticized rollout had been “very smooth” and once again blamed the court for “a bad decision.”\n\nThe Justice Department court filing on Thursday said Trump’s order would be “substantially revised” but provided no more details than the president did at his press conference. Last week an congressional aide who asked not to be identified told Reuters that Trump might rewrite the original order to explicitly exclude green card holders, who have legal permission to live and work in the United States.\n\nStephen Griffin, a professor of constitutional law at Tulane University, said adding non-Muslim countries could also help a new order withstand accusations that it discriminates based on religion. Given that the administration already identified the seven Muslim-majority countries as a threat, he said, it would be unlikely to remove any of those.\n\n“I’d speculate they would add to the list, as opposed to walk it back,” he said.", "authors": [], "publish_date": "2017-02-16", "source": "cnn", "top_words": ["executive", "original", "travel", "trump", "plans", "immigration", "court", "week", "united", "states", "issue", "order", "president", "proceedings", "legal"], "summary": "U.S. President Donald Trump said on Thursday he will issue a new executive order to replace his controversial directive suspending travel to the United States by citizens of seven mostly Muslim countries.\nThe Justice Department asked the court to vacate that ruling once the administration has rescinded its original order and issued a new one.\nThe ban has been deeply divisive in the United States, with a Reuters/Ipsos poll indicating about half of Americans supported it shortly after the order took effect.\nLEGAL UNCERTAINTYTrump’s decision to issue a new directive plunges court proceedings over his earlier order into uncertainty.\nHis original order barred people from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen from entering the country for 90 days."}