{"url": "http://management.fortune.cnn.com/2017/03/16/trump-travel-ban-elizabeth-warren/", "id": "13", "title": "Elizabeth Warren to Trump: 'Your Muslim Ban Is Now 0 for 2 VS the Constitution'", "text": "Known for her many spars with President Donald Trump on social media ever since last year’s election campaign, Senator Elizabeth Warren has once again taken to Twitter, this time over a judge’s decision to temporarily block the White House’s revamped travel ban.\n\n“Turns out, an illegal Muslim ban by another name is still an illegal Muslim ban,” she tweeted hours after the judgment came.\n\nReiterating many of the arguments against the travel restrictions imposed on people from six Muslim-majority nations, Warren tweeted that the revamped executive order would “still be a recruiting tool for ISIS” and “a betrayal” of U.S. values, as well fail to secure the country.\n\n.@realDonaldTrump's illegal Muslim ban is still a recruiting tool for ISIS. Still a betrayal of our values. Still doesn't keep us safe. — Elizabeth Warren (@SenWarren) March 16, 2017\n\n“@realDonaldTrump, your Muslim ban is now 0 for 2 vs the Constitution,” Warren continued, appearing to echo former Secretary of State Hillary Clinton’s tweet when the Ninth Circuit Court upheld a halt on Trump’s first travel ban in February.\n\n.@realDonaldTrump, your Muslim ban is now 0 for 2 vs the Constitution. Stop fighting the rule of law and start fighting for all Americans. — Elizabeth Warren (@SenWarren) March 16, 2017\n\nFor more on Elizabeth Warren, watch Fortune’s video:\n\n“Stop fighting the rule of law and start fighting for all Americans,” the Democratic Senator from Massachusetts implored at the end of her tweetstorm.", "authors": ["Kevin Lui"], "publish_date": "2017-03-16", "source": "cnn", "top_words": ["illegal", "travel", "values", "trump", "constitution", "ban", "fighting", "elizabeth", "tweeted", "vs", "warren", "muslim"], "summary": "“Turns out, an illegal Muslim ban by another name is still an illegal Muslim ban,” she tweeted hours after the judgment came.\n@realDonaldTrump's illegal Muslim ban is still a recruiting tool for ISIS.\n— Elizabeth Warren (@SenWarren) March 16, 2017“@realDonaldTrump, your Muslim ban is now 0 for 2 vs the Constitution,” Warren continued, appearing to echo former Secretary of State Hillary Clinton’s tweet when the Ninth Circuit Court upheld a halt on Trump’s first travel ban in February.\n@realDonaldTrump, your Muslim ban is now 0 for 2 vs the Constitution.\n— Elizabeth Warren (@SenWarren) March 16, 2017For more on Elizabeth Warren, watch Fortune’s video:“Stop fighting the rule of law and start fighting for all Americans,” the Democratic Senator from Massachusetts implored at the end of her tweetstorm."}