{"url": "http://money.cnn.com/2017/01/29/technology/immigration-ban-airbnb-free-housing/index.html", "id": "17", "title": "Airbnb offers free housing to people stranded by Trump's travel ban", "text": "Brian Chesky is one of many tech leaders who have condemned President Trump's sweeping immigration order. Now the Airbnb CEO is offering free housing for people left stranded as a result.\n\nTrump has banned the citizens of seven Muslim-majority countries from entering the U.S. for at least the next 90 days. The order also stops the admission of all refugees for the next four months, and bans people fleeing war-torn Syria indefinitely.\n\nIn response, Chesky tweeted: \"Not allowing countries or refugees into America is not right, and we must stand with those who are affected.\"\n\nIn a Facebook post, Chesky gave a few more details, saying the offer of free housing applied to \"refugees or anyone else who needs it in the event they are denied the ability to board a U.S.-bound flight and are not in your city/country of residence.\"\n\nTrump's executive order left many people, including refugees, stranded at airports around the world.\n\nAirbnb is providing free housing to refugees and anyone not allowed in the US. Stayed tuned for more, contact me if urgent need for housing — Brian Chesky (@bchesky) January 29, 2017\n\nOn Monday, Airbnb launched a support page where people who want to help can list their homes. Under the heading \"help create a world where anyone can belong anywhere,\" the company pledged to link up those in need of accommodation with a provider, or subsidize the cost of an Airbnb listing if free housing is not available.\n\n\"Our goal is to provide short term housing assistance to these impacted individuals,\" a spokesperson said.\n\nMany Airbnb hosts, such as Andrew Tran in Philadelphia, were quick to offer help.\n\n\"My wife and I came to America from families of immigrants and are incredibly lucky to have had opportunity in this country,\" he told CNNMoney. \"We were inspired to contribute in whatever way we can.\"\n\n@bchesky I have housing available in Philadelphia, how can I participate and contribute — Andrew Tran (@Drew_Tran) January 29, 2017\n\nAirbnb has a history of putting its network of housing in 191 countries to work to help the victims of natural disasters, most recently after wildfires in Chile and earthquakes in Italy.\n\nIf you would like to help temporarily house these people in need, sign up here: https://t.co/y0ctQprO3u\n\n\n\nThank you for your generosity! https://t.co/mIVOqZZ529 — Airbnb (@Airbnb) January 30, 2017\n\nWorld leaders are also opening their doors to those affected by the ban. Canada's Prime Minister Justin Trudeau tweeted: \"To those fleeing persecution, terror & war, Canadians will welcome you, regardless of your faith. Diversity is our strength #WelcomeToCanada\"\n\nRelated: Mark Zuckerberg criticizes Trump on immigration\n\nSo did his Turkish counterpart. \"#RefugeesWelcome in #Turkey, the world's largest refugee hosting country. We'd happily welcome global talent not allowed back into #USA,\" tweeted Mehmet Simsek.\n\nTrump's order also calls for a review into suspending the Visa Interview Waiver Program, which allows travelers from 38 countries -- including close allies -- to renew travel authorizations without an in-person interview.\n\n-- Samuel Burke contributed to this article.", "authors": ["Zahraa Alkhalisi"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["travel", "ban", "housing", "chesky", "order", "stranded", "free", "tweeted", "trumps", "countries", "need", "refugees", "help", "offers", "airbnb"], "summary": "Now the Airbnb CEO is offering free housing for people left stranded as a result.\nIn response, Chesky tweeted: \"Not allowing countries or refugees into America is not right, and we must stand with those who are affected.\"\nTrump's executive order left many people, including refugees, stranded at airports around the world.\nAirbnb is providing free housing to refugees and anyone not allowed in the US.\nhttps://t.co/mIVOqZZ529 — Airbnb (@Airbnb) January 30, 2017World leaders are also opening their doors to those affected by the ban."}