{"url": "http://www.cnn.com/2017/01/29/europe/uk-petition-president-trump-ban-trnd/index.html", "id": "138", "title": "UK petition to stop Trump state visit hits 1 million", "text": "Story highlights Petitions with more than 100,000 signatures can be considered in Parliament\n\nIncrease in signatures comes after Trump announced a controversial travel ban\n\nLondon (CNN) A petition to stop US President Donald Trump's making an official state visit to Britain had gained more than a million signatures by Monday, in a backlash to Trump's controversial ban on citizens from seven Muslim-majority countries from entering the United States.\n\nThe petition to ban Trump from making the visit was created on the country's Government and Parliament website at the end of November, long before Trump's announcement, and had gained just 372 signatures in two months.\n\nNews spread over the weekend of Trump's travel ban, and by 10 am on Monday, the number of signatures on the petition had soared, and it's still rising fast.\n\nGraham Guest, the British lawyer who created the petition, said he had no specific issue or policy position in mind when he started the petition. It was just Trump the man, really.\n\n\"Maybe Trump's travel ban has angered people and they want him to know what it's like to be banned from a country,\" he wrote to CNN.\n\nRead More", "authors": ["Emanuella Grinberg"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["gained", "travel", "petition", "trump", "ban", "state", "stop", "visit", "created", "making", "uk", "trumps", "million", "hits", "signatures"], "summary": "The petition to ban Trump from making the visit was created on the country's Government and Parliament website at the end of November, long before Trump's announcement, and had gained just 372 signatures in two months.\nNews spread over the weekend of Trump's travel ban, and by 10 am on Monday, the number of signatures on the petition had soared, and it's still rising fast.\nGraham Guest, the British lawyer who created the petition, said he had no specific issue or policy position in mind when he started the petition.\nIt was just Trump the man, really.\n\"Maybe Trump's travel ban has angered people and they want him to know what it's like to be banned from a country,\" he wrote to CNN."}