{"url": "http://management.fortune.cnn.com/2017/02/21/donald-trump-travel-ban-us-economy/", "id": "12", "title": "President Trump's Travel Ban Will Likely Have 'Little Effect' on U.S. Economy At First", "text": "President Donald Trump’s proposed travel ban won’t have too much of an effect on the U.S. economy during the first year, according to economists surveyed by Bloomberg.\n\nSeventy percent of respondents said that the ban, which has been temporarily suspended by federal courts, would have “little to no effect” on 2017’s economic growth. Nine of the 40 economists said it would have a moderately negative impact on the economy, while two said it would be moderately positive. Just one felt it would have a significantly negative effect.\n\nThe majority predicted a limited economic impact primarily because most felt the ban wouldn’t “stick,” according to Bloomberg. After the initial executive order was issued on Jan. 27, a federal judge issued a nationwide stay. Trump attempted to get the ban reinstated, but the 9th Circuit Court of Appeals in San Francisco ruled to keep the block in place.\n\nBrian Schaitkin, of the Conference Board, believes the workforce from the potentially banned countries of Iran, Iraq, Libya, Somalia, Sudan, Syria, and Yemen is a “small but disproportionately skilled and well-educated cohort,” according to Bloomberg. Another economist argued that the issue could snowball if Trump expands his immigration restrictions.\n\n“Of more concern is President Trump’s apparent belief that protectionism can succeed,” Tom Fullerton, an economics professor at the University of Texas at El Paso, told Bloomberg. “Raising protectionist barriers and/or withdrawing from NAFTA could easily cause a re-birth of stagflation due to ensuing supply chain disruptions.”\n\nPresident Trump is slated to announce his revised travel ban sometime this week. The new proposal is said to allow far more expulsions than the original executive order, according to the New York Times. The revamped order is likely to face legal resistance, and could ultimately be settled by the Supreme Court.", "authors": ["Aric Jenkins"], "publish_date": "2017-02-21", "source": "cnn", "top_words": ["negative", "likely", "travel", "bloomberg", "economy", "trump", "ban", "trumps", "moderately", "according", "little", "order", "president", "effect"], "summary": "President Donald Trump’s proposed travel ban won’t have too much of an effect on the U.S. economy during the first year, according to economists surveyed by Bloomberg.\nSeventy percent of respondents said that the ban, which has been temporarily suspended by federal courts, would have “little to no effect” on 2017’s economic growth.\nNine of the 40 economists said it would have a moderately negative impact on the economy, while two said it would be moderately positive.\n“Of more concern is President Trump’s apparent belief that protectionism can succeed,” Tom Fullerton, an economics professor at the University of Texas at El Paso, told Bloomberg.\nThe new proposal is said to allow far more expulsions than the original executive order, according to the New York Times."}