{"url": "http://www.cnn.com/2017/01/29/politics/bill-de-blasio-trump-travel-ban/index.html", "id": "142", "title": "NYC mayor: Trump travel ban 'sends a horrible message'", "text": "Story highlights de Blasio's comments come amid protests at airports\n\nHe was also critical of Trump's executive action blocking\n\nWashington (CNN) New York City Mayor Bill de Blasio blasted President Donald Trump Sunday over the executive order placing a travel ban on people coming from seven Muslim-majority countries into the United States. He said the new GOP President's executive action \"goes against our Constitutional values\" and targets Muslims.\n\n\"This sends a horrible message to them that for no reason whatsoever they could be detained or even sent to their home country even though they're part of the life of the United States,\" he told CNN's Jake Tapper on \"State of the Union.\"\n\nThe progressive mayor also said Trump's action has left 800,000 permanent residents of the United States in the United States unsure of their futures, adding it's \"still not clear\" whether the Trump administration is abiding by the temporary hold placed on the travel ban issued by federal judges Saturday night.\n\nde Blasio's comments come amid protests at airports in New York and across the country.\n\nThe mayor also asserted the ban's exceptions for religious minorities in Muslim-majority nations make it a de facto Muslim ban, a point Tapper pushed back on, saying it's possible minority Muslims could be allowed in, as well.\n\nRead More", "authors": ["Eric Bradner"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["executive", "message", "travel", "trump", "ban", "sends", "nyc", "united", "trumps", "mayor", "action", "states", "york", "horrible"], "summary": "Story highlights de Blasio's comments come amid protests at airportsHe was also critical of Trump's executive action blockingWashington (CNN) New York City Mayor Bill de Blasio blasted President Donald Trump Sunday over the executive order placing a travel ban on people coming from seven Muslim-majority countries into the United States.\nHe said the new GOP President's executive action \"goes against our Constitutional values\" and targets Muslims.\n\"This sends a horrible message to them that for no reason whatsoever they could be detained or even sent to their home country even though they're part of the life of the United States,\" he told CNN's Jake Tapper on \"State of the Union.\"\nThe progressive mayor also said Trump's action has left 800,000 permanent residents of the United States in the United States unsure of their futures, adding it's \"still not clear\" whether the Trump administration is abiding by the temporary hold placed on the travel ban issued by federal judges Saturday night.\nde Blasio's comments come amid protests at airports in New York and across the country."}