{"url": "http://www.cnn.com/2017/01/27/politics/donald-trump-refugees-executive-order/index.html", "id": "122", "title": "Trump's latest executive order: Banning people from 7 countries and more", "text": "Washington (CNN) With just a few quick strokes of the pen, President Donald Trump on Friday banned -- temporarily, for now -- roughly 218 million people from entering the United States.\n\nTrump barred citizens of seven Muslim-majority countries from entering the US for at least the next 90 days by executive order, which a senior White House official said later Friday is likely just a first step toward establishing a broader ban.\n\nIt's unclear how many more countries will be added to the list, but the official said the administration will be \"very aggressive\" as it weighs how many more countries to add to the list.\n\nAsked what criteria the administration will consider as it looks to expand the ban beyond the initial seven countries, the official said simply the \"mandate is to keep America safe.\"\n\n\"Not going to take any risks,\" the official added.\n\nThat's just one part of the controversial executive order Trump signed Friday dubbed: \"Protecting the nation from foreign terrorist entry into the United States.\" Many of the provisions in the order are consistent with Trump's campaign pledges.\n\nHere's a breakdown of what the executive order does.\n\nBans citizens of 7 countries\n\nTrump banned citizens of seven Muslim-majority countries from entering the US for at least the next 90 days.\n\nThe executive order bars all people hailing from Iraq, Syria, Iran, Libya, Somalia, Sudan and Yemen -- or at least 218 million people, based on 2015 data published by the World Bank -- from entering the United States. Those countries were named in a 2016 law concerning immigration visas as \"countries of concern.\"\n\nBut the executive order also makes clear those seven countries are just a starting point for a likely broader ban.\n\nThe order exempts diplomats and members of international organizations from the ban.\n\nOrders review of countries to be added to the ban\n\nThe order also directs the secretary of Homeland Security to conduct a 30-day review to determine which countries do not provide \"adequate information\" for its citizens to be issued visas to enter the US.\n\nDuring the campaign, Trump talked about these countries as \"terror-prone\" countries. During the GOP primary campaign, he called for banning all Muslims from the US -- a statement he never retracted -- before shifting toward calling for banning individuals from countries with terrorist links, though he never specified the countries.\n\nSuspends the US refugee program\n\nTrump also stopped the admission of all refugees to the United States for four months.\n\nDuring that time, Trump's secretary of state will review the application and screening process for refugees to be admitted to the US. The process is already highly rigorous and often takes successful refugee applicants at least two years to be admitted into the United States, but Trump has argued the program could still be exploited by terrorists.\n\nTrump also more than halved the number of refugees who could eventually be admitted in 2017 to 50,000 from the 110,000 cap established under former President Barack Obama.\n\nTrump also states in the order that refugees should be prioritized for entry on the basis of religious persecution, \"provided that the religion of the individual is a minority religion.\" That would open the door for Christian refugees from Muslim-majority countries to be accepted in the US while Muslims fleeing those countries would be excluded.\n\nBans Syrian refugees\n\n\"I hereby proclaim that the entry of nationals of Syria as refugees is detrimental to the interests of the United States and thus suspend any such entry,\" Trump declared in Friday's executive order.\n\nWhile Trump during his campaign called for banning Syrian refugees from the US -- decrying their entry as a potential \"Trojan horse\" -- he also called for establishing a safe zone in Syria where Syrians fleeing the war-ravaged country could live peacefully. Trump made no mention of that plan in Friday's executive order, even though a draft of the executive order circulating in recent days called for beginning to plan for creating such zones.\n\nCalls for new immigration screening procedures\n\nThe executive order also calls for the secretaries of state and homeland security, the director of national intelligence and the FBI director to develop and implement new immigration screening procedures.\n\nTrump during his campaign called for developing new \"extreme vetting\" screening procedures that would weed out potential terrorists from visa applicants by asking questions about their views on the US and ensuring that individuals support the US's pluralistic values.\n\n\"In order to protect Americans, the United States must ensure that those admitted to this country do not bear hostile attitudes toward it and its founding principles,\" Trump states in the opening section of the executive order.\n\n\"The United States cannot, and should not, admit those who do not support the Constitution, or those who would place violent ideologies over American law. In addition, the United States should not admit those who engage in acts of bigotry or hatred...or those who would oppress Americans of any race, gender, or sexual orientation.\"\n\nCorrection: The combined population of the seven countries named in the executive order -- Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen -- is roughly 218 million, according to 2015 data published by the World Bank. An earlier version of this story incorrectly used a lower figure.", "authors": ["Jeremy Diamond"], "publish_date": "2017-01-27", "source": "cnn", "top_words": ["executive", "seven", "trump", "banning", "refugees", "united", "states", "trumps", "countries", "entry", "order", "campaign", "latest"], "summary": "That's just one part of the controversial executive order Trump signed Friday dubbed: \"Protecting the nation from foreign terrorist entry into the United States.\"\nHere's a breakdown of what the executive order does.\nBut the executive order also makes clear those seven countries are just a starting point for a likely broader ban.\nDuring the campaign, Trump talked about these countries as \"terror-prone\" countries.\nTrump made no mention of that plan in Friday's executive order, even though a draft of the executive order circulating in recent days called for beginning to plan for creating such zones."}