{"url": "http://tech.fortune.cnn.com/2017/02/16/syria-president-bashar-al-assad-donald-trump-travel-ban/", "id": "104", "title": "Syria's President Seems to Support President Trump's Travel Ban", "text": "Syria’s President Bashar al-Assad said President Donald Trump’s ban on Syrians entering the United States targeted terrorists, not the Syrian people, appearing to defend the logic of the measure in an interview broadcast on Thursday.\n\nTrump last month issued an executive order, since suspended by a U.S. district judge, that temporarily barred travelers from seven mostly Muslim countries including Syria, as well as imposing an indefinite ban on all Syrian refugees.\n\n“It’s against the terrorists that would infiltrate some of the immigrants to the West. And that happened. It happened in Europe, mainly in Germany,” Assad said in the interview with Europe 1 radio and TF1 television which was recorded on Tuesday in English.\n\n“I think the aim of Trump is to prevent those people from coming.” It was “not against the Syrian people”, he said.\n\nTrump said his order, which triggered protests at home and abroad and confusion at U.S. and international airports, was intended to prevent militants from entering the United States. His administration is challenging the suspension ruling, which was upheld last week by appeal court judges.\n\nAssad’s government has often criticized Western states for their support for Syrian rebel groups, all of which are regarded by Damascus as terrorists, and has warned that such backing will lead to militant attacks around the world.\n\nTrump has not yet set out a clear policy on Syria but has indicated he could cut U.S. support for insurgent groups and has said he wants to mend ties with Russia, whose President Vladimir Putin is Assad’s strongest international ally.\n\nAsked directly whether Trump’s immigration policy was the right one, Assad did not answer. He also said he had not yet seen what Trump’s Syria policy would be.", "authors": [], "publish_date": "2017-02-16", "source": "cnn", "top_words": ["syrian", "travel", "syrias", "ban", "prevent", "support", "united", "trumps", "syria", "terrorists", "states", "president", "policy"], "summary": "Syria’s President Bashar al-Assad said President Donald Trump’s ban on Syrians entering the United States targeted terrorists, not the Syrian people, appearing to defend the logic of the measure in an interview broadcast on Thursday.\n“I think the aim of Trump is to prevent those people from coming.” It was “not against the Syrian people”, he said.\nTrump said his order, which triggered protests at home and abroad and confusion at U.S. and international airports, was intended to prevent militants from entering the United States.\nAsked directly whether Trump’s immigration policy was the right one, Assad did not answer.\nHe also said he had not yet seen what Trump’s Syria policy would be."}