{"url": "http://www.cnn.com/2017/01/29/us/zakaria-take-executive-order-cnntv/index.html", "id": "159", "title": "Fareed Zkaria criticizes Trump travel ban", "text": "Story highlights Fareed Zakaria delivers a damning assessment of Trump's executive order\n\nZakaria: \"Donald Trump seems to want to turn off that lamp on the Statue of Liberty\"\n\n(CNN) CNN's Fareed Zakaria delivered a scathing critique of Trump's travel ban on his show, \"GPS,\" on Sunday, calling the refugees and foreign nationals affected by the order the \"roadkill of Trump's posturing.\"\n\nReferencing President Trump's request that the Department of Homeland Security and the State Department provide information and progress reports on the numbers of foreign terrorists over the next three months, Zakaria offered up some figures there and then on the seven countries affected by the ban.\n\n\"Let me save the government some money and offer up the data right now,\" he said, quoting a study by Alex Nowrasteh of the CATO Institute , a conservative think tank that has tallied the number of Americans killed on US soil from 1975 to 2015 by citizens of the seven countries.\n\n\"Iraq - zero, Iran -zero, Syria - zero, Yemen - zero, Libya - zero, Somalia - zero, Sudan -- zero,\" Zakaria said.\n\nAs to how these particular countries were chosen, Zakaria said it was \"truly mysterious,\" before observing that \"none of the Muslim majority countries that have a Trump hotel, building or office are on the list.\"\n\nRead More", "authors": ["Alexandra King"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["seven", "travel", "foreign", "trump", "ban", "affected", "criticizes", "fareed", "zkaria", "zero", "zakaria", "trumps", "countries", "department"], "summary": "Story highlights Fareed Zakaria delivers a damning assessment of Trump's executive orderZakaria: \"Donald Trump seems to want to turn off that lamp on the Statue of Liberty\"(CNN) CNN's Fareed Zakaria delivered a scathing critique of Trump's travel ban on his show, \"GPS,\" on Sunday, calling the refugees and foreign nationals affected by the order the \"roadkill of Trump's posturing.\"\nReferencing President Trump's request that the Department of Homeland Security and the State Department provide information and progress reports on the numbers of foreign terrorists over the next three months, Zakaria offered up some figures there and then on the seven countries affected by the ban.\n\"Let me save the government some money and offer up the data right now,\" he said, quoting a study by Alex Nowrasteh of the CATO Institute , a conservative think tank that has tallied the number of Americans killed on US soil from 1975 to 2015 by citizens of the seven countries.\n\"Iraq - zero, Iran -zero, Syria - zero, Yemen - zero, Libya - zero, Somalia - zero, Sudan -- zero,\" Zakaria said.\nAs to how these particular countries were chosen, Zakaria said it was \"truly mysterious,\" before observing that \"none of the Muslim majority countries that have a Trump hotel, building or office are on the list.\""}