{"url": "http://tech.fortune.cnn.com/2017/03/06/trump-new-travel-ban-livestream/", "id": "107", "title": "Watch Live: Donald Trump's Administration Announces New Travel Ban", "text": "Donald Trump has made some changes to his controversial travel ban.\n\nOn Monday at 11:30 a.m. ET, members of Trump’s administration will announce a new travel ban that temporarily prohibits immigrants from six Muslim-majority countries from entering the country, not seven. According to a fact sheet given to lawmakers and obtained by the Associated Press, the new order will exclude Iraq—a decision that was made after the country agreed to work with the U.S. government to further vet its citizens who are applying for a travel visa.\n\nThis change will also allow those who currently hold a visa to travel freely, according to the AP.\n\nPeople from the six remaining countries—Syria, Iran, Libya, Somalia, Sudan, and Yemen—will still be blocked from entering the United States for 90 days if they don’t have a valid visa.\n\nThis new executive order, which Trump is also expected to sign Monday, seeks to address any legal issues that caused the 9th U.S. Circuit Court of Appeals to block it the first time around.\n\nWatch the announcement in the video above.", "authors": ["Madeline Farber"], "publish_date": "2017-03-06", "source": "cnn", "top_words": ["travel", "live", "trump", "ban", "watch", "donald", "announces", "trumps", "entering", "country", "according", "yemenwill", "work", "order", "administration", "visa", "visathis"], "summary": "Donald Trump has made some changes to his controversial travel ban.\nET, members of Trump’s administration will announce a new travel ban that temporarily prohibits immigrants from six Muslim-majority countries from entering the country, not seven.\nThis change will also allow those who currently hold a visa to travel freely, according to the AP.\nThis new executive order, which Trump is also expected to sign Monday, seeks to address any legal issues that caused the 9th U.S.\nWatch the announcement in the video above."}