{"url": "http://www.cnn.com/2017/02/01/politics/donald-trump-ban-bad-people-out/index.html", "id": "196", "title": "Trump on travel ban: 'Call it what you want'", "text": "(CNN) President Donald Trump tweeted Wednesday that debate about what to call his executive order preventing travelers from seven majority Muslim countries and temporarily barring refugees are irrelevant.\n\n\"Everybody is arguing whether or not it is a BAN. Call it what you want, it is about keeping bad people (with bad intentions) out of country,\" he tweeted.\n\nTrump signed an executive order Friday to block refugees from entering the U.S. for 120 days and immigrants from seven predominantly Muslim nations away for three months. Iran, Iraq, Syria, Sudan, Libya, Yemen and Somalia are the countries impacted.\n\nWhite House press secretary Sean Spicer dismissed the idea that Trump imposed a ban.\n\n\"A ban would mean people can't get in, and we've clearly seen hundreds of thousands of people come into our country from other countries,\" he said Tuesday.\n\nBut both Spicer and Trump have recently referred to the executive order as a ban. Trump tweeted earlier this week in defense of his order, \"If the ban were announced with a one week notice, the 'bad' would rush into our country during that week. A lot of bad 'dudes' out there!\"\n\nIf the ban were announced with a one week notice, the \"bad\" would rush into our country during that week. A lot of bad \"dudes\" out there! — Donald J. Trump (@realDonaldTrump) January 30, 2017\n\nSpicer used the term ban to describe the order when describing it Monday while speaking at an event at George Washington University recorded on C-SPAN.\n\n\"One, the ban deals with seven countries that the Obama administration had previously identified as needing further travel restrictions,\" Spicer told School of Media & Public Affairs Director Frank Sesno , comments that were spotlighted by the Huffington Post . \"Two, in the 24-hour period following the implementation of the executive order, 325,000 people came to this country through our airports in 24 hours: 109 of them were stopped for additional screening, 109 out of 325,000.\"\n\nThe administration has been criticized for suggesting that the ban will guarantee safety that statistics do not support.\n\nThere have been no people accepted to the US as a refugee that have been implicated in a major fatal terrorist attack since the Refugee Act of 1980 put systematic procedures in place for accepting refugees, according to an analysis of terrorism immigration risks by the Cato Institute.", "authors": ["Eugene Scott"], "publish_date": "2017-02-01", "source": "cnn", "top_words": ["executive", "seven", "travel", "trump", "bad", "ban", "spicer", "week", "country", "countries", "order"], "summary": "Trump signed an executive order Friday to block refugees from entering the U.S. for 120 days and immigrants from seven predominantly Muslim nations away for three months.\nWhite House press secretary Sean Spicer dismissed the idea that Trump imposed a ban.\nBut both Spicer and Trump have recently referred to the executive order as a ban.\nTrump tweeted earlier this week in defense of his order, \"If the ban were announced with a one week notice, the 'bad' would rush into our country during that week.\nIf the ban were announced with a one week notice, the \"bad\" would rush into our country during that week."}