{"url": "http://www.cnn.com/2017/01/29/politics/trump-travel-ban-congress-reaction/index.html", "id": "154", "title": "McCain, Graham lead in GOP criticism of Trump ban, many others stay mum", "text": "Washington (CNN) Republican Sens. John McCain of Arizona and Lindsey Graham of South Carolina broke the GOP silence on Capitol Hill on Sunday to issue a scathing condemnation of President Donald Trump's ban on travel to the United States from seven Muslim-majority countries.\n\n\"We fear this executive order will become a self-inflicted wound in the fight against terrorism,\" McCain and Graham said in a joint statement, adding that Trump's executive order \"may do more to help terrorist recruitment than improve our security.\"\n\nSenate Foreign Relations Chairman Bob Corker said Sunday the administration should immediately make revisions to the executive order.\n\n\"We all share a desire to protect the American people, but this executive order has been poorly implemented, especially with respect to green card holders,\" said Corker. \"The administration should immediately make appropriate revisions, and it is my hope that following a thorough review and implementation of security enhancements that many of these programs will be improved and reinstated.\"\n\nIt was the strongest criticism Trump has faced yet from the right, as congressional leaders largely deflect questions about the ban and aides say Trump is doing exactly what he pledged he'd do on the campaign trail.\n\nThat could change this week when lawmakers return to Washington and the Senate considers several of Trump's Cabinet nominees' confirmation -- with Democrats determined to force the new administration to backtrack, protests continuing and confusion about the fate of green card holders, including some who have spent years in the United States.\n\nTrump responded, tweeting: \"The joint statement of former presidential candidates John McCain & Lindsey Graham is wrong - they are sadly weak on immigration. The two ... Senators should focus their energies on ISIS, illegal immigration and border security instead of always looking to start World War III.\"\n\nThe joint statement of former presidential candidates John McCain & Lindsey Graham is wrong - they are sadly weak on immigration. The two... — Donald J. Trump (@realDonaldTrump) January 29, 2017\n\n...Senators should focus their energies on ISIS, illegal immigration and border security instead of always looking to start World War III. — Donald J. Trump (@realDonaldTrump) January 29, 2017\n\nTrump also issued a statement defending the new order, saying: \"We will continue to show compassion to those fleeing oppression, but we will do while protecting our own citizens and voters.\"\n\n\"This is not a Muslim ban, as the media is falsely reporting. This is not about religion -- this is about terror and keeping our country safe,\" he said, adding that his first priority \"will always be to protect and serve our country, but as President I will find ways to help all of those who are suffering.\"\n\nSenate Democratic leader Chuck Schumer of New York teared up at a Sunday news conference as he called the ban \"mean-spirited and un-American.\"\n\nHe also heaped pressure on majority Republicans in the House and Senate to play a role in blocking Trump -- noting McCain's denouncement.\n\n\"We should have other Republicans speaking out against it and maybe we can pass something in the Congress,\" Schumer said. \"We can only do it with Republican support to at least undo this or stay it.\"\n\nOn Capitol Hill, many GOP offices were non-responsive in the 24 hours after the executive order was signed, though more are now making statements.\n\nThe reason, according to GOP sources in both chambers, was two-fold: They were left out of the loop by the White House before the travel ban was announced, and they see political risk coming from both directions.\n\n\"Support it and get hit, oppose it and get hit,\" one GOP source said. \"There will be time for discussion about this. Right now we'll let the administration take the lead.\"\n\nOnly a handful of lawmakers were looped in on the general content of the order, and even then, most on Capitol Hill were operating off a draft of the order that was circulating among reporters and agency sources, one aide said.\n\nCommittees with jurisdiction reached out to the relevant agencies at various point throughout the week, from the Department of Homeland Security to the Justice Department and even the White House, and were met mostly with silence or an acknowledgment that their contacts were also in the dark, several aides said.\n\nOne GOP aide noted that the House, in passing a bill to suspend the refugee program for participants in Iraq and Syria in with a veto-proof majority in 2015, had already laid down a similar marker on the issue. The order itself fell into line generally with that bill and was \"in no way a Muslim ban.\"\n\nBut even so, the confusion that appeared pervasive on the agency side extended to Capitol Hill. The status of green card holders, along those refugees already in transit, was something two GOP aides said they had been told was more clear-cut than originally perceived.\n\nThroughout the day Saturday, several senior GOP officials were still attempting to get firm answers on what precisely the exemption and waiver process would be for those programs.\n\nStill, a reality several pointed to, separately: Trump is doing what voters elected him to do.\n\n\"It's not like this was a secret during the campaign,\" one Senate aide said. \"He ran on it. He won.\"\n\nReflecting the muted reaction, Sen. Todd Young, R-Indiana, said in a statement: \"The federal government has no more important responsibility than protecting the American people, and refugees from any country should only be permitted to enter the United States if we are certain they do not represent a threat to our citizens.\"\n\n\"I am eager to ensure that the administration's new policy allows Iraqis and Afghanis who faithfully supported our troops and who face threats to their safety -- and who do not represent a terrorist threat -- to come to the United States,\" Young said.\n\nAnd at least one member offered praise --House Permanent Select Committee on Intelligence Chairman Devin Nunes.\n\n\"In light of attempts by jihadist groups to infiltrate fighters into refugee flows to the West, along with Europe's tragic experience coping with this problem, the Trump Administration's executive order on refugees is a common-sense security measure to prevent terror attacks on the homeland,\" he said in a statement. \"While accommodations should be made for green card holders and those who've assisted the US armed forces, this is a useful temporary measure on seven nations of concern until we can verify who is entering the United States.\"\n\nGOP criticism\n\nTrump famously campaigned on a pledge to indefinitely ban Muslims from entering the United States, something his campaign aides later tried to finesse as a broader policy aimed at implementing \"extreme vetting\" for immigrants from certain countries.\n\nAnd the White House says its executive action doesn't specifically target Muslims -- instead focuses on countries that are terrorism hotbeds that also happen to be majority Muslim. But McCain and Graham said that, in effect, Trump has created the perception that he is banning Muslims from the United States.\n\n\"This executive order sends a signal, intended or not, that America does not want Muslims coming into our country,\" the two said.\n\nMcCain and Graham aren't the only Republican senators to criticize Trump so far.\n\nHe said he's glad to see two federal judges temporarily block Trump's executive order, and said Congress should be involved in strengthening the nation's vetting of visa applicants.\n\n\"We ought to be part of it. We've been working on this,\" Portman said.\n\nSen. Ben Sasse, R-Nebraska, said in a statement that \"while not technically a Muslim ban, this order is too broad.\"\n\n\"There are two ways to lose our generational battle against jihadism by losing touch with reality,\" he said. \"The first is to keep pretending that jihadi terrorism has no connection to Islam or to certain countries. That's been a disaster. And here's the second way to fail: If we send a signal to the Middle East that the U.S. sees all Muslims as jihadis, the terrorist recruiters win by telling kids that America is banning Muslims and that this is America versus one religion.\"\n\nSen. Orrin Hatch, R-Utah, urged Trump's administration to tailor the executive order to be \"as narrowly as possible.\"\n\nHatch said as a Mormon, he is aware that many of his ancestors were refugees himself, as he called on Trump to reduce \"unnecessary burdens on the vast majority of visa-seekers that present a promise -- not a threat -- to our nation.\"\n\nSen. Jeff Flake, R-Arizona, like McCain and Graham, said Trump's executive order appears to target Muslims broadly.\n\n\"President Trump and his administration are right to be concerned about national security, but it's unacceptable when even legal permanent residents are being detained or turned away at airports and ports of entry,\" he said in a statement. \"Enhancing long term national security requires that we have a clear-eyed view of radical Islamic terrorism without ascribing radical Islamic terrorist views to all Muslims.\"\n\nRepublican leaders silent\n\nOn ABC's \"This Week,\" Senate Majority Leader Mitch McConnell, R-Kentucky, said Trump should have \"a lot of latitude\" to secure the country by improving vetting of immigrants.\n\nHe said he opposes \"religious tests,\" but did not specify whether Trump's executive order is one.\n\n\"The courts are going to determine whether this is too broad,\" McConnell said.\n\nA spokeswoman for House Speaker Paul Ryan, R-Wisconsin, was similarly vague -- telling The Washington Post : \"This is not a religious test and it is not a ban on people of any religion.\"\n\nDemocrats push back\n\nDemocrats from liberal havens to conservative states have equally condemned the travel ban.\n\nSen. Kamala Harris, a freshman Democrat from California, wrote to the Department of Homeland Security urging that Customs and Border Protection grant those detained at airports immediate access to lawyers.\n\nCustoms agents, she wrote, should \"be directed to grant individuals detained at ports-of-entry throughout the United States timely and unfettered access to legal counsel.\"\n\nAnd two red-state Democrats up for re-election in 2018 -- North Dakota Sen. Heidi Heitkamp and Montana Sen. Jon Tester -- both criticized it in statements Sunday.\n\n\"This executive order is having harmful consequences on children and brave allies who are helping us fight terrorism,\" Tester said. \"We must take strong steps to protect our nation from those who want to harm us, but we cannot sacrifice our religious freedom and our American values.\"", "authors": ["Eric Bradner", "Phil Mattingly"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["stay", "executive", "mum", "lead", "trump", "gop", "ban", "security", "statement", "mccain", "united", "trumps", "graham", "order", "house", "muslims", "criticism"], "summary": "Senate Foreign Relations Chairman Bob Corker said Sunday the administration should immediately make revisions to the executive order.\nOn Capitol Hill, many GOP offices were non-responsive in the 24 hours after the executive order was signed, though more are now making statements.\nSen. Jeff Flake, R-Arizona, like McCain and Graham, said Trump's executive order appears to target Muslims broadly.\nHe said he opposes \"religious tests,\" but did not specify whether Trump's executive order is one.\n\"This executive order is having harmful consequences on children and brave allies who are helping us fight terrorism,\" Tester said."}