{"url": "http://www.cnn.com/2017/01/29/opinions/what-trump-said-about-travel-ban-is-false-opinion-aslan/index.html", "id": "141", "title": "What Trump said about travel ban is false", "text": "Story highlights President Donald Trump issues a statement Sunday after his travel ban was roundly criticized\n\nAslan: The ban is about religion, not about fighting terrorism\n\nReza Aslan is the author of \"Zealot: The Life and Times of Jesus of Nazareth\" and the host of CNN's new original series \"Believer With Reza Aslan,\" which premieres at 10 p.m. ET March 5. The views expressed are his own.\n\n(CNN) Donald Trump released a statement Sunday afternoon in response to the massive protests that have erupted across the country in response to his latest executive order freezing all refugees from Syria and banning entry to foreign nationals from seven Muslim-majority countries.\n\nReza Aslan\n\n\"To be clear,\" the statement read, \"this is not a Muslim ban, as the media is falsely reporting. This is not about religion - this is about terror and keeping our country safe.\"\n\nAs we have come to expect from Donald Trump, nearly every word of that sentence is false.\n\nIt is a Muslim ban. Rudy Giuliani Rudy Giuliani admitted as much in talking about its origins on Fox News. \"I'll tell you the whole story,\" he said. \"So, when [Trump] announced it he said \"Muslim ban.\" He called me up, he said, 'Put a commission together. Show me the right way to do it legally.'\"\n\nIt is about religion. Trump Trump said so on Christian Broadcast Network when he vowed that he would allow Christians to enter from the banned countries list but not Muslims. \"If you were a Muslim, you could come in,\" Trump said, \"but if you were a Christian, it was almost impossible,\" Trump said of our refugee system. This is, of course, another lie. According to the Pew Research Center, in 2016 the United States brought in 37,521 Christian refugees and 38,901 Muslims refugees.\n\nRead More", "authors": ["Reza Aslan"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["travel", "trump", "ban", "false", "statement", "donald", "religion", "rudy", "response", "refugees", "muslim", "christian"], "summary": "Reza Aslan\"To be clear,\" the statement read, \"this is not a Muslim ban, as the media is falsely reporting.\nAs we have come to expect from Donald Trump, nearly every word of that sentence is false.\n\"So, when [Trump] announced it he said \"Muslim ban.\"\nTrump Trump said so on Christian Broadcast Network when he vowed that he would allow Christians to enter from the banned countries list but not Muslims.\nAccording to the Pew Research Center, in 2016 the United States brought in 37,521 Christian refugees and 38,901 Muslims refugees."}