{"url": "http://www.cnn.com/2017/01/30/politics/travel-ban-protests-immigration/index.html", "id": "174", "title": "Third day of travel ban protests stretch from US to UK", "text": "(CNN) Americans from coast to coast took to the streets for the third consecutive day in support of immigrants and refugees affected by President Donald Trump's controversial travel ban.\n\nSigned Friday, the executive order bars refugees from entering the country for 120 days, and immigrants from seven predominantly Muslim nations for the next three months.\n\nProtesters in Columbus, Ohio, shared videos on social media of police pepper spraying a crowd that refused to disperse. Otherwise, no arrests or disturbances were reported from demonstrations in front of state capitols and universities Monday challenging what participants called a discriminatory policy against Muslims.\n\nTrump has denied that his executive order is a Muslim ban, saying \"this is not about religion -- this is about terror and keeping our country safe.\"\n\nBut in signs and chants, protesters across the United States proclaimed the order un-American. Large crowds gathered in front of New York's Columbia University condemning the order. They waved signs declaring \"No one is illegal\" and urging the public to \"Resist Trump.\"\n\nColumbia students protesting the immigration ban tonight at Low Library. #NoBanNoWall @Columbia pic.twitter.com/8SEUrsWz7J — Kelly Carroll (@NoMadBlog) January 30, 2017\n\nOutside the Ohio statehouse in Columbus, protesters chanted \"No hate, no fear, refugees are welcome here.\" Later in the evening, police pepper sprayed demonstrators after they refused to get out of the street, protesters Daniel Maxwell and Tieryn Terrell told CNN. Columbus Police did not immediately respond to a request for comment.\n\nOn Monday, the mayor of Columbus , Andrew Ginther had announced that the city would accept refugees and that its money and resources wouldn't be used to detect and arrest someone based on immigration status.\n\nColumbus police pepper spraying protesters near the state house pic.twitter.com/4Kt54qyGGa — Daniel Maxwell (@Daniel_Maxwell_) January 31, 2017\n\nThousands outside of the Columbus statehouse \"no hate no fear refugees are welcome here!\" pic.twitter.com/8bTw1ftTLE — Molly Shack (@mollyshack) January 31, 2017\n\nIn Washington, House and Senate Democrats stood outside the Supreme Court and vowed to protest until Trump withdraws the policy, saying that it would worsen the threat of terrorism.\n\n\"This order is against what we believe in in America,\" Senate Minority Leader Chuck Schumer said. \"It will make us unsafe because it will encourage those who are lone wolves as they get more and more isolated, which is our greatest danger.\"\n\nOutrage crosses borders\n\nThe demonstrations in America followed a day of peaceful marches across the United Kingdom.\n\nLondoners, incensed by Trump's new immigration policies , took to the streets from Trafalgar Square to Parliament Square -- a roughly half-mile stretch wedged between St. James Park and the Thames River that includes 10 Downing Street.\n\nThe throng lifted signs above their heads and chanted, \"Hey, hey! Ho, ho! Donald Trump has got to go!\"\n\nTheir placards -- not all rated PG -- made clear protesters' message to the American President.\n\nBritish-born Afghan Maarya said she's peacefully demonstrating because 'this could happen to anyone' pic.twitter.com/19i6YKQkKN — Kara Fox (@karadaniellefox) January 30, 2017\n\nFrom trafalagar sq to parliament sq the streets are lined with peaceful demonstrators - 'refugees welcome here' they say pic.twitter.com/psYnwAKNha — Kara Fox (@karadaniellefox) January 30, 2017\n\n\"Refugees welcome here,\" read a sign. Another said, \"Compassion not complicity.\" One more repudiation of the travel ban read, \"Your hate does not belong in our country.\" Illustrations of Trump controlling UK Prime Minister Theresa May like a marionette were also popular.\n\nSocial media activity showed London wasn't alone. Demonstrations were taking place in several United Kingdom cities Monday evening.\n\nIn Glasgow, Scotland, protesters took to George Square to express their displeasure, with one attendee holding a sign that said, \"Trumpty Numpty wants a big wall, Trumpty Numpty really should FALL.\" In the capital of Edinburgh, marchers carried a \"Scotland against Trump\" banner down a main thoroughfare.\n\nA photo posted by Connor Hall (@connorlewishall) on Jan 30, 2017 at 10:56am PST\n\nIn Manchester, Brighton and Hove, Ipswich, Newcastle, Bristol and Falmouth, protesters braved the cold -- and in Bristol, a chilly rain -- to make their voices heard.\n\nA weekend of protests\n\nThe protests in England and Scotland came on the heels of a weekend of American demonstrations targeting the travel ban.\n\nAirports where detained travelers were held became the focal point, including Los Angeles, San Francisco, Washington, Dallas, New York's JFK, Raleigh, Houston, Seattle, Portland and Atlanta.\n\nProtesters also converged at major landmarks, including the White House, Boston's Copley Square and Battery Park in Manhattan.\n\nMore than 10,000 people arrived at Battery Park, City Hall said, to hear from the likes of New York Mayor Bill de Blasio, Rep. Nydia Velazquez and Sens. Chuck Schumer, Kirsten Gillibrand and Cory Booker, all Democrats.\n\n.@CoryBooker speaking at #BatteryPark protest: \"the power of the people is greater than the people in power\" #NoBanNoWall pic.twitter.com/zlKSveW2Qt — Sen. Cory Booker (@SenBookerOffice) January 29, 2017\n\nAt airports, the crowds waved signs in solidarity with travelers stuck inside -- students, doctors, professors and refugees. They cheered as affected travelers left airports and reunited with loved ones.\n\nAt Terminal 4 of John F. Kennedy International Airport, protesters decried the detention of two Iraqis who were later released.\n\nAirport officials for the most part accommodated the protests, temporarily closing security checkpoints and diverting traffic to make room for demonstrators.\n\nTrump's immigration order: Which countries are affected? Iran\n\nIraq\n\nSyria\n\nSudan\n\nLibya\n\nYemen\n\nSomalia\n\nAt the Philadelphia airport, police closed lanes of traffic to vehicles to make room for demonstrators singing the classic Woody Guthrie protest song, \"This Land Is Your Land.\"\n\nAt Chicago O'Hare Airport, immigration lawyers set up with their laptops, forming a makeshift legal clinic to help travelers arriving from the banned countries.\n\nWhile the protest at Portland International Airport remained largely peaceful, at times Trump supporters and protesters clashed, forcing airport police to move in. A Port of Portland and airport spokesperson told CNN affiliate KOIN 6 News that one person was assaulted during the protest and \"removed for medical care.\"\n\nBy Sunday night, everyone who had been detained in the initial halt of Friday's executive order had either been released into the United States or put on a plane out of the country, Department of Homeland Security spokeswoman Gillian Christensen said.\n\nShe added that 392 green card holders, or lawful permanent residents, were given exemptions and entered the country.", "authors": ["Emanuella Grinberg", "Eliott C. Mclaughlin"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["protests", "travel", "airport", "day", "trump", "ban", "immigration", "order", "stretch", "uk", "protest", "country", "welcome", "refugees", "protesters", "columbus"], "summary": "#NoBanNoWall @Columbia pic.twitter.com/8SEUrsWz7J — Kelly Carroll (@NoMadBlog) January 30, 2017Outside the Ohio statehouse in Columbus, protesters chanted \"No hate, no fear, refugees are welcome here.\"\nA weekend of protestsThe protests in England and Scotland came on the heels of a weekend of American demonstrations targeting the travel ban.\nAt Terminal 4 of John F. Kennedy International Airport, protesters decried the detention of two Iraqis who were later released.\nTrump's immigration order: Which countries are affected?\nAt Chicago O'Hare Airport, immigration lawyers set up with their laptops, forming a makeshift legal clinic to help travelers arriving from the banned countries."}