{"url": "http://tech.fortune.cnn.com/2017/03/15/travel-ban-states-trump-immigration/", "id": "113", "title": "States Seeking to Block Trump Travel Ban Despite Revisions", "text": "U.S. President Donald Trump’s revised travel ban is “substantially different” from the original and a judge shouldn’t apply a previous restraining order to the new version, federal lawyers said Tuesday in a court filing.\n\nJustice Department lawyers filed the documents in U.S. District Court in Seattle, two days before the executive order is set to go into effect.\n\nWashington and several other states are trying to block the revised ban that affects six mostly Muslim nations, saying it’s unconstitutional.\n\nFor more on the travel ban, watch Fortune’s video:\n\nGovernment lawyers say the new version removed provisions that “purportedly drew religious distinctions — erasing any doubt that national security, not religion, is the focus.”\n\nThey made their filings with Judge James Robart, who blocked the original ban last month. Washington state wants him to apply that decision to the new order.\n\nTrump’s revised ban applies to Somalia, Iran, Syria, Sudan, Libya and Yemen and temporarily shuts down the U.S. refugee program.\n\nUnlike the original order, it says people with visas won’t be affected and removes language that would have given priority to religious minorities for entry to the U.S.\n\nWashington Attorney General Bob Ferguson, joined in his lawsuit by heavily Democratic California, Maryland, Massachusetts, New York and Oregon, said the revised ban is still flawed and harms residents, universities and businesses, especially tech companies such as Washington state-based Microsoft and Amazon that rely on foreign workers.\n\nLawyers for New York, Los Angeles, Chicago and other cities filed documents Tuesday with the court supporting Washington state’s lawsuit.\n\nA hearing in a separate lawsuit by Hawaii is scheduled for Wednesday.", "authors": ["The Associated Press"], "publish_date": "2017-03-15", "source": "cnn", "top_words": ["original", "travel", "lawyers", "trump", "revised", "revisions", "ban", "block", "order", "court", "version", "despite", "states", "seeking", "york", "washington"], "summary": "U.S. President Donald Trump’s revised travel ban is “substantially different” from the original and a judge shouldn’t apply a previous restraining order to the new version, federal lawyers said Tuesday in a court filing.\nJustice Department lawyers filed the documents in U.S. District Court in Seattle, two days before the executive order is set to go into effect.\nWashington and several other states are trying to block the revised ban that affects six mostly Muslim nations, saying it’s unconstitutional.\nTrump’s revised ban applies to Somalia, Iran, Syria, Sudan, Libya and Yemen and temporarily shuts down the U.S. refugee program.\nLawyers for New York, Los Angeles, Chicago and other cities filed documents Tuesday with the court supporting Washington state’s lawsuit."}