{"url": "http://www.cnn.com/2017/01/31/politics/house-staff-worked-on-trump-executive-orders/index.html", "id": "186", "title": "House Republican defends staffers working on executive order", "text": "Story highlights The order immediately caused confusion and protests at airports\n\nThe issue came in a closed-door House Republican meeting Tuesday\n\nWashington (CNN) The chairman of the House Judiciary Committee is defending his staffers who worked with President Donald Trump's transition team on the controversial travel ban executive order.\n\nVirginia Rep. Bob Goodlatte said his staffers were discussing immigration policies with Trump officials during the transition period. In a closed-door meeting of House Republicans, he said that their involvement ended January 20 and was on volunteer basis, according to a source in the meeting.\n\nGoodlatte later released a statement Tuesday saying that while he supported the order and his staff working with the transition, they were not decision-makers on its contents.\n\n\"My staff on the House Judiciary Committee are some of the best on Capitol Hill. They are experts in their respective fields and I proudly allowed them to provide their expertise to the Trump transition team on immigration law,\" Goodlatte said. \"To be clear, while they gave advice to the new administration, they did not have decision making authority on the policy. The final decision was made at the highest levels of the Trump Administration, and I support the President's executive order. My staff had no control of the language contained in the President's executive order, the timing of the announcement, the rollout and subsequent implementation, and the coordination with Congress.\"\n\nMultiple sources confirmed to CNN before Goodlatte's statement that Judiciary staffers had aided the transition and worked on the order, but that the chairman was not aware of the content of their work with the administration.\n\nRead More", "authors": ["Tal Kopan", "Phil Mattingly", "Deirdre Walsh"], "publish_date": "2017-01-31", "source": "cnn", "top_words": ["executive", "republican", "trump", "working", "transition", "defends", "worked", "staff", "order", "house", "staffers", "team", "judiciary"], "summary": "Story highlights The order immediately caused confusion and protests at airportsThe issue came in a closed-door House Republican meeting TuesdayWashington (CNN) The chairman of the House Judiciary Committee is defending his staffers who worked with President Donald Trump's transition team on the controversial travel ban executive order.\n\"My staff on the House Judiciary Committee are some of the best on Capitol Hill.\nThey are experts in their respective fields and I proudly allowed them to provide their expertise to the Trump transition team on immigration law,\" Goodlatte said.\nThe final decision was made at the highest levels of the Trump Administration, and I support the President's executive order.\nMy staff had no control of the language contained in the President's executive order, the timing of the announcement, the rollout and subsequent implementation, and the coordination with Congress.\""}