{"url": "http://www.cnn.com/2017/01/29/opinions/trump-ban-impact-on-health-care-vox/index.html", "id": "139", "title": "Trump's travel ban hits hospitals hard", "text": "Story highlights The impact of the White House's travel ban is already being disproportionately felt in American health care, writes Ford Vox\n\nOur hospitals rely on a steady influx of international physicians to keep running, he says\n\nFord Vox is a physician specializing in rehabilitation medicine and a journalist. He is a medical analyst for NPR station WABE-FM 90.1 in Atlanta. He writes frequently for CNN Opinion. Follow him on Twitter @FordVox. The opinions expressed in this commentary are his.\n\n(CNN) The White House's travel ban encompassing seven majority-Muslim countries is a blunt instrument that's already wreaking havoc and the impact is already being disproportionately felt in American health care. The administration emphasizes it's preventing only a \"small percentage\" of global travelers from entering or leaving the country, but our hospitals rely on a steady influx of international physicians to keep running.\n\nThroughout my medical career I've benefited from working alongside medical graduates from around the world. I've enjoyed professional relationships with Russians, Saudis, Canadians, Israelis, Iranians and Italians in the halls of medical centers in Alabama, Ohio, Missouri, Massachusetts and Georgia. Thanks to our conversations between cases I've learned about different medical systems and different approaches to managing the same conditions, and I've enjoyed their camaraderie.\n\nToday I work at one of the top rehabilitation hospitals in the country, and on our wards I've recently had the pleasure of overseeing a resident physician from Iran who's doing her rehabilitation specialty training through Emory University School of Medicine. She holds an H-1B visa, the kind our government grants to the highly skilled workers our economy needs.\n\nUnder President Trump's new order, even after the interventions of two federal courts, if she left the country for any reason, such as going to visit family, she might be locked out from returning. Her colleagues, including myself, trust her to care for patients at the country's eighth ranked rehabilitation hospital, but our government doesn't trust her enough to let her travel.\n\nOther doctors made the mistake of being out of the country the same week Donald Trump started flexing his newfound powers. Border agents ejected a Cleveland Clinic physician who arrived at John F. Kennedy Airport on Saturday, directing her back to Saudi Arabia (she holds a Sudanese passport). On Sunday the clinic took a bold stand against the White House's disruptive new policy, saying it had caused uncertainty for its employees and that the clinic is \"fully committed and actively working toward the safe return of any of our employees who have been affected by this action.\"\n\nRead More", "authors": ["Ford Vox"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["rehabilitation", "travel", "medical", "ive", "ban", "hospitals", "physician", "clinic", "trumps", "country", "houses", "hits", "white", "hard", "care"], "summary": "(CNN) The White House's travel ban encompassing seven majority-Muslim countries is a blunt instrument that's already wreaking havoc and the impact is already being disproportionately felt in American health care.\nThroughout my medical career I've benefited from working alongside medical graduates from around the world.\nHer colleagues, including myself, trust her to care for patients at the country's eighth ranked rehabilitation hospital, but our government doesn't trust her enough to let her travel.\nOther doctors made the mistake of being out of the country the same week Donald Trump started flexing his newfound powers.\nBorder agents ejected a Cleveland Clinic physician who arrived at John F. Kennedy Airport on Saturday, directing her back to Saudi Arabia (she holds a Sudanese passport)."}