{"url": "http://www.cnn.com/2017/01/29/politics/trump-travel-ban-legal/index.html", "id": "156", "title": "How opponents may challenge Trump's order in court", "text": "(CNN) President Donald Trump's executive order banning more than 218 million people from the United States was met with swift legal challenges over the weekend across the country.\n\nJudges from New York to Seattle have granted limited relief for citizens of the seven Muslim-majority countries who have already arrived in the US (or are in the air) with a valid visa or green card, blocking their deportation from the country (for now).\n\nAdvocacy groups say they plan to file additional lawsuits in the days to come challenging the constitutionality of the order as whole.\n\nHere are several key legal issues:\n\nPresidential power on immigration is sweeping, but prohibits discrimination\n\nTrump's order relies on the broad executive powers outlined in Immigration and Nationality Act (or INA), which provides:\n\n\"Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or non-immigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate.\"\n\nAnother section of the law, however, states that \"no person shall receive any preference or priority or be discriminated against in the issuance of an immigrant visa because of the person's race, sex, nationality, place of birth, or place of residence.\"\n\nNon-discrimination clause\n\nExperts have pointed to a variety of legal avenues foreign nationals potentially have at their disposal to challenge the order.\n\nSome say the most direct approach would be an attack based on the non-discrimination clause of the INA.\n\nDavid Bier, an immigration policy analyst at the libertarian Cato Institute, wrote that \"Trump's new policy would run afoul of at least one if not all three of (the) restrictions -- nationality, place of birth, or place of residence -- depending on how it was applied.\"\n\nWhile the Act extends to green card holders, legal experts say refugees outside of the US may continue to be lawfully excluded before they enter because they lack a guaranteed right to come into the US under current law.\n\nYet once on American soil, US and international law prohibits the deportation of non-citizens who can establish that they will face torture or persecution if returned home.\n\nDue process\n\nOther experts highlight the constitutional questions in play, especially for those who are currently detained at airports around the country.\n\nStephen Yale-Loehr, a professor of immigration law practice at Cornell Law School, likened it to the state revoking or suspending a driver's license without affording the driver an opportunity to be heard.\n\n\"That's a procedural due process violation,\" Yale-Loehr explained. \"They can't just put you on a plane and send you back without any sort of hearing at all -- courts look at the interest of the individual, the interest of the government, and balance the two.\"\n\nReligious test?\n\nAnd while the executive order does not explicitly ban all Muslims from entering the country, constitutional lawyers say Trump could have an equal protection problem on his hands if a court were to find that he is intentionally discriminating on the basis of national origin -- the argument would be that he has no rational basis to treat a foreign national from Germany or France differently than someone from Iran or Iraq.\n\nDavid Cole, national legal director of the ACLU and Georgetown University law professor, and others have argued that by showing \"preferential treatment\" for Christian refugees seeking asylum over Muslims or by seeking to \"disfavor a particular religion,\" the executive order would violate the Establishment Clause.\n\n\"The executive order, of course, does not say in express terms that it is favoring Christians and disfavoring Muslims. But Trump is the signatory, and he has said so explicitly,\" wrote Cole.\n\nSpeaking with the Christian Broadcasting Network last week , Trump said that it had been \"impossible, or at least very tough\" for Syrian Christians to enter the United States.\n\n\"If you were a Muslim you could come in, but if you were a Christian, it was almost impossible and the reason that was so unfair -- everybody was persecuted, in all fairness -- but they were chopping off the heads of everybody but more so the Christians. And I thought it was very, very unfair. So we are going to help them.\"\n\nNow what?\n\nTrump insisted Saturday that the travel ban did not amount to \"a Muslim ban\" like the one he called for in during the primary campaign, and his administration showed no signs Sunday of backing down from enforcing the order.\n\n\"It is the right and duty of the President to do everything in his legal and Constitutional power to protect the American people. Saturday's ruling does not undercut the President's executive order. All stopped visas will remain stopped. All halted admissions will remain halted. All restricted travel will remain prohibited. The executive order is a vital action toward strengthening America's borders, and therefore sovereignty. The order remains in place,\" a White House spokesperson said in a statement.\n\nWhether the order will hold up in court is an open question.\n\n\"(P)residents have wide discretion on immigration, because immigration touches national sovereignty and foreign relations. Courts tend to defer to whatever a president declares on immigration. I think the administration could win,\" said Yale-Loehr. \"The national security interests (likely asserted here) may make it particularly hard to win in court even though the order seems so egregiously unconstitutional.\"\n\nCNN's Ariane de Vogue and Steve Almasy contributed to this report.", "authors": ["Laura Jarrett"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["executive", "aliens", "national", "challenge", "immigration", "place", "court", "united", "say", "trumps", "opponents", "order", "law", "legal"], "summary": "(CNN) President Donald Trump's executive order banning more than 218 million people from the United States was met with swift legal challenges over the weekend across the country.\nNon-discrimination clauseExperts have pointed to a variety of legal avenues foreign nationals potentially have at their disposal to challenge the order.\n\"The executive order, of course, does not say in express terms that it is favoring Christians and disfavoring Muslims.\nSaturday's ruling does not undercut the President's executive order.\nThe executive order is a vital action toward strengthening America's borders, and therefore sovereignty."}