{"url": "http://www.cnn.com/2017/01/28/politics/academics-petition-travel-ban/index.html", "id": "128", "title": "Thousands of academics sign letter opposing Trump's travel ban", "text": "Washington (CNN) Thousands of academics in the United States are calling on President Donald Trump to reconsider his executive order that bans travel from seven Muslim-majority nations for 90 days and temporarily suspends all refugee admission to the US.\n\nBy late Saturday afternoon, more than 4,000 academics, including more than two dozen Nobel laureates, signed an open letter going around the academic community addressed to Trump.\n\n\"These bans, as proposed, have consequences that reach beyond the scope of national security. The unethical and discriminatory treatment of law-abiding, hard-working and well-integrated immigrants fundamentally contravenes the founding principles of the United States,\" the letter reads.\n\nThe academics list three grounds for their opposition, saying the executive order is \"discriminatory,\" is \"detrimental to the national interests of the United States\" and \"imposes undue burden on members of our community.\"\n\nIt goes on to say that the disruption this ban will cause is \"inhumane, ineffective and un-American.\"\n\nAsked about the travel ban at the White House Saturday afternoon, Trump rejected a description of the order as a \"Muslim ban\" and said it was \"working out very nicely.\"\n\nThe petition began late Thursday evening and was spread by word of mouth in the academic community, Dr. Mohammad Akbarpour, an assistant professor of economics in graduate school of business at Stanford University. He is from Iran and said the impact this ban will have on students and fellow academics is vast.\n\n\"Iranian students are panicked as they cannot leave the country or come back. We have multiple students who left the country just last week for conferences and visits, and now they can't return,\" Akbarpour said. \"The families of these students want to visit them here and now they cannot.\"\n\n\"Families with valid visas are being denied entry and green card holders are advised not to leave the country. My friends in academia with pending permanent residency applications are being told they may have to leave,\" he added.\n\nHis colleague, Dr. Paul Milgrom, a professor of economics at Stanford, as well as a member of the National Academy of Sciences, told CNN the ban may cause issues for the entire economic community.\n\n\"This policy does not seem to be based on facts. We in the academic and scientific community are very concerned with working toward policy based on facts,\" he said.", "authors": ["Caroline Kenny"], "publish_date": "2017-01-28", "source": "cnn", "top_words": ["academics", "opposing", "travel", "national", "thousands", "ban", "community", "leave", "order", "united", "trumps", "country", "sign", "states", "students", "letter"], "summary": "By late Saturday afternoon, more than 4,000 academics, including more than two dozen Nobel laureates, signed an open letter going around the academic community addressed to Trump.\nThe unethical and discriminatory treatment of law-abiding, hard-working and well-integrated immigrants fundamentally contravenes the founding principles of the United States,\" the letter reads.\nAsked about the travel ban at the White House Saturday afternoon, Trump rejected a description of the order as a \"Muslim ban\" and said it was \"working out very nicely.\"\nHe is from Iran and said the impact this ban will have on students and fellow academics is vast.\n\"Families with valid visas are being denied entry and green card holders are advised not to leave the country."}