{"url": "http://www.cnn.com/2017/01/30/politics/1879-mormon-travel-ban/index.html", "id": "164", "title": "138 years ago, the controversy over travel bans and religion was about Mormons from Europe", "text": "Washington (CNN) President Trump's executive order banning immigrants from seven countries that are predominantly Muslim for three months isn't the first time US attempts to limit travel into the country intersected with faith. More than a century ago, it was Mormon immigrants who found presidential administrations less than welcoming.\n\nIn 1879, President Rutherford B. Hayes' secretary of state William Evarts wrote to US diplomats asking them to seek help from European governments to keep Mormon converts from traveling to the US. And in 1883 President Grover Cleveland asked Congress to \"prevent the importation of Mormons into the country,\" according to \" Immigration and the 'Mormon Question '\" by William Mulder.\n\nThe Church of Jesus Christ of Latter-day Saints faced persecution since its founding in 1830, with members fleeing from New York to Ohio to Missouri. In 1838, Missouri Gov. Lilburn Boggs issued an \" extermination order \" calling for all Mormons to be \"exterminated or driven from the state.\" Members eventually settled in what later became Utah, but opposition continued.\n\nMormon missionary work brought converts from around the world to Utah, and these immigrants were often viewed as alien and pawns in a sinister un-American theocracy. Like Catholics, their loyalty to a Church leader -- in their case, the Mormon prophet -- was seen as suspicious. Reverend J.M. Coyner in 1882 imagined the political ramifications of foreign Mormon immigrants \"scattered over the great mountain regions of the West\" with as many as 16 US senators.\n\nThese immigrants were also viewed as poor and uneducated recruits into Mormon polygamy (a practice the Church banned in 1890), something depicted in the 1882 cartoon below by Thomas Nast.\n\nRead More", "authors": ["Hunter Schwarz"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["travel", "europe", "mormons", "ago", "mormon", "immigrants", "viewed", "state", "order", "president", "religion", "utah", "william", "controversy", "bans", "138", "church"], "summary": "More than a century ago, it was Mormon immigrants who found presidential administrations less than welcoming.\nAnd in 1883 President Grover Cleveland asked Congress to \"prevent the importation of Mormons into the country,\" according to \" Immigration and the 'Mormon Question '\" by William Mulder.\nLilburn Boggs issued an \" extermination order \" calling for all Mormons to be \"exterminated or driven from the state.\"\nLike Catholics, their loyalty to a Church leader -- in their case, the Mormon prophet -- was seen as suspicious.\nCoyner in 1882 imagined the political ramifications of foreign Mormon immigrants \"scattered over the great mountain regions of the West\" with as many as 16 US senators."}