{"url": "http://www.cnn.com/2017/01/30/politics/trump-immigration-religion/index.html", "id": "177", "title": "Religious leaders condemn Trump's immigration order. But who's listening?", "text": "(CNN) Few issues unite American religious leaders across the spiritual and political spectrum. Condemning President Donald Trump's new executive order on immigration is now one of them.\n\nBut will the people in the pews heed their calls to action?\n\nSince the order was released on Friday, a growing chorus of top Christians, Muslims, Jews and leaders of other faiths have denounced it, calling it contrary to their spiritual traditions and the country's values.\n\n\"This weekend proved to be a dark moment in U.S. history,\" Cardinal Blase Cupich of Chicago, a top ally of Pope Francis, said on Sunday , expressing a sentiment widely echoed in churches, synagogues and mosques. \"The world is watching as we abandon our commitments to American values.\"\n\nMeanwhile, nearly 18,500 people have signed a statement promoted by a coalition of evangelical groups pledging to welcome refugees and urging elected officials to assist them.\n\nSeparately, a letter to Congress and Trump from the Interfaith Immigration Coalition has more than 2,000 signatures, including from the heads of several Jewish organizations and Protestant denominations who collectively represent millions of Americans.\n\nOn Sunday, more than 500 Catholics celebrated Mass outside the White House , seeking to express solidarity with immigrants and refugees.\n\nEven Trump's childhood church has condemned the executive order.\n\nThe Rev. J. Herbert Nelson, the top official in the Presbyterian Church (USA), called Trump's order \"a miscarriage of justice.\"\n\n\"I urge the president and his administration to reverse this very harmful decision regarding refugees,\" Nelson said. \"Presbyterians are not afraid of this so-called terror threat. We are not afraid because we profess a faith in Jesus, who entered the world a refugee.\"\n\nAs a boy, Trump attended a Presbyterian church in Queens, New York, that is now part of the Presbyterian Church (USA) . He still calls himself a Presbyterian, though he no longer regularly attends church services.\n\nGood Samaritans?\n\nTrump's order bars Syrian refugees indefinitely, suspends all refugee admissions for 120 days, halts immigration from seven majority Muslim countries for three months and gives priority to \"religious minorities\" when applying for refugee status.\n\nIn a statement on Sunday, Trump said the order is not a \"Muslim ban,\" as many critics have dubbed it.\n\n\"This is not about religion -- this is about terror and keeping our country safe. There are over 40 different countries worldwide that are majority Muslim that are not affected by this order,\" Trump said.\n\nIn an interview with the Christian Broadcast Network on Friday, Trump also said that Christian refugees had been \"horribly treated\" by the United States. \"So we are going to help them.\"\n\nAccording to the Pew Research Center , however, since 2002 the United States admitted far more Christian than Muslim refugees.\n\nIn any case, even many Christian leaders said they do not want their brethren to get special treatment, arguing that the Bible is rife with examples of one tribe -- or faith -- helping another.\n\nThe Rev. James Martin, a Jesuit author and editor at America magazine, cited the parable of the Good Samaritan.\n\n\"Refusing the one in need because you want to protect yourself, especially when the other is in desperate need and obvious danger, is not what Christianity is about,\" Martin said. \"It's about the opposite. It's about helping the stranger, even if it carries some risk.\"\n\nThe Rev. Jim Winkler, President and General Secretary of the National Council of the Churches of Christ, a partnership of some 38 U.S. churches and denominations, drew on the example of Christianity's Holy Family.\n\n\"By effectively preventing the entrance of refugees into this country, President Trump is establishing a policy that would have kept Joseph, Mary and Jesus from entering our nation,\" Winkler said.\n\nHIAS, a Jewish refugee resettlement group based in Maryland, published a letter signed by more than 1,700 rabbis urging the United States to remain a safe haven for thousands fleeing war, poverty and genocide.\n\n\"Jewish history bears witness to the critical choice facing our country: whether to rescue those in need or to construct barriers to keep them out,\" the rabbis said, adding that America has provided generations of Jewish families with opportunity and welcome.\n\n\"But we also know what it looks like for America to turn its back on refugees. We have seen xenophobia overwhelm our nation's capacity for compassion, and we have seen the doors slam shut in our greatest hours of need.\"\n\nOn Monday, meanwhile, Russell Moore, the top ethics and public policy official in the Southern Baptist Church, which has some 17 million members, released a letter that he will send to Trump and Vice President Michael Pence.\n\nMoore acknowledged concerns about admitting immigrants from trouble spots in the Middle East and Africa but said refugees are already stringently vetted and that his church -- and the country -- have long traditions of \"welcoming the stranger.\"\n\n\"As a nation, we must seek to resolve the tension created by these two values — compassion for the sojourner and the security of our citizens — in a way that upholds both values,\" Moore said.\n\nNot all Christian leaders have criticized Trump, however.\n\nFranklin Graham, the son of famed evangelical preacher Billy Graham, told The Huffington Post that it is \"not a biblical command for the country to let everyone in who wants to come.\"\n\nThe Rev. Robert Jeffress , pastor of First Baptist Church of Dallas and a member of Trump's evangelical advisory board, said Christians are more persecuted than other faiths and should be given preferential treatment, as the president has pledged to do.\n\nPulpit vs. pews\n\nThroughout the 2016 presidential campaign, Trump essentially went over the heads of many Christian leaders, winning a majority of white Catholics and 81% of white evangelicals, despite the objections of evangelicals like Moore and Catholics like Pope Francis.\n\nSurveys show there's some chance he could do so again with the new immigration order.\n\nMore than half of white evangelical Protestants (54%) and white mainline Protestants (53%) would support a law barring Syrian refugees from entering the United States, according to a survey conducted last June by the Public Religion Research Institute\n\nA majority of those same groups, as well as a slight majority of white Catholics (52%) also endorse a temporary ban on Muslims coming to the United States from abroad, the survey found.", "authors": ["Daniel Burke", "Cnn Religion Editor"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["listening", "trump", "majority", "immigration", "condemn", "refugees", "united", "states", "trumps", "religious", "order", "president", "white", "leaders", "christian", "church", "whos"], "summary": "Condemning President Donald Trump's new executive order on immigration is now one of them.\nJ. Herbert Nelson, the top official in the Presbyterian Church (USA), called Trump's order \"a miscarriage of justice.\"\nThere are over 40 different countries worldwide that are majority Muslim that are not affected by this order,\" Trump said.\nIn an interview with the Christian Broadcast Network on Friday, Trump also said that Christian refugees had been \"horribly treated\" by the United States.\nAccording to the Pew Research Center , however, since 2002 the United States admitted far more Christian than Muslim refugees."}