{"url": "http://www.cnn.com/2017/03/06/politics/john-kelly-travel-ban-muslim-countries/index.html", "id": "289", "title": "Kelly: There are '13 or 14' more countries with questionable vetting procedures", "text": "Story highlights Trump signed a new executive order that bans immigration from six Muslim-majority countries\n\nKelly says the ban is not a Muslim ban\n\nWashington (CNN) Secretary of Homeland Security John Kelly said that apart from the six countries listed on Monday's travel ban, there are \"13 or 14\" other countries that also have questionable vetting procedures.\n\nKelly didn't name any of the additional countries the administration is concerned about and acknowledged he doesn't expect the list of countries subject to the travel ban will grow.\n\n\"There will probably be other countries we will look at,\" he told CNN's Wolf Blitzer on \"The Situation Room.\" \"I don't believe the list will be expanded, but there are countries out there that we will ask, like Iraq has done ... to cooperate with us better, to get us the information we need to safeguard the country.\"\n\nHe continued: \"There's a number of them out there, I don't want to speculate. There's probably 13 or 14 countries, not all of them Muslim countries, not all of them in the Middle East, that have questionable vetting procedures we can rely on. And if we overlay additional vetting procedures, the chances are these countries will be minimum citizens from those countries that visit our country.\"\n\nPresident Donald Trump on Monday signed a new executive order that bans immigration from six Muslim-majority countries, dropping Iraq from January's previous order and reinstates a temporary blanket ban on all refugees. Iraq was removed from a revised version of an executive order banning travel from certain Muslim-majority countries after intensive lobbying from the Iraqi government at the highest levels, a senior US official told CNN Monday.\n\nRead More", "authors": ["Daniella Diaz"], "publish_date": "2017-03-06", "source": "cnn", "top_words": ["executive", "travel", "muslimmajority", "trump", "ban", "vetting", "iraq", "told", "13", "questionable", "procedures", "countries", "kelly", "order", "14"], "summary": "Story highlights Trump signed a new executive order that bans immigration from six Muslim-majority countriesKelly says the ban is not a Muslim banWashington (CNN) Secretary of Homeland Security John Kelly said that apart from the six countries listed on Monday's travel ban, there are \"13 or 14\" other countries that also have questionable vetting procedures.\nKelly didn't name any of the additional countries the administration is concerned about and acknowledged he doesn't expect the list of countries subject to the travel ban will grow.\n\"There will probably be other countries we will look at,\" he told CNN's Wolf Blitzer on \"The Situation Room.\"\nThere's probably 13 or 14 countries, not all of them Muslim countries, not all of them in the Middle East, that have questionable vetting procedures we can rely on.\nAnd if we overlay additional vetting procedures, the chances are these countries will be minimum citizens from those countries that visit our country.\""}