{"url": "http://www.cnn.com/2017/02/04/politics/airlines-airports-trump-travel-ban/index.html", "id": "208", "title": "Airlines allow passengers after judge blocks travel ban", "text": "Story highlights State Department official confirms reversal of canceled visas\n\nState Department official confirms reversal of canceled visas Customs tells major US airlines it was \"back to business as usual,\" airline exec says\n\n(CNN) Many international airlines are allowing nationals of seven Muslim-majority countries hit with President Donald Trump's travel ban to board US-bound flights after a federal judge blocked the controversial ban nationwide.\n\nUS Customs and Border Protection informed major American airlines on a conference call late Friday that it was \"back to business as usual,\" effective immediately, an airline executive told CNN.\n\nThe State Department has reversed the cancellation of visas provisionally revoked after Trump's executive order -- so long as those visas were not stamped or marked as canceled.\n\nThe State Department has said fewer than 60,000 visas were revoked since Trump signed the order January 27. It was not immediately clear how many from that group will continue to be without their visas because their visas were physically canceled.\n\nAlso, the Department of Homeland Security has suspended all actions to implement the order.\n\nRead More", "authors": ["Angela Dewan"], "publish_date": "2017-02-04", "source": "cnn", "top_words": ["passengers", "blocks", "travel", "official", "ban", "visas", "state", "usual", "judge", "order", "trumps", "revoked", "airlines", "reversal", "department", "allow"], "summary": "Story highlights State Department official confirms reversal of canceled visasState Department official confirms reversal of canceled visas Customs tells major US airlines it was \"back to business as usual,\" airline exec says(CNN) Many international airlines are allowing nationals of seven Muslim-majority countries hit with President Donald Trump's travel ban to board US-bound flights after a federal judge blocked the controversial ban nationwide.\nThe State Department has reversed the cancellation of visas provisionally revoked after Trump's executive order -- so long as those visas were not stamped or marked as canceled.\nThe State Department has said fewer than 60,000 visas were revoked since Trump signed the order January 27.\nIt was not immediately clear how many from that group will continue to be without their visas because their visas were physically canceled.\nAlso, the Department of Homeland Security has suspended all actions to implement the order."}