{"url": "http://www.cnn.com/2017/02/03/politics/federal-judge-declines-to-renew-restraining-order-on-trump-travel-ban/index.html", "id": "204", "title": "Federal judge declines to renew restraining order on Trump travel ban", "text": "Story highlights The temporary restraining order affected travelers arriving in Massachusetts\n\nThe Department of Homeland Security is looking to clear up some confusion about the travel order\n\nWashington (CNN) In the first court victory for the Trump administration, a federal judge in Boston declined Friday to renew a temporary restraining order affecting Massachusetts that prohibited the detention or removal of foreign travelers legally authorized to come to the US.\n\nThe win in court comes at the same time that the administration issued a clarification to its travel order allowing for some citizens from the seven banned countries -- Iraq, Syria, Iran, Libya, Somalia, Sudan and Yemen -- to enter the US under specific circumstances. It was issued shortly before a federal judge in Washington state issued a temporary restraining order against the travel ban effective nationwide.\n\nThe original temporary restraining order in Massachusetts, issued by US District Court Judge Allison Burroughs and US Magistrate Judge Judith Dein, was put in place early Sunday morning and was set to expire on February 5.\n\nBut a different federal judge, US District Court Judge Nathaniel Gordon, ruled Friday that the claims brought by legal permanent residents are now moot given the White House counsel's recent clarification that the travel ban order does not apply such individuals.\n\nGordon went on to additionally conclude that because the other plaintiffs in the case -- Iranian nationals and Oxfam America, Inc. -- did not demonstrate a likelihood of success on the merits of their claim, \"an extension of the restraining order at the present time is not warranted.\"\n\nRead More", "authors": ["Laura Jarrett"], "publish_date": "2017-02-03", "source": "cnn", "top_words": ["travel", "restraining", "trump", "declines", "ban", "judge", "travelers", "court", "massachusetts", "issued", "renew", "federal", "order", "temporary"], "summary": "Story highlights The temporary restraining order affected travelers arriving in MassachusettsThe Department of Homeland Security is looking to clear up some confusion about the travel orderWashington (CNN) In the first court victory for the Trump administration, a federal judge in Boston declined Friday to renew a temporary restraining order affecting Massachusetts that prohibited the detention or removal of foreign travelers legally authorized to come to the US.\nIt was issued shortly before a federal judge in Washington state issued a temporary restraining order against the travel ban effective nationwide.\nThe original temporary restraining order in Massachusetts, issued by US District Court Judge Allison Burroughs and US Magistrate Judge Judith Dein, was put in place early Sunday morning and was set to expire on February 5.\nBut a different federal judge, US District Court Judge Nathaniel Gordon, ruled Friday that the claims brought by legal permanent residents are now moot given the White House counsel's recent clarification that the travel ban order does not apply such individuals.\nGordon went on to additionally conclude that because the other plaintiffs in the case -- Iranian nationals and Oxfam America, Inc. -- did not demonstrate a likelihood of success on the merits of their claim, \"an extension of the restraining order at the present time is not warranted.\""}