{"url": "http://www.cnn.com/2017/02/15/politics/democrats-amicus-brief-trump-travel-ban/index.html", "id": "265", "title": "First on CNN: Congressional Democrats to file brief on Trump's travel ban", "text": "Story highlights The effort is being led by California Rep. Zoe Lofgren in the House and Delaware Sen. Chris Coons in the Senate\n\nIn the House, the effort already has more than 65 signatures\n\nWashington (CNN) Democrats in the House and Senate are joining the court challenge to President Donald Trump's travel and refugee ban, arguing it violates the Constitution.\n\nThe effort is being led by California Rep. Zoe Lofgren in the House and Delaware Sen. Chris Coons in the Senate, according to details shared first with CNN. The brief was expected to be filed on Thursday.\n\nIn the House, the effort already has more than 65 signatures, including leaders like House Minority Leader Nancy Pelosi, Congressional Hispanic Caucus Chairwoman Michelle Lujan Grisham and Democratic Caucus Chairman Joe Crowley, as well as the top Democrats on the House Judiciary and House Homeland Security committees. The group hopes to have more signatures by the time they file the briefing.\n\nIn the Senate, the effort has a dozen signers, including most Democratic members of the Judiciary Committee and its top Democrat, Sen. Dianne Feinstein, and No. 2 Senate Democrat Dick Durbin.\n\nThe group is filing an amicus curiae -- or a friend of the court brief -- in the New York case Darweesh v. Trump. The case was brought by two Iraqis, Hameed Khalid Darweesh and Haider Sameer Abdulkhaleq Alshawi, who were granted visas to the US after supporting the US military in Iraq.\n\nRead More", "authors": ["Tal Kopan"], "publish_date": "2017-02-15", "source": "cnn", "top_words": ["travel", "file", "cnn", "led", "judiciary", "ban", "rep", "congressional", "democrats", "lofgren", "senate", "trumps", "sen", "brief", "zoe", "house", "effort", "signatures"], "summary": "Story highlights The effort is being led by California Rep. Zoe Lofgren in the House and Delaware Sen. Chris Coons in the SenateIn the House, the effort already has more than 65 signaturesWashington (CNN) Democrats in the House and Senate are joining the court challenge to President Donald Trump's travel and refugee ban, arguing it violates the Constitution.\nThe effort is being led by California Rep. Zoe Lofgren in the House and Delaware Sen. Chris Coons in the Senate, according to details shared first with CNN.\nThe group hopes to have more signatures by the time they file the briefing.\nIn the Senate, the effort has a dozen signers, including most Democratic members of the Judiciary Committee and its top Democrat, Sen. Dianne Feinstein, and No.\nThe group is filing an amicus curiae -- or a friend of the court brief -- in the New York case Darweesh v. Trump."}