{"url": "http://www.cnn.com/2017/02/05/politics/trump-twitter-attacks-judge/index.html", "id": "219", "title": "Trump: 'If something happens blame' the judge", "text": "Story highlights Trump continued his attacks on a judge Sunday on Twitter\n\n\"Just cannot believe a judge would put our country in such peril,\" Trump said\n\nWashington (CNN) President Donald Trump spent the weekend at his Mar-A-Lago estate in Florida, disconnected from White House staff and once again tweeting attacks on a federal judge.\n\nHis ire was aimed at US District Judge James Robart, who last week put a nationwide hold on Trump's executive order barring citizens of seven Muslim-majority countries from entering the US for 90 days, all refugees for 120 days and indefinitely halts refugees from Syria.\n\n\"Just cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!\" the President wrote, not just attacking the decision but going after the judge who may yet make more decisions on the matter.\n\nJust cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad! — Donald J. Trump (@realDonaldTrump) February 5, 2017\n\nThis came after a Saturday tweetstorm where Trump called Robart a \"so-called judge.\"\n\nThe opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned! — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nWhat is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.? — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nRead More", "authors": ["Eric Bradner", "Jeff Zeleny"], "publish_date": "2017-02-05", "source": "cnn", "top_words": ["believe", "trump", "bad", "blame", "judge", "peril", "donald", "happens", "country", "realdonaldtrump", "system", "j"], "summary": "Story highlights Trump continued his attacks on a judge Sunday on Twitter\"Just cannot believe a judge would put our country in such peril,\" Trump saidWashington (CNN) President Donald Trump spent the weekend at his Mar-A-Lago estate in Florida, disconnected from White House staff and once again tweeting attacks on a federal judge.\n\"Just cannot believe a judge would put our country in such peril.\n— Donald J. Trump (@realDonaldTrump) February 5, 2017This came after a Saturday tweetstorm where Trump called Robart a \"so-called judge.\"\n— Donald J. Trump (@realDonaldTrump) February 4, 2017What is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.?\n— Donald J. Trump (@realDonaldTrump) February 4, 2017Read More"}