{"url": "http://money.cnn.com/2017/01/31/news/companies/us-airlines-trump-immigration-ban/index.html", "id": "29", "title": "US airlines' cautious reaction to Trump's immigration order", "text": "The nation's airlines scrambled to comply with President Trump's decree on immigration, but have also struggled with how -- or if -- to respond publicly.\n\nWhile some corporate CEOs have denounced Trump's immigration ban, the U.S. airlines -- the industry most directly affected by the ruling -- have been largely and cautiously silent.\n\nAmerican Airlines, the nation's largest air carrier, made the boldest statement from an U.S. airline Monday when CEO Doug Parker sent a memo to employees stating in part that Trump's order \"does not affect the values that this company is built upon — those of diversity, inclusiveness and tolerance.\n\n\"At a time when the world is watching, our industry affords us a unique opportunity to show firsthand what true compassion and kindness look like. Treating each other with respect and dignity does not belong to a political party and transcends any law,\" Parker wrote.\n\nOscar Munoz, United's CEO, wrote to his employees Monday, \"Whatever may divide us as individuals is far, far outweighed by all that unites us as a people.\"\n\nBut neither corporate leader went so far as to declare its opposition to the policy.\n\n\"However, it is the current law of the U.S. And so long as that is the case,\" wrote Parker. \"We must comply.\"\n\nRelated: 20,000 people called us about Trump's travel ban. Hear their voices\n\nBehind the scenes, U.S. airlines, like many businesses, are petrified of running afoul of the president for fear of bringing a financial and public relations maelstrom if mentioned in a tweet. Some airlines, said one official, have even done crisis communications planning in the event they are mentioned in a Trump tweet.\n\nDelta Air Lines felt the sting of a presidential tweet early Monday when its computers failed Sunday evening, canceling hundreds of flights. Trump on Monday blamed the IT system failure at Delta for the chaos at U.S. airports, which were roiled by protesters and confusion over his executive order.\n\nAirline officials also feel that taking a political position risks alienating millions of Americans.\n\nUnlike their counterparts in other industries, airlines are heavily regulated and dependent on the federal government for everything from international route approvals to numerous contracts ranging from flying the mail to government travel.\n\n\"Airlines tend to be more politically conservative organizations. If they speak out against something today, they may find them selves without government support for something they need tomorrow,\" said Henry Harteveldt, founder of the Atmosphere Research Group.\n\nThe presidential order, signed late Friday, left airlines in the U.S. and abroad scrambling to adapt. They first sought to understand how to implement the decree and spent the weekend discussing if, and how, they might oppose the policy, according to multiple interviews with aviation industry officials.\n\nRelated: Trump's immigration ban triggers panic at universities\n\nThe longer-term concern among industry experts and airline officials is the executive order may expand in scope. White House Press Secretary Sean Spicer said at an event at George Washington University Monday of the countries affected by the ban, \"Maybe we will expand those.\"\n\nU.S. carriers don't fly to any of the seven affected countries, nor do the airlines of those countries fly to the U.S. But those citizens travel on an array of U.S. or international airlines and transiting through cities like London, Frankfurt, Dubai, Istanbul and Paris where they frequently transfer to a U.S. airline.\n\nCustoms and Border Patrol told airlines over the weekend the executive order would affect roughly 200 fliers to the U.S. each day.\n\nAirlines today have little room to maneuver.\n\n\"The consequences are very real around\" refusing to comply with the order, said one airline official and the carriers risk fines for noncompliance. Compliance would require the airlines to prevent persons from the seven countries -- Iraq, Iran, Syria, Libya, Somalia, Yemen and Sudan -- in Trump's order from boarding their planes in a foreign country.\n\n\"Airlines are being quiet now because it has a very limited direct impact on them,\" said Harteveldt. \"There are lines that could be crossed that have serious commercial implications and they may try to speak up or use back channels.\"", "authors": ["Jon Ostrower"], "publish_date": "2017-01-31", "source": "cnn", "top_words": ["parker", "executive", "reaction", "industry", "ban", "immigration", "airlines", "trumps", "cautious", "countries", "order", "far"], "summary": "The nation's airlines scrambled to comply with President Trump's decree on immigration, but have also struggled with how -- or if -- to respond publicly.\nWhile some corporate CEOs have denounced Trump's immigration ban, the U.S. airlines -- the industry most directly affected by the ruling -- have been largely and cautiously silent.\nOscar Munoz, United's CEO, wrote to his employees Monday, \"Whatever may divide us as individuals is far, far outweighed by all that unites us as a people.\"\nRelated: Trump's immigration ban triggers panic at universitiesThe longer-term concern among industry experts and airline officials is the executive order may expand in scope.\nCustoms and Border Patrol told airlines over the weekend the executive order would affect roughly 200 fliers to the U.S. each day."}