{"url": "http://www.cnn.com/2017/02/05/politics/mitch-mcconnell-trump-travel-ban/index.html", "id": "218", "title": "McConnell: Congress unlikely to step in if courts throw out Trump travel ban", "text": "Story highlights \"I don't know that that's necessary,\" McConnell told CNN's Jake Tapper on \"State of the Union\"\n\nTrump lashed out at the \"so-called judge\" Saturday\n\nWashington (CNN) Senate Majority Leader Mitch McConnell said President Donald Trump isn't likely to get his travel ban implemented by Congress if courts strike it down.\n\n\"I don't know that that's necessary,\" McConnell told CNN's Jake Tapper on \"State of the Union\" Sunday. \"I mean, the courts are going to decide whether the executive order the President issued is valid or not, and we all follow court orders.\"\n\nMcConnell's comments come after a federal judge put a pause on Trump's order that barred citizens of seven Muslim-majority countries -- Iraq, Syria, Iran, Libya, Somalia, Sudan and Yemen -- from entering the US for 90 days, all refugees for 120 days and indefinitely halts refugees from Syria.\n\nTrump lashed out at the \"so-called judge,\" tweeting Saturday: \"The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!\"\n\nThe opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned! — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nRead More", "authors": ["Eric Bradner"], "publish_date": "2017-02-05", "source": "cnn", "top_words": ["thats", "socalled", "travel", "courts", "trump", "congress", "throw", "ban", "state", "told", "judge", "unlikely", "ridiculous", "step", "takes", "mcconnell", "tapper"], "summary": "Story highlights \"I don't know that that's necessary,\" McConnell told CNN's Jake Tapper on \"State of the Union\"Trump lashed out at the \"so-called judge\" SaturdayWashington (CNN) Senate Majority Leader Mitch McConnell said President Donald Trump isn't likely to get his travel ban implemented by Congress if courts strike it down.\n\"I don't know that that's necessary,\" McConnell told CNN's Jake Tapper on \"State of the Union\" Sunday.\n\"I mean, the courts are going to decide whether the executive order the President issued is valid or not, and we all follow court orders.\"\nTrump lashed out at the \"so-called judge,\" tweeting Saturday: \"The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!\"\nThe opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!"}