{"url": "http://www.cnn.com/2017/03/06/politics/travel-ban-exceptions/index.html", "id": "291", "title": "This time around, travel ban offers wiggle room", "text": "Story highlights Whether an applicant can get a waiver is largely in the hands of officers at US embassies\n\nThe new executive order gives discretion to State Department and DHS personnel\n\nWashington (CNN) President Donald Trump's updated executive order on travel appears to offer more flexibility to would-be travelers than its January predecessor, spelling out several exemptions to the ban on nationals from six designated countries, and giving others wiggle room to apply for waivers.\n\nThe original order, signed days after Trump took office and subsequently blocked by a federal court, created widespread confusion for travelers, border agents, diplomats, airlines, and foreign governments -- an experience the administration hoped to avoid with this new, much longer edition.\n\nIn version 2.0, the parameters of the ban are more clearly outlined. They spell out which categories of travelers are affected, and outline a broader scope of exemptions for individuals seeking to bypass the restrictions.\n\nPer the text of the order, waivers can be issued on \"a case-by-case basis\" by US consular officers at diplomatic posts, and by certain Customs and Border Protection officials at ports of entry.\n\nUnlike January's order, US embassies are not planning to cancel appointments for people seeking US visas, and will \"review each case carefully to ensure it is processed appropriately under the (executive order) and in compliance with any court orders,\" a State Department official told CNN.\n\nRead More", "authors": ["Laura Koran"], "publish_date": "2017-03-06", "source": "cnn", "top_words": ["executive", "room", "travel", "wiggle", "officers", "ban", "state", "travelers", "court", "border", "exemptions", "order", "seeking", "department", "offers"], "summary": "The original order, signed days after Trump took office and subsequently blocked by a federal court, created widespread confusion for travelers, border agents, diplomats, airlines, and foreign governments -- an experience the administration hoped to avoid with this new, much longer edition.\nIn version 2.0, the parameters of the ban are more clearly outlined.\nThey spell out which categories of travelers are affected, and outline a broader scope of exemptions for individuals seeking to bypass the restrictions.\nPer the text of the order, waivers can be issued on \"a case-by-case basis\" by US consular officers at diplomatic posts, and by certain Customs and Border Protection officials at ports of entry.\nUnlike January's order, US embassies are not planning to cancel appointments for people seeking US visas, and will \"review each case carefully to ensure it is processed appropriately under the (executive order) and in compliance with any court orders,\" a State Department official told CNN."}