{"url": "http://www.cnn.com/2017/03/03/politics/homeland-security-assessment-radicalization/index.html", "id": "281", "title": "DHS assessment: Individuals radicalized once in US", "text": "Story highlights Such findings seem to undercut the Trump administration's case for its travel ban\n\nThe assessment is based on \"unclassified, open source materials\"\n\nWashington (CNN) A recent Department of Homeland Security intelligence assessment found that most foreign-born violent extremists do not arrive in the US radicalized, but become radicalized after living in the US for several years.\n\nSuch findings seem to undercut the Trump administration's case for its travel ban and track with other studies, including one by the New America Foundation , that find no clear connection with violent attacks or attempts in the US and travel from certain countries.\n\nWork on the assessment, which was first reported by MSNBC Thursday night and confirmed by a DHS spokesman to CNN Friday morning, began in August. It is based only on \"unclassified, open source materials, including a Department of Justice list of unsealed cases. It does not include information from historical or current investigative case data or current intelligence or threat stream data from classified data sets.\"\n\nDHS said the assessment is \"used to inform federal, state, local, tribal, and territorial counterterrorism, law enforcement, and countering violent extremism officials, as well as immigrant screening and vetting officials on trends of foreign-born individuals engaged in terrorism activity in the homeland.\"\n\nThe report examined 88 cases.\n\nRead More", "authors": ["Tammy Kupperman"], "publish_date": "2017-03-03", "source": "cnn", "top_words": ["radicalized", "travel", "case", "trump", "assessment", "undercut", "dhs", "data", "violent", "individuals", "unclassified", "source"], "summary": "Story highlights Such findings seem to undercut the Trump administration's case for its travel banThe assessment is based on \"unclassified, open source materials\"Washington (CNN) A recent Department of Homeland Security intelligence assessment found that most foreign-born violent extremists do not arrive in the US radicalized, but become radicalized after living in the US for several years.\nWork on the assessment, which was first reported by MSNBC Thursday night and confirmed by a DHS spokesman to CNN Friday morning, began in August.\nIt is based only on \"unclassified, open source materials, including a Department of Justice list of unsealed cases.\nIt does not include information from historical or current investigative case data or current intelligence or threat stream data from classified data sets.\"\nDHS said the assessment is \"used to inform federal, state, local, tribal, and territorial counterterrorism, law enforcement, and countering violent extremism officials, as well as immigrant screening and vetting officials on trends of foreign-born individuals engaged in terrorism activity in the homeland.\""}