{"url": "http://www.cnn.com/2017/02/13/politics/donald-trump-justin-trudeau-white-house/index.html", "id": "261", "title": "Trump defends travel ban as Trudeau looks on", "text": "Washington (CNN) President Donald Trump offered an unapologetic defense of his travel ban during a joint news conference Monday with Canadian Prime Minister Justin Trudeau, saying the US \"cannot let the wrong people in.\"\n\nTrudeau, meanwhile, made clear that he holds a different view of the issue but said it was not his place to come to the US and \"lecture\" Trump on the controversial policy.\n\nBoth leaders, though, were careful not to critique each others' fundamentally divergent approaches, and instead sought to focus on their shared goal of improving cross-border trade.\n\nTrump called his executive order -- now stalled in court -- \"common sense,\" adding he would continue to fight to keep \"the wrong people\" out of the US, even at the risk of casting too wide a net. Trudeau, meanwhile, touted Canada's acceptance of tens of thousands of Syrian refugees and made clear he differs with Trump on the issue.\n\nBut he stated it was not his place to come to the US and \"lecture\" Trump on the controversial policy.\n\n\"I'm just doing what I said I would do,\" Trump said, referring to his hardline immigration policies.\n\nThe two leaders, who are ideologically at odds on a range of issues, played a delicate dance Monday as they sought to focus on the commonalities between their two countries, rather than the chasm between their personal philosophies and politics.\n\n\"There have been times where we have differed in our approaches and that has always been done firmly and respectfully,\" Trudeau said. \"The last thing Canadians expect is for me to come down and lecture another country on how they choose to govern themselves.\"\n\nTrudeau said he would focus on governing \"in such a way that reflects Canadians' approach.\"\n\nHis comments came after Trump defended his action to ban citizens of seven Muslim-majority countries and put a stop to the entry of refugees into the US -- a ban that has been stalled by a federal court.\n\n\"We cannot let the wrong people in and I will not allow that to happen during this administration,\" Trump said. \"We're going to give ourselves every bit of chance.\"\n\nBoth Trump and Trudeau said they hoped to continue strengthening the relationship between their two countries and both remarked on the important trading relationship the two countries share.\n\nReferring to his pledge to renegotiate NAFTA, Trump said the two leaders would be \"tweaking\" their trade relationship, but he emphasized that the US's bones with the free trade deal were mostly centered on the US trading relationship with the third country in the deal: Mexico.\n\n\"It's a much less severe situation than what's taking place on the southern border,\" Trump said, after calling the US-Canada trading relationship \"very outstanding.\"\n\nTrudeau made clear that the Canadian economy is \"very dependent\" on its relationship with the US and sought to draw closer to Trump's populist rhetoric by noting that both men were \"elected on commitments to support the middle class, to work hard for people who need a real shot at success.\"\n\nJUST WATCHED Who is Justin Trudeau? Replay More Videos ... MUST WATCH Who is Justin Trudeau? 02:05\n\nThe remarks came after the two leaders shared their first in-person meetings together at the White House Monday, which included a roundtable discussion with women business executives -- which included Trump's daughter Ivanka -- and the launching of a joint council to advance female entrepreneurship and leadership in business.\n\nTheir first in-person meeting came amid Trump's first series of diplomatic forays, following his weekend bonding session with Japan's prime minister and just two days before the Israeli prime minister arrives at the White House.\n\nIn his previous US visits, Trudeau found a leader almost exactly aligned with his liberal worldview and youthful image. In return, then-President Barack Obama met with Trudeau often, counseling his younger ally on how to best advocate for the progressive agenda he championed.\n\nTrudeau has arrived to a very different White House. He sought to balance the need to maintain close ties with a mandate from anxious Canadians to press Trump on his more controversial views.\n\nThe meeting is Trump's third official visit from a head of government at the White House. In his first three weeks in office, he's also welcomed the British and Japanese prime ministers, and will host Israeli leader Benjamin Netanyahu Wednesday.\n\nTrump's previous bilateral sessions were marked by comity and a focus on shared priorities. But in Trudeau, Trump encountered a leader further apart from him in both age and global outlook than his previous two visitors.\n\nAides both in Washington and Ottawa insisted Trump and Trudeau sought to emphasize neighborly bonds during their first face-to-face meeting, but their stylistic approaches were on full view during the midday news conference.", "authors": ["Jeremy Diamond", "Kevin Liptak"], "publish_date": "2017-02-13", "source": "cnn", "top_words": ["travel", "relationship", "trump", "ban", "sought", "focus", "trumps", "countries", "trudeau", "prime", "defends", "white", "leaders", "looks"], "summary": "Washington (CNN) President Donald Trump offered an unapologetic defense of his travel ban during a joint news conference Monday with Canadian Prime Minister Justin Trudeau, saying the US \"cannot let the wrong people in.\"\nTrudeau, meanwhile, touted Canada's acceptance of tens of thousands of Syrian refugees and made clear he differs with Trump on the issue.\nBut he stated it was not his place to come to the US and \"lecture\" Trump on the controversial policy.\nBut in Trudeau, Trump encountered a leader further apart from him in both age and global outlook than his previous two visitors.\nAides both in Washington and Ottawa insisted Trump and Trudeau sought to emphasize neighborly bonds during their first face-to-face meeting, but their stylistic approaches were on full view during the midday news conference."}