{"url": "http://www.cnn.com/2017/02/08/politics/donald-trump-travel-ban-defense/index.html", "id": "236", "title": "Trump to judges: Even a 'bad high school student' would rule in my favor", "text": "Story highlights He said even a \"bad high school student\" would find in his favor\n\nTrump said his executive order was \"written beautifully\"\n\nWashington (CNN) President Donald Trump harshly criticized arguments against his temporary travel ban on Wednesday, discounting a legal challenge to the order as anti-security and lambasting the federal judicial system that's weighing it as overtly political.\n\nSeeking to lend his own legal argument for the order banning travel from certain Muslim-majority countries, Trump insisted that US presidents have wide authority to determine who may enter the United States.\n\nAs he read from US immigration law, the President declared that even a \"bad high school student\" could understand the language and find in his favor.\n\n\"I think it's sad, I think it's a sad day,\" Trump told a group of major city police officers and sheriffs in Washington.\n\nOn Tuesday evening, a federal appeals court heard arguments in the legal battle over the travel ban. The California-based 9th Circuit Court of Appeals will decide soon whether to reinstate the executive order. Until then, his order that temporarily bars all refugees from entering the country, and all immigration from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen, is halted.\n\nRead More", "authors": ["Kevin Liptak", "Cnn White House Producer"], "publish_date": "2017-02-08", "source": "cnn", "top_words": ["high", "travel", "judges", "trump", "bad", "sad", "immigration", "think", "president", "school", "rule", "student", "order", "legal", "favor"], "summary": "Seeking to lend his own legal argument for the order banning travel from certain Muslim-majority countries, Trump insisted that US presidents have wide authority to determine who may enter the United States.\nAs he read from US immigration law, the President declared that even a \"bad high school student\" could understand the language and find in his favor.\n\"I think it's sad, I think it's a sad day,\" Trump told a group of major city police officers and sheriffs in Washington.\nOn Tuesday evening, a federal appeals court heard arguments in the legal battle over the travel ban.\nThe California-based 9th Circuit Court of Appeals will decide soon whether to reinstate the executive order."}