{"url": "http://www.cnn.com/2017/02/08/politics/donald-trump-travel-ban-delay/index.html", "id": "237", "title": "Trump: I wanted month delay before travel ban, was told no", "text": "Story highlights Trump said he argued for giving travelers a month's notice\n\n\"They said you can't do that because then people are gonna pour in before the toughness,\" he said\n\nWashington (CNN) President Donald Trump -- even as he blasted lawyers contesting his immigration executive order -- detailed for the first time Wednesday his own hesitations about the controversial plan before it was signed.\n\nTrump, speaking to law enforcement officials in Washington, said he argued before the order was finalized for giving travelers a month's notice before cutting off entry to the US.\n\nBut he said he was overruled by law enforcement officials, who he didn't name, alleging the delay could prompt a flood of dangerous terrorists into the country -- an explanation that failed to account for the lengthy process of obtaining a US visa or applying for refugee status.\n\n\"The law enforcement people said to me, 'Oh, you can't give a notice,' \" Trump said at a conference for the Major Cities Chiefs Association. \"I suggested a month. And I said, 'What about a week?' They said you can't do that because then people are gonna pour in before the toughness.\"\n\nIt was a surprising admission, given the President's full-throated defense of his travel ban. He even tweeted Sunday after a judge suspended its implementation: \"Just cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!\"\n\nJust cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad! — Donald J. Trump (@realDonaldTrump) February 5, 2017\n\nRead More", "authors": ["Kevin Liptak", "Cnn White House Producer"], "publish_date": "2017-02-08", "source": "cnn", "top_words": ["wanted", "travel", "trump", "ban", "told", "judge", "travelers", "pour", "enforcement", "month", "pouring", "country", "system", "delay", "cant", "law"], "summary": "Trump, speaking to law enforcement officials in Washington, said he argued before the order was finalized for giving travelers a month's notice before cutting off entry to the US.\n\"The law enforcement people said to me, 'Oh, you can't give a notice,' \" Trump said at a conference for the Major Cities Chiefs Association.\nThey said you can't do that because then people are gonna pour in before the toughness.\"\nIt was a surprising admission, given the President's full-throated defense of his travel ban.\nHe even tweeted Sunday after a judge suspended its implementation: \"Just cannot believe a judge would put our country in such peril."}