{"url": "http://finance.fortune.cnn.com/2017/01/30/elon-musk-twitter-followers-immigration/", "id": "2", "title": "Elon Musk Asks His 6.9 million Twitter Followers for Advice on Trump's Immigration Ban", "text": "Tesla’s (tsla) Elon Musk has asked his 6.9 million Twitter followers for their suggestions on changes to President Trump’s executive order that bans immigrants from seven Muslim-majority countries.\n\n“Please read immigration order. Lmk specific amendments. Will seek advisory council consensus & present to President,” he wrote.\n\nMusk serves on Trump’s Strategic & Policy Forum, along with Travis Kalanick of Uber, Indra Nooyi of PepsiCo, Disney’s Bob Iger, and Jamie Dimon of JPMorgan, among others. Members of the Strategic & Policy Forum, less formally known as the President’s business-advisory group, offer their expertise to Trump.\n\nPlease read immigration order. Lmk specific amendments. Will seek advisory council consensus & present to President. https://t.co/qLpbsP4lEk — Elon Musk (@elonmusk) January 29, 2017\n\nMusk was critical of the order on Saturday, tweeting “Many people negatively affected by this policy are strong supporters of the U.S. They’ve done right, not wrong & don’t deserve to be rejected.”\n\nMany people negatively affected by this policy are strong supporters of the US. They've done right,not wrong & don't deserve to be rejected. — Elon Musk (@elonmusk) January 29, 2017\n\nOther than banning immigrants from seven predominately Muslim countries from entering the U.S. for at least 90 days, the order also prohibits Syrian refugees from coming to the country indefinitely. The order has been controversial, and has caused a slew of protests across the nation.\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\nIt’s not known yet when Musk would meet with Trump and offer the suggested changes to him.", "authors": ["Madeline Farber"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["advice", "trump", "elon", "ban", "immigration", "asks", "followers", "wrong", "twitter", "theyve", "trumps", "million", "order", "president", "musk", "policy"], "summary": "Tesla’s (tsla) Elon Musk has asked his 6.9 million Twitter followers for their suggestions on changes to President Trump’s executive order that bans immigrants from seven Muslim-majority countries.\n“Please read immigration order.\nMusk serves on Trump’s Strategic & Policy Forum, along with Travis Kalanick of Uber, Indra Nooyi of PepsiCo, Disney’s Bob Iger, and Jamie Dimon of JPMorgan, among others.\nPlease read immigration order.\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 AdvertisementIt’s not known yet when Musk would meet with Trump and offer the suggested changes to him."}