{"url": "http://www.cnn.com/2017/03/06/politics/iraq-travel-ban/index.html", "id": "288", "title": "Why Iraq was removed from the revised travel ban", "text": "Story highlights The country provided more detail to US officials about how it screens travelers\n\nTrump also faced pressure to remove Iraq from the order from some American national security officials\n\nWashington (CNN) Iraq was removed from a revised version of an executive order banning travel from certain Muslim-majority countries after intensive lobbying from the Iraqi government at the highest levels, a senior US official told CNN Monday.\n\nPresident Donald Trump signed the order midday in the Oval Office, according to the White House. A previous version of the travel ban, which was mired in legal challenges, was revoked.\n\nThe pressure from the Iraq officials included a phone call between Trump and Iraqi Prime Minister Haider al-Abadi on February 10 and an in-person conversation between Abadi and Vice President Mike Pence in Munich on February 18.\n\nThose conversations were followed by discussions between Secretary of State Rex Tillerson and members of the Iraqi government about vetting measures in place that would prevent suspected terrorists from leaving Iraq and coming to the United States.\n\nTillerson described his efforts in public remarks Monday after the new order had been signed.\n\nRead More", "authors": ["Kevin Liptak", "Cnn White House Producer"], "publish_date": "2017-03-06", "source": "cnn", "top_words": ["travel", "iraqi", "cnn", "revised", "trump", "ban", "iraq", "version", "officials", "pressure", "removed", "order", "white"], "summary": "Story highlights The country provided more detail to US officials about how it screens travelersTrump also faced pressure to remove Iraq from the order from some American national security officialsWashington (CNN) Iraq was removed from a revised version of an executive order banning travel from certain Muslim-majority countries after intensive lobbying from the Iraqi government at the highest levels, a senior US official told CNN Monday.\nPresident Donald Trump signed the order midday in the Oval Office, according to the White House.\nA previous version of the travel ban, which was mired in legal challenges, was revoked.\nThe pressure from the Iraq officials included a phone call between Trump and Iraqi Prime Minister Haider al-Abadi on February 10 and an in-person conversation between Abadi and Vice President Mike Pence in Munich on February 18.\nTillerson described his efforts in public remarks Monday after the new order had been signed."}