{"url": "http://www.cnn.com/2017/03/01/politics/top-trump-advisers-urged-iraq-to-be-removed-from-new-travel-ban/index.html", "id": "280", "title": "Top Trump advisers urged Iraq to be removed from new travel ban", "text": "Story highlights It remains unclear whether the White House has made a final decision\n\nThe executive order is expected to be released later this week\n\nWashington (CNN) Three of President Donald Trump's top foreign policy advisers have advocated for Iraq to be removed from the Trump administration's list of banned countries in his new executive order, citing diplomatic reasons, sources told CNN.\n\nSecretary of State Rex Tillerson, Secretary of Defense James Mattis and national security adviser H.R. McMaster made the request, the sources said. One of the main reasons is Iraq's role in fighting ISIS.\n\nHomeland Security Secretary John Kelly also supported the move, but it remains unclear whether the White House has made a final decision.\n\nThe executive order is expected to be released later this week. Trump delayed plans to sign a reworked travel ban in the wake of positive reaction to his first address to Congress, a senior administration official told CNN.\n\nTrump's original executive order, signed a week after he entered the White House, banned citizens of seven Muslim-majority countries -- Iraq, Syria, Iran, Libya, Somalia, Sudan and Yemen -- from entering the US for 90 days, and temporarily suspended the entry of all refugees.\n\nRead More", "authors": ["Elise Labott", "Evan Perez", "Daniella Diaz"], "publish_date": "2017-03-01", "source": "cnn", "top_words": ["executive", "travel", "trump", "ban", "security", "told", "iraq", "house", "week", "advisers", "unclear", "removed", "order", "white", "urged", "sources"], "summary": "Secretary of State Rex Tillerson, Secretary of Defense James Mattis and national security adviser H.R.\nHomeland Security Secretary John Kelly also supported the move, but it remains unclear whether the White House has made a final decision.\nThe executive order is expected to be released later this week.\nTrump delayed plans to sign a reworked travel ban in the wake of positive reaction to his first address to Congress, a senior administration official told CNN.\nTrump's original executive order, signed a week after he entered the White House, banned citizens of seven Muslim-majority countries -- Iraq, Syria, Iran, Libya, Somalia, Sudan and Yemen -- from entering the US for 90 days, and temporarily suspended the entry of all refugees."}