{"url": "http://www.cnn.com/2017/02/04/politics/doj-appeals-travel-ban-ruling/index.html", "id": "209", "title": "Setback for Trump: Appeals court rejects demand to resume travel ban -- for now", "text": "Story highlights Friday night federal Judge James Robart halted the enforcement of Trump's order\n\nIt was a nationwide ruling\n\nWashington (CNN) A federal appeals court early Sunday morning denied the US government's emergency request to resume President Donald Trump's travel ban.\n\nThe Ninth Circuit Court of Appeals has asked for both sides to file legal briefs before the court makes its final decision after a federal judge halted the program on Friday.\n\nWhat this means is that the ruling by US District Court Judge James Robart, who suspended the ban, will remain in place -- for now.\n\nThe US Justice Department filed an appeal just after midnight Sunday, asking to pause Robart's sweeping decision that temporarily halted enforcement of several key provisions of Trump's executive order.\n\nThe order bars citizens of seven Muslim-majority countries -- Iraq, Syria, Iran, Libya, Somalia, Sudan and Yemen -- from entering the US for 90 days, all refugees for 120 days and indefinitely halts refugees from Syria.\n\nJUST WATCHED Christian refugees skeptical of travel ban Replay More Videos ... MUST WATCH Christian refugees skeptical of travel ban 03:09\n\nRead More", "authors": ["Laura Jarrett"], "publish_date": "2017-02-04", "source": "cnn", "top_words": ["travel", "skeptical", "trump", "ban", "appeals", "judge", "court", "setback", "demand", "trumps", "rejects", "federal", "resume", "refugees", "robart", "halted"], "summary": "Story highlights Friday night federal Judge James Robart halted the enforcement of Trump's orderIt was a nationwide rulingWashington (CNN) A federal appeals court early Sunday morning denied the US government's emergency request to resume President Donald Trump's travel ban.\nThe Ninth Circuit Court of Appeals has asked for both sides to file legal briefs before the court makes its final decision after a federal judge halted the program on Friday.\nWhat this means is that the ruling by US District Court Judge James Robart, who suspended the ban, will remain in place -- for now.\nThe US Justice Department filed an appeal just after midnight Sunday, asking to pause Robart's sweeping decision that temporarily halted enforcement of several key provisions of Trump's executive order.\nJUST WATCHED Christian refugees skeptical of travel ban Replay More Videos ... MUST WATCH Christian refugees skeptical of travel ban 03:09Read More"}