{"url": "http://www.cnn.com/2017/03/06/politics/travel-ban-lawsuit/index.html", "id": "292", "title": "Travel ban: What happens now in court?", "text": "Washington (CNN) In a show of force, the heads of the departments of Justice, State and Homeland Security appeared together on Monday to make the case for President Donald Trump's new travel ban of people from six Muslim-majority countries and institute changes they believe will make it impervious to court challenges.\n\nBut will the changes be enough to persuade federal judges?\n\nThe President's ink was barely dry before challengers, including immigrant rights groups, the ACLU and state attorneys general, reacted swiftly, treating the new ban as very similar to the last one. Challengers are preparing their own next steps and hinting that while the changes are substantial, they still have deep reservations about the new travel ban.\n\n\"The Trump administration has conceded that its original Muslim ban was indefensible,\" said Omar Jadwat, director of the ACLU's Immigrants' Rights Project. \"Unfortunately, it has replaced it with a scaled-back version that shares the same fatal flaws.\"\n\nJadwat and others say the \"only way to actually fix the Muslim ban is not to have a Muslim ban.\" They will press some of the same issues they have made before, including religious discrimination claims, questions about the urgency of an order and a request for national security evidence to back up the administration's claims about the countries at issue.\n\nWashington Attorney General Bob Ferguson, who is behind a challenge that is furthest along in the courts, said at a press conference Monday that the new order is \"drastically narrowed\" and that it is \"too soon to say what we are going to do.\"\n\nAlthough the new order does not go into effect until March 16, already it has triggered a new flurry of legal documents.\n\nThe Justice Department filed notices in federal courts alerting the judges to the new order and making clear that the government believes the new order \"falls outside of\" injunctions that blocked the original ban. The government cited the changes including the fact that the new order does not apply to green card holders or those with valid visas.\n\nBut courts that took up the original ban have plenty of issues to look at.\n\nDue Process\n\nThe 9th US Circuit Court of Appeals last month expressed due process concerns about the impact of the order, especially when it came to green card holders.\n\nThe \"government has failed to establish that lawful permanent residents have no due process rights when seeking to re-enter the United States,\" the judges wrote. The new order makes crystal clear that green card holders should not be impacted by the ban.\n\nThe administration also made clear that those with valid visas who found themselves caught in a legal \"no man's land\" in airports after the first order would also not be affected.\n\nBut Ferguson said he still had reservations outside of the realm of due process. \"The intent behind the original order is of deep concern for us,\" he said, adding, \"I do not take lightly suing the President of the United States.\"\n\nUrgency\n\nOne thing challengers are sure to attack is the fact that the administration argues there are urgent reasons for the ban. But it waited several weeks after the original version to issue a new order, and the new one doesn't take effect until March 16.\n\nDuring a background briefing on Monday, an administration official said that the time lapse was due in part to the legal tangles prompted by federal judges who were \"substituting\" their judgment for that of the executive.\n\nHowever, the White House was ready to release the new ban last week, but delayed the announcement after the President's speech to Congress got a better reception than anticipated.\n\nReligious Discrimination\n\nAdministration officials in a briefing with reporters Monday stressed that the executive order was \"not in any way ... a Muslim ban. ... [W]e want to make sure everyone understands that.\"\n\nBut US federal Judge Leonie M. Brinkema issued a strong rebuke on February 13 in a different case before her court, holding that there was a strong likelihood that challengers \"will prevail on the merits of its Establishment Clause claim.\" And Brinkema used Trump's comments on the campaign against him.\n\n\"The 'Muslim ban' was a centerpiece of the President's campaign for months, and the press release calling for it was still available on his website as of the day this memorandum opinion is being entered,\" she wrote. The release remains available as of March 6.\n\nAfter the order came down on Monday, Virginia Attorney General Mark Herring, who won a preliminary injunction against the ban, issued a statement. \"Although the new order appears to be significantly scaled back, it still sends a horrible message to the world, to Muslim-Americans, and to minority communities across the country, without any demonstrable benefit to national security,\" he said.\n\nNational Security\n\nAs Sessions unveiled the new ban, he revealed some new national security information.\n\n\"Today more than 300 people who came here as refugees are under FBI investigation for potential terrorism-related activities,\" he said. The statement was likely in response to a footnote in the 9th US Circuit Court's opinion criticizing the government for failing to put forward national security information to justify the ban.\n\n\"Courts regularly receive classified information under seal and maintain its confidentiality,\" the judges said.\n\nStephen Yale-Loehr, a Cornell Law School professor, said he expects the challenges to continue.\n\n\"Overall, the revised executive order is essentially old wine in a new bottle,\" he said.\n\n\"Analysis in the intelligence unit at the Department of Homeland Security found little evidence that citizens of the seven countries included in the original travel ban pose a terror threat to the United States,\" Yale-Loehr said.\n\nFor now, because of the delayed start date, lawyers are considering their options. Both sides acknowledge the battle is far from over.", "authors": ["Ariane De Vogue", "Cnn Supreme Court Reporter"], "publish_date": "2017-03-06", "source": "cnn", "top_words": ["original", "travel", "judges", "national", "courts", "ban", "security", "court", "happens", "changes", "federal", "order", "muslim"], "summary": "\"The Trump administration has conceded that its original Muslim ban was indefensible,\" said Omar Jadwat, director of the ACLU's Immigrants' Rights Project.\nJadwat and others say the \"only way to actually fix the Muslim ban is not to have a Muslim ban.\"\nBut courts that took up the original ban have plenty of issues to look at.\nReligious DiscriminationAdministration officials in a briefing with reporters Monday stressed that the executive order was \"not in any way ... a Muslim ban.\nNational SecurityAs Sessions unveiled the new ban, he revealed some new national security information."}