{"url": "http://www.cnn.com/2017/02/09/opinions/white-house-terrorism-list-undermines-the-case-for-travel-ban-bergen/index.html", "id": "242", "title": "White House's own terrorism list torpedoes the case for travel ban", "text": "Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. He is the author of \" United States of Jihad: Investigating America's Homegrown Terrorists .\"\n\n(CNN) The White House's list of 78 \"major terrorist attacks targeting the West\" is strikingly devoid of evidence to support President Trump's halt to immigration from seven Muslim-majority nations.\n\nConspicuous by their absence on the White House list of terrorists carrying out major attacks against Western targets were Iraqis, Somalis, Sudanese and Yemenis, who are from four of the seven Muslim countries that the Trump administration is seeking to suspend travel from. (Note: An earlier version of this article incorrectly said there were no Libyans on the White House list of attackers. This article has been updated to reflect the omission.)\n\nInstead, the incidents listed on the White House terrorism list identified France, the United States and Belgium as the countries supplying the most anti-Western terrorists.\n\nWith great fanfare on Monday the White House released a list of 78 terrorist attacks since September 2014. A White House official described them as \"major terrorist attacks targeting the West.\"\n\nThe list was released after President Trump's claim that the media is under-covering terrorist attacks, a contention that is not borne out by the evidence.\n\nThe White House's own terrorism list underlines the arbitrary nature of the travel ban because, by the White House's own account, the countries that are generating the most significant number of terrorists threatening the West are in the West.\n\nThe list also underlines the fact that it is American citizens who largely foment terrorism in the United States. This is also the case in countries such as France and Belgium, where it is French and Belgian citizens who are often the ones conducting significant acts of terrorism.\n\nOf the total of 90 terrorists on the White House list, at most nine are from travel ban countries.\n\nIndeed, 50 of the terrorists — more than half -- are from Christian-majority countries in the West.\n\nOn the list, which includes the identities of attackers where they are known, France leads the way with 16 French terrorists, followed by the United States with 13 American terrorists, 11 of whom are US citizens and two of whom are legal permanent residents.\n\nOf these 29 American and French terrorists, only two even have family origins in travel ban countries and they are both from Somalia.\n\nBelgium comes in third place with seven terrorists.\n\nIn descending order after that are:\n\n--Tunisians (6),\n\n--Libyans and Bengalis are tied with 5,\n\n--Saudis (4),\n\n--Syrians, Algerians and Indonesians are tied with 3 each;\n\n--Afghans, Australians, Bosnians, Canadians, Danes, Germans, Russians and Turks are tied with two each and\n\n--One each from Chad, Egypt, the Emirates, Iran, Morocco, the Palestinian Territories, Pakistan, Sweden, and the United Kingdom.\n\nThese findings may cause a problem for the White House as it makes the argument that citizens of Iran, Iraq, Libya, Somalia, Syria, Sudan and Yemen are particularly likely to foment anti-Western terrorism, when the White House's own terrorism list demonstrates that this is not the case.\n\nFor example, an unspecified number of Filipinos participated in a botched attempt to blow up a bomb outside the US embassy in Manila last year.\n\nIn 15 of the 78 attacks the perpetrators have not been identified.\n\nI took the White House terrorism list and grouped it by nationalities below. The countries with the largest number of identified terrorists are at the beginning, while attacks where the perpetrator was not identified are listed at the end. The wording added by me is in boldface.\n\nFRENCH\n\nTOURS, FRANCE\n\nDecember, 2014\n\nTARGET: Three police officers wounded in knife attack\n\nATTACKER: Bertrand Nzohabonayo (French citizen, convert from Burundi)\n\nPARIS, FRANCE\n\nJanuary, 2015\n\nTARGET: One police officer and four hostages killed in shooting at a kosher supermarket\n\nATTACKER: Amedy Coulibaly (French citizen born in France, family from Mali)\n\nNICE, FRANCE\n\nFebruary, 2015\n\nTARGET: Two French soldiers wounded in knife attack outside a Jewish community center\n\nATTACKER: Moussa Coulibaly (French originally from Mali)\n\nLYON, FRANCE\n\nJune, 2015\n\nTARGET: One civilian killed in beheading and explosion at a chemical plant\n\nATTACKER: Yasin Salhi (French of Moroccan-Algerian descent)\n\nMAGNANVILLE, FRANCE\n\nJune, 2016\n\nTARGET: One police officer and one civilian killed in knife attack\n\nATTACKER: Larossi Abballa (French, born in France, family origin not clear)\n\nNORMANDY, FRANCE\n\nJuly, 2016\n\nTARGET: One priest killed in knife attack\n\nATTACKERS: Adel Kermiche (French-Algerian) and Abdel Malik Nabil Petitjean (French, from eastern France)\n\nPARIS, FRANCE\n\nSeptember, 2016\n\nTARGET: One police officer wounded in raid after VBIED failed to detonate at Notre Dame Cathedral\n\nATTACKERS: Sarah Hervouet, Ines Madani, and Amel Sakaou (French, family origins French or unclear. )\n\nQUEENSLAND, AUSTRALIA\n\nAugust, 2016\n\nTARGET: Two killed and one wounded in knife attack at a hostel frequented by Westerners\n\nATTACKER: Smail Ayad (French, family origin unclear)\n\nPARIS, FRANCE\n\nNovember, 2015\n\nTARGET: At least 129 killed and approximately 400 wounded in series of shootings and IED attacks\n\nATTACKERS: Brahim Abdelslam, (French, Moroccan-Algerian family) Saleh Abdeslam, (French, Moroccan descent) Ismail Mostefai, (French, family origin not clear) Bilal Hadfi, (French, Moroccan descent) Samy Amimour, (French, Algerian descent) Foued Mohamed Aggad, (French, Algerian-Moroccan descent)\n\nAMERICANS\n\nNEW YORK CITY, NY, USA\n\nOctober, 2014\n\nTARGET: Two police officers wounded in knife attack\n\nATTACKER: US person (American citizen, African-American)\n\nGARLAND, TX, USA\n\nMay, 2015\n\nTARGET: One security guard wounded in shooting at the Prophet Muhammad cartoon event\n\nATTACKERS: Two US persons (Americans, one had a father from Pakistan, the other was African-American)\n\nBOSTON, MA, USA\n\nJune, 2015\n\nTARGET: No casualties; one police officer attacked with knife\n\nATTACKER: US person (American, African-American)\n\nMERCED, CA, US\n\nNovember, 2015\n\nTARGET: Four wounded in knife attack on a college campus\n\nATTACKER: US person (American, family originally from Pakistan)\n\nSAN BERNARDINO, CA\n\nDecember, 2015\n\nTARGET: 14 killed and 21 wounded in coordinated firearms attack\n\nATTACKERS: Two US persons (American citizen whose family emigrated from Pakistan and legal permanent resident, originally from Pakistan.)\n\nPHILADELPHIA, PENNSYLVANIA\n\nJanuary, 2016\n\nTARGET: One police officer wounded in shooting\n\nATTACKER: US person (American, African-American)\n\nCOLUMBUS, OH, US\n\nFebruary, 2016\n\nTARGET: Four civilians wounded in machete attack at a restaurant\n\nATTACKER: US person (American, originally from Guinea)\n\nORLANDO, FL, US\n\nJune, 2016\n\nTARGET: 49 killed and 53 wounded in shooting at a nightclub\n\nATTACKER: US person (American, family originally from Afghanistan.)\n\nST. CLOUD, MN, US\n\nSeptember, 2016\n\nTARGET: 10 wounded in knife attack in a mall\n\nATTACKER: Dahir Ahmed Adan (American, family originally from Somalia.)\n\nNEW YORK, NY; SEASIDE PARK AND ELIZABETH, NJ, US\n\nSeptember, 2016\n\nTARGET: 31 wounded in bombing in New York City; several explosive devices found in New York and New Jersey; one exploded without casualty at race in New Jersey; one police officer wounded in shootout\n\nATTACKER: Ahmad Khan Rahami (American citizen, born in Afghanistan.)\n\nCOLUMBUS, OH, US\n\nNovember, 2016\n\nTARGET: 14 wounded by individuals who drove a vehicle into a group of pedestrians and attacked them with a knife\n\nATTACKER: US person (American legal resident, originally from Somalia.)\n\nBELGIANS\n\nThese Belgians were both involved in the Paris attacks in November 2015\n\nChakib Ahrouh, (Belgian-Moroccan)\n\nand Abdelhamid Abaaoud (Belgian-Moroccan)\n\nBRUSSELS, BELGIUM\n\nMarch, 2016\n\nTARGET: At least 31 killed and 270 wounded in coordinated bombings at Zaventem Airport and on a subway train\n\nATTACKERS: Khalid el-Bakraoui, (Belgian) Ibrahim el-Bakraoui, (Belgian) Najim Laachraoui (Belgian-Moroccan), Mohammed Abrini (Belgian)\n\nBRUSSELS, BELGIUM\n\nOctober, 2016\n\nTARGET: Two police officers wounded in stabbing\n\nATTACKER Belgian national\n\nTUNISIANS\n\nNICE, FRANCE\n\nJuly, 2016\n\nTARGET: 84 civilians killed and 308 wounded by an individual who drove a truck into a crowd\n\nATTACKER: Mohamed Bouhlel (Tunisian)\n\nSOUSSE, TUNISIA\n\nJune, 2015\n\nTARGET: 38 killed and 39 wounded in shooting at a beach frequented by westerners\n\nATTACKERS: Seifeddine Rezgui (Tunisian)\n\nPARIS, FRANCE\n\nJanuary, 2016\n\nTARGET: No casualties; attacker killed after attempted knife attack on Paris police station\n\nATTACKER: Tarek Belgacem (Tunisian)\n\nTUNIS, TUNISIA\n\nMarch, 2015\n\nTARGET: 21 tourists killed, including 16 westerners, and 55 wounded in shooting at the Bardo Museum\n\nATTACKERS: Two ISIL-aligned extremists (Tunisians)\n\nBERLIN, GERMANY\n\nDecember, 2016\n\nTARGET: 12 killed and 48 wounded by individual who drove truck into a crowded market\n\nATTACKER: Anis Amri (Tunisian)\n\nLIBYANS\n\nTRIPOLI, LIBYA\n\nJanuary, 2015\n\nTARGET: Ten killed, including one US citizen, and five wounded in bombing and shooting at a hotel frequented by westerners\n\nATTACKERS: As many as five ISIL-Libya members (Libyans)\n\nBENGALIS\n\nDHAKA, BANGLADESH\n\nJuly, 2016\n\nTARGET: 22 killed, including one American and 50 wounded after hours-long siege using machetes and firearms at holy Artisan Bakery\n\nATTACKERS: Nibras Islam, Rohan Imtiaz, Meer Saameh Mubasheer, Khairul Islam Paye, and Shafiqul Islam Uzzal (Bengalis)\n\nSAUDIS\n\nRIYADH, SAUDI ARABIA\n\nNovember, 2014\n\nTARGET: One Danish citizen wounded in shooting\n\nATTACKERS: Three Saudi Arabia-based ISIL members (Saudis)\n\nRIYADH, SAUDI ARABIA\n\nJanuary, 2015\n\nTARGET: Two US citizens wounded in shooting\n\nATTACKER: Saudi Arabia-based ISIL supporter (Saudi)\n\nSYRIANS\n\nANSBACH, GERMANY\n\nJuly, 2016\n\nTARGET: At least 15 wounded in suicide bombing at a music festival\n\nATTACKER: Mohammad Daleel (Syrian)\n\nMALMO, SWEDEN\n\nOctober, 2016\n\nTARGET: No casualties; mosque and community center attacked with Molotov cocktail\n\nATTACKER: Syrian national\n\nISTANBUL, TURKEY\n\nJanuary, 2016\n\nTARGET: 12 German tourists killed and 15 wounded in suicide bombing\n\nATTACKER: Nabil Fadli (Syrian)\n\nALGERIANS\n\nTIZI OUZOU, ALGERIA\n\nSeptember, 2014\n\nTARGET: One French citizen beheaded\n\nATTACKER: Jund al-Khilafah in Algeria (Algerian)\n\nPARIS, FRANCE\n\nApril, 2015\n\nTARGET: Catholic churches targeted; one civilian killed in shooting, possibly during an attempted carjacking\n\nATTACKER: Sid Ahmed Ghlam (Algerian immigrant)\n\nCHARLEROI, BELGIUM\n\nAugust, 2016\n\nTARGET: Two police officers wounded in machete attack\n\nATTACKER: Khaled Babouri (Algerian)\n\nINDONESIANS\n\nJAKARTA, INDONESIA\n\nJanuary, 2016\n\nTARGET: Four civilians killed and more than 20 wounded in coordinated bombing and firearms attacks near a police station and a Starbucks\n\nATTACKERS: Dian Joni Kurnaiadi, Muhammad Ali, Arif Sunakim, and Ahmad Muhazan bin Saron (Indonesians)\n\nAFGHANS\n\nMELBOURNE, AUSTRALIA\n\nSeptember, 2014\n\nTARGET: Two police officers wounded in knife attack\n\nATTACKER: Abdul Numan Haider (Afghan)\n\nKABUL, AFGHANISTAN\n\nJune, 2016\n\nTARGET: 14 killed in suicide attack on a bus carrying Canadian Embassy guards\n\nATTACKER: ISIL-Khorasan operative (Afghan)\n\nAUSTRALIANS\n\nSYDNEY, AUSTRALIA\n\nDecember, 2014\n\nTARGET: Two Australians killed in hostage taking and shooting\n\nATTACKER: Man Haron Monis (Australian citizen)\n\nSYDNEY, AUSTRALIA\n\nSeptember, 2016\n\nTARGET: One civilian wounded in knife attack\n\nATTACKER: Ihsas Khan (Australian)\n\nCANADIANS\n\nQUEBEC, CANADA\n\nOctober, 2014\n\nTARGET: One soldier killed and one wounded in vehicle attack\n\nATTACKER: Martin Couture-Rouleau (Canadian convert)\n\nOTTAWA, CANADA\n\nOctober, 2014\n\nTARGET: One soldier killed at war memorial; two wounded in shootings at Parliament building\n\nATTACKER: Michael Zehaf-Bibeau (Libyan Canadian)\n\nDANISH\n\nCOPENHAGEN, DENMARK\n\nFebruary, 2015\n\nTARGET: One civilian killed in shooting at a free-speech rally and one security guard killed outside the city's main synagogue\n\nATTACKER: Omar Abdel Hamid el-Hussein (Danish citizen)\n\nCOPENHAGEN, DENMAKR\n\nSeptember, 2016\n\nTARGET: Two police officers and a civilian wounded in shooting\n\nATTACKER: Mesa Hodzic (Danish)\n\nBOSNIANS\n\nZVORNIK, BOSNIA\n\nApril, 2015\n\nTARGET: One police officer killed and two wounded in shooting\n\nATTACKER: Nerdin Ibric (Bosnian)\n\nRAJLOVAC, BOSNIA\n\nDecember, 2015\n\nTARGET: Two Bosnian soldiers killed in shooting\n\nATTACKER: Enes Omeragic (Bosnian)\n\nGERMANS\n\nHANOVER, GERMANY\n\nFebruary, 2016\n\nTARGET: One police officer wounded in knife attack\n\nATTACKER: Safia Schmitter (German-Moroccan)\n\nWURZBURG, GERMANY\n\nJuly, 2016\n\nTARGET: Four civilians wounded in axe attack on a train\n\nATTACKER: Riaz Khan Ahmadzai (German-Pakistani)\n\nRUSSIANS\n\nISTANBUL, TURKEY\n\nJune, 2016\n\nTARGET: 45 killed and approximately 240 wounded at Ataturk International Airport\n\nATTACKERS: Rakhim Bulgarov, Vadim Osmanov, and an unidentified ISIL operative (Russians)\n\nTURKS\n\nMARSEILLES, FRANCE\n\nJanuary, 2016\n\nTARGET: One Jewish teacher wounded in machete attack\n\nATTACKER: 15 year-old Ethnic Kurd from Turkey (Turk)\n\nISTANBUL, TURKEY\n\nMarch, 2016\n\nTARGET: Four killed and 36 wounded in suicide bombing in the tourist district\n\nATTACKER: Mehmet Ozturk (Turk)\n\nEMIRATIS\n\nABU DHABI, UAE\n\nDATE: December 2014\n\nTARGET: One American killed in knife attack\n\nATTACKER: Dalal al-Hashimi (Emirati)\n\nPAKISTANI\n\nKARACHI, PAKISTAN\n\nApril, 2015\n\nTARGET: One US citizen wounded in knife attack\n\nATTACKERS: Pakistan-based ISIL supporters (Pakistani)\n\nMOROCCANS\n\nPARIS, FRANCE\n\nAugust, 2015\n\nTARGET: Two civilians and one US soldier wounded with firearms and knife on a passenger train\n\nATTACKER: Ayoub el-Khazzani (Moroccan)\n\nPALESTINIANS\n\nCOPENHAGEN, DENMARK\n\nSeptember, 2015\n\nTARGET: One police officer wounded in knife attack\n\nATTACKER: Palestinian national (Palestinian)\n\nIRAN-BORN AUSTRALIAN\n\nPARRAMATTA, AUSTRALIA\n\nOctober, 2015\n\nTARGET: One police officer killed in shooting\n\nATTACKER: Farhad Jabar (Iranian born Australian)\n\nBRITISH\n\nLONDON\n\nDecember, 2015\n\nTARGET: Three wounded in knife attack at an underground rail station\n\nATTACKER: Muhyadin Mire (British citizen)\n\nEGYPTIAN\n\nKUWAIT CITY, KUWAIT\n\nTARGET: No casualties; vehicle carrying three US soldiers hit by a truck\n\nATTACKER: Ibrahim Sulayman (Egyptian)\n\nNovember, 2016\n\nCHADIAN\n\nTARGET: No casualties; attacker arrested after opening fire at entrance of US Embassy\n\nATTACKER: Chadian national (Chad)\n\nSWEDISH\n\nOne of the 2016 Brussels attackers is Osama Krayem (Swedish)\n\nUNIDENTIFIED ATTACKERS\n\nMANILA, PHILIPPINES\n\nNovember, 2016\n\nTARGET: No casualties; failed IED attempt near US Embassy\n\nATTACKERS: Philippine nationals aligned with the Maute group (Unspecified number of Filipinos)\n\nKARAK, JORDAN\n\nDecember, 2016\n\nTARGET: 10 killed and 28 wounded in shooting at a tourist site\n\nATTACKERS: Several gunmen\n\nEL GORA (AL JURAH), EGYPT\n\nJune, 2015\n\nTARGET: No casualties; camp used by Multinational Force and Observers (MFO) troops attacked in shooting and bombing attack\n\nATTACKERS: Unknown number of ISIL-Sinai members\n\nHAMBURG, GERMANY\n\nOctober, 2016\n\nTARGET: One killed in knife attack\n\nATTACKER: Unknown\n\nLUXOR, EGYPT\n\nJune, 2015\n\nTARGET: One police officer killed by suicide bomb near the Temple of Karnak\n\nATTACKER: Unidentified\n\nHASANAH, EGYPT\n\nOctober, 2015\n\nTARGET: 224 killed in downing of a Russian airliner\n\nATTACKER: Unidentified ISIL-Sinai operatives\n\nDINAJPUR, BANGLADESH\n\nNovember, 2015\n\nTARGET: One Italian citizen wounded in shooting\n\nATTACKER: Unidentified\n\nCAIRO, EGYPT\n\nJuly, 2015\n\nTARGET: One killed and nine wounded in VBIED attack at Italian Consulate\n\nATTACKER: Unidentified ISIL operatives\n\nCAIRO, EGYPT\n\nJuly, 2015\n\nTARGET: One Croatian national kidnapped; beheaded on August 12 at an unknown location\n\nATTACKER: Unidentified ISIL-Sinai operative\n\nEL GORA, EGYPT\n\nSeptember, 2015\n\nTARGET: Four US and two MFO troops wounded in IED attack\n\nATTACKER: Unidentified\n\nDHAKA, BANGLADESH\n\nSeptember, 2015\n\nTARGET: One Italian civilian killed in shooting\n\nATTACKER: Unidentified\n\nEL GORA, EGYPT\n\nOctober, 2015\n\nTARGET: No casualties; airfield used by MFO attacked with rockets\n\nATTACKER: Unidentified ISIL-Sinai operatives\n\nRANGPUR, BANGLADESH\n\nOctober, 2015\n\nTARGET: One Japanese civilian killed in shooting\n\nATTACKER: Unidentified\n\nDERBENT, RUSSIA\n\nDecember, 2015\n\nTARGET: One killed and 11 wounded in shooting at UN World Heritage site\n\nATTACKER: Unidentified ISIL-Caucasus operative\n\nCAIRO, EGYPT\n\nJanuary, 2016\n\nTARGET: Two wounded in drive-by shooting outside a hotel frequented by tourists\n\nATTACKERS: Unidentified ISIL operatives\n\nHURGHADA, EGYPT\n\nJanuary, 2016\n\nTARGET: One German and one Danish national wounded in knife attack at a tourist resort\n\nATTACKER: Unidentified\n\nESSEN, GERMANY\n\nApril, 2016\n\nTARGET: Three wounded in bombing at Sikh temple\n\nATTACKERS: Three identified minors", "authors": ["Peter Bergen", "Cnn National Security Analyst"], "publish_date": "2017-02-09", "source": "cnn", "top_words": ["list", "travel", "case", "2016target", "attackattacker", "shooting", "ban", "torpedoes", "french", "killed", "2015target", "houses", "wounded", "terrorism", "white", "american", "knife"], "summary": "(Note: An earlier version of this article incorrectly said there were no Libyans on the White House list of attackers.\nThe White House's own terrorism list underlines the arbitrary nature of the travel ban because, by the White House's own account, the countries that are generating the most significant number of terrorists threatening the West are in the West.\nOf the total of 90 terrorists on the White House list, at most nine are from travel ban countries.\nOf these 29 American and French terrorists, only two even have family origins in travel ban countries and they are both from Somalia.\nCLOUD, MN, USSeptember, 2016TARGET: 10 wounded in knife attack in a mallATTACKER: Dahir Ahmed Adan (American, family originally from Somalia.)"}