{"url": "http://www.cnn.com/2017/02/10/opinions/trump-should-take-a-lesson-from-nixon-naftali/index.html", "id": "253", "title": "On travel ban, Trump could learn a hard lesson from Nixon", "text": "Story highlights Judge John Sirica, a Republican, ordered tapes incriminating Nixon in Watergate be turned over to prosecutors\n\nTimothy Naftali: If travel ban case gets to high court, Trump shouldn't imagine justices will put politics above judiciary's reputation\n\nTimothy Naftali teaches history and public policy at New York University. He's the former director of the Richard Nixon Presidential Library and Museum. The views expressed in this commentary are solely his.\n\n(CNN) In late 1973, Judge John Sirica, chief judge of the US District Court for the District of Columbia, and a young clerk jointly listened to a tape of a White House conversation, which would later become infamous as the \"Cancer on the Presidency\" meeting between Richard Nixon and his counsel John W. Dean.\n\nTim Naftali\n\nSirica had been appointed by Dwight D. Eisenhower, and both he and his clerk were Republican. Nevertheless, when Sirica and the clerk, D. Todd Christofferson, heard Nixon telling Dean on the March 21, 1973, tape that money could be found to pay for the silence of the Watergate burglars, party didn't matter. \"(Y)ou could get a million dollars,\" Nixon said. \"And you could get it in cash. I know where it could be gotten.\"\n\n\"We felt, both of us, like we had been hit in the gut,\" Christofferson, now a member of the Quorum of the Twelve Apostles of the Church of Jesus Christ of Latter-day Saints, later recalled for the Nixon Library, \"and it was hard to breathe. It was such a disillusioning experience because both of us had voted for Nixon twice ... and hoped against hope as things went on that he really wasn't a party to any of this, that it had been a conspiracy maybe involving some of his chief aides, but not him. But this for us, for the judge and myself, laid it to rest. There was no doubt after that.\"\n\nPhotos: Richard Nixon's life and career Photos: Richard Nixon's life and career President Richard Nixon was in the White House from 1969 to 1974, when he became the first president to resign from office. He died at 81 in 1994. Here's a look at his life and legacy: Hide Caption 1 of 22 Photos: Richard Nixon's life and career Nixon was born in California on January 9, 1913. He is pictured at age 4. Hide Caption 2 of 22 Photos: Richard Nixon's life and career As a teenager, Nixon poses for a portrait with a violin in 1927. Hide Caption 3 of 22 Photos: Richard Nixon's life and career Nixon, No. 12, and his football teammates at Whittier College pose for a picture in the 1930s. After graduating from Whittier, he attended law school at Duke University. Hide Caption 4 of 22 Photos: Richard Nixon's life and career During World War II, Nixon served as a lieutenant commander in the Navy. Hide Caption 5 of 22 Photos: Richard Nixon's life and career Nixon, far right, stands next to John F. Kennedy and other freshmen members of Congress in 1947. Hide Caption 6 of 22 Photos: Richard Nixon's life and career Republican presidential nominee Dwight D. Eisenhower and his running mate, Richard Nixon, with their wives at the Republican National Convention in Chicago on July 12, 1952. The Eisenhower-Nixon ticket won the election that year. Hide Caption 7 of 22 Photos: Richard Nixon's life and career Vice President Nixon, right, and Soviet Premier Nikita Khrushchev, center, share a laugh during Nixon's visit to the Soviet Union in 1959. The two leaders engaged in an informal debate about the merits of capitalism versus communism at the opening of the American National Exhibition in Moscow. Hide Caption 8 of 22 Photos: Richard Nixon's life and career Nixon poses for a portrait with his wife, Pat, and their daughters, Tricia and Julie, circa 1958. Hide Caption 9 of 22 Photos: Richard Nixon's life and career Vice President Nixon and Sen. John F. Kennedy take part in a televised debate during their 1960 presidential campaign. Kennedy won the election that year. Hide Caption 10 of 22 Photos: Richard Nixon's life and career Republican presidential candidate Nixon campaigns in New York in 1960. Hide Caption 11 of 22 Photos: Richard Nixon's life and career Nixon addresses supporters after winning his party's nomination again in 1968. He went on to defeat the Democratic nominee, incumbent Vice President Hubert Humphrey. Hide Caption 12 of 22 Photos: Richard Nixon's life and career First lady Pat Nixon, center, watches as her husband is sworn in as the 37th president of the United States by Supreme Court Chief Justice Earl Warren on January 20, 1969. Hide Caption 13 of 22 Photos: Richard Nixon's life and career Apollo 11 astronauts Neil Armstrong, Michael Collins and Buzz Aldrin laugh with President Nixon aboard the USS Hornet on July 24, 1969. The president was on hand to greet the astronauts after their splashdown in the Pacific. Hide Caption 14 of 22 Photos: Richard Nixon's life and career In 1970, Nixon announces the invasion of Cambodia to the American public. Hide Caption 15 of 22 Photos: Richard Nixon's life and career Chinese Premier Zhou Enlai toasts with Nixon during his trip to China in February 1972. Hide Caption 16 of 22 Photos: Richard Nixon's life and career President Nixon, left, briefs the Congressional leadership in 1973 before his televised announcement of the ceasefire in the Vietnam War. From left are Senate Minority Leader Hugh Scott, House Majority Leader Tip O'Neill, Speaker of the House Carl Albert, Senate Majority Leader Mike Mansfield, House Minority Leader Gerald Ford, Vice President Spiro Agnew and Secretary of State Henry Kissinger. Hide Caption 17 of 22 Photos: Richard Nixon's life and career In 1972, Nixon ran a successful re-election campaign. Gerald Ford, right, became his vice president when Spiro Agnew resigned in 1973. Hide Caption 18 of 22 Photos: Richard Nixon's life and career Surrounded by family members, Nixon delivers his resignation speech on August 9, 1974. He stepped down after the Watergate scandal, which stemmed from a break-in at the Democratic National Committee offices during the 1972 campaign. Hide Caption 19 of 22 Photos: Richard Nixon's life and career Nixon leaves the White House after his resignation over the Watergate scandal in 1974. Hide Caption 20 of 22 Photos: Richard Nixon's life and career Former President Nixon is wired for a microphone on April 9, 1988, before the taping of the NBC television show \"Meet the Press.\" It was his first appearance on the show since 1968. Hide Caption 21 of 22 Photos: Richard Nixon's life and career Days after suffering a stroke, Nixon died in New York on April 22, 1994. A military honor guard carries Nixon's casket at the Stewart Air Force Base before the flight back to his hometown of Yorba Linda, California. His body was put on the same Boeing 707 that flew him home after his resignation. Hide Caption 22 of 22\n\nThursday's unanimous decision by the 9th US Circuit Court of Appeals is a matter of the constitutionality of a policy and not of a president's involvement in a criminal conspiracy. Nevertheless, President Donald Trump's public comments, especially his tweets, suggest a deep skepticism that the American judiciary can ever be apolitical when it disagrees with him.\n\nRead More", "authors": ["Tim Naftali"], "publish_date": "2017-02-10", "source": "cnn", "top_words": ["travel", "trump", "ban", "career", "learn", "life", "22", "richard", "nixon", "hide", "lesson", "nixons", "photos", "caption", "president", "hard"], "summary": "Photos: Richard Nixon's life and career Photos: Richard Nixon's life and career President Richard Nixon was in the White House from 1969 to 1974, when he became the first president to resign from office.\nHide Caption 3 of 22 Photos: Richard Nixon's life and career Nixon, No.\nHide Caption 10 of 22 Photos: Richard Nixon's life and career Republican presidential candidate Nixon campaigns in New York in 1960.\nHide Caption 11 of 22 Photos: Richard Nixon's life and career Nixon addresses supporters after winning his party's nomination again in 1968.\nHide Caption 17 of 22 Photos: Richard Nixon's life and career In 1972, Nixon ran a successful re-election campaign."}