{"url": "http://www.cnn.com/2017/02/28/politics/trump-travel-ban-visa-holders/index.html", "id": "278", "title": "Trump delays new travel ban after well-reviewed speech", "text": "Story highlights The new travel ban will exclude legal permanent residents and existing visa holders\n\nTwo sources also expect that the President will formally revoke the previous executive order\n\nWashington (CNN) President Donald Trump has delayed plans to sign a reworked travel ban in the wake of positive reaction to his first address to Congress, a senior administration official told CNN.\n\nThe decision came late Tuesday night as positive reviews flooded in for Trump's speech, which struck a largely optimistic and unifying tone.\n\nSigning the executive order Wednesday, as originally indicated by the White House, would have undercut the favorable coverage. The official didn't deny the positive reception was part of the administration's calculus in pushing back the travel ban announcement.\n\n\"We want the (executive order) to have its own 'moment,'\" the official said.\n\nThe sudden change of plans came as Trump and his top advisers returned to the White House after his address to a joint session of Congress on Tuesday night.\n\nRead More", "authors": ["Laura Jarrett", "Ariane De Vogue", "Jeremy Diamond"], "publish_date": "2017-02-28", "source": "cnn", "top_words": ["executive", "travel", "official", "trump", "ban", "plans", "speech", "delays", "positive", "order", "president", "white", "wellreviewed"], "summary": "The decision came late Tuesday night as positive reviews flooded in for Trump's speech, which struck a largely optimistic and unifying tone.\nSigning the executive order Wednesday, as originally indicated by the White House, would have undercut the favorable coverage.\nThe official didn't deny the positive reception was part of the administration's calculus in pushing back the travel ban announcement.\n\"We want the (executive order) to have its own 'moment,'\" the official said.\nThe sudden change of plans came as Trump and his top advisers returned to the White House after his address to a joint session of Congress on Tuesday night."}