{"url": "http://www.cnn.com/2017/02/08/politics/dev-patel-trump-travel-ban-cnntv/index.html", "id": "235", "title": "Dev Patel: Trump travel ban 'terrifies me'", "text": "Story highlights Patel was flying to the United States last week when the travel ban went into effect\n\nPatel is only the third actor of Indian descent to be nominated for an Oscar\n\n(CNN) The \"divisive nature\" of President Donald Trump's travel ban \"terrifies me in a way,\" Oscar-nominated actor Dev Patel said Wednesday.\n\n\"I'm a product of immigrants,\" he told CNN's Alisyn Camerota. Patel said his parents moved to the UK from Kenya and are \"completely proud to be British.\"\n\nOscar nominated actor @Dev_Patel says \"divisive nature\" of Trump's travel ban \"terrifies me in a way.\" https://t.co/hkroSiI55N — New Day (@NewDay) February 8, 2017\n\nThe actor said he was on a flight to the United States when the travel ban went into effect. \"It was quite overwhelming, very sad. It's kind of a strange situation when you're walking a red carpet and at the same time people are out marching the streets because of so much strife in the air,\" he said.\n\nTrump signed the executive order January 27. It bars citizens of seven Muslim-majority countries -- Iraq, Syria, Iran, Libya, Somalia, Sudan and Yemen -- from entering the US for 90 days, all refugees for 120 days and indefinitely halts refugees from war-torn Syria.\n\nThe order was temporarily blocked by a Seattle Court on February 3 and is now being considered by the 9th Circuit Court of Appeals.\n\nRead More", "authors": ["Melissa Mahtani"], "publish_date": "2017-02-08", "source": "cnn", "top_words": ["travel", "dev", "trump", "ban", "united", "trumps", "terrifies", "patel", "went", "states", "actor", "way"], "summary": "Story highlights Patel was flying to the United States last week when the travel ban went into effectPatel is only the third actor of Indian descent to be nominated for an Oscar(CNN) The \"divisive nature\" of President Donald Trump's travel ban \"terrifies me in a way,\" Oscar-nominated actor Dev Patel said Wednesday.\nPatel said his parents moved to the UK from Kenya and are \"completely proud to be British.\"\nOscar nominated actor @Dev_Patel says \"divisive nature\" of Trump's travel ban \"terrifies me in a way.\"\nhttps://t.co/hkroSiI55N — New Day (@NewDay) February 8, 2017The actor said he was on a flight to the United States when the travel ban went into effect.\nThe order was temporarily blocked by a Seattle Court on February 3 and is now being considered by the 9th Circuit Court of Appeals."}