{"url": "http://www.cnn.com/2017/02/02/politics/donald-trump-immigration-ban/index.html", "id": "200", "title": "Trump administration easing travel ban restrictions for green card holders", "text": "Story highlights Permanent residents already undergo extensive background screening to qualify for green cards\n\nUS legal permanent residents who are from the seven countries will again be allowed to participate in the Global Entry program\n\nWashington (CNN) The Trump administration is easing restrictions on legal permanent residents who were initially affected by the President's executive order largely banning entry to the US by citizens of seven Muslim-majority countries.\n\nAfter nearly a week of claiming it wouldn't change the executive order, the administration is retreating on how the order affects so-called green card holders. The seven countries affected are Iran, Iraq, Syria, Somalia, Libya, Sudan and Yemen.\n\nAirlines were briefed on some of the changes beginning on Wednesday.\n\nDetails of the eased restrictions were described by a person briefed on the changes and confirmed by a senior administration official.\n\nUS legal permanent residents who are from the seven countries will again be allowed to participate in the Global Entry program, which allows for expedited border clearance for travelers deemed to be low-risk.\n\nRead More", "authors": ["Evan Perez", "Elise Labott"], "publish_date": "2017-02-02", "source": "cnn", "top_words": ["participate", "seven", "travel", "restrictions", "residents", "trump", "permanent", "ban", "holders", "card", "easing", "countries", "entry", "green", "order", "administration", "legal"], "summary": "After nearly a week of claiming it wouldn't change the executive order, the administration is retreating on how the order affects so-called green card holders.\nThe seven countries affected are Iran, Iraq, Syria, Somalia, Libya, Sudan and Yemen.\nAirlines were briefed on some of the changes beginning on Wednesday.\nDetails of the eased restrictions were described by a person briefed on the changes and confirmed by a senior administration official.\nUS legal permanent residents who are from the seven countries will again be allowed to participate in the Global Entry program, which allows for expedited border clearance for travelers deemed to be low-risk."}