{"url": "http://www.cnn.com/2017/02/04/politics/next-legal-steps-travel-ban/index.html", "id": "214", "title": "Next steps in legal battle over the travel ban", "text": "Story highlights The White House has vowed to fight the immigration ruling\n\nHere are the next steps to watch as this legal war wages on\n\nWashington (CNN) It has been less than 24 hours since a federal judge brought the enforcement of President Donald Trump's travel ban to a screeching halt -- and the legal battle over the ruling has only just begun.\n\nThe White House announced late Friday night that the Justice Department would file an emergency motion to stop US District Court Judge James Robart's block of the executive order, but it had yet to do so as of Saturday afternoon.\n\nHere are the next steps to watch as this legal war wages on:\n\nMore court filings to come\n\nFirst, the Justice Department might file an emergency motion in front of Robart asking that he \"stay\" his Friday night order and reverse himself.\n\nRead More", "authors": ["Laura Jarrett"], "publish_date": "2017-02-04", "source": "cnn", "top_words": ["travel", "battle", "ban", "watch", "wages", "night", "motion", "war", "justice", "order", "white", "steps", "legal"], "summary": "Story highlights The White House has vowed to fight the immigration rulingHere are the next steps to watch as this legal war wages onWashington (CNN) It has been less than 24 hours since a federal judge brought the enforcement of President Donald Trump's travel ban to a screeching halt -- and the legal battle over the ruling has only just begun.\nThe White House announced late Friday night that the Justice Department would file an emergency motion to stop US District Court Judge James Robart's block of the executive order, but it had yet to do so as of Saturday afternoon.\nHere are the next steps to watch as this legal war wages on:More court filings to comeFirst, the Justice Department might file an emergency motion in front of Robart asking that he \"stay\" his Friday night order and reverse himself."}