{"url": "http://www.cnn.com/2017/02/09/politics/judges-threatened-immigration-order/index.html", "id": "247", "title": "Threats against judges in immigration ban cases leads to increased security", "text": "Story highlights Security experts say public officials should avoid comments against a specific judge\n\nWhite House press secretary Sean Spicer was asked whether Trump regrets his criticism.\n\n(CNN) Threats against more than one judge involved in legal challenges to President Donald Trump's executive order on immigration have prompted federal and local law enforcement agencies to temporarily increase security protection for some of them, according to law enforcement officials.\n\nCNN did not learn how specific the threats were, but law enforcement agencies treated them seriously and out of an abundance of caution, the US Marshals Service and local police increased patrols and protective officers to provide security for some of the judges, the officials said.\n\nA spokesperson from the US Marshals Service declined to comment directly on the threats but said that while \"we do not discuss our specific security measures, we continuously review the security measures in place for all federal judges and take appropriate steps to provide additional protection when it is warranted.\"\n\nThe threats come as Trump continues his verbal criticisms of judges -- something that has drawn concern from former law enforcement officials and others who fear that public officials should not target a specific judge, and instead base their criticism more broadly on a court's ruling.\n\nSecurity experts say that while Trump's comments were clearly not meant to put the judges' safety at risk, in general, public officials should avoid comments against a specific judge so as not to spur an unhappy litigant.\n\nRead More", "authors": ["Evan Perez", "Shimon Prokupecz", "Ariane De Vogue"], "publish_date": "2017-02-09", "source": "cnn", "top_words": ["judges", "ban", "cases", "security", "immigration", "public", "judge", "threats", "officials", "enforcement", "law", "comments", "leads", "specific", "increased"], "summary": "Story highlights Security experts say public officials should avoid comments against a specific judgeWhite House press secretary Sean Spicer was asked whether Trump regrets his criticism.\n(CNN) Threats against more than one judge involved in legal challenges to President Donald Trump's executive order on immigration have prompted federal and local law enforcement agencies to temporarily increase security protection for some of them, according to law enforcement officials.\nCNN did not learn how specific the threats were, but law enforcement agencies treated them seriously and out of an abundance of caution, the US Marshals Service and local police increased patrols and protective officers to provide security for some of the judges, the officials said.\nThe threats come as Trump continues his verbal criticisms of judges -- something that has drawn concern from former law enforcement officials and others who fear that public officials should not target a specific judge, and instead base their criticism more broadly on a court's ruling.\nSecurity experts say that while Trump's comments were clearly not meant to put the judges' safety at risk, in general, public officials should avoid comments against a specific judge so as not to spur an unhappy litigant."}