{"url": "http://www.cnn.com/2017/03/06/politics/congress-reaction-travel-ban-muslim/index.html", "id": "287", "title": "Muslims in Congress, Democrats blast new Trump travel ban: 'Muslim Ban 2.0'", "text": "Story highlights President Donald Trump banned travel from Yemen, Libya, Iran, Somalia, Syria and Sudan\n\nThose six countries are majority Muslim but the administration denies its a 'Muslim ban'\n\nWashington (CNN) The two Muslim members of Congress swiftly blasted President Donald Trump's new version of the travel ban as still targeting Muslim-majority countries -- raising the critical issue which stalled the first ban in court.\n\n\"Here we go again...Muslim Ban 2.0 #NoBanNoWall,\" tweeted Democratic Rep. Andre Carson of Indiana, the second Muslim elected to Congress and a member of the House Intelligence Committee.\n\nAnd Rep. Keith Ellison, a Minnesota Democrat and the first Muslim elected to Congress a decade ago, tweeted: \"On Campaign, @realDonaldTrump called for 'total and complete shutdown of Muslims entering the United States.' Now, says 'what Muslim Ban?'\"\n\nOn Campaign, @realDonaldTrump called for \"total and complete shutdown of Muslims entering the United States.\" Now, says \"what Muslim Ban?\" — Rep. Keith Ellison (@keithellison) March 6, 2017\n\nEllison later reiterated his tweet to CNN, calling it a \"lawyered up\" version of his first executive order.\n\n\"It's a Muslim ban,\" he said in a phone interview. \"It's a revised one. It's a lawyered up one. The man said he wanted a complete and total ban of Muslims. And then it gets struck down ... and then he comes back a few days later with something else. He is trying to restrict access to the United States because of their religion. The people that it does ban are banned because it's Muslim.\"", "authors": ["Tom Lobianco"], "publish_date": "2017-03-06", "source": "cnn", "top_words": ["travel", "trump", "congress", "ban", "blast", "rep", "democrats", "total", "version", "united", "complete", "states", "muslim", "muslims", "20"], "summary": "Now, says 'what Muslim Ban?'\"\nNow, says \"what Muslim Ban?\"\n\"It's a Muslim ban,\" he said in a phone interview.\nThe man said he wanted a complete and total ban of Muslims.\nHe is trying to restrict access to the United States because of their religion."}