{"url": "http://www.cnn.com/2017/02/07/politics/trump-defends-travel-ban/index.html", "id": "231", "title": "Trump defends travel ban ahead of court hearing", "text": "Story highlights The Ninth Circuit is scheduled to hear oral arguments in the travel ban case Tuesday at 6 p.m. ET\n\nThe case may end up at the Supreme Court, Trump indicated\n\nWashington (CNN) President Donald Trump said Tuesday his travel ban is \"common sense\" and that the challenge to the ban may make it to the Supreme Court.\n\nDuring a meeting with sheriffs at the White House, the President was pressed by a reporter about how far he's willing to take his legal defense of the travel ban. Trump said he's going to take it through the system, explaining that \"it's very important for the country\" for it to be successful.\n\n\"We're not allowed to be tough on the people coming in? Explain that one. So we'll see what happens. We have a big court case. We're well represented and we're going to see what happens,\" he said.\n\nWhen asked if the case will make it to the Supreme Court, the President said hopefully it doesn't have to. \"Some things are law, and I'm all in favor of that,\" he said.\n\n\"I actually can't believe that we're having to fight to protect the security, in a court system, to protect the security of our nation. I can't even believe it. And a lot of people agree with us, believe me,\" he added.\n\nRead More", "authors": ["Elizabeth Landers"], "publish_date": "2017-02-07", "source": "cnn", "top_words": ["travel", "case", "believe", "trump", "ban", "supreme", "security", "court", "ahead", "system", "defends", "president", "hearing"], "summary": "Story highlights The Ninth Circuit is scheduled to hear oral arguments in the travel ban case Tuesday at 6 p.m.\nETThe case may end up at the Supreme Court, Trump indicatedWashington (CNN) President Donald Trump said Tuesday his travel ban is \"common sense\" and that the challenge to the ban may make it to the Supreme Court.\nDuring a meeting with sheriffs at the White House, the President was pressed by a reporter about how far he's willing to take his legal defense of the travel ban.\nWe have a big court case.\nWhen asked if the case will make it to the Supreme Court, the President said hopefully it doesn't have to."}