{"url": "http://www.cnn.com/2017/03/07/opinions/travel-ban-is-still-a-muslim-ban-opinion-parsi/index.html", "id": "299", "title": "Why Trump's travel ban is still a Muslim ban (Opinion)", "text": "Trita Parsi is the president of the National Iranian American Council and author of the forthcoming book \"Losing an Enemy -- Obama, Iran and the Triumph of Diplomacy.\" Adam Weinstein is a former US Marine who served in Afghanistan. The opinions in this article belong to the authors.\n\n(CNN) President Donald Trump's new travel ban may reduce the chaos at airports caused by his previous executive order, but it will not enhance American security or make the intention behind the original order any less bigoted.\n\nIndeed, in our opinion, the new travel ban is still very much a Muslim ban , even if it falls short of the Trump administration's true ambitions.\n\nA close look at what the administration has been doing since the now-infamous executive order was issued on January 27 -- banning travelers and refugees from seven Muslim-majority nations -- reveals a clear intent from Trump's inner circle to depopulate the United States of Muslims.\n\nThe many articles written about chief strategist Stephen Bannon, alleged architect of the ban, are a testament to his endeavor to rid the United States of Muslims. He has repeatedly asked the question: \"Don't we have a problem with legal immigration?\" Bannon described a high legal immigrant population as the \"beating heart of this problem.\"\n\nConsider these points:\n\nThe original executive order not only prevented more citizens from the seven Muslim-majority countries coming to the United States, but the broad language of the executive order deliberately made no distinction between permanent residents, students, former translators for the military or refugees.\n\nInitially, everyone was kept out. There were several cases of lawful green card holders being detained -- despite the fact that they had been living in the United States legally for years and obtained their green cards through legal channels. Public pressure forced the government to relent.\n\nHad it not been for the outrage, pushback from within the US Congress and bureaucracy -- as well as the court order from a federal judge in Washington state -- then we believe we could have seen the deportation of lawful green card holders.\n\nMoreover, simultaneous with the effort to prevent nationals from these seven countries from entering the United States was this alarming report in The New York Times , which said that staff at the Citizenship and Immigration Services were told that applicants from the countries listed \"should be interviewed, but that their cases for citizenship, green cards or other immigration documents should be put on pause.\"\n\nIf this report is accurate and the order to USCIS staff carried out to its logical conclusion, then the vast majority of these visa holders would be forced to leave the country as their existing visas would expire and their efforts to obtain permanent residency would be blocked en masse. This blocks the flow of individuals from Muslim-majority countries into the United States while ensuring those who remain are forced out over time.\n\nJUST WATCHED Trump's new travel ban: One thing to know Replay More Videos ... MUST WATCH Trump's new travel ban: One thing to know 01:25\n\nTaken together, these steps appear to have all the hallmarks of a campaign to depopulate the United States of Muslims.\n\nRudy Giuliani also disclosed Trump's motivation when he told Fox News about a conversation he had with the then-candidate, concerning the original order: \"He called me up, he said, 'Put a commission together, show me the right way to do it legally.' \"\n\nWhat we've ended up with is not the Muslim ban that Bannon wanted. It's the Muslim ban that geopolitics currently allows for. It is allegedly designed to prevent 9/11-style or ISIS-inspired attacks. Yet more foreign ISIS fighters come from Tunisia than any other country in the world. Tunisia is not on the list. Neither is Saudi Arabia or Pakistan despite a long history of militant Islamism in both countries.\n\nThe United States has deep military partnerships with Saudi Arabia and Pakistan. They are partners in the war on terror.\n\nTrump cannot yet afford to ostracize these Muslim-majority countries. But he can afford to target countries such as Iran, Sudan and Somalia since the United States does not have strong relations with them -- even though the nationals of these countries pose far less of a terror threat to the American homeland and in many cases are in greater need of refugee status.\n\nThis ban is a blueprint for ridding the United States of Muslims and turning the remaining Muslim population into second-class citizens -- if it is allowed to stand.\n\nBanning countries increases US vulnerability to terrorism. The original ban even had the perverse effect of preventing an Iraqi general in charge of counterterrorism from visiting his family in the United States.\n\nThe removal of Iraq from the list due to pressure from Prime Minister Haider al-Abadi proves that countries were not banned based on security concerns. It is Iran and Iraq that are leading the ground offensive against ISIS.\n\nFollow CNN Opinion Join us on Twitter and Facebook\n\nThe intent, clearly, is to prevent Muslim immigration to the furthest extent possible and test the limits of the US Constitution and the courts. Affected US citizens remain uncertain whether their parents, wives, husbands and in some cases even children can enter the country.\n\nIf geopolitics allows it, more Muslim-majority countries will undoubtedly be added to the list. Maybe Trump will one day get the ban he wanted all along.", "authors": ["Trita Parsi", "Adam Weinstein"], "publish_date": "2017-03-07", "source": "cnn", "top_words": ["original", "travel", "muslimmajority", "ban", "order", "opinion", "united", "trumps", "countries", "states", "muslim"], "summary": "Indeed, in our opinion, the new travel ban is still very much a Muslim ban , even if it falls short of the Trump administration's true ambitions.\nJUST WATCHED Trump's new travel ban: One thing to know Replay More Videos ... MUST WATCH Trump's new travel ban: One thing to know 01:25Taken together, these steps appear to have all the hallmarks of a campaign to depopulate the United States of Muslims.\n\"What we've ended up with is not the Muslim ban that Bannon wanted.\nIt's the Muslim ban that geopolitics currently allows for.\nThe original ban even had the perverse effect of preventing an Iraqi general in charge of counterterrorism from visiting his family in the United States."}