{"url": "http://www.cnn.com/2017/02/08/politics/trump-travel-ban-presidential-power-american-identity/index.html", "id": "239", "title": "The epic showdown over presidential power and American identity", "text": "(CNN) The challenge to President Donald Trump's refugee order has escalated toward an epic showdown over presidential power, judicial authority and American identity.\n\nBy their questions in a hearing Tuesday, three US appeals court judges made plain that even at this early procedural stage they are concerned about the administration's potential targeting of Muslims along with possible risks to national security.\n\nThe judges of the Ninth Circuit Court of Appeals also expressed unease with how quickly they were being pressed to consider looming dilemmas of refugee policy with no lower court hearings yet on both sides' evidence.\n\n\"Courts must act fast!\" Trump tweeted late Monday, as he warned about \"a threat from radical Islamic terrorism.\"\n\nTrump's natural impatience conflicts with the usual tendencies of the federal judiciary, which even in dangerous times attempts, as Chief Justice John Roberts has observed, \"calmly to poise the scales of justice.\"\n\nTrump's January 27 order suspending refugee admissions for at least 120 days and barring people from seven majority-Muslim countries from entering the US for at least 90 days, has engendered more public protest and litigation than any of Trump's policy moves or Cabinet appointments to date.\n\nMore than anything else, it cuts to the core of the nation's character.\n\nAmong the \"friend of the court\" briefs filed ahead of the Ninth Circuit hearing was one from technology companies that addressed lost talent and revenue related to the ban but first highlighted America's reputation as a nation that welcomed immigrants.\n\n\"A quarter of us have at least one parent who was born outside the country,\" it said, referring to population statistics. \"Close to half of us have a grandparent born somewhere else. Nearly all of us trace our lineage to another country.\"\n\nThe order also raises concerns that the nation would favor Christians over Muslims. The directive gives priority to refugee claims based on religious persecution but only \"if the religion of the individual is a minority religion\" in his home country. Given the list of countries targeted, the challengers say, that provision discriminates against Muslims.\n\nIn the administration's written filings and during arguments Tuesday, the federal government argued that the order was neutral with respect to religion and rightly focused on countries that have been breeding grounds for terrorism.\n\nWhile trial judges across the country have been reviewing claims that the order exceeds the president's statutory and constitutional power, Tuesday's hearing marked the first time a federal appeals court took up a piece of the controversy.\n\nIt heard the Trump administration's appeal of US District Court Judge James Robart's order in a case brought by officials in Washington state and Minnesota preventing enforcement of the travel ban while litigation is underway.\n\nTrump condemned Robart, referring to him as a \"so-called judge\" and deeming his ruling \"ridiculous.\"\n\nWednesday morning, he insisted the government must win the case.\n\n\"If the U.S. does not win this case as it so obviously should, we can never have the security and safety to which we are entitled. Politics!\" Trump tweeted.\n\nIf the U.S. does not win this case as it so obviously should, we can never have the security and safety to which we are entitled. Politics! — Donald J. Trump (@realDonaldTrump) February 8, 2017\n\nDo Trump's campaign promises matter?\n\nAppeals court judges expressed doubts about the government's terrorism claims but also pressed Washington state Solicitor General Noah Purcell about the broad reach of the order. They questioned whether to consider comments by Trump during the presidential campaign, such as the promise of \"a total and complete shutdown of Muslims entering the United States.\"\n\nThe Washington and Minnesota lawyers say judges should look to such statements and \"distinguish a sham\" purpose from a sincere one. Trump administration lawyers counter that the order can only be read on its face. They stress overall that judges \"are particularly ill equipped to second guess\" the President on security risks.\n\nIf the administration loses at this stage, it is likely to appeal to the Supreme Court for reinstatement of the ban.\n\nBut at this early point, with the Supreme Court still down a justice from last year's death of Antonin Scalia, it might be disinclined to take up the matter. The current bench is divided 4-to-4 along ideological and political lines.\n\nTrump's nominated successor to Scalia, US Appeals Court Judge Neil Gorsuch, is unlikely to be on the bench before late spring.\n\nA reminder of Korematsu\n\nStill many more chapters could unfold in the dispute already raising comparisons to past legal clashes over presidential power at times of war and national crisis.\n\nFor the challengers, the dispute particularly recalls the 1944 case of Korematsu v. United States, in which the Supreme Court upheld a World War II executive order moving Japanese-American citizens into detention camps.\n\nSince regarded as an egregious infringement on civil rights and one of the high court's worst decisions ever, Korematsu often emerges at judicial confirmation hearings.\n\nDuring Chief Justice John Roberts' 2005 confirmation hearings, Sen. Patrick Leahy, a Vermont Democrat, asked whether Roberts would be a \"Korematsu justice\" and allow individuals to be targeted based on nationality or religion.\n\nRoberts responded that the government was unlikely to resort ever again to such internment camps, yet also emphasized the need for constitutional vigilance when national security is under threat.\n\nRoberts told senators he was reminded of a judicial motto tracing to the 1807 treason trial of Aaron Burr, that a judge's obligation even in dangerous times is \"calmly to poise the scales of justice.\"", "authors": ["Joan Biskupic", "Cnn Legal Analyst", "Supreme Court Biographer"], "publish_date": "2017-02-08", "source": "cnn", "top_words": ["epic", "presidential", "case", "judges", "identity", "trump", "justice", "security", "appeals", "refugee", "win", "american", "court", "showdown", "order", "power"], "summary": "(CNN) The challenge to President Donald Trump's refugee order has escalated toward an epic showdown over presidential power, judicial authority and American identity.\n\"A quarter of us have at least one parent who was born outside the country,\" it said, referring to population statistics.\nAppeals court judges expressed doubts about the government's terrorism claims but also pressed Washington state Solicitor General Noah Purcell about the broad reach of the order.\nTrump's nominated successor to Scalia, US Appeals Court Judge Neil Gorsuch, is unlikely to be on the bench before late spring.\nA reminder of KorematsuStill many more chapters could unfold in the dispute already raising comparisons to past legal clashes over presidential power at times of war and national crisis."}