{"url": "http://www.cnn.com/2017/02/03/health/iraqi-refugee-dilbireen-profile/index.html", "id": "202", "title": "Injured toddler's future waits on Trump travel policy", "text": "This story has been updated on February 5 to reflect the status of the family's travel restriction to the United States.\n\n(CNN) Severe burns disfigured the toddler's face. Scars are scattered under little Dilbireen Muhsin's chin.\n\nIn Kurdish, the young Yazidi boy's name means \"wounded heart.\" Yet 2-year-old Dilbireen, affectionately called Dili, remains cheerful and self-sufficient. He enjoys cuddling with his blanket and playing peek-a-boo, and he exhibits more independence than many other children his age -- from feeding himself to brushing his own teeth\n\nThis might be because he has been without his mother for so long, said Dilbireen's caretaker, Adlay Kejjan, in an exclusive interview with CNN's chief medical correspondent Dr. Sanjay Gupta.\n\nDilbireen arrived in the United States last year to receive medical treatment for severe burns after a fire in his home in a refugee camp. While he now lives with a family in Lansing, Michigan, his parents and baby brother are in their native country, Iraq. They're making efforts to be by Dilbireen's side in the United States, but their travel visas were revoked in early January.\n\nTrump on travel ban: Call it what you want\n\nTrump on travel ban: Call it what you want 01:22\n\nTrump on travel ban: Call it what you want\n\nAs of February 5 the family has not been able to secure travel visas to the United States. The father, Ajeel, was refused entry to the US consulate in Erbil, Iraq despite having an appointment on Sunday.\n\nOutside of a video-chat screen, Dilbireen hasn't seen his family in about four months, and he misses them, said Kejjan, director of the Yazidi American Women Organization.\n\n\"He feels abandoned by them. Because when they call, I can see, like, he doesn't want to interact with them, but sometimes when they're talking to me, he just looks at them like over my shoulder,\" she said from her home in Michigan this week. \"It's heart-breaking for all of us when we watch that. He definitely recognizes his dad, and I'm not sure about his mom. He's very confused, because he thinks I'm his mom.\"\n\n'It's almost like he is the face of the Yazidis'\n\nTerror struck Dilbireen's family while he was still in his mother's womb.\n\nDilbireen's family fled their home to escape the bloodshed. The young family found shelter among other displaced Yazidis in a refugee camp, where Dilbireen was born on January 4, 2015. A year later, around Dilbireen's first birthday, a fire sparked by a malfunctioning gas heater set his crib ablaze. Flosa was baking bread outside when her baby's crib went up in flames, and people nearby rushed to his aid.\n\nDilbireen was severely burned on his face and feet, but a blanket protected the rest of his body from harm.\n\nJUST WATCHED They survived ISIS, but may not survive the winter Replay More Videos ... MUST WATCH They survived ISIS, but may not survive the winter 02:47\n\nIraqi doctors advised the parents to get him treated outside the country, Dilbireen's father, Ajeel Muhsin, said.\n\nThe UK-based charity Road to Peace made arrangements for Dilbireen to receive urgent medical care in Boston, where Shriners Hospitals for Children agreed to treat him and other injured refugee children at no cost. Road to Peace works with organizations around the world to help build alliances between communities in conflict and facilitate specialized medical care for refugee children.\n\nThe family had a plan: With the charity's assistance, Dilbireen and Ajeel would go to the US for the boy's first round of reconstructive surgeries in October. Flosa, who was pregnant, would remain in Iraq.\n\nAs Dilbireen recovered in the United States, Ajeel returned to Iraq for the baby's birth and then planned to accompany Flosa and their newborn to the United States so the family could reunite for the rest of Dilbireen's surgeries. After his treatment, the family would return to Iraq together.\n\nDr. Shirzad Khaleel, medical coordinator for Road to Peace, and Sally Becker, who founded the charity, accompanied Dilbireen and Ajeel on their journey to the United States.\n\n\"This little boy, with everything he has been through, it's almost like he is the face of the Yazidis,\" Becker said. \"He is a symbol of their suffering. A symbol of everything they have been going through.\"\n\nDilbireen's first treatments went well. But the family's travel plans didn't unfold so smoothly.\n\nA turn of events\n\nAs planned, Ajeel traveled back to Iraq, and Dilbireen, who was still recovering, moved to Michigan to stay with Kejjan until his next round of surgeries.\n\nFlosa gave birth to their second child on November 9. When it came time to name their new son, the family thought of the country caring for their first baby boy.\n\n\"America is helping us to do surgery on our boy,\" Ajeel said in an interview from Iraq. His comments were translated from Kurdish. \"We want to show our appreciation to America for what they are doing for our boy.\"\n\nThey named the newborn Trump.\n\nAjeel and Flosa planned to join Dilbireen for his next surgery. Though they already had visas to travel to the United States, they submitted an application last month, before Trump took office, for a passport and visa for their newborn.\n\nTheir application was denied , and then the visas they already had were revoked.\n\nPhotos: Yazidi toddler waits without his parents for surgery Dilbireen Muhsin, a 2-year-old boy from Iraq's Yazidi community, was born in a refugee camp January 4, 2015. Hide Caption 1 of 12 Photos: Yazidi toddler waits without his parents for surgery Dilbireen, a cheerful child, has a love of animals. Hide Caption 2 of 12 Photos: Yazidi toddler waits without his parents for surgery Around his first birthday, Dilbireen was burned in a fire. He flew to the US for reconstructive surgery on his face in October. Hide Caption 3 of 12 Photos: Yazidi toddler waits without his parents for surgery Since his first surgery, Dilbireen has been cared for by a Yazidi advocate, Adlay Kejjan, in Michigan. Hide Caption 4 of 12 Photos: Yazidi toddler waits without his parents for surgery As Dilbireen waits for his second round of surgeries, his parents, who are still in Iraq, have finally been issued visas so they can come to the US to be with their son. Hide Caption 5 of 12 Photos: Yazidi toddler waits without his parents for surgery Dilbireen celebrated his 2nd birthday in the US last month. In a message to the boy, father Ajeel Muhsin said, \"I am hopeful that we will come soon. Finish all your operations. After that, we will return to Iraq. We love you. Kisses.\" Hide Caption 6 of 12 Photos: Yazidi toddler waits without his parents for surgery Dilbireen has grown into an independent toddler who brushes his own teeth. Hide Caption 7 of 12 Photos: Yazidi toddler waits without his parents for surgery Kejjan said said she prayed that Dilbireen's parents would get the travel visas they needed to by their son's side. Hide Caption 8 of 12 Photos: Yazidi toddler waits without his parents for surgery Dilbireen has started to notice that \"he is different,\" Kejjan said. Hide Caption 9 of 12 Photos: Yazidi toddler waits without his parents for surgery \"When he plays with kids, he like touches their eyes and nose. He realizes there's something different about him, and it's really, really sad, because these kids, they run away. ... They're always scared of him,\" Kejjan said. Hide Caption 10 of 12 Photos: Yazidi toddler waits without his parents for surgery Kejjan, who works as a pilot, has shown a curious Dilbireen how airplanes are operated. Hide Caption 11 of 12 Photos: Yazidi toddler waits without his parents for surgery Kejjan, who also works as a paramedic, has shown Dilbireen some of her medical equipment. Hide Caption 12 of 12\n\nThe denial letter indicated that Ajeel and Flosa were either unable to sufficiently demonstrate strong ties to their home country that would compel them to leave the US at the end of their stay or unable to establish clearly that their stay would be temporary.\n\n\"They didn't give us visas because they thought we would go there and stay,\" Ajeel said. \"No, we didn't want to stay there. We want to finish our son's treatment and return back home. If that was our intention, we all would have gone there originally, when we had visas.\"\n\nAjeel now has regrets about their travel plans and how long they've been apart.\n\n\"I wish we had all gone there together and the baby was born there,\" he said. \"But my plan was to return back.\"\n\nDilbireen has yet to meet his baby brother.\n\nA desperate child in limbo\n\nTrump signed an executive order last week to keep refugees from entering the country for 120 days. Immigrants from seven predominantly Muslim nations -- Iran, Iraq, Syria, Sudan, Libya, Yemen and Somalia -- are unable to enter the country for at least the next 90 days. Dilbireen and his family, who count as refugees, might be among those impacted.\n\nJUST WATCHED Trump voters applaud travel ban Replay More Videos ... MUST WATCH Trump voters applaud travel ban 02:55\n\nAjeel and Flosa submitted new applications to the US consulate in Erbil, Iraq, but were refused entry to the US consulate in Erbil on Sunday.\n\nRoad to Peace and Scott LaStaiti, a Los Angeles-based film producer and philanthropist, shared the cost of the applications, about $160 per applicant, each time; a total of about $2,000 for the family.\n\nDue to the travel ban, Ajeel and Flosa's applications could be rejected again. Dilbireen, who has shown signs of separation anxiety from his mother, could either remain in the US without his family or return to Iraq without undergoing any more surgeries, said Becker, the Road to Peace founder.\n\nThough his injuries aren't life-threatening, Shriners Hospitals said in a statement Thursday, \"Dilbireen will need other surgeries to further improve the function of his face. The next step in improving the appearance and function of his face will be to work on scarring around his eyes, and to begin to reconstruct his nose.\n\n\"In general, Dilbireen's doctors at Shriners Hospitals believe it's best to do these types of procedures while a child's face is still growing, so that scar tissue can be released allowing as much normal growth and development to occur as possible,\" the statement said. \"Ideally, this surgery would be done fairly soon, but there's no specific timeframe for success.\"\n\nDilbireen was due to have another surgery in Boston on January 25, but Becker said the appointment was canceled because \"it would be too cruel\" to go forward without the emotional support that a toddler needs from his parents.\n\n\"When their visas were refused, Trump wasn't in office,\" Becker said.\"Following his announcement, everything has changed, so we really don't know what will happen.\"\n\n\"Dilbireen's case is unique, so I'm hoping that their visas will be approved on compassionate grounds,\" she said. \"If the visas are refused, it would mean that I would have to take that little boy back to Iraq (without treatment), and I can't bear the thought.\"\n\n'He realizes there's something different about him'\n\nAs Dilbireen's parents wait -- not knowing when they will see their son again -- the growing toddler is adjusting to life in Michigan , Kejjan said.\n\n\"If he was older, he would definitely say, 'I want my parents, my mom and dad.' He's so young, and he doesn't understand,\" said Kejjan, who serves as an advocate for the Yazidi community.\n\nKejjan, a paramedic and pilot, is also a Yazidi refugee and became an American citizen in 2006. She was asked to care for Dilbireen because she is a member of the Yazidi community and had offered to volunteer with Road to Peace in the past.\n\nKejjan initially took time away from her career to care for Dilbireen but has since returned to work. She said that her sister-in-law cares for Dilbireen in the afternoons and that he spends time around her nieces, nephews and other children.\n\nKejjan said she thinks Dilbireen has become more aware of the scars that not only shape his face but shape his character.\n\n\"When he plays with kids, he like touches their eyes and nose. He realizes there's something different about him, and it's really, really sad, because these kids, they run away. ... They're always scared of him,\" Kejjan said. \"When he's trying to touch their eyes and nose, he knows they're like, 'OK, what's going on?' \"\n\nThough Ajeel can't be there for his son now, he said he is hopeful his family soon will be reunited.\n\nIn a message to his son, Ajeel said, \"I am hopeful that we will come soon. Finish all your operations. After that, we will return to Iraq. We love you. Kisses.\"\n\nJoin the conversation See the latest news and share your comments with CNN Health on Facebook and Twitter.\n\nBecker, the founder of Road to Peace, said she has identified about 87 other children in Iraq who need specialized medical attention, similar to Dilbireen.\n\n\"Dilbireen is an amazing little boy, and I really, really hope that the US government will realize how important it is for this child to be reunited with his parents and get the surgery he needs, but I also want people to bear in mind that there are hundreds of other children in desperate need of help,\" Becker said.\n\n\"Shriners has kindly said that they would treat as many of the children as they can with no payment, but of course it depends on visa approvals. ... I'm also hoping that other countries might step in to help,\" she said.", "authors": ["Jacqueline Howard", "Ben Tinker"], "publish_date": "2017-02-03", "source": "cnn", "top_words": ["yazidi", "travel", "future", "trump", "ajeel", "family", "injured", "iraq", "waits", "dilbireen", "parents", "surgery", "policy", "toddlers", "toddler"], "summary": "Photos: Yazidi toddler waits without his parents for surgery Dilbireen Muhsin, a 2-year-old boy from Iraq's Yazidi community, was born in a refugee camp January 4, 2015.\nHide Caption 1 of 12 Photos: Yazidi toddler waits without his parents for surgery Dilbireen, a cheerful child, has a love of animals.\nHide Caption 5 of 12 Photos: Yazidi toddler waits without his parents for surgery Dilbireen celebrated his 2nd birthday in the US last month.\nHide Caption 6 of 12 Photos: Yazidi toddler waits without his parents for surgery Dilbireen has grown into an independent toddler who brushes his own teeth.\nHide Caption 8 of 12 Photos: Yazidi toddler waits without his parents for surgery Dilbireen has started to notice that \"he is different,\" Kejjan said."}