{"url": "http://www.cnn.com/2017/02/06/politics/trump-travel-ban-update/index.html", "id": "225", "title": "Trump's travel ban hits legal hurdles: Get up to speed", "text": "(CNN) US President Donald Trump's on-again, off-again travel ban is back with the courts after a tumultuous weekend, when an appeals court opted to keep in place the temporary restraining order issued by a federal judge until a final ruling can be made.\n\nTrump's executive order bars citizens of seven Muslim-majority countries -- Iraq, Syria, Iran, Libya, Somalia, Sudan and Yemen -- from entering the US for 90 days, bans all refugees for 120 days and indefinitely halts refugees from Syria.\n\nSo what's the latest with one of the new administration's most controversial moves so far?\n\nWhat happened?\n\nOn Friday, federal Judge James Robart of the US District Court for the Western District of Washington temporarily suspended key parts of the executive order nationwide.\n\nThe powerful 9th Circuit Court of Appeals, a federal appeals court in San Francisco, early Sunday denied the US government's emergency request to resume the ban. That court ordered both sides to submit arguments for and against the ban by Monday night.\n\nThe 9th Circuit scheduled oral arguments for Tuesday evening in the matter. Lawyers will make their cases to three federal judges in an hourlong hearing to determine the immediate fate of the temporary restraining order.\n\nRegardless of the outcome, the loser is expected to appeal to the US Supreme Court.\n\nHow has Trump taken it?\n\nHe's fuming. Over the weekend he fired off several tweets blasting Robart's decision , in one referring to the Bush appointee as a \"so called\" judge.\n\nThe opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned! — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nWhat is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.? — Donald J. Trump (@realDonaldTrump) February 4, 2017\n\nIn another, he said, \"Just cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!\"\n\nJust cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad! — Donald J. Trump (@realDonaldTrump) February 5, 2017\n\nTrump's Justice Department sent out a strongly worded filing, emphasizing that halting enforcement of the travel ban \"harms the public\" and \"second-guesses the President's national security judgment\" in the immigration context.\n\n\"(Robart's ruling) contravenes the considered judgment of Congress that the President should have the unreviewable authority to suspend the admission of any class of aliens,\" the Justice Department wrote.\n\nAre people traveling?\n\nRobart's ruling suspended the ban, and the rejection of the appeal means it's no longer in effect until the ruling by the 9th Circuit Court of Appeals.\n\nRecent Clemson University graduate Nazanin Zinouri touched down in Boston's Logan International Airport early Sunday afternoon after more than a day of air travel from Tehran -- she had left the US on vacation on January 20, the day of Trump's inauguration.\n\nJUST WATCHED The battle continues over travel ban Replay More Videos ... MUST WATCH The battle continues over travel ban 04:25\n\n\"I still can't believe this actually happened,\" she told CNN at the airport Sunday. \"I didn't see this coming any time soon, so this is definitely beyond whatever I could imagine.\"\n\nRepublican Sen. Lindsey Graham shared the news that she was heading back to South Carolina by tweeting \"Good news! I know she has lots of friends and co-workers who can't wait to see her. I'm happy she's almost home.\"\n\nGood news! I know she has lots of friends and co-workers who can't wait to see her. I'm happy she's almost home. https://t.co/7ApO2ZMggb — Lindsey Graham (@LindseyGrahamSC) February 6, 2017\n\nWhat is the 9th Circuit Court of Appeals?\n\nThe three-judge panel of the San Francisco-based court has a reputation as one of the most liberal in the nation -- to the point where some Republican lawmakers have even pushed to split it up in an effort to limit its impact.\n\nThe court will not rule on whether the ban is constitutional, but whether it will remain suspended for now.\n\nWhen could the ruling come?\n\nBoth sides filed legal briefs Monday at the request of the court.\n\nJUST WATCHED Christian refugees skeptical of travel ban Replay More Videos ... MUST WATCH Christian refugees skeptical of travel ban 03:09\n\nLawyers for Washington state and Minnesota asked the court to leave the temporary restraining order in place, arguing that the government has failed to show that it would be \"irreparably harmed\" by a suspension of the executive order.\n\nUnsurprisingly, the government said Robart's injunction should be lifted and the executive order should go back into effect while the legal process continues.\n\n\"The Executive Order is a lawful exercise of the President's authority over the entry of aliens into the United States and the admission of refugees,\" the Justice Department wrote in a brief.\n\nThe panel will hear oral arguments Tuesday and is expected to rule shortly after.\n\nAfter the three-judge panel publishes its decision, the losing party has 14 days to file a petition for rehearing the case by the full appellate court. A rehearing is not required, though, in order to get the case in front of the Supreme Court. Given the high stakes, it is expected that whomever ultimately loses before the 9th Circuit will most likely appeal to the US Supreme Court.\n\nHow have others reacted?\n\nJUST WATCHED McConnell weighs in on Trump travel ban Replay More Videos ... MUST WATCH McConnell weighs in on Trump travel ban 01:28\n\n\"I don't know that that's necessary,\" McConnell told CNN's Jake Tapper on \"State of the Union\" on Sunday. \"I mean, the courts are going to decide whether the executive order the President issued is valid or not, and we all follow court orders.\"\n\nPeople close to the White House said over the weekend that Trump's attacks will be a problem -- particularly as his administration shepherds his Supreme Court nominee Neil Gorsuch toward confirmation.\n\nWhat happens if court rules for -- or against -- the ban?\n\nTrump is unlikely to give up on his executive order, and it is entirely possible that the states would also appeal, should the ruling go against them. So no matter what the ruling is in San Francisco, the next stop will likely be the US Supreme Court\n\n\"Ultimately, one way or another, this case ends up at the Supreme Court,\" writes CNN legal analyst Danny Cevallos.\n\n\"Other cases are pending throughout the country, and the odds are that there will be a serious split among the federal appellate courts, one that can only be resolved by the high court.\n\n\"That same court, of course, is currently composed of eight members and capable of a 4-4 split. That's where it gets strange. When cases tie at the Supreme Court, then the appellate court's decision stands.\"", "authors": ["Euan Mckirdy"], "publish_date": "2017-02-06", "source": "cnn", "top_words": ["ruling", "executive", "travel", "speed", "trump", "ban", "supreme", "judge", "court", "order", "refugees", "trumps", "hurdles", "hits", "legal"], "summary": "Regardless of the outcome, the loser is expected to appeal to the US Supreme Court.\nJUST WATCHED The battle continues over travel ban Replay More Videos ... MUST WATCH The battle continues over travel ban 04:25\"I still can't believe this actually happened,\" she told CNN at the airport Sunday.\nUnsurprisingly, the government said Robart's injunction should be lifted and the executive order should go back into effect while the legal process continues.\nJUST WATCHED McConnell weighs in on Trump travel ban Replay More Videos ... MUST WATCH McConnell weighs in on Trump travel ban 01:28\"I don't know that that's necessary,\" McConnell told CNN's Jake Tapper on \"State of the Union\" on Sunday.\nWhen cases tie at the Supreme Court, then the appellate court's decision stands.\""}