{"url": "http://money.cnn.com/2017/01/30/technology/mit-cmu-presidents-immigration-ban/index.html", "id": "27", "title": "For MIT and Carnegie Mellon presidents, the immigration ban is personal", "text": "Leaders at some of America's best universities have had enough.\n\nThe presidents of MIT and Carnegie Mellon pledged Monday to fight for those impacted by the immigration ban. Both circulated strongly worded letters to their communities, highlighting the contributions that immigrants had made to the United States.\n\nThe travel restrictions, affecting faculty and students from seven Muslim nations, are deeply personal for the two men. Both are immigrants. MIT president L. Rafael Reif is from Venezuela. Carnegie Mellon president Subra Suresh was born in India.\n\n\"I first came to the U.S. at age 21 with a partially filled suitcase, less than $100 in cash, and a one-way airplane ticket purchased with a loan,\" Suresh wrote. \"Once in the U.S., I was able to pursue a series of extraordinary opportunities for scholarship and service without regard for my national origin -- an experience that forged in me an unshakeable faith in the ability of this nation to help everyone to succeed, wherever they came from.\"\n\nBoth men said they were disturbed and troubled by President Trump's executive order. Reif called it a stunning violation of deep American values.\n\n\"The Statue of Liberty is the 'Mother of Exiles,' how can we slam the door on desperate refugees,\" Reif wrote. \"Religious liberty is a founding American value; how can our government discriminate against people of any religion?\"\n\nRelated: Trump's immigration ban causes panic at universities\n\nAs Reif published his letter, MIT continues to work to bring two undergraduate students back to campus. In the passionate letter, Reif described MIT as both American and global.\n\n\"We are as American as the flag on the Moon,\" Reif wrote. \"With classic American ingenuity and drive, our graduates have invented fundamental technologies, launched new industries and created millions of American jobs.\"\n\nMIT has faculty, students and staff from 134 countries. And 40% of faculty and graduate students come from outside the United States.\n\n\"As I have -- a great many stay in this country for life, repaying the American promise of freedom with their energy and their ideas,\" Reif wrote.\n\nAmerica's world-leading engineering schools have been hit especially hard by the executive order.\n\nStanford had a PhD student detained at JKF Airport in New York Friday. Another graduate student is in Iran, worried whether he can return and complete his degree. A Stanford spokeswoman said that 97 Stanford students are directly affected by the ban.", "authors": ["Matt Mcfarland"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["wrote", "ban", "immigration", "mit", "reif", "faculty", "president", "united", "personal", "trumps", "mellon", "carnegie", "students", "presidents", "american"], "summary": "The presidents of MIT and Carnegie Mellon pledged Monday to fight for those impacted by the immigration ban.\nMIT president L. Rafael Reif is from Venezuela.\nBoth men said they were disturbed and troubled by President Trump's executive order.\n\"The Statue of Liberty is the 'Mother of Exiles,' how can we slam the door on desperate refugees,\" Reif wrote.\nRelated: Trump's immigration ban causes panic at universitiesAs Reif published his letter, MIT continues to work to bring two undergraduate students back to campus."}