{"url": "http://www.cnn.com/2017/03/21/politics/sxsw-farida-trump-travel-ban/index.html", "id": "321", "title": "R&B artist Farida talks Trump's travel ban", "text": "Austin, Texas (CNN) President Donald Trump's latest travel ban, which temporarily bars refugees and people from six majority-Muslim countries from entering the country, has reinforced negative stereotypes about Arabs and Muslims, according to R&B artist Farida.\n\n\"I think that just even putting that out on the table has already caused damage,\" she told CNN Saturday at the SXSW music festival in Austin, Texas, where she showcased her latest music. \"I don't think that's really something that you can fix.\"\n\nThe White House did not respond to a request for comment.\n\nThe 26-year-old artist, whose full name is Farida Bolseth Benounis, grew up in Gjøvik, a small town in Norway, and she takes her love of music from her parents, who have vastly different tastes.\n\n\"I think because I am a mix -- my dad is from Algeria and my mom is from Norway -- I have a more tolerant way of thinking not just people but also music,\" she said.\n\nShe describes her style as \"melancholy\" R&B with Scandinavian influences, and she released her debut EP, \"The 25th Hour,\" last year.\n\nShe said that anti-immigrant rhetoric championed by right-wing politicians in the United States is mirrored in Europe and is exacerbating negative stereotypes about Arabs and Muslims.\n\n\"If you're Arab, you're a terrorist,\" the Norwegian-Algerian singer said, describing the stereotypes her community wrestles with.\n\nPeople in leadership, like Trump in the US, have a major impact on the people of a country, she added.\n\n\"It's just so sad that some people are going to have one voice that's going to mean so much to a nation,\" she added.\n\nFarida, whose work is inspired by American hip-hop and R&B music, said that the world is deeply influenced by American pop culture -- and the rise of Trump has emboldened people with similar views on immigration in Europe.\n\n\"As human beings, sadly, we're built on a society that's about being comfortable,\" she said. \"People we look up to say something then we're going to do it.\"\n\nBut she added that she has an optimistic view, and hopes that by being herself and sharing her music she can challenge negative stereotypes: \"Deep inside, I know that people have a heart. People do care about civil rights, justice, equality.\"", "authors": ["Deena Zaru"], "publish_date": "2017-03-21", "source": "cnn", "top_words": ["thats", "travel", "stereotypes", "trump", "ban", "farida", "talks", "think", "going", "trumps", "youre", "texas", "music", "artist", "rb", "negative"], "summary": "Austin, Texas (CNN) President Donald Trump's latest travel ban, which temporarily bars refugees and people from six majority-Muslim countries from entering the country, has reinforced negative stereotypes about Arabs and Muslims, according to R&B artist Farida.\n\"I don't think that's really something that you can fix.\"\nShe said that anti-immigrant rhetoric championed by right-wing politicians in the United States is mirrored in Europe and is exacerbating negative stereotypes about Arabs and Muslims.\n\"If you're Arab, you're a terrorist,\" the Norwegian-Algerian singer said, describing the stereotypes her community wrestles with.\n\"It's just so sad that some people are going to have one voice that's going to mean so much to a nation,\" she added."}