{"url": "http://www.cnn.com/2017/06/26/politics/trump-travel-ban-decision/index.html", "id": "368", "title": "The Supreme Court finally handed Trump a travel ban victory", "text": "(CNN) Ever since Donald Trump signed the first executive order banning people from seven countries from entering the U.S. on January 27 , it's been nothing but trouble.\n\nWithin 24 hours of the EO being signed, judges in several states blocked the so-called \"travel ban\" from going into effect. Trump submitted a second executive order on March 6 taking the number of affected countries to six (Iraq was excluded from the 2nd ban). It was, again, immediately stopped by a lawsuit in Hawaii. Trump went on to lose a series of appeals in court.\n\nOn Monday, the Supreme Court actually handed Trump a win on the travel ban -- albeit not a complete one.\n\nThe Court decided to hear the full case in October but, in the meantime, knocked down the lower courts' move to completely shelve the ban. Instead, the Supremes ruled that some foreign nationals from the six states included in the second executive order could be kept from entering the U.S.\n\n\"In practical terms, this means that §2(c) may not be enforced against foreign nationals who have a credible claim of a bona fide relationship with a person or entity in the United States. All other foreign nationals are subject to the provisions of EO--2.\"\n\n\"All other foreign nationals are subject to the provisions of [Executive Order]--2,\" is the key line there -- affirming that a not-insignificant piece of the Trump travel ban can go into effect while the Court waits to rule on the constitutionality of the broader ban.\n\nWhat's less clear -- at least to me -- is what a \"bona fide relationship\" means. Is that blood connection? Close friend? And who decides what a \"credible\" claim of a \"bona fide\" relationship is?\n\nThat is a legal question, of course, not a political one. The political reality is far clearer: After a string of losses, Donald Trump just won one. And it's not a small one.\n\nWhile some legal observers suggested that the Court's initial ruling on the ban suggests that the nine justices will likely uphold the full ban come the fall, predicting what the Court will do is rarely a good gamble. (Predictions of how the Court would rule on the constitutionality of the Affordable Care Act were, literally, all over the place.)\n\nAnd, if the Court eventually rules that Trump doesn't have it within his powers to install a travel ban, Monday's ruling will be seen as a Pyrrhic victory.\n\nStill, good news -- on the travel ban or anything else -- has been hard to come by for Trump in his first 157 days in office. And this is good news -- particularly for the base voters that Trump has so carefully cultivated in his first months in office.\n\nConsider this: A CBS News poll conducted in late April showed that 53% opposed \"temporarily preventing people entering the U.S. from some majority Muslim countries.\" But, among self-identified Republicans almost three in four (72%) supported the ban.\n\nThis decision will be cheered by Trump's base. Trump himself will undoubtedly tout it as vindication for what he has insisted all along: That he has the power to institute this sort of ban. (\"Today's unanimous Supreme Court decision is a clear victory for our national security,\" Trump said in a statement Monday afternoon. \"It allows the travel suspension for the six terror-prone countries and the refugee suspension to become largely effective.\") Congressional Republicans, forever nervous about Trump's political prospects vis a vis their own, will breathe the slightest sigh of relief.\n\nBy the fall, this victory could look like a false positive. But, today it is a positive. And it looks a whole hell of a lot like an oasis for Trump in the political desert he has been trudging through of late.", "authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "publish_date": "2017-06-26", "source": "cnn", "top_words": ["executive", "travel", "nationals", "foreign", "trump", "ban", "supreme", "political", "handed", "court", "victory", "countries", "finally", "states"], "summary": "Within 24 hours of the EO being signed, judges in several states blocked the so-called \"travel ban\" from going into effect.\nOn Monday, the Supreme Court actually handed Trump a win on the travel ban -- albeit not a complete one.\nAnd, if the Court eventually rules that Trump doesn't have it within his powers to install a travel ban, Monday's ruling will be seen as a Pyrrhic victory.\nStill, good news -- on the travel ban or anything else -- has been hard to come by for Trump in his first 157 days in office.\n(\"Today's unanimous Supreme Court decision is a clear victory for our national security,\" Trump said in a statement Monday afternoon."}