{"url": "http://www.cnn.com/2017/03/15/politics/travel-ban-federal-hearings/index.html", "id": "311", "title": "Judges address legal future of travel ban Wednesday", "text": "(CNN) President Donald Trump's new travel ban is scheduled to go into effect Thursday, but several federal judges across the country may decide its legal fate just hours before midnight.\n\nTrump's new executive order bans foreign nationals from six Muslim-majority countries from entering the US for 90 days and bans all refugees for 120 days. But unlike his original executive order from January, those with green cards or valid visas are exempted from the ban.\n\nDespite these changes, several states and immigration advocates say the new order still suffers from legal flaws and have asked federal judges to weigh in by issuing temporary restraining orders blocking the ban before Thursday.\n\nCourts in Maryland and Hawaii agreed to hear oral arguments from both sides Wednesday and could issue decisions the same day.\n\nHere are the issues at play:\n\nHow different is the new executive order?\n\nDespite the fact that the President's senior policy adviser said the revised travel ban would have \"mostly minor technical differences\" from the iteration previously blocked by the courts, the Justice Department's position is crystal clear: the new executive order is \"substantially different.\"\n\nDOJ has argued in legal filings this week that challengers to the new order have no legal claim because: visa holders are now protected and exempted from the travel ban, the only foreigners who are excluded have no constitutional right to enter the US, and the new executive order contains \"robust waiver provisions,\" granting entry on a case-by-case basis for those who do not pose a national security risk, in any event.\n\nYet several states have urged judges to see that the new order still contains a 90-day ban on foreign nationals from Muslim-majority countries and a 120-day ban on all refugees -- two aspects of the old executive order that were explicitly suspended by federal courts.\n\n\"[T]he revised executive order is essentially old wine in a new bottle,\" said Cornell Law School Professor Stephen Yale-Loehr. \"It assumes that travelers from the six Muslim-majority countries and all refugees are inherent security risks.\"\n\nIn other words, the sticking point in the new executive order could come down to whether a judge agrees -- at least for the limited purposes of a restraining order blocking the order's implementation temporarily -- that the challengers have sufficiently shown that it discriminates on the basis of religion.\n\nLast time around, at least one federal judge in Virginia took note of Trump's campaign trail statements calling for a \"complete shutdown of Muslims entering the United States,\" and concluded that the state had produced \"unrebutted evidence\" that the travel ban \"was not motivated by rational national security concerns,\" but \"religious prejudice\" against Muslims.\n\nDOJ strongly disagrees with any such reading of the new executive order.\n\n\"(The) text and purpose (of the new executive order) are explicitly religion neutral, and it no longer grants any preference for victims of religious persecution,\" Justice Department attorneys argued in a court filing Monday.\n\nCan states still sue?\n\nSeveral of the states challenging the new executive order claim that it harms tourism and negatively affects foreign students for public universities.\n\nThe Justice Department says that argument is \"mere speculation.\"\n\nFor instance, \"Hawaii does not identify any particular persons it seeks to recruit who have concrete plans to relocate to Hawaii and join a state university or agency -- let alone specific plans to do so in the next 90 days,\" DOJ attorneys argue in legal briefs. \"Rather, the most Hawaii can say is that unidentified aliens might aspire to do so someday.\"\n\nYet the Ninth Circuit Court of Appeals, which tackled this threshold issue when evaluating the first executive order, saw no problem to states bringing the lawsuits -- at least for the initial stages of litigation.\n\n\"The necessary connection can be drawn in at most two logical steps: (1) the Executive Order prevents nationals of seven countries from entering Washington and Minnesota; (2) as a result, some of these people will not enter state universities, some will not join those universities as faculty, some will be prevented from performing research, and some will not be permitted to return if they leave,\" the appellate court wrote.\n\nThe question is whether courts this time will agree, especially since students or faculty members with existing valid visas are excluded from the new travel ban.\n\nConfusion at airports again?\n\nWhen the new executive order was signed last week, administration officials told reporters that the new order included a 10-day \"phase-in\" period to ensure that those traveling \"aren't placed in legal jeopardy,\" and in the hopes of avoiding the \"chaos\" seen at airports after the first travel ban was signed.\n\nBut now that judges have scheduled hearings to hear challenges to the new order Wednesday -- just hours before it is slated to go into effect at 12:01 a.m. on Thursday -- travelers at airports could experience confusion once again if any judge blocks the new order, either in full or in part.\n\nThe Department of Homeland Security did not immediately respond to a request for comment for this story.\n\nBut immigrant rights groups say they are prepared and will have attorneys stationed at airports if travelers experience any problems.\n\nThis story has been updated.", "authors": ["Laura Jarrett"], "publish_date": "2017-03-15", "source": "cnn", "top_words": ["executive", "future", "travel", "judges", "address", "hawaii", "ban", "security", "states", "federal", "order", "legal"], "summary": "(CNN) President Donald Trump's new travel ban is scheduled to go into effect Thursday, but several federal judges across the country may decide its legal fate just hours before midnight.\nTrump's new executive order bans foreign nationals from six Muslim-majority countries from entering the US for 90 days and bans all refugees for 120 days.\nBut unlike his original executive order from January, those with green cards or valid visas are exempted from the ban.\n\"[T]he revised executive order is essentially old wine in a new bottle,\" said Cornell Law School Professor Stephen Yale-Loehr.\nThe question is whether courts this time will agree, especially since students or faculty members with existing valid visas are excluded from the new travel ban."}