{"url": "http://www.cnn.com/2017/06/05/opinions/trump-shows-hand-on-travel-ban-tribe/index.html", "id": "349", "title": "Laurence Tribe: The true cluelessness of Trump's travel ban tweets", "text": "Story highlights Laurence Tribe: Tweets on travel ban show Trump doesn't get how judicial process works\n\nTribe: They also expose unchanged religious bigotry that underlies his executive orders\n\nLaurence H. Tribe is the Carl M. Loeb University professor and professor of constitutional law at Harvard Law School. Follow him on Twitter @Tribelaw and @ShadowingTrump and @ShallTakeCare.The opinions expressed in this commentary are solely those of the author.\n\n(CNN) Donald Trump's tweets in the wake of the London massacre Saturday night have become the subject of much speculation: Will they reduce the administration's chances of victory for its executive order banning travel to the United States from six majority-Muslim countries when the ban is taken up by the Supreme Court?\n\nLaurence H. Tribe\n\nPredictions either way are perilous, but one thing seems clear: It's not the President's return to calling his executive order a \"travel ban\" rather than a \"pause\" that matters in the tweets he has sprayed all over the globe.\n\nMany talking heads and tweeters seem to think this particular shift in terminology is somehow fatal to Trump's case because it erases his staff's careful efforts over the past few months to insist that Trump's executive order wasn't a ban on travel and shouldn't be called that. Those who think this are making a mistake.\n\nPeople, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN! — Donald J. Trump (@realDonaldTrump) June 5, 2017\n\nThe issue before the Supreme Court isn't whether the thing is a travel \"ban\" or a travel \"pause,\" but whether it's a barely disguised form of religious discrimination, one targeting believers in Islam (even though, of course, not all such believers). Part of what Trump tweeted over the past day or so does indeed bear on that issue.\n\nJUST WATCHED How will Trump's travel ban hold up in court? Replay More Videos ... MUST WATCH How will Trump's travel ban hold up in court? 01:37\n\nFor instance, the original version of the order included a pair of provisions giving express priority to minority religions that Trump publicly told groups of Christians was meant to help them, whereas those tell-tale provisions were conspicuously omitted from the version now before the court.\n\nRead More", "authors": ["Laurence H. Tribe"], "publish_date": "2017-06-05", "source": "cnn", "top_words": ["executive", "travel", "true", "cluelessness", "tweets", "trump", "ban", "court", "version", "trumps", "order", "tribe", "laurence"], "summary": "Story highlights Laurence Tribe: Tweets on travel ban show Trump doesn't get how judicial process worksTribe: They also expose unchanged religious bigotry that underlies his executive ordersLaurence H. Tribe is the Carl M. Loeb University professor and professor of constitutional law at Harvard Law School.\nLaurence H. TribePredictions either way are perilous, but one thing seems clear: It's not the President's return to calling his executive order a \"travel ban\" rather than a \"pause\" that matters in the tweets he has sprayed all over the globe.\nPeople, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!\nJUST WATCHED How will Trump's travel ban hold up in court?\nReplay More Videos ... MUST WATCH How will Trump's travel ban hold up in court?"}