{"url": "http://www.cnn.com/2017/07/14/us/five-things-july-14-trnd/index.html", "id": "378", "title": "5 things for Friday, July 14: Health care bill, President Trump, missing men, travel ban, overseas attacks", "text": "(CNN) You're in luck. Today is Pandemonium Day , giving you the perfect excuse to leave the dishes undone and the house a mess. Here's what else you need to know to Get Up to Speed and Out the Door . (You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here .)\n\n1. Health care bill\n\nGOP senators' latest attempt at fixing health care is a secret no more . It includes an amendment by Ted Cruz that would let insurers offer cheaper, bare-bones policies . Conservatives like that, but moderates don't, because they fear it would drive up premiums for folks with pre-existing conditions. The bill still includes cuts to Medicaid and keeps two Obamacare-era taxes on rich people. Is this version enough to get Majority Leader Mitch McConnell the 50 votes he needs to pass this thing ? We still don't know. Rand Paul said he won't even vote for a motion to debate the bill. Susan Collins says she won't either, until she sees the all-important CBO score, which is due out Monday.\n\n2. President Trump\n\nPresident Trump is enjoying Bastille Day in Paris , including watching a parade down the Champs-Elysees, but the Russia storm brewing back in Washington churns on . Trump, during a joint news conference with French President Emmanuel Macron, defended son Donald Trump Jr.'s meeting with a Russian lawyer, saying most people working on a campaign would have taken that meeting (nope, says former Rep. Steve Israel, who's actually conducted opposition research ). Trump also said he didn't know about the meeting until a couple of days ago and that he's open to his son testifying about it.\n\n3. Pennsylvania missing men\n\nWhat happened to four young men who disappeared in Pennsylvania is a mystery no more. Cosmo Dinardo confessed to involvement in the killings of the men, his attorney said, though he wouldn't say if Dinardo actually killed them. In exchange for the confession, prosecutors say they won't seek the death penalty. Dinardo was already in custody; he'd been charged with stealing and trying to sell one of the men's cars. Dinardo reportedly told police where to find the bodies. The body of one man, Dean Finocchiaro, was found on property owned by Dinardo's parents, buried with other human remains.\n\nJUST WATCHED Lawyer: Man confesses in case of missing men Replay More Videos ... MUST WATCH Lawyer: Man confesses in case of missing men 01:05\n\n4. Travel ban\n\nJUST WATCHED The six countries banned by Trump Replay More Videos ... MUST WATCH The six countries banned by Trump 02:14\n\n5. Overseas attacks\n\nIn Jerusalem, two Israeli police officers were killed this morning when three men launched a shooting attack in the Old City. Police killed the attackers. The attack occurred near one of the world's most important religious sites, called the Noble Sanctuary by Muslims and the Temple Mount by Jews.\n\nJUST WATCHED Police: 2 injured in Jerusalem shooting Replay More Videos ... MUST WATCH Police: 2 injured in Jerusalem shooting 00:56\n\nAnd in London, police are looking for suspects in a string of acid attacks . At least two suspects rode on mopeds in east London, throwing acid on people, police said. One male teenager has been arrested. The attacks all happened within about an hour of each other. Five men were hospitalized, including one who suffered life-changing facial injuries. Robbery may have been a motive.\n\nNUMBER OF THE DAY\n\n17\n\nThat's how many years are left before the Social Security trust fund is tapped out , meaning future retirees (like a certain, unnamed newsletter writer) will only get about three-quarters of their benefits. Congress is being urged to act.\n\nJUST WATCHED Mulvaney: Trump wants to protect entitlements Replay More Videos ... MUST WATCH Mulvaney: Trump wants to protect entitlements 01:32\n\nBREAKFAST BROWSE\n\nPeople are talking about these. Read up. Join in.\n\nCrazy in love\n\nBeyonce is a habitual internet breaker, and early this morning, she broke it again with the first pics of her twins\n\nSir Carter and Rumi 1 month today. 🙏🏽❤️👨🏽👩🏽👧🏽👶🏾👶🏾 A post shared by Beyoncé (@beyonce) on Jul 13, 2017 at 10:10pm PDT\n\nHelp me\n\nATMs are supposed to give you money, but sometimes you get a note from the repairman who got stuck inside of it\n\nBest kid on the block\n\nDonnie Wahlberg's never forgotten his blue-collar roots. That's probably why he left a $2,000 tip for his servers at Waffle House.\n\nThey never learn\n\nUnited's considering a new system where the airline can resell your seat . But wasn't screwing around with seats what got them in trouble in the first place?\n\nQUOTE OF THE DAY\n\n\"I think it's really important to know what you don't know and listen to people who do know what you don't know\"\n\nFormer President George W. Bush, appearing at an event with former President Bill Clinton, stressing the importance of humility in the Oval Office\n\nJUST WATCHED Bush, Clinton stress humility in presidency Replay More Videos ... MUST WATCH Bush, Clinton stress humility in presidency 01:02\n\nAND FINALLY ...\n\nNo, no, no", "authors": ["Doug Criss"], "publish_date": "2017-07-14", "source": "cnn", "top_words": ["replay", "travel", "missing", "trump", "men", "videos", "watch", "dont", "know", "overseas", "things", "dinardo", "president", "health", "bill", "watched", "care"], "summary": "Health care billGOP senators' latest attempt at fixing health care is a secret no more .\nWe still don't know.\nJUST WATCHED Lawyer: Man confesses in case of missing men Replay More Videos ... MUST WATCH Lawyer: Man confesses in case of missing men 01:054.\nTravel banJUST WATCHED The six countries banned by Trump Replay More Videos ... MUST WATCH The six countries banned by Trump 02:145.\nJUST WATCHED Mulvaney: Trump wants to protect entitlements Replay More Videos ... MUST WATCH Mulvaney: Trump wants to protect entitlements 01:32BREAKFAST BROWSEPeople are talking about these."}