{"url": "http://www.cnn.com/2017/08/22/politics/nikki-haley-donald-trump-afghanistan/index.html", "id": "383", "title": "Nikki Haley: Trump 'listened to his generals' on Afghanistan", "text": "Story highlights Haley praised Trump's speech\n\nShe defended his past statements on pulling out of Afghanistan\n\nWashington (CNN) US Ambassador to the United Nations Nikki Haley said Tuesday that President Donald Trump's announced plan for a path forward in Afghanistan came to be because he \"listened to his generals.\"\n\n\"We're going to stomp out terrorism,\" she told CNN's Chris Cuomo on \"New Day.\" \"What you saw was he listened to his generals. He saw what they were saying, but he also talked about the path forward, and I think he came out with a very strong speech last night that the military, the diplomats and citizens of this country should be very proud of.\"\n\nHaley repeatedly praised Trump for his speech, saying his plan is \"focused on results.\"\n\n\"I think we all as Americans should want this President and our military to be successful,\" she told Cuomo. \"We're not talking about duration, because we're not focused on time. We're not talking about troop numbers because we're not focused on troop numbers. What we are focused on is results, stomping out terrorism, doing whatever it takes.\"\n\nWhen asked about Trump's past statements on Afghanistan -- in which he slammed the Bush and Obama administrations for keeping troops in the country -- Haley said Trump's changed his opinion on the matter.\n\nRead More", "authors": ["Daniella Diaz"], "publish_date": "2017-08-22", "source": "cnn", "top_words": ["generals", "trump", "nikki", "afghanistan", "listened", "focused", "told", "talking", "speech", "think", "troop", "trumps", "statements", "haley", "terrorism"], "summary": "Story highlights Haley praised Trump's speechShe defended his past statements on pulling out of AfghanistanWashington (CNN) US Ambassador to the United Nations Nikki Haley said Tuesday that President Donald Trump's announced plan for a path forward in Afghanistan came to be because he \"listened to his generals.\"\n\"We're going to stomp out terrorism,\" she told CNN's Chris Cuomo on \"New Day.\"\nHaley repeatedly praised Trump for his speech, saying his plan is \"focused on results.\"\nWe're not talking about troop numbers because we're not focused on troop numbers.\nWhen asked about Trump's past statements on Afghanistan -- in which he slammed the Bush and Obama administrations for keeping troops in the country -- Haley said Trump's changed his opinion on the matter."}