{"url": "http://www.cnn.com/2017/08/16/politics/donald-trump-crisis/index.html", "id": "381", "title": "Donald Trump's presidency is headed to a very dark place", "text": "(CNN) Donald Trump's insistence Tuesday that \"both sides\" were responsible for the violent protests in Charlottesville, Virginia , has turned what was a fumbling presidency into what now appears to be one on the verge of total collapse.\n\n\"You had a group on one side that was bad, and you had a group on the other side that was also very violent, and nobody wants to say that, but I'll say it right now,\" Trump told reporters at a press availability Tuesday in New York City.\n\nThat stance was a reversal from comments Trump made 24 hours earlier, condemning the white supremacists and neo-Nazis who had gathered in Charlottesville to protest the removal of a confederate statue. It was, however, broadly in line with what Trump said Saturday even as the protests were raging -- arguing that there was plenty of blame \"on many sides\" for the violence.\n\nTrump's comments on Tuesday provoked massive, across-the-board outrage with virtually every Republican elected official in the country expressing their disagreement and disapproval with Trump's sentiments, although, notably, most did not call out the President by name.\n\n\"The presidency is the most important job in the country,\" Ohio Gov. John Kasich said on NBC's \"Today\" show Wednesday . \"And there is a bitterness setting in that may not be able to be removed.\"\n\nTake one giant step back. What you have here is a presidency that is just 208 days old that finds itself in total and complete crisis. And, it's not simply a political crisis. It's a moral one too. And it's entirely self inflicted.\n\nConsider where we are.\n\nThe President of the United States has spent the last 24 hours creating some sort of moral equivalency between hate-mongers and those there to protest hate. In doing so, he has handed these white supremacists and neo-Nazis exactly what they want: Cover for their hate-filled rhetoric. Make no mistake: For the bigots and supremacists who gathered in Charlottesville, what Trump said on Saturday and again yesterday marks a major win, a success in their efforts to push their venomous views into the mainstream.\n\nThat failure of moral leadership comes on top of a series of political failures over the first six months of Trump's presidency. Health care has not been repealed or replaced. Trump's so-called \"travel ban\" remains largely in legal limbo. Resignations and firings of a number of top White House advisers have left questions about who is really in charge -- if anyone. An ongoing special counsel continues to investigate Russia's meddling in the 2016 election and possible collusion with members of Trump's campaign. Trump's job approval rating sits in the mid 30s , a historic low point for a president at this stage of his term.\n\nAnd, at the center of it all, is Trump. A man bent on settling every score. A man who takes every slight -- real or perceived -- personally. A man unwilling to grasp the mantle of moral and political leadership the presidency grants him. A man who will not change and, worse, is so wrapped up in his bouts of personal pique that he can't see the damage he is doing to his party and, more importantly, the country.\n\nWhat had been a slow-motion political collapse over these past 207 days turned into a fast-motion moral collapse on Tuesday. Which leads to this question: What now? What do Republicans -- and the rest of the country -- do now, with the sure knowledge that Trump won't change and, if he keeps on this present course, seems likely to do lasting damage to the office to which he is elected?\n\nImpeachment has long been on the lips of some Democrats. But that is a difficult process that it's hard to imagine, still, a majority of Republicans in the Congress are willing to pursue. Trump has broken no laws. His mistakes, while massive and morally reprehensible, are not illegal.\n\nJUST WATCHED Trump's words are making racism OK Replay More Videos ... MUST WATCH Trump's words are making racism OK 02:00\n\nShort of impeachment then, what is there to do? Tweets of condemnation, which appear to be the preferred method of communication for Republican elected officials in the immediate aftermath of Trump's comments Tuesday, feel inadequate to address the scope of Trump's abdication of leadership.\n\nThe problem for Republicans -- and the rest of us -- is that, short of impeachment, there simply aren't that many levers to pull to rein in Trump. The executive branch has grown more and more powerful over the past few decades. And, Trump has shown a willingness to use -- and expand -- its power even within his first 200 days in the office.\n\nHe is also the duly elected president of the United States. He won, fair and square. While it seems hard to believe that nearly 63 million Americans voted for this sort of \"leadership\" from Trump, it's equally impossible to convince yourself that voters didn't have some sense of what they were getting when they voted for him.\n\nWhile the paths forward remain very murky, what's crystal clear is this: Trump won't change. And on his current path, this is a presidency that will collapse around him.\n\nThat's, obviously, bad for Trump. It's bad for Republicans. But, most importantly, it's bad for America. We need moral leadership. And we're not getting it out of the White House right now. And it doesn't appear that's going to change.", "authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "publish_date": "2017-08-16", "source": "cnn", "top_words": ["trump", "dark", "place", "political", "republicans", "man", "donald", "president", "trumps", "presidency", "leadership", "white", "moral", "headed"], "summary": "What you have here is a presidency that is just 208 days old that finds itself in total and complete crisis.\nThat failure of moral leadership comes on top of a series of political failures over the first six months of Trump's presidency.\nAn ongoing special counsel continues to investigate Russia's meddling in the 2016 election and possible collusion with members of Trump's campaign.\nA man unwilling to grasp the mantle of moral and political leadership the presidency grants him.\nWe need moral leadership."}