{"url": "http://www.cnn.com/2017/06/05/politics/cuomo-and-gorka-spar-cnntv/index.html", "id": "350", "title": "Chris Cuomo, Trump aide tangle over 'travel ban' tweets", "text": "Story highlights Cuomo and Gorka clashed over who was the true purveyor of spin\n\nGorka said Trump can say whatever he wants as President\n\n(CNN) Sparks flew between CNN's Chris Cuomo and White House national security aide Sebastian Gorka Monday over whether or not President Donald Trump's morning tweets on the \"travel ban\" matter.\n\nGorka said Trump may call the executive order anything he wants because he's President.\n\n\"There are no games,\" he said on \"New Day.\" \"The President can call it whatever he likes because he has the constitutional authority to control whoever comes into the country, Chris. That's his job.\"\n\n\"The Constitution, tradition, precedence and administrative law give him that right,\" he continued. \"If he wants to call it a ban, he's the President, he's the chief officer of this administration, and he has every right to do that.\"\n\nUpon being pressed by Cuomo about why the administration previously wouldn't say \"travel ban,\" Gorka turned aggressive.", "authors": ["Lindsey Ellefson"], "publish_date": "2017-06-05", "source": "cnn", "top_words": ["hes", "travel", "wants", "trump", "tweets", "chris", "ban", "right", "aide", "gorka", "cuomo", "president", "tangle", "say"], "summary": "Story highlights Cuomo and Gorka clashed over who was the true purveyor of spinGorka said Trump can say whatever he wants as President(CNN) Sparks flew between CNN's Chris Cuomo and White House national security aide Sebastian Gorka Monday over whether or not President Donald Trump's morning tweets on the \"travel ban\" matter.\nGorka said Trump may call the executive order anything he wants because he's President.\n\"The President can call it whatever he likes because he has the constitutional authority to control whoever comes into the country, Chris.\n\"If he wants to call it a ban, he's the President, he's the chief officer of this administration, and he has every right to do that.\"\nUpon being pressed by Cuomo about why the administration previously wouldn't say \"travel ban,\" Gorka turned aggressive."}