{"url": "http://www.cnn.com/2017/05/15/politics/9th-circuit-travel-ban-hearing-round-two/index.html", "id": "334", "title": "9th Circuit presses Trump admin on travel ban", "text": "(CNN) For the second time in President Donald Trump's young administration, the 9th US Circuit Court of Appeals pressed the Justice Department to explain the legality of his travel ban, this time with Trump's record of campaign calls to ban Muslims from entering the US taking center stage.\n\nThe three judges on the panel -- all appointees of former President Bill Clinton -- peppered the parties with questions in an hour-long televised hearing Monday, appearing eager to flesh out exactly when the court might be allowed to look behind the plain text of the President's executive order find a discriminatory purpose.\n\nTwo months ago, a federal judge in Hawaii halted the core portions of Trump's revised travel ban just hours before it was slated to go into effect nationwide, finding it likely violated the Constitution by disfavoring Muslims.\n\nTrump immediately slammed the decision as \" an unprecedented judicial overreach \" and later tweeted about his frustrations with the West Coast-based 9th Circuit over an unrelated case.\n\nBut on Monday, acting Solicitor General Jeffrey Wall, arguing on behalf of the Trump administration, urged the judges not to delve into a \"wide ranging inquiry into subjective motivation\" in considering Trump's past comments on Muslims, because \"the (executive) order on its face doesn't have anything to do with religion and in operation doesn't distinguish on the basis of religion.\"\n\nNeal Katyal, arguing on behalf of the plaintiffs, countered that they are not in favor of judicial \"psychoanalysis\" or trying to get in President's head, but suggested Trump's past statements evinced a \"repeated pattern\" that any neutral observer would find clear.\n\n\"Does that mean the President is forever barred from issuing an executive order along these lines?\" Judge Richard Paez asked.\n\nKatyal said no, suggested he wouldn't be arguing the case if it involved past campaign statements alone, pointed out that the President has never disavowed his past statements and noted a December 2015 press release calling for a \"complete shutdown\" of Muslims entering the country remained on Trump's campaign website up until early last week\n\n\"I think the most important point is if you don't say all these things, you never wind up with an executive order like this, which is why no president has done that,\" Katyal added. \"If you rule for him, you defer to the President in a way that history teaches us is very dangerous. You open the door to so much.\"\n\nThe judges did not indicate when they will rule. In February, the court handed down a decision declining to reinstate the first travel ban just two days after oral arguments.\n\nLimits of presidential power\n\nThis is the second time the 9th Circuit has been tasked with deciding the immediate fate of the President's travel ban.\n\nIn February, a federal judge in Seattle halted the original travel ban nationwide, and a three-judge panel on the 9th Circuit declined to reinstate it -- unanimously unpersuaded by the Trump administration's national security arguments and doubting travelers had been given adequate \"due process,\" such as \"notice and a hearing prior to restricting an individual's ability to travel.\"\n\nBut unlike the due process concerns driving the analysis in the last round, this time the different panel of judges appeared to wrestle with Trump's past statements about Muslims as it decides whether the lower court in Hawaii correctly blocked the revised ban.\n\n\"The executive order sets out national security justifications, but how is a court to know whether in fact it's a Muslim ban in the guise of national security justification?\" asked Judge Ronald Gould.\n\nWall suggested that Supreme Court precedent should marshal against the judges \"second-guessing\" the President's \"national security determinations that they're sort of ill-equipped to do.\"\n\nBut Paez seemed troubled by the logical conclusion of Wall's argument, asking him if the executive order at issue in the infamous case of Korematsu v. United States -- which ordered Japanese Americans into internment camps during World War II -- would \"pass muster\" under Wall's theory today.\n\n\"No, Judge Paez,\" Wall immediately responded. \"I want to be very clear about this. This case is not Korematsu and if it were I wouldn't be standing here and the United States would not be defending it.\"\n\n\"I know (the plaintiffs) disagree with this president and many of his policy judgments but none of that converts this into a constitutional crisis,\" Wall added. \"And we respectfully submit that this court shouldn't treat it like one. It ought to leave this debate where it belong, its in the political arena.\"\n\nTravel ban headed to SCOTUS?\n\nThe 9th Circuit isn't the only appeals court currently evaluating Trump's executive order.\n\nThe Justice Department separately appealed a different federal judge's decision to halt the 90-day travel ban to the 4th US Circuit Court of Appeals. The court heard arguments for two hours last week , but no word yet on when it might rule.\n\nIn the event the two appellate courts reach different results, the travel ban will not go back into effect as long as one court's nationwide injunction remains in effect. But experts say such a scenario undoubtedly puts the case on track for review by the US Supreme Court.\n\n\"There's no guarantee that the 13 4th Circuit judges who heard argument last week will hand down their ruling before the three 9th Circuit judges hearing Monday's argument will,\" said Steve Vladeck, CNN legal analyst and professor of law at the University of Texas School of Law. \"The real question, though, isn't the timing, but whether the two courts come out the same way. This issue may be bound for the Supreme Court no matter what, but it will certainly be heard by the justices if these lower courts disagree.\"\n\n\"No matter how the two courts rule, I predict this case will go to the Supreme Court,\" agreed Cornell Law School professor Stephen Yale-Loehr. \"The issue is too important for the Supreme Court to pass up.\"", "authors": ["Laura Jarrett"], "publish_date": "2017-05-15", "source": "cnn", "top_words": ["executive", "travel", "judges", "trump", "ban", "circuit", "9th", "court", "presses", "trumps", "order", "president", "admin"], "summary": "Trump immediately slammed the decision as \" an unprecedented judicial overreach \" and later tweeted about his frustrations with the West Coast-based 9th Circuit over an unrelated case.\nIn February, the court handed down a decision declining to reinstate the first travel ban just two days after oral arguments.\nLimits of presidential powerThis is the second time the 9th Circuit has been tasked with deciding the immediate fate of the President's travel ban.\nThe 9th Circuit isn't the only appeals court currently evaluating Trump's executive order.\nThe Justice Department separately appealed a different federal judge's decision to halt the 90-day travel ban to the 4th US Circuit Court of Appeals."}