{"url": "http://www.cnn.com/2017/08/23/americas/canada-asylum-seekers-from-united-states/index.html", "id": "384", "title": "His greatest hope at freedom is escaping the US and being arrested", "text": "\"I have lots of family in Haiti and wanted to bring them to the United States, but I don't have residency,\" Frederic says. \"I thought about them every day, my wife and kids.\"\n\nAt a dead end called Roxham Road, Frederic is crossing a narrow ditch that separates the United States and Canada.\n\nCanadian police wait patiently on the other side. They warn anyone who approaches that what they're about to do is illegal, that they'll be arrested.\n\nBut that's the first step. Once arrested, Frederic, and the thousands of others who have made this journey across to Quebec in the past few weeks, can apply for asylum in Canada. He hopes that would mean a chance at uniting with his family that remains in Haiti after 17 years apart. Then, he hopes, his family could apply to for asylum to become Canadian residents too.\n\nIn the past month, Greyhound and other bus lines have been packed with immigrants -- primarily Haitians -- making this exact trip from the United States into Canada. They have taken trains, buses, often multiple, to get to Plattsburgh, New York.\n\nFrom there, they hail a taxi to the border. On this day, Frederic is one of a stream of almost 300 crossing, dragging whatever belongings they can with them. Haitians flooded to the United States after a cholera outbreak in 2010, as well as after the devastating earthquake the same year.\n\nFrederic, like 59,000 other Haitians in the United States, has \"temporary protected status,\" known as TPS, given to Haitians after the earthquake.\n\ntwo months has been accelerated, infused with new urgency: But the gradual exodus from the U.S. over the pasttwo monthshas been accelerated, infused with new urgency: the Trump administration has warned it will not renew the TPS , which is currently set to expire in January 2018.\n\nFrederic is fearful that means he would be kicked out of the US.\n\n\"I'm scared because every day I hear different news,\" Frederic says. \"That's why I'm leaving the United States for Canada.\"\n\n. It has created bottleneck at the border with more than 1,000 people waiting to be processed in Red Cross tents, according to the RCMP. Canadian authorities have scrambled to manage an \"unprecedented\" surge of asylum seekers coming over the border into Quebec province. So many people have been fleeing in the past few months that Canadian police have set up tents for processing and background checksIt has created bottleneck at the border with more than 1,000 people waiting to be processed in Red Cross tents, according to the RCMP.\n\n\"We've never seen those numbers,\" said Royal Canadian Mounted Police (RCMP) spokesman Claude Castonguay. \"Even though our officers are patrolling 24 hours a day all year long, we've never seen such numbers coming in.\"\n\nRCMP intercepted almost 7,000 asylum seekers in the last six weeks in Quebec. 3,000 of those were in July, RCMP says, and almost 4,000 in just the first half of August.\n\nCrossings mount, driven by fear\n\n13-year-old Melissa Paul talks with Canadian officials at the border as she crosses with her mother.\n\nBroadly, asylum seekers point to their growing unease about the Trump administration's attitudes toward immigrants. They also point to the racism they say was unleashed after President Trump's election as motivation for driving them to pick up and head to Canada.\n\nMimose Joseph and her 13-year-old daughter, Melissa Paul, are trying to find their taxi for the ride from Plattsburgh to the border.\n\nThey had taken a series of trains and buses from their home in Belle Glade, Florida, a state Joseph has called home since 2002.\n\nJoseph does not speak any English, but her daughter Melissa was born in Florida and is a US citizen. The 13-year-old explains the pair made this trip to Canada, uprooting her adolescence, because of the growing pressure on her,\n\n\"She's been through a lot and has stayed here for almost 15 years, and she doesn't want any stress anymore,\" Paul says.\n\nThey, too, hope Canada will take them in permanently and allow brothers and sisters to join her. But for Melissa, it means leaving the only country she has ever known.\n\n\"It's kind of shocking and a little bit sad,\" she says.\n\nIt's not going to be an open door. Francine Dupuis, refugee assistance agency\n\nHundreds have been crossing the border each day in the last two months, according to PRAIDA, a provincial government agency that works under Quebec's Immigration Ministry and focuses on helping new arrivals resettle. Immigration officials say 250 people are coming across the border illegally each day.\n\n\"Definitely, there is a movement. People are talking to one another and they are suggesting that it is very easy to cross the border and they think that they will automatically become Canadian,\" PRAIDA Associate CEO Francine Dupuis says.\n\nCanada has already done away with its version of TPS for Haitians, making it more difficult to claim asylum, Dupuis says.\n\nJust because some asylum seekers are poor, or come from poverty-stricken countries, she says, that does not automatically make them refugees nor guarantee asylum.\n\n\"It's not going to be an open door,\" Dupuis says. \"That's definitely not (the case) and it's sad because we do think that many of them believe that they are here to stay, which is not necessarily true.\"\n\nAn Olympic stadium becomes a refuge\n\nThe stadium that brought together countries in the 1976 Olympics is now temporary housing for asylum seekers.\n\nSo many asylum seekers now see Canada as a more welcoming country to find refuge and rebuild their lives that traditional sheltering options used during slower times are overflowing. 3,200 are in temporary housing in Montreal, Dupuis says.\n\nThe numbers have grown so much that Montreal's Olympic Stadium, which was home to the 1976 games, is now housing about 700 newcomers, Dupuis says.\n\nA ticket stub left behind shows a person took four buses to reach the Canadian border for asylum.\n\nThe idea, Dupuis says, is to get them comfortable temporary housing but move them through the system as quickly as possible into more permanent lodging.\n\nThe vast majority of asylum seekers these days are Haitian, officials say. There are others from Syria and Yemen, fleeing the wars in their countries.\n\n\"What they want is a normal life, they want to study, they want to work, they want to have their families with a perspective of stability and this isn't something they seem to be getting now in the (United) States, unfortunately,\" Dupuis says. \"They don't know what is going to happen and that creates anxiety, a lot of anxiety.\"\n\n'I still love the USA ... it's just the administration'\n\nNidal al-Yamani is among many who received temporary housing at the YMCA in Montreal.\n\nThe YMCA on Montreal's Tupper Street has long served as the first stop for asylum seekers coming from the United States, but these days it is bursting. Its 600 beds are all full.\n\nNidal al-Yamani, 26, is standing outside. The Yemeni was living in Alabama on a student visa before he crossed into Canada on July 4. Yemen is one of the six Muslim-majority countries on the Trump administration's travel ban.\n\n\"After the ban, everybody knows Yemen. Only the bad things about Yemen,\" al-Yamani says.\n\nI don't think I'm welcome anymore. Nidal al-Yamani, asylum seeker\n\nHe says he no longer felt comfortable in America and experienced several racist incidents.\n\n\"The mood changed and the new administration, they give the green light to the people who were racist (who weren't previously) showing it,\" al-Yamani says.\n\nAl-Yamani has since moved out of the YMCA into more permanent lodgings as his case is processed. He has a higher chance of succeeding than the Haitians, coming from a country wracked by war, immigration officials say. Already, he says, he feels more at home and accepted in Canada.\n\n\"I still love USA. As a people, as a community, as everything. It's just the administration, and maybe the system, that affected me,\" he says. \"Even if I try to go back to the United States I don't think I'm welcome anymore.\"\n\nCanadian Prime Minister Justin Trudeau and his government are bracing for more people like Al-Yamani to make their way into Canada. On Wednesday he met with a task force of federal and provincial officials charged with managing the influx of asylum seekers.\n\nThose from nine other countries besides Haiti may begin to make their way north too, as their TPS is currently set to expire in the next year. Among them, Honduras and Syria and Al-Yamani's home country of Yemen. It is unclear if the US will extend the TPS for the other countries.\n\nTrudeau said immigrants were a positive for Canada: \"Being welcoming and opening is a source of strength,\" he told reporters.\n\nBut he stressed no one was getting a free pass by entering Canada, especially at unauthorized crossing points.\n\n\"There are no advantages in terms of the immigration system to arrive irregularly versus arriving regularly,\" he says. \"The same systems will be followed whether it's the very strong and rigorous immediate security checks or whether it's the careful evaluation of their file.\"", "authors": ["Alexander Marquardt", "Ann Roche", "Francine Dupuis", "Refugee Assistance Agency", "Nidal Al-Yamani", "Asylum Seeker"], "publish_date": "2017-08-23", "source": "cnn", "top_words": ["arrested", "seekers", "alyamani", "freedom", "united", "asylum", "states", "dupuis", "escaping", "border", "haitians", "greatest", "canadian", "hope", "canada"], "summary": "\"I have lots of family in Haiti and wanted to bring them to the United States, but I don't have residency,\" Frederic says.\nAt a dead end called Roxham Road, Frederic is crossing a narrow ditch that separates the United States and Canada.\nFrederic, like 59,000 other Haitians in the United States, has \"temporary protected status,\" known as TPS, given to Haitians after the earthquake.\nAn Olympic stadium becomes a refugeThe stadium that brought together countries in the 1976 Olympics is now temporary housing for asylum seekers.\nOn Wednesday he met with a task force of federal and provincial officials charged with managing the influx of asylum seekers."}