{"url": "http://www.cnn.com/2017/08/14/politics/trump-republicans-criticism/index.html", "id": "380", "title": "9 times Republicans denounced Trump but came back to him", "text": "(CNN) In the wake of President Donald Trump's less-than-full-throated condemnation of the neo-Nazis and white supremacist violence over the weekend in Charlottesville, Virginia, a number of Republican leaders expressed disappointment that the President had not gone further.\n\n\"Mr. President - we must call evil by its name,\" tweeted Sen. Cory Gardner of Colorado. \"These were white supremacists and this was domestic terrorism.\"\n\nAnd, this from Utah Sen. Orrin Hatch : \"We should call evil by its name. My brother didn't give his life fighting Hitler for Nazi ideas to go unchallenged here at home.\"\n\nThese Republicans were cheered for making clear that Trump's initial statement Saturday -- he delivered a more-forceful-but-still-flawed one on Monday -- was inadequate. And, rightly so. Speaking out on matters of moral importance to our society should always be cheered.\n\nBut, a look back at the two-plus years since Trump burst onto the political scene suggests a disturbing pattern -- which goes like this:\n\n1. Trump says or does something controversial or just plain wrong.\n\n2. Republican elected leaders condemn him for it.\n\n3. Trump never apologizes or acknowledges any sort of remorse or wrongdoing.\n\n4. Republican elected officials carry on in support of Trump and his agenda.\n\nI plucked out nine of the most high-profile instances in which Republican condemnation of Trump turned to acceptance. These are in no order other than that in which I recalled them.\n\n* 'Access Hollywood'\n\nThe emergence of audio (and video) of Trump graphically telling \"Access\" host Billy Bush that women will let you do whatever you want to them if you have money brought widespread condemnation down on Trump. Sens. Mike Lee of Utah and Ben Sasse of Nebraska called for him to drop out of the race. Then-Illinois Sen. Mark Kirk rescinded his endorsement of Trump. Speaker Paul Ryan said he would no longer advocate for Trump's candidacy, focusing instead on keeping the Republican majority in the House.\n\n* John McCain\n\nJUST WATCHED CNN's report from July of 2015. Replay More Videos ... MUST WATCH CNN's report from July of 2015. 02:35\n\nAt an event in Ames, Iowa, in July 2015 , Trump said this of Arizona Sen. John McCain: \"He's not a war hero. He's a war hero because he was captured. I like people who weren't captured.\" (McCain spent more than five years in a North Vietnamese prison camp and suffered lifelong injuries from the beatings he endured.) A number of Trump's 2016 primary opponents -- Bobby Jindal, Jeb Bush, Rick Perry -- blasted Trump for the comment. \"Enough with the slanderous attacks. @SenJohnMcCain and all our veterans - particularly POWs have earned our respect and admiration,\" Bush tweeted.\n\n* Khizr Khan\n\nJUST WATCHED Khizr Khan's powerful DNC speech (Full speech) Replay More Videos ... MUST WATCH Khizr Khan's powerful DNC speech (Full speech) 06:03\n\nFor many Democrats, the speech delivered by Khizr Khan, a Muslim-American man whose son had been killed in Iraq in 2004 was the emotional high point of the party's national convention in 2016. For Trump, it was another chance to attack someone who attacked him.\n\n\"Who wrote that? Did Hillary's scriptwriters write it?\" Trump said in an interview with ABC News' George Stephanopoulos right after the Democratic convention. Trump also responded directly to the attack from Khan that the Republican nominee had never known true sacrifice: \"I think I've made a lot of sacrifices,\" Trump said. \"I work very, very hard.\"\n\nThe attack on a Gold Star family forced Republicans in droves to condemn Trump . \"America's greatness is built on the principles of liberty and preserved by the men and women who wear the uniform to defend it,\" Ryan said. \"I agree with the [Khans] and families across the country that a travel ban on all members of a religion is simply contrary to American values,\" Senate Majority Leader Mitch McConnell added.\n\n* Gonzalo Curiel\n\nJUST WATCHED Man's deportation tests Trump's stance on DACA Replay More Videos ... MUST WATCH Man's deportation tests Trump's stance on DACA 02:58\n\nAt a campaign rally in May 2016 in San Diego, Trump took out after Gonzalo Curiel, the judge in a lawsuit against Trump University.\n\n\"Everybody says it, but I have a judge who is a hater of Donald Trump, a hater,\" Trump said. \"He's a hater. His name is Gonzalo Curiel.\"\n\nTrump went on to insinuate that Curiel's Mexican heritage -- though the judge was born in Indiana -- meant that he couldn't offer a fair ruling because of Trump's position on building a wall on the US' southern border.\n\n* David Duke\n\nJUST WATCHED Trump refused during an interview with Jake Tapper in 2016 to disavow white supremacist David Duke. He later did disavow Duke Replay More Videos ... MUST WATCH Trump refused during an interview with Jake Tapper in 2016 to disavow white supremacist David Duke. He later did disavow Duke 09:16\n\nIn February 2016, Trump was asked -- again, by Tapper -- about David Duke, a prominent white supremacist who had endorsed him days earlier.\n\n\"Just so you understand, I don't know anything about David Duke, OK?\" Trump told Tapper . \"I don't know anything about what you're even talking about with white supremacy or white supremacists. So I don't know. I don't know -- did he endorse me, or what's going on? Because I know nothing about David Duke; I know nothing about white supremacists.\"\n\nHe later blamed a \"bad earpiece\" for not issuing an immediate condemnation of Duke. \"Any candidate who cannot immediately condemn a hate group like the KKK does not represent the Republican Party and will not unite it,\" said South Carolina Sen. Tim Scott\n\n* Serge Kovaleski\n\nReporter Serge Kovaleski, left, in New York City in 2010.\n\nDuring the campaign, Trump claimed that he remembered Muslims celebrating on New Jersey rooftops on September 11, 2001. Kovaleski was a reporter for The Washington Post at the time, had investigated those reports and found nothing to them.\n\nSo, Trump turned his ire on the reporter in a rally in South Carolina in November 2015. \"Now, the poor guy, you ought to see this guy, 'Ah, I don't know what I said, I don't remember, I don't remember, maybe that's what I said,'\" Trump said, wildly flailing his arms . That gesturing was widely interpreted as Trump mocking Kovaleski who has arthrogryposis, a congenital condition that creates arm movements very similar to those Trump used to describe the reporter. ( You can watch for yourself here .)\n\n* Mika Brzezinski\n\nJUST WATCHED Trump tweets insults at Mika Brzezinski Replay More Videos ... MUST WATCH Trump tweets insults at Mika Brzezinski 01:28\n\nIn late June, Trump said the \"Morning Joe\" host had come to Mar-a-Lago and wanted a meeting. \"She was bleeding badly from a face-lift. I said no!,\" he tweeted . South Carolina Sen. Lindsey Graham responded via Twitter : \"Mr. President, your tweet was beneath the office and represents what is wrong with American politics, not the greatness of America.\" Tweeted Sasse : \"Please just stop. This isn't normal and it's beneath the dignity of your office.\"\n\n* Megyn Kelly\n\nJUST WATCHED Highlights of the Donald Trump vs Megyn Kelly battle Replay More Videos ... MUST WATCH Highlights of the Donald Trump vs Megyn Kelly battle 03:10\n\nTrump, unhappy with the the way the one-time Fox News anchor moderated a Republican primary debate, took after Megyn Kelly. \"You could see there was blood coming out of her eyes,\" Trump told CNN's Don Lemon on Friday night. \"Blood coming out of her wherever.\"\n\nHe later insisted his reference had nothing to do with Kelly's menstrual cycle. Former Arkansas Gov. Mike Huckabee, at the time a Trump primary challenger, said he \"would certainly never say anything about a person like that, and I hope [Trump] apologizes because I think that he should.\"\n\n* Mexican 'rapists'\n\nJUST WATCHED Then-candidate Donald Trump doubled down on calling Mexicans 'rapists' Replay More Videos ... MUST WATCH Then-candidate Donald Trump doubled down on calling Mexicans 'rapists' 04:36\n\nIn his announcement speech in June 2015, Trump said Mexico was sending bad people to the US. \"They're sending people that have lots of problems, and they're bringing those problems with us,\" Trump said. \"They're bringing drugs. They're bringing crime. They're rapists.\"\n\nBush said of the comment: \"He's doing this to inflame and incite and to draw attention, which seems to be the organizing principle of his campaign.\"\n\nAnd yet, through it all, Trump is still in the White House and still, broadly speaking, enjoys the backing of the vast majority of Republican elected officials. Remember that when considering all of the condemnation being issued of Trump's latest major mistake.", "authors": ["Chris Cillizza", "Cnn Editor-At-Large"], "publish_date": "2017-08-14", "source": "cnn", "top_words": ["replay", "came", "republican", "trump", "videos", "watch", "republicans", "know", "denounced", "trumps", "duke", "times", "white", "watched"], "summary": "I plucked out nine of the most high-profile instances in which Republican condemnation of Trump turned to acceptance.\n\"Everybody says it, but I have a judge who is a hater of Donald Trump, a hater,\" Trump said.\n* David DukeJUST WATCHED Trump refused during an interview with Jake Tapper in 2016 to disavow white supremacist David Duke.\nHe later did disavow Duke Replay More Videos ... MUST WATCH Trump refused during an interview with Jake Tapper in 2016 to disavow white supremacist David Duke.\n* Mika BrzezinskiJUST WATCHED Trump tweets insults at Mika Brzezinski Replay More Videos ... MUST WATCH Trump tweets insults at Mika Brzezinski 01:28In late June, Trump said the \"Morning Joe\" host had come to Mar-a-Lago and wanted a meeting."}