{"url": "http://www.cnn.com/2017/06/05/politics/trump-tweet-travel-ban-infrastructure-messaging/index.html", "id": "355", "title": "Trump tweets step on his own messaging", "text": "Washington (CNN) White House aides, facing a week focused on Thursday's testimony of former FBI Director James Comey, told reporters over the weekend that President Donald Trump would spend his time focusing on a $1 trillion infrastructure plan .\n\nOr, at least, they hoped he would.\n\nTrump woke up on Monday morning and rattled of a series of tweets that lambasted his own Justice Department , undercut the credibility of his press secretary and attacked the mayor of London , who is currently trying to navigate his city though its latest act of terrorism.\n\n\"Pathetic excuse by London Mayor Sadiq Khan who had to think fast on his \"no reason to be alarmed\" statement. MSM is working hard to sell it,\" Trump tweeted, taking a comment made by Khan out of context.\n\nAt least 7 dead and 48 wounded in terror attack and Mayor of London says there is \"no reason to be alarmed!\"\n\nPeople, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!\n\n\"People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN,\" Trump said, undercutting White House press secretary Sean Spicer, who said earlier this year in that calling his plan a travel ban \"misrepresents what it is.\"\n\nTweets as policy\n\nTrump's tweets are the most accurate representation of his administration's view, given they usually come directly from the President himself.\n\nAnd all of these tweets, taken as the presidential pronouncements that they are, have entirely overshadowed the Trump administration's attempt to push for infrastructure reform.\n\n\"We are very confident that through a $200 billion federal government expenditure, and that is over and above all normal infrastructure spending, this is in addition to, that that can equal well over $1 trillion of infrastructure investment in this country,\" Reed Cornish, a top White House aide, told reporters about the plan as most major outlets covered Trump's tweets.\n\nThis puts aides in a tough position. While they want to push policy reforms, like they did over the weekend, they almost always find themselves getting distracted by 140-character messages from the President himself.\n\nFormer Trump campaign aides have said that during the campaign they would regularly wake up in the morning in fear of what their boss, then a candidate for president, would have tweeted in the wee hours of the morning. Some of that fear abated, these aides said, when Trump entered the White House. But Monday morning's series of messages shows Trump will rarely, if ever, break his Twitter habit.\n\nJUST WATCHED Trump pushes travel ban in tweetstorm Replay More Videos ... MUST WATCH Trump pushes travel ban in tweetstorm 02:30\n\nWhat's in a tweet?\n\nSpicer has tried to dismiss conversation about Trump's tweets in the past by simply saying, Trump's tweet \"speaks for itself.\"\n\nBut on Monday, top Trump aides took to criticizing the media for covering Trump's tweets.\n\nKellyanne Conway, speaking to NBC News, scolded the media for their \"obsession\" with Trump's Twitter account.\n\nConway decried \"this obsession with covering everything he says on Twitter and very little of what he does as president.\"\n\nAnd on Fox News, she said people don't hear about infrastructure because \"it's not in a tweet\" or it isn't something \"people on other networks can put against the President.\"\n\nBut her own husband, George Conway, tweeted Monday after her remarks, saying: \"These tweets may make some ppl feel better, but they certainly won't help OSG get 5 votes in SCOTUS, which is what actually matters. Sad.\"\n\nThese tweets may make some ppl feel better, but they certainly won't help OSG get 5 votes in SCOTUS, which is what actually matters. Sad. https://t.co/zVhcyfm8Hr — George Conway (@gtconway3d) June 5, 2017\n\nSebastian Gorka, a deputy assistant to Trump, used a tactic similar to Kellyanne Conway on CNN Monday morning.\n\n\"I just find it really disappointing that not only did you have one of your staff on before me for several minutes on the President's tweets, now we're eight minutes into this interview and you're doing it again,\" he said. \"Let's talk about policy.\"\n\nAfter pressed that Trump's tweets are policy, Gorka said: \"They are not policy. It's not policy ... It's not policy, it's not an executive order. It's social media. Please understand the difference.\"\n\nBut Trump could, if he wanted to, tweet about infrastructure and follow the lead of his top aides.\n\nInstead, though, the President sent six tweets on Monday morning about the mayor of London, his travel ban and his Justice Department.\n\nNot one of Trump's messages mentioned infrastructure.", "authors": ["Dan Merica"], "publish_date": "2017-06-05", "source": "cnn", "top_words": ["travel", "trump", "tweets", "ban", "aides", "president", "trumps", "step", "infrastructure", "messaging", "white", "policy"], "summary": "Tweets as policyTrump's tweets are the most accurate representation of his administration's view, given they usually come directly from the President himself.\nJUST WATCHED Trump pushes travel ban in tweetstorm Replay More Videos ... MUST WATCH Trump pushes travel ban in tweetstorm 02:30What's in a tweet?\nSpicer has tried to dismiss conversation about Trump's tweets in the past by simply saying, Trump's tweet \"speaks for itself.\"\nBut on Monday, top Trump aides took to criticizing the media for covering Trump's tweets.\nAfter pressed that Trump's tweets are policy, Gorka said: \"They are not policy."}