{"url": "http://www.cnn.com/2017/03/17/politics/doj-maryland-notice-appeal-travel-ban/index.html", "id": "319", "title": "Trump administration files notice to appeal ruling blocking travel ban", "text": "In a decision published Thursday morning, US District Court Judge Theodore Chuang imposed a nationwide halt to the portion of the President's executive order that barred foreign nationals from six majority-Muslim nations from entering the country.\n\n\"The Department of Justice strongly disagrees with the Maryland federal district court's ruling, and looks forward to defending the President's executive order seeking to protect our nation's security,\" a Justice Department spokesperson said in a statement Friday.\n\nThe ban was set to go into effect Thursday.\n\nThe Justice Department has not yet filed its formal appellate brief in the Fourth Circuit Court of Appeals, where the case will eventually be heard, but that is the next step.\n\nThe Fourth Circuit does not publicize ahead of time who will be on the eventual three-judge panel that hears the case.\n\nThe lawsuit in Maryland was brought by refugee aid groups and foreign nationals who argued in court filings that the revised executive order \"was motivated by animus toward Muslims,\" and impermissibly discriminates on the basis of religion and national origin.\n\nIn a 43-page decision, Chuang detailed many of Trump's statements about Muslims from the campaign trail and concluded that despite the significant changes to who was exempted by the executive order the second time around, \"the history of public statements continues to provide a convincing case that the purpose of the Second Executive Order remains the realization of the long-envisioned Muslim ban.\"\n\nACLU attorney Omar Jadwat, who argued the Maryland case on behalf of the plaintiffs, said: \"We look forward to defending this careful and well-reasoned decision in the appeals court.\"\n\nAnother federal judge in Hawaii issued a decision Wednesday resulting in a nationwide temporary restraining order of two key provisions of travel ban, just hours before the judge in Maryland.\n\nUS District Court Judge Derrick Watson's ruling in Hawaii was slightly broader in scope in that it blocked both the 90-day ban on all foreign nationals from Iran, Libya, Somalia, Sudan, Syria, and Yemen, as well as the 120-day ban on all refugees entering the country, while Chuang's ruling only concerns the 90-day ban.\n\nAdditionally, Chuang issued a preliminary injunction, which will last through a trial on the merits of the case, while Watson only issued a temporary restraining order of the executive order, which is typically more limited in time.\n\nThe Justice Department also filed a motion late Friday to clarify the scope of Watson's decision.\n\nThe department claims in its filing that even though Watson's ruling suspends the 90- and 120-day bans, many of the provisions in the relevant sections of the executive order were not addressed in the briefs the plaintiffs filed in support of their request for a temporary restraining order. \"It is therefore unclear whether the court intended its injunction to extend to all of those provisions,\" the department said.\n\nThe department goes on to request that if Watson meant for his decision to apply to the ban on refugees, the court should not apply the temporary restraining order to a cap of 50,000 refugees outlined in the executive order.\n\n\"Plaintiffs' briefing makes no mention of the cap, and this court did not address it in its order,\" the Justice Department says. \"Moreover, that cap -- which has global applicability -- draws no distinction whatsoever on the basis of religion, and none of the courts to analyze either the old or the new executive orders has called that cap into question.\"\n\nHawaii and the other plaintiff in the case believe department's motion will \"unduly delay resolution\" of the case and have indicated that they will file an opposition brief, according to court filings.\n\nWatson said Wednesday that he intended to set an expedited hearing to determine whether his restraining order should be extended, and the Justice Department has not yet made any moves to appeal the ruling.", "authors": ["Laura Jarrett"], "publish_date": "2017-03-17", "source": "cnn", "top_words": ["ruling", "executive", "travel", "case", "restraining", "trump", "ban", "appeal", "blocking", "court", "files", "notice", "justice", "order", "department", "administration", "decision"], "summary": "\"The Department of Justice strongly disagrees with the Maryland federal district court's ruling, and looks forward to defending the President's executive order seeking to protect our nation's security,\" a Justice Department spokesperson said in a statement Friday.\nAnother federal judge in Hawaii issued a decision Wednesday resulting in a nationwide temporary restraining order of two key provisions of travel ban, just hours before the judge in Maryland.\nThe Justice Department also filed a motion late Friday to clarify the scope of Watson's decision.\n\"Plaintiffs' briefing makes no mention of the cap, and this court did not address it in its order,\" the Justice Department says.\nWatson said Wednesday that he intended to set an expedited hearing to determine whether his restraining order should be extended, and the Justice Department has not yet made any moves to appeal the ruling."}