{"url": "http://www.cnn.com/2017/03/07/world/trump-ban-blocks-gay-iranian-refugee/index.html", "id": "301", "title": "US travel ban leaves LGBT refugees in limbo", "text": "Story highlights Ramtin Zigorat's visa application blocked under Trump's new travel ban\n\nZigorat, a gay rights activist, fled to Turkey after being sentenced to death in Iran\n\nUS one of last remaining safe-havens for non-Syrian LGBT refugees\n\nIstanbul, Turkey (CNN) Beaten by his brother because of his sexual orientation while growing up in Iran, Ramtin Zigorat's greatest wish is to wake up one day and to not have to look over his shoulder.\n\nThe 27-year-old gay rights activist, currently living in Turkey, was on the road to a new life in the United States, but his dream was derailed in January after US President Donald Trump introduced an immigration executive order that included a suspension of refugee arrivals from Iran and six other countries.\n\nA revised version of the order issued on Monday will not rectify his predicament. It exempts Iraq and lawful permanent residents from the ban, but still bars citizens from Iran and five other majority-Muslim countries from entering the US for 90 days. Refugees from those countries are barred for 120 days while officials review already stringent vetting measures.\n\nZigorat at a candlelight vigil in solidarity with Orlando shooting victims.\n\nIn Iran, Zigorat's doctor pushed him towards medication for what was described as his \"condition\" and recommended sex reassignment surgery, a legal option in a country where being gay is illegal, and often considered the same as being transgender. When he refused to renounce his sexual orientation and LGBT activism, he was arrested and sentenced to death in 2013.\n\nSince escaping to Turkey nearly two years ago, Zigorat, who does not use his given name out of fears for his safety, registered with the UN's refugee agency, UNHCR, which offered him resettlement in the US.\n\nRead More", "authors": ["Nina Dos Santos"], "publish_date": "2017-03-07", "source": "cnn", "top_words": ["leaves", "iran", "travel", "limbo", "ramtin", "lgbt", "ban", "orientation", "turkey", "refugee", "gay", "rights", "sexual", "refugees", "zigorats", "sentenced"], "summary": "A revised version of the order issued on Monday will not rectify his predicament.\nIt exempts Iraq and lawful permanent residents from the ban, but still bars citizens from Iran and five other majority-Muslim countries from entering the US for 90 days.\nRefugees from those countries are barred for 120 days while officials review already stringent vetting measures.\nIn Iran, Zigorat's doctor pushed him towards medication for what was described as his \"condition\" and recommended sex reassignment surgery, a legal option in a country where being gay is illegal, and often considered the same as being transgender.\nWhen he refused to renounce his sexual orientation and LGBT activism, he was arrested and sentenced to death in 2013."}