{"url": "http://www.cnn.com/2017/05/08/politics/trump-muslim-ban-campaign-website/index.html", "id": "333", "title": "Trump campaign removes Muslim ban language from website", "text": "Story highlights Trump's campaign website still included language promoting a ban on Muslims from entering the country originally posted in 2015\n\nWhite House press secretary Sean Spicer was asked about the language Monday; it was removed shortly thereafter\n\nWashington (CNN) A press release touting Donald Trump's controversial plan to ban all Muslim travel into the United States was removed from his campaign website Monday, shortly after White House press secretary Sean Spicer told reporters that he was unaware that the plan was still online.\n\nThen-candidate Trump issued a statement calling for the \"total and complete shutdown\" of Muslims entering the United States until the government could \"figure out what is going on,\" in response to a deadly mass shooting in San Bernardino, California, by ISIS sympathizers in December 2015.\n\nTrump later read the plan at a Mount Pleasant, South Carolina, rally before his supporters.\n\n\"We have no choice. We have no choice,\" Trump said. \"We have no choice.\"\n\nJUST WATCHED Fiery debate on Trump's travel ban Replay More Videos ... MUST WATCH Fiery debate on Trump's travel ban 03:14\n\nSince stepping into office, though, Trump and his top aides have tried to distance themselves from the exact language of the plan, which has been used against the administration's attempt to suspend travel to seven -- then six -- Muslim-majority countries and suspend the admission of Syrian refugees into the United States.\n\nRead More", "authors": ["Dan Merica"], "publish_date": "2017-05-08", "source": "cnn", "top_words": ["campaign", "travel", "trump", "suspend", "ban", "plan", "removes", "united", "trumps", "press", "muslim", "website", "language"], "summary": "Story highlights Trump's campaign website still included language promoting a ban on Muslims from entering the country originally posted in 2015White House press secretary Sean Spicer was asked about the language Monday; it was removed shortly thereafterWashington (CNN) A press release touting Donald Trump's controversial plan to ban all Muslim travel into the United States was removed from his campaign website Monday, shortly after White House press secretary Sean Spicer told reporters that he was unaware that the plan was still online.\nTrump later read the plan at a Mount Pleasant, South Carolina, rally before his supporters.\n\"We have no choice.\nWe have no choice,\" Trump said.\nJUST WATCHED Fiery debate on Trump's travel ban Replay More Videos ... MUST WATCH Fiery debate on Trump's travel ban 03:14Since stepping into office, though, Trump and his top aides have tried to distance themselves from the exact language of the plan, which has been used against the administration's attempt to suspend travel to seven -- then six -- Muslim-majority countries and suspend the admission of Syrian refugees into the United States."}