{"url": "http://www.cnn.com/2017/03/15/politics/republican-judges-ninth-circuit-support-travel-ban/index.html", "id": "309", "title": "Five Republican-nominated judges signal support for travel ban", "text": "(CNN) Five Republican-appointed judges on the Ninth Circuit Court of Appeals signaled their support for the legal underpinnings of President Donald Trump's travel ban late Wednesday in an unusual and unsolicited filing .\n\nDespite the fact that Trump has resoundingly and repeatedly criticized the 9th Circuit , five judges came to the President's defense, saying that \"whatever we, as individuals, may feel about the President or the Executive Order, the President's decision was well within the powers of the presidency.\"\n\nThe comments from the five judges do not impact the move by a federal judge in Hawaii who blocked Trump's new travel ban on Wednesday.\n\nBut it could be meaningful down the line. If the Justice Department appeals the Hawaii ruling, the case will be headed to the 9th Circuit and could very well be heard by these same five judges who now say the law is on Trump's side.\n\nAn unusual move\n\nLast week, the day after Trump signed the new travel ban, the Justice Department voluntarily moved to dismiss its appeal of an earlier federal ruling that blocked implementation of the original travel ban nationwide -- meaning the case was out of the hands of the 9th Circuit.\n\nBut that didn't stop members of the court from weighing in on their three colleagues' earlier -- but now moot -- declination to reinstate the original travel ban last month.\n\n\"The panel's errors are many and obvious\" and the decision \"stands contrary to well-established separation-of-powers principles,\" wrote Judge Jay Bybee, who was joined by four other Republican-nominated judges in a blistering 26-page missive.\n\n\"We are all acutely aware of the enormous controversy and chaos that attended the issuance of the Executive Order,\" but \"we cannot let our personal inclinations get ahead of important, overarching principles about who gets to make decisions in our democracy.\"\n\nCondemning Trump attacks on judiciary\n\nThe judges did, however, issue a strong condemnation of Trump's \"personal attacks\" on US District Court Judge James Robart in Seattle, who originally froze the travel ban.\n\n\"The personal attacks on the distinguished district judge and our colleagues were out of all bounds of civic and persuasive discourse -- particularly when they came from the parties,\" they wrote.\n\n\"Such personal attacks treat the court as though it were merely a political forum in which bargaining, compromise, and even intimidation are acceptable principles,\" the judges added. \"The courts of law must be more than that, or we are not governed by law at all.\"", "authors": ["Laura Jarrett"], "publish_date": "2017-03-15", "source": "cnn", "top_words": ["principles", "travel", "judges", "trump", "ban", "judge", "support", "court", "trumps", "personal", "signal", "republicannominated", "attacks"], "summary": "(CNN) Five Republican-appointed judges on the Ninth Circuit Court of Appeals signaled their support for the legal underpinnings of President Donald Trump's travel ban late Wednesday in an unusual and unsolicited filing .\nThe comments from the five judges do not impact the move by a federal judge in Hawaii who blocked Trump's new travel ban on Wednesday.\nAn unusual moveLast week, the day after Trump signed the new travel ban, the Justice Department voluntarily moved to dismiss its appeal of an earlier federal ruling that blocked implementation of the original travel ban nationwide -- meaning the case was out of the hands of the 9th Circuit.\nBut that didn't stop members of the court from weighing in on their three colleagues' earlier -- but now moot -- declination to reinstate the original travel ban last month.\nCondemning Trump attacks on judiciaryThe judges did, however, issue a strong condemnation of Trump's \"personal attacks\" on US District Court Judge James Robart in Seattle, who originally froze the travel ban."}