{"url": "http://www.cnn.com/2017/03/16/politics/trump-campaign-statements-federal-lawsuits/index.html", "id": "316", "title": "Trump's words come back to haunt in court", "text": "Story highlights Early in the presidential campaign, Trump called for a \"complete shutdown\" of Muslims entering the US\n\nTwo different federal judges have now blocked the ban's implementation\n\n\"The second executive order remains the realization of the long-envisioned Muslim ban,\" one wrote\n\n(CNN) When then-presidential candidate Donald Trump called for a \"total and complete shutdown of Muslims\" entering the US back in 2015, he probably didn't imagine those words would come back to haunt him federal court in 2017.\n\nTwo different federal judges have now blocked implementation of Trump's new travel ban with lengthy written opinions in which his own past rhetoric and recent statements from his advisers have taken center stage.\n\nTrump announced his plan via a press release calling for a \"total and complete shutdown of Muslims\" entering the US in late 2015. He then made plain his opposition to Islam in an interview with CNN's Anderson Cooper last year, asserting: \"I think Islam hates us.\"\n\nWhen asked by NBC later last year if he was rolling back his Muslim ban plan, Trump responded: \"I don't think it's a rollback. In fact, you could say it's an expansion. I'm looking at now at territories. ... I'm talking about territory instead of Muslim.\"\n\nThen, after the first executive order was rolled out in January, former New York Mayor Rudy Giuliani told Fox that \"when (Trump) first announced it, he said, 'Muslim ban.' He called me up. He said, 'Put a commission together. Show me the right way to do it legally.'\"\n\nRead More", "authors": ["Laura Jarrett"], "publish_date": "2017-03-16", "source": "cnn", "top_words": ["haunt", "trump", "called", "ban", "court", "total", "entering", "trumps", "complete", "words", "shutdown", "federal", "come", "muslim", "muslims"], "summary": "Two different federal judges have now blocked implementation of Trump's new travel ban with lengthy written opinions in which his own past rhetoric and recent statements from his advisers have taken center stage.\nTrump announced his plan via a press release calling for a \"total and complete shutdown of Muslims\" entering the US in late 2015.\nHe then made plain his opposition to Islam in an interview with CNN's Anderson Cooper last year, asserting: \"I think Islam hates us.\"\nWhen asked by NBC later last year if he was rolling back his Muslim ban plan, Trump responded: \"I don't think it's a rollback.\nThen, after the first executive order was rolled out in January, former New York Mayor Rudy Giuliani told Fox that \"when (Trump) first announced it, he said, 'Muslim ban.'"}