{"url": "http://www.cnn.com/2017/03/15/politics/travel-ban-lawsuits/index.html", "id": "312", "title": "DOJ: Trump's Muslim ban talk shouldn't count in lawsuits", "text": "Story highlights The new executive order is slated to go into effect on Thursday\n\nFederal judges in Maryland, Hawaii or Washington state could decide the order's immediate legal fate\n\n(CNN) For almost two months, immigration advocates have consistently argued that President Donald Trump's call for a \"complete shutdown of Muslims entering the United States\" during the campaign shows his travel ban executive orders are motivated by religious animus, but the Justice Department told a federal judge in Maryland on Wednesday that none of those statements count.\n\nWhy? Because Trump wasn't president yet.\n\nUS District Court Judge Theodore Chuang heard arguments Wednesday morning for nearly two hours about whether he should block the President's new travel ban, and drilled both sides about the extent to which he should \"look behind\" a \"facially neutral\" law to find alleged discriminatory purpose.\n\nChuang asked Acting Solicitor General Jeffrey Wall what would happen if Trump had made the same statements from the campaign while president, and Wall conceded, \"that would be a much harder case.\"\n\nTrump's new executive order bans foreign nationals from six Muslim-majority countries from entering the US for 90 days and bans all refugees for 120 days. But unlike his original executive order from January, those with green cards or valid visas are exempted from the ban -- changes the Justice Department said shield it from legal scrutiny.\n\nRead More", "authors": ["Laura Jarrett"], "publish_date": "2017-03-15", "source": "cnn", "top_words": ["count", "executive", "travel", "trump", "lawsuits", "ban", "shouldnt", "orders", "maryland", "wall", "doj", "trumps", "president", "statements", "talk", "order", "muslim"], "summary": "Because Trump wasn't president yet.\nUS District Court Judge Theodore Chuang heard arguments Wednesday morning for nearly two hours about whether he should block the President's new travel ban, and drilled both sides about the extent to which he should \"look behind\" a \"facially neutral\" law to find alleged discriminatory purpose.\nChuang asked Acting Solicitor General Jeffrey Wall what would happen if Trump had made the same statements from the campaign while president, and Wall conceded, \"that would be a much harder case.\"\nTrump's new executive order bans foreign nationals from six Muslim-majority countries from entering the US for 90 days and bans all refugees for 120 days.\nBut unlike his original executive order from January, those with green cards or valid visas are exempted from the ban -- changes the Justice Department said shield it from legal scrutiny."}