{"url": "http://money.cnn.com/2017/02/05/technology/trump-travel-ban-tech-companies-legal-brief/index.html", "id": "38", "title": "More than 100 companies join legal fight against Trump travel ban", "text": "America's biggest tech firms have stepped into the legal fight against President Donald Trump's travel ban.\n\nA total of 127 companies -- including Apple (AAPL), Facebook (FB), Google (GOOGL), Intel (INTC), Microsoft (MSFT), Netflix (NFLX) and Twitter (TWTR) -- filed court papers declaring that Trump's executive order on immigration \"violates the immigration laws and the Constitution.\" The wave of opposition came in two court filings, one on Sunday and one on Monday.\n\nAlmost all the companies that signed on in support are tech companies. The few exceptions include yogurt producer Chobani, snack maker Kind and fashion brand Levi Strauss. All three companies were founded by immigrants.\n\nThe ban represents \"a sudden shift in the rules governing entry into the United States, and is inflicting substantial harm on U.S. companies,\" says the court document.\n\nIt's the latest move by the tech industry to oppose Trump's controversial order, which has run into hurdles in the U.S. court system.\n\nRelated: Amazon, Expedia back lawsuit opposing Trump travel ban\n\nThe motion was filed with the Ninth Circuit Court of Appeals, which on Sunday morning denied the U.S. government's emergency request to resume Trump's travel ban. The appeals court has asked for both sides to file legal briefs before it makes a final decision.\n\nThe lawsuit in question was filed by the attorneys general of Washington state and Minnesota. The motion from the companies seeks permission to file what's known as an amicus (\"friend of the court\") brief in the case.\n\nThe San Francisco-based Ninth Circuit has a reputation as one of the most liberal in the nation. No matter how it rules, the next stop for the case is likely be the U.S. Supreme Court.\n\nTrump's executive order bars citizens of seven Muslim-majority countries from entering the U.S. for 90 days and all refugees from entering for 120 days. It also indefinitely halts refugees from Syria.\n\nRelated: Tech companies criticize travel ban but not their investor Peter Thiel\n\nTech companies have been at the vanguard of businesses opposing the ban. Their court motion emphasizes the important role of immigration in the U.S. economy.\n\n\"Immigrants make many of the Nation's greatest discoveries, and create some of the country's most innovative and iconic companies,\" it says.\n\n\"At the same time, America has long recognized the importance of protecting ourselves against those who would do us harm,\" it adds. \"But it has done so while maintaining the fundamental commitment to welcoming immigrants -- through increased background checks and other controls on people seeking to enter our country.\"\n\nRelated: Elon Musk says he's 'doing good' on Trump's advisory council\n\nIt's not the first legal move by tech firms over Trump's ban.\n\nAmazon (AMZN) and Expedia (EXPE) filed motions last week in the Washington attorney general's lawsuit. They argued the immigration order will hurt their employees and their businesses.\n\nUber CEO Travis Kalanick on Thursday dropped out of Trump's business advisory council, citing the ban.\n\n\"The executive order is hurting many people in communities all across America,\" Kalanick wrote in a memo to employees. \"Families are being separated, people are stranded overseas and there's a growing fear the U.S. is no longer a place that welcomes immigrants.\"\n\nUber and its rival Lyft both support the motion filed Sunday.\n\nTesla (TSLA) CEO Elon Musk has defended his decision to take part in the advisory council, saying it's better to be on the inside where he can push Trump on issues like immigration and climate change. Tesla was not a signatory to the motion initially but signed on to the brief Monday evening.\n\n-- Rob McLean, Ariane de Vogue and Laura Jarrett contributed to this report.\n\nEditor's Note: This article has been updated to include Monday's new filings.", "authors": ["Jethro Mullen"], "publish_date": "2017-02-05", "source": "cnn", "top_words": ["100", "travel", "companies", "trump", "fight", "ban", "join", "tech", "immigration", "court", "trumps", "filed", "order", "motion", "legal"], "summary": "America's biggest tech firms have stepped into the legal fight against President Donald Trump's travel ban.\nAlmost all the companies that signed on in support are tech companies.\nRelated: Amazon, Expedia back lawsuit opposing Trump travel banThe motion was filed with the Ninth Circuit Court of Appeals, which on Sunday morning denied the U.S. government's emergency request to resume Trump's travel ban.\nRelated: Tech companies criticize travel ban but not their investor Peter ThielTech companies have been at the vanguard of businesses opposing the ban.\nRelated: Elon Musk says he's 'doing good' on Trump's advisory councilIt's not the first legal move by tech firms over Trump's ban."}