{"url": "http://www.cnn.com/2017/06/05/politics/trump-travel-ban-lawyer/index.html", "id": "353", "title": "How would you like to be Trump's lawyer in the travel ban case?", "text": "Story highlights George Conway on Monday gave the President some pro-bono advice\n\nTrump's tweets won't help him \"get 5 votes in Scotus,\" Conway said\n\nWashington (CNN) President Donald Trump's Twitter tirades on the travel ban may be undermining the legal work of top-notch Justice Department lawyers assigned to represent his administration at the Supreme Court.\n\nEven George Conway, who was seriously considered for a top Justice Department post and could have been representing Trump in the travel ban case, gave the President some pro-bono advice.\n\nConway, married to White House Counselor Kellyanne Conway, revived his own near dormant Twitter account Monday morning to warn Trump that while presidential tweets may \"make some ppl feel better,\" they won't help his Justice Department \"get 5 votes in Scotus, which actually matter.\"\n\nThe journey for Justice Department lawyers defending the ban began last January, when travelers suddenly found themselves blocked from entering the country following Trump's first executive order banning entry to people from seven Muslim-majority countries. Confusion reigned and civil rights lawyers set up impromptu law firms in airport hallways.\n\nFederal courts ultimately ruled against the ban, often seizing upon the President's own statements during the campaign -- page after page -- to hold that the executive order amounted to a Muslim ban in violation of the Constitution's Establishment Clause.\n\nRead More", "authors": ["Ariane De Vogue", "Cnn Supreme Court Reporter"], "publish_date": "2017-06-05", "source": "cnn", "top_words": ["travel", "case", "lawyers", "tweets", "ban", "conway", "votes", "lawyer", "twitter", "trumps", "wont", "justice", "president", "department"], "summary": "Story highlights George Conway on Monday gave the President some pro-bono adviceTrump's tweets won't help him \"get 5 votes in Scotus,\" Conway saidWashington (CNN) President Donald Trump's Twitter tirades on the travel ban may be undermining the legal work of top-notch Justice Department lawyers assigned to represent his administration at the Supreme Court.\nEven George Conway, who was seriously considered for a top Justice Department post and could have been representing Trump in the travel ban case, gave the President some pro-bono advice.\nThe journey for Justice Department lawyers defending the ban began last January, when travelers suddenly found themselves blocked from entering the country following Trump's first executive order banning entry to people from seven Muslim-majority countries.\nConfusion reigned and civil rights lawyers set up impromptu law firms in airport hallways.\nFederal courts ultimately ruled against the ban, often seizing upon the President's own statements during the campaign -- page after page -- to hold that the executive order amounted to a Muslim ban in violation of the Constitution's Establishment Clause."}