{"url": "http://www.cnn.com/2017/06/16/politics/trump-cuba-policy/index.html", "id": "362", "title": "Trump unveils new restrictions on Cuba travel, business", "text": "Miami (CNN) President Donald Trump slammed former President Barack Obama's dealings with the communist regime in Cuba on Friday in Miami, charting his own course of more confrontational relations with the Castro-led government.\n\nThe speech, which came as the President signed a directive outlining his posture toward Cuba, is the latest attempt by the Trump administration to chip away at Obama's legacy. Obama spent the last two years of his presidency looking to warm relations with Cuba, including a trip to the island in 2016.\n\n\"I am canceling the last administration's completely one-sided deal with Cuba,\" Trump said.\n\nCasting the Obama administration as people who looked the other way on the Castro regime's human rights violations, Trump said that he, as President, will \"expose the crimes of the Castro regime.\"\n\n\"They made a deal with a government that spread violence and instability in the region and nothing they got, think about it, nothing they got, they fought for everything and we just didn't fight hard enough, but now, those days are over,\" Trump said. \"We now hold the cards. The previous administration's easing of restrictions of travel and trade does not help the Cuban people. They only enrich the Cuban regime.\"\n\nTrump listed some of the Castro regime's anti-United States actions, ranging back to the Cuban Missile Crisis, and added, \"We will never, ever be blind to it. We know what is going on and we remember what happened.\"\n\nAlthough Trump said he was \"completely\" canceling Obama's Cuba policy, the change is posture is only a partial shift from Obama's policy.\n\nDiplomatic relations between the United States and Cuba will remain open, as will the newly opened embassies in Washington and Havana. And there will be no further restrictions on the types of goods that Americans can take out of Cuba, including the country's popular rum and cigars\n\nTrump said he is keeping the embassy open \"in the hope that our countries can forge a much stronger and better path.\"\n\nThe changes do, however, tighten restrictions on Cuba and ratchet up rhetoric on the Castro regime in hopes that it will lead to a transition of power on the island. Many presidents, though, have predicted the end of the Castros and, to date, none have been correct.\n\nThe Trump administration will begin strictly enforcing the authorized exemptions that allow travel between the US and Cuba and prohibit commerce with Cuban businesses owned by the military and intelligence services. The President also directed Secretary of State Rex Tillerson to convene a task force on expanding Internet access on the island and reiterate the United States' opposition to efforts in the United Nations to lift the Cuban embargo until more is done to honor human rights.\n\n\"To the Cuban government, I say, put an end to the abuse of dissidents, release the political prisoners, stop jailing innocent people, open yourselves to political and economic freedoms, return the fugitives from American justice, including the return of the cop killer Joanne Chesimard,\" Trump said, referencing the former Black Panther who was convicted of murder in 1977.\n\nTrump responded well to the adoring crowd, even at one point kissing a Cuban dissident on the cheek and pronouncing \"Little Havana\" with a mimic Cuban accent.\n\nHe challenged the Castro regime \"to come to the table with a new agreement that is in the best interest of both their people and our people.\"\n\nAnd in possibly his toughest rhetoric directed at Castro, Trump flatly said, \"the harboring of criminals and fugitives will end. You have no choice. It will end.\"\n\nThe Castro government criticized Trump's move, calling it \"ill-advised\" in a statement Friday.\n\n\"The United States are not in the condition to lecture us\" on human rights, Havana added, citing police brutality, firearm deaths and estimates that as many as 23 million Americans would lose health insurance under the House GOP health care plan.\n\nAhead of Friday's remarks, the Cuban government -- including Cuban President Raul Castro -- signaled a willingness to negotiate with Trump.\n\n\"We know they have a different view of the world,\" a Cuban official told CNN. \"We understand that.\"\n\nNone of these new regulations take effect immediately, a White House official said, adding that government agencies are expected to officially issue the regulatory amendments in the coming months.\n\nTrump was knocked Friday, though, from both sides. Some Republicans said the policy did not go far enough, while Democrats charged the roll back as reactionary.\n\n\"The policy isn't going to do anything new,\" a source from the office of one Cuban American lawmaker complained. \"It's pretty weak.\"\n\nSen. Mark Warner, a Virginia Democrat, said Friday the \"decision by the Trump Administration to reverse progress in US-Cuba relations sends the wrong message to the world about American leadership.\"\n\n\"We must never stop pressing the Cuban government on democracy and human rights, but further restricting economic and cultural engagement between our two nations betrays the spirit of cooperation that will ultimately help empower the Cuban people to choose their own destiny,\" he said.\n\nChanges in policy\n\nObama, after years of clandestine work with the Castro regime, announced in 2014 that the United States would re-establish diplomatic relations and reopen the American embassy in Havana, which was closed in 1961 following the Cuban revolution. The announcement led Obama to visit Cuba in 2016, making him the first sitting president to visit the island in more than 50 years.\n\nThe moved allowed for more Americans to travel to Cuba, with US air carriers marketing commercial flights direct to the island and cruise ships to port in the nation. The thaw also allowed Americans to bring more goods back from the island nation.\n\nTrump was personally invested in drafting the plans on Cuba, multiple aides told CNN, with one adding that the President deeply believes that the changes Obama announced in 2014 were a \"bad deal for the United States and a bad deal for the Cuban people.\"\n\n\"It has not led to greater freedom in Cuba,\" the official said. \"I don't think you would see him go back to the embargo wholesale, look for ways to leverage America's influence over Cuba in a way that will encourage greater freedom for the Cuban people and economic interaction.\"\n\nLimits on business\n\nTrump's new policy will directly limit commerce with GAESA, the Cuban military's business and commerce wing. The company is run by Gen. Luis Alberto Rodríguez López-Callejas, Raul Castro's son-in-law.\n\nThat action could adversely impact hotel brands that directly compete with Trump's business empire, making it more difficult for them expand their foothold in Cuba. Gaviota, GAESA's tourism arm, currently operates the Four Points by Sheraton Havana, a hotel that, when it opened, was the first US hotel to open in Cuba in nearly 60 years.\n\nAlthough officials said Trump's plans were not meant to \"disrupt existing transactions that have (already) occurred,\" the new policy would make it difficult for any American company to expand their footprint in Cuba.\n\nWhite House officials said the effort was meant to direct American business to private companies and AirBnB, the vacation rental company that began allowing Cubans rent out their homes in 2016.\n\nAnd on non-Cuban American travel, a change would make Americans who travel under the Obama administration categories of permitted travel subject to a Treasury Department audit, a move that could have a cooling effect on travel as it adds a potential layer of inconvenience to travelers.\n\nRubio's influence\n\nMarco Rubio, who joined Trump on Air Force One on Friday, spent months working to push Trump toward more strict rules and though Trump and Rubio sparred -- at times personally -- during the 2016 campaign, the President heralded the Rubio's views on Cuban relations after a February dinner.\n\n\"We had dinner with Sen. Rubio and his wife, who was, by the way, lovely, and we had a very good discussion about Cuba because we have very similar views on Cuba,\" Trump said, adding that \"Cuban people\" were \"very good\" to him in the 2016 election.\n\nRubio, in particular, made Friday's policy announcement about Obama, charging the former president with looking the other way on Cuba's human rights abuses.\n\n\"A year and a half ago, an American president landed in Havana and outstretched his hand to a regime,\" Rubio said. \"Today, a new president lands in Miami to reach out his hand to the people of Cuba.\"\n\nTrump said throughout the 2016 campaign that he was willing to rollback diplomatic relations with the communist regime in Cuba. Especially in Southern Florida, where Cubans make up a key voting bloc for Republicans, Trump railed on Obama for building relations with the Castros.\n\nTrump has long hanged his understanding of the deal between the United States and Cuba on his \"Cuban friends\" in Florida, whom he said throughout the campaign supported him over Democrat Hillary Clinton. To a degree, he was right: Trump did beat the former secretary of state in Florida, providing the effective knock out blow to Clinton on Election Night.\n\nBut Republicans were not unified behind Trump's action.\n\nSen. Jeff Flake, a member of the Senate Foreign Relations Committee, panned Trump on Friday.\n\n\"Any policy change that diminishes the ability of Americans to travel freely to Cuba is not in the best interests of the United States or the Cuban people,\" Flake said. \"It is time Senate leadership finally allowed a vote on my bipartisan bill to fully lift these archaic restrictions which do not exist for travel by Americans to any other country in the world.\"", "authors": ["Dan Merica"], "publish_date": "2017-06-16", "source": "cnn", "top_words": ["travel", "restrictions", "trump", "castro", "relations", "cuban", "american", "united", "cuba", "states", "president", "unveils", "business"], "summary": "\"I am canceling the last administration's completely one-sided deal with Cuba,\" Trump said.\nDiplomatic relations between the United States and Cuba will remain open, as will the newly opened embassies in Washington and Havana.\nAnd in possibly his toughest rhetoric directed at Castro, Trump flatly said, \"the harboring of criminals and fugitives will end.\nAhead of Friday's remarks, the Cuban government -- including Cuban President Raul Castro -- signaled a willingness to negotiate with Trump.\n\"The policy isn't going to do anything new,\" a source from the office of one Cuban American lawmaker complained."}