{"url": "http://www.cnn.com/2017/07/14/politics/doj-appeals-hawaii-travel-ban/index.html", "id": "376", "title": "Trump administration asks Supreme Court to clarify travel ban ruling", "text": "Story highlights The Supreme Court said in June foreigners need \"bona fide\" relationships with persons in the United States\n\nA lower court ruled grandparents and others now count as sufficiently close family relationships\n\n(CNN) Lawyers for the Trump administration went back to the Supreme Court again late Friday in the ongoing battle over President Donald Trump's travel ban -- this time asking the justices to resolve the uncertainty created by last month's ruling on which foreign nationals are exempt from the ban.\n\nThe Supreme Court decided in June that the travel ban must not apply to those people with a \"bona fide connection\" to a person or entity in the United States while the case is pending full argument this fall. The justices further explained that for \"individuals, a close familial relationship is required.\"\n\nA federal judge in Hawaii ruled Thursday, however, that the administration's decision to keep out some foreign nationals with close family members (like grandparents) but not others (like spouses) defied common sense, and was not in line with the spirit of the Supreme Court's decision.\n\nJustice Department lawyers argued in Friday night's motion that the justices should now clarify what they meant in June and, in the meantime, place an immediate freeze on the lower court's decision.\n\n\"The district court's interpretation of this Court's ... ruling distorts this Court's decision and upends the equitable balance this Court struck,\" lawyers said in the motion. \"And the district court's sweeping interpretation of 'close familial relationship' ... to encompass a wide range of distant relatives -- including cousins, uncles, and siblings-in-law -- effectively eliminates the 'close' requirement and has no basis in this Court's ruling.\"\n\nRead More", "authors": ["Laura Jarrett"], "publish_date": "2017-07-14", "source": "cnn", "top_words": ["ruling", "travel", "courts", "trump", "lawyers", "ban", "supreme", "asks", "ruled", "court", "united", "close", "clarify", "justices", "administration"], "summary": "The Supreme Court decided in June that the travel ban must not apply to those people with a \"bona fide connection\" to a person or entity in the United States while the case is pending full argument this fall.\nThe justices further explained that for \"individuals, a close familial relationship is required.\"\nJustice Department lawyers argued in Friday night's motion that the justices should now clarify what they meant in June and, in the meantime, place an immediate freeze on the lower court's decision.\n\"The district court's interpretation of this Court's ... ruling distorts this Court's decision and upends the equitable balance this Court struck,\" lawyers said in the motion.\n\"And the district court's sweeping interpretation of 'close familial relationship' ... to encompass a wide range of distant relatives -- including cousins, uncles, and siblings-in-law -- effectively eliminates the 'close' requirement and has no basis in this Court's ruling.\""}