{"url": "http://money.cnn.com/2017/01/31/news/economy/trump-travel-ban-amazon-expedia/index.html", "id": "31", "title": "Amazon, Expedia back lawsuit opposing Trump travel ban", "text": "Amazon and Expedia have joined a legal challenge to President Trump's travel ban.\n\nThe companies argue it will hurt their employees and their business. They filed motions in a federal lawsuit brought Monday by Washington State Attorney General Bob Ferguson. Both companies are based in Washington.\n\nAmazon says it has 49 employees born in the seven Muslim-majority countries included in the ban who are legally working for the company in the United States or elsewhere. Amazon says their work and travel could be disrupted.\n\nThe Amazon motion refers to an unnamed Libyan-born senior Amazon lawyer who has been a British citizen for many years.\n\n\"This employee had plans to travel to the United States for business during the month of February. We have instructed the employee to cancel her plans and remain in the UK rather than risk being denied entry to the United States,\" the motion says.\n\nRelated: Companies executives speak out on Trump's travel ban\n\nAmazon also says it has offered jobs to seven Iranian-born candidates who are citizens of other countries, as well as 10 employees who have dependents from the seven countries who are living legally in the United States.\n\nIt also brings up the case of Iranian filmmaker Asghar Farhadi, who will not be able to attend the Academy Awards ceremony, even though his film, which is distributed by Amazon Studios, is nominated for an Oscar.\n\nExpedia's motion describes potential damage to its travel business. At least 1,000 of its customers hold passports from the seven countries, the company says. It also mentions employees whose travel could be restricted.\n\nExpedia (EXPE) CEO Dara Khosrowshahi was once an Iranian refugee whose family came to the United States after the Iranian Revolution in 1978. He wrote a long message to his employees decrying the ban.\n\nAmazon CEO Jeff Bezos has been a frequent Trump critic and owns The Washington Post. Trump in threatened during the campaign to cause big problems for Amazon (AMZN) if he was elected. He has yet to announce any action.\n\nRelated: Trump's immigration reform - High-skilled visas may be next\n\nThe Washington State lawsuit says Trump's ban violates the First Amendment guarantee of freedom of religion and the Fifth Amendment guarantee of due process.\n\nWashington State University also filed in support of the suit, detailing problems that the ban is causing its students and faculty.", "authors": ["Chris Isidore"], "publish_date": "2017-01-31", "source": "cnn", "top_words": ["seven", "opposing", "travel", "trump", "ban", "state", "washington", "united", "trumps", "expedia", "amazon", "countries", "lawsuit", "states", "employees"], "summary": "Amazon and Expedia have joined a legal challenge to President Trump's travel ban.\nThey filed motions in a federal lawsuit brought Monday by Washington State Attorney General Bob Ferguson.\n\"This employee had plans to travel to the United States for business during the month of February.\nExpedia (EXPE) CEO Dara Khosrowshahi was once an Iranian refugee whose family came to the United States after the Iranian Revolution in 1978.\nWashington State University also filed in support of the suit, detailing problems that the ban is causing its students and faculty."}