{"url": "http://www.cnn.com/2017/06/26/politics/supreme-court-order-may-cause-travel-chaos/index.html", "id": "364", "title": "Supreme Court order may cause travel chaos", "text": "Washington (CNN) The Supreme Court's decision green-lighting parts of President Donald Trump's controversial travel ban Monday saved many of the prickly questions about the constitutionality of the executive order for another day -- but legal experts say that the court's compromise ruling raises other more practical headaches (and potentially further litigation) for travelers this summer.\n\n\"Today's order will create more confusion, delays, and litigation,\" says Stephen Yale-Loehr, a professor of immigration law practice at Cornell Law School.\n\nHere's a look at why.\n\n1. Roll-out plan unclear\n\nWhen the Trump administration rolled out the President's first executive order in January, bedlam ensued almost immediately as foreigners from seven predominately Muslim countries tried to enter the US, only to be turned away at the border or separated from loved ones abroad.\n\nThis time around, the ban will not go into effect immediately. The President -- perhaps looking ahead to a potential court victory -- signed a memorandum earlier this month directing administration officials to begin implementation of the permitted parts of the travel ban 72 hours after the court gives the okay.\n\nSo when exactly does the clock begin to run?\n\nThe Department of Homeland Security did not immediately respond to CNN's request for comment on precise timing or a detailed roll-out plan, but said in a statement Monday that implementation will be done with \"clear and sufficient public notice, particularly to potentially affected travelers.\"\n\n2. How bona fide is bona fide?\n\nThe test for prospective travelers under the Supreme Court's new decision is whether one has a \"credible claim of bona fide relationship\" with either an entity or person living in the US -- if you do, you can come to the US; if you don't, you are banned for 90 days if you are from Libya, Syria, Iran, Somalia, Yemen and Sudan (and 120 days if you are a refugee).\n\nJustices offered several examples of scenarios in which travel ban shouldn't apply -- such as a foreign national who wishes to live with a family member in the US or a student accepted to an American university -- but what if the individual's connection to the US is more attenuated or not as well defined?\n\n\"It all depends on what the relationship is and when it is initiated,\" explained Yale-Loehr. \"If a person thinking about applying to become a refugee emails a church in the US and says 'please sponsor me to become a refugee,' that would not qualify as a bona fide relationship, in my view.\"\n\nBut immigrant rights activists and leaders of refugee resettlement organizations said Monday that based on their reading of the ruling, thousands of refugees should still be able to come to the United States.\n\nJUST WATCHED Swalwell: SCOTUS ruling makes U.S. less safe Replay More Videos ... MUST WATCH Swalwell: SCOTUS ruling makes U.S. less safe 03:36\n\n\"The hope is that this really only impacts a very small number of people,\" said Becca Heller, director of the International Refugee Assistance Project.\n\nMelanie Nezer, senior vice president for public affairs of HIAS, told reporters that the refugee resettlement agency is trying to reassure its clients who are already in the pipeline. Many of them have family ties in the United States, she said, and have established relationships with US-based resettlement organizations.\n\nThe court made clear that nonprofits may not initiate contact with foreign nationals from the banned countries to secure their entry into the country, but left open is whether previous contact between refugees and resettlement agencies in the US counts as sufficiently \"bona fide.\"\n\n\"They have extensive ties here, and it would be hard to say that they don't,\" Nezer said. \"This decision makes a strong statement that ties are important, that being in the process still matters, and that the US is not looking to break its promises toward people it's offered resettlement to.\"\n\n3. Even more lawsuits?\n\nOther experts say that the Supreme Court's decision provides greater discretion to consular officers and border agents.\n\n\"Think about how the people at the border, at airports are going to make that decision,\" said CNN legal analyst Page Pate. \"Who is going to make this decision? If we leave it to the folks on the front line, that's just going to lead to more litigation.\"\n\nAt least three justices agreed the standard used by the court will prove \"unworkable\" in practice and invite a \"flood of litigation\" over the summer as \"courts struggle to determine what exactly constitutes a 'bona fide relationship.'\"\n\nThe dissent from Justices Clarence Thomas, Samuel Alito and Neil Gorsuch argued the travel ban should be fully implemented.\n\n\"How individuals will prove such a (bona fide) relationship, and whether the burden of proof will be on the government or the individuals seeking entry, remains to be seen,\" Yale-Loehr agreed. \"I predict chaos at the border and new lawsuits as foreign nationals and refugees argue that they are entitled to enter the United States.\"\n\nExcept this time, the confusion will have been of the court's own making. Justices won't hear oral arguments on the merits of the travel ban until this fall.", "authors": ["Laura Jarrett"], "publish_date": "2017-06-26", "source": "cnn", "top_words": ["ruling", "fide", "travel", "relationship", "courts", "ban", "supreme", "cause", "bona", "refugee", "chaos", "court", "resettlement", "order", "decision"], "summary": "The President -- perhaps looking ahead to a potential court victory -- signed a memorandum earlier this month directing administration officials to begin implementation of the permitted parts of the travel ban 72 hours after the court gives the okay.\nHow bona fide is bona fide?\nOther experts say that the Supreme Court's decision provides greater discretion to consular officers and border agents.\nThe dissent from Justices Clarence Thomas, Samuel Alito and Neil Gorsuch argued the travel ban should be fully implemented.\nJustices won't hear oral arguments on the merits of the travel ban until this fall."}