{"url": "http://www.cnn.com/2017/03/15/politics/donald-trump-travel-ban-judge-ruling/index.html", "id": "307", "title": "Trump rails against court ruling blocking travel ban", "text": "Nashville (CNN) President Donald Trump on Wednesday decried a federal judge's decision to block the travel ban he enacted via a revised executive order as a politically motivated decision that makes the US look \"weak\" and vowed to take his case to the Supreme Court if necessary.\n\n\"The order he blocked was a watered-down version of the first order that was also blocked by another judge and should have never been blocked to start with,\" Trump said during a rally in Nashville. \"This new order was tailored to the dictates of the 9th Circuit's -- in my opinion -- flawed ruling.\"\n\nTrump called the court actions blocking his orders \"unprecedented judicial overreach.\"\n\nTrump also said he would have preferred to keep his original ban in place and suggested his administration should reinstate that order, which caused widespread upheaval in airports and sparked protests across the country. It was blocked last month by a separate federal court.\n\n\"And let me tell you something, I think we ought to go back to the first one and go all the way, which is what I wanted to do in the first place,\" Trump said.\n\nThe President's comments came during a previously scheduled campaign rally. It took place shortly after US District Court Judge Derrick Watson blocked Trump's executive order. The new travel ban was set to take effect Thursday.\n\nThe new executive order removed Iraq from the original list of seven banned countries, stripped away language about prioritizing religious minorities in the refugee admissions process and did not include an indefinite ban on Syrian refugees. But it still banned citizens of six Muslim-majority countries -- Iran, Libya, Somalia, Sudan, Syria and Yemen -- and temporarily stopped the admission of all refugees.\n\nTrump slammed the judge's decision as one that would make the US look weak and endanger US national security.\n\n\"We're talking about the safety of our nation. The safety and security of our people,\" Trump said. \"The danger is clear. The law is clear. The need for my executive order is clear. I was elected to change our broken and dangerous system and thinking in government that has weakened and endangered our country and left our people defenseless.\"\n\nTrump seized on the federal judge's decision to block the executive order about halfway through the rally, telling supporters he had \"bad news\" to announce.\n\nAs the \"bad news\" drew jeers from the crowd, Trump explained that he needed to be cautious in his criticism, an apparent reference to the flak he took after calling the first federal judge who ruled against his executive order a \"so-called judge.\"\n\n\"I have to be nice otherwise I'll get criticized for -- for speaking poorly about our courts. I'll be criticized by these people, among the most dishonest people in the world,\" Trump said referring to reporters in the room.\n\nStill, Trump argued that the judge's decision to block the order -- which agreed with arguments that the ban targeted Muslims on the basis of their religion -- was founded on political, not legal grounds.\n\nTrump also managed to knock his former 2016 rival, Hillary Clinton, during his criticism of the order as he argued that presidential powers should give him the right to block the entry of any class of individuals.\n\n\"The law and the Constitution give the President the power to suspend immigration when he deems or she -- fortunately it will not be Hillary ... \" Trump said as his crowd of supporters burst into cheers and deafening chants of \"Lock her up! Lock her up!\"\n\nThe chant was a common occurrence at Trump's rallies while he was running for president. Trump had pledged to appoint a special prosecutor to investigate Clinton for her use of a private email server while she was secretary of state. Despite the fact that FBI director James Comey recommended against criminal charges for Clinton for the server use over the summer, Trump told Clinton during a debate that if he were president, \"you'd be in jail.\"\n\nHowever, once Trump was elected, he said he wouldn't recommend prosecution of Clinton, whom he told New York Times reporters has \"suffered greatly.\"\n\nHe also said the idea of prosecuting Clinton is \"just not something I feel very strongly about.\"", "authors": ["Jeremy Diamond"], "publish_date": "2017-03-15", "source": "cnn", "top_words": ["ruling", "executive", "travel", "clinton", "judges", "trump", "ban", "blocking", "rails", "court", "federal", "blocked", "order", "president", "decision"], "summary": "Trump called the court actions blocking his orders \"unprecedented judicial overreach.\"\nIt took place shortly after US District Court Judge Derrick Watson blocked Trump's executive order.\nTrump slammed the judge's decision as one that would make the US look weak and endanger US national security.\nThe need for my executive order is clear.\nTrump seized on the federal judge's decision to block the executive order about halfway through the rally, telling supporters he had \"bad news\" to announce."}