{"url": "http://www.cnn.com/2017/06/14/politics/judges-trump-travel-ban/index.html", "id": "360", "title": "Judges keep a very close eye on Trump", "text": "(CNN) President Donald Trump has for months belittled federal judges on social media and tried to undermine their legitimacy in the public eye.\n\nIn a recent string of rulings against the administration's travel ban, judges have offered an implicit rejoinder by asserting their independence and authority to limit the executive branch.\n\nNone of the judges who ruled against the ban on nationals from six predominantly Muslim countries has referred to Trump's criticism of the courts. Their legal reasoning has responded to the administration's specific positions. Yet the language wielded has been has been sharp, even scathing, as they rebuffed the administration's arguments about national security. They have overall emphasized the judiciary's role in determining the law of the land.\n\nIn the latest decision, the San Francisco-based 9th US Circuit Court of Appeals on Monday acknowledged that judges traditionally defer to executive authority regarding who may enter the country.\n\nBut, the court wrote, \"immigration, even for the President, is not a one-person show.\"\n\nLifting a line from a 1981 Supreme Court opinion, the judges added, \"Deference does not mean abdication.\"\n\nLast month, the 4th US Circuit Court of Appeals employed stronger rhetoric as it rejected the administration and its \"dangerous idea -- that this court lacks the authority to review high-level government policy of the sort here.\"\n\n\"Although the Supreme Court has certainly encouraged deference in our review of immigration matters that implicate national security interests, it has not countenanced judicial abdication, especially where constitutional rights, values, and principles are at stake,\" the court wrote, siding with challengers of the travel ban who say it infringes religious rights.\n\nSo far, the message is that the third branch of government intends to provide a significant check on an executive proudly disrupting the status quo. This first big legal battle over Trump policy could foreshadow greater judicial scrutiny for his initiatives and escalating tensions between the White House and the courts.\n\nA crucial test could come as the Supreme Court considers whether to hear the dispute over the executive order that would suspend for 90 days the entry of nationals from Iran, Libya, Somalia, Sudan, Syria and Yemen.\n\nTrump said the ban was needed to safeguard against terrorism. Among his campaign promises, as stated on his website: \"a total and complete shutdown of Muslims entering the United States until our country's representatives can figure out what is going on.\"\n\nJUST WATCHED Trump pushes travel ban in tweetstorm Replay More Videos ... MUST WATCH Trump pushes travel ban in tweetstorm 02:30\n\nEarlier attacks on judges\n\nTrump's efforts to diminish the judiciary emerged during the 2016 presidential campaign. He derided US District Court Judge Gonzalo Curiel, hearing a fraud claims in San Diego against Trump University, for his Mexican heritage. Trump questioned his ability to rule fairly. Curiel was born in Indiana and has been a federal district court judge since 2012.\n\nAfter Trump became President, he continued the attacks. He referred to US District Court Judge James Robart, of Washington state, as a \"so-called judge\" and deemed his February order temporarily blocking the travel ban \"ridiculous.\" Trump also said \"if something happens blame him and court system.\"\n\nIn a similar vein, Trump took to Twitter on April 26 to declare \"ridiculous\" an adverse decision in separate litigation over \"sanctuary cities\" that decline to enforce immigration rules.\n\nEarlier this month, in a series of tweets defending his \"original travel ban, not the watered down, politically correct version,\" Trump said, \"The courts are slow and political!\"\n\nOn Tuesday morning, Trump leveled another broadside on Twitter, declaring that Monday's 9th Circuit ruling comes \"at such a dangerous time in the history of the country.\"\n\nWell, as predicted, the 9th Circuit did it again - Ruled against the TRAVEL BAN at such a dangerous time in the history of our country. S.C. — Donald J. Trump (@realDonaldTrump) June 13, 2017\n\nJudges have been reluctant to respond directly. In March, however, 9th Circuit Judge Jay Bybee, who was not part of Monday's panel decision, wrote without naming Trump: \"The personal attacks on the distinguished district judge [Robart] and our colleagues were out of all bounds of civic and persuasive discourse -- particularly when they came from the parties. ... Such personal attacks treat the court as though it were merely a political forum in which bargaining, compromise, and even intimidation are accepted principles.\"\n\nBybee, a conservative, offered the critique as he signaled support for Trump on his legal arguments. The judge was dissenting from a court order denying a new hearing in an earlier round of litigation on the travel ban.\n\nThe rulings in recent weeks marked a more substantive phase of federal appeals court action. In refusing to revive the travel ban, the 4th and 9th Circuits both cited its potential for unlawful discrimination. The 4th Circuit ruled on constitutional grounds, the 9th based on the administration's failure to comply with a federal statute.\n\nBoth, however, firmly rejected Trump arguments that courts lacked the authority even to decide the cases.\n\nIn Monday's decision, the 9th Circuit noted that the administration argued courts cannot review decisions related to the issuance or withholding of visas. At issue here, the court countered, was not a discrete set of visas but the president's \"promulgation of sweeping immigration policy.\"\n\nThat court said the Trump administration failed to justify the suspension for certain nationals. Federal immigration law allows the president to exclude people who could be \"detrimental\" to American interests but requires findings related to who might be dangerous and forbids nationality-based discrimination.\n\nThe 4th Circuit, meanwhile, highlighted Trump's anti-Muslim sentiment over the past year. That appeals court, along with district court judges who ruled against Trump, cited a 2005 Supreme Court decision that said judges should not \"turn a blind eye\" to the context of a government decision affecting religious rights.\n\nIn looking at past statements that might reveal officials' motivations, the high court declared: \"The world is not made brand new every morning.\"", "authors": ["Joan Biskupic", "Cnn Legal Analyst", "Supreme Court Biographer"], "publish_date": "2017-06-14", "source": "cnn", "top_words": ["travel", "judges", "trump", "ban", "circuit", "immigration", "judge", "court", "9th", "close", "eye", "decision"], "summary": "(CNN) President Donald Trump has for months belittled federal judges on social media and tried to undermine their legitimacy in the public eye.\nIn a recent string of rulings against the administration's travel ban, judges have offered an implicit rejoinder by asserting their independence and authority to limit the executive branch.\nJUST WATCHED Trump pushes travel ban in tweetstorm Replay More Videos ... MUST WATCH Trump pushes travel ban in tweetstorm 02:30Earlier attacks on judgesTrump's efforts to diminish the judiciary emerged during the 2016 presidential campaign.\nHe derided US District Court Judge Gonzalo Curiel, hearing a fraud claims in San Diego against Trump University, for his Mexican heritage.\nThat appeals court, along with district court judges who ruled against Trump, cited a 2005 Supreme Court decision that said judges should not \"turn a blind eye\" to the context of a government decision affecting religious rights."}