{"url": "http://tech.fortune.cnn.com/2017/01/28/us-companies-immigration-ban/", "id": "395", "title": "'Case by Case' Approach for U.S. Green Card Holders Under Trump's New Order", "text": "U.S. green card holders from Syria and six other Muslim-majority countries traveling outside the United States need to check with a U.S. consulate to see whether they can return, senior U.S. administration officials said on Saturday.\n\nNew restrictions on immigrants and refugees in an executive order signed by President Donald Trump will mean legal permanent residents who have passports from the seven countries have to be cleared back into the United States on a case-by-case basis, an official told reporters in a briefing.\n\n“It’s being cleared on a case-by-case basis and being moved expeditiously,” the official said.\n\nThe official defended the scope and execution of the new rules, saying it moved with “astonishing rapidity” but worked as intended.\n\nConfusion abounded at airports as immigration and customs officials struggled to interpret the new rules, with some legal residents who were in the air when the order was issued detained at airports upon arrival.\n\nGoogle CEO Orders Employees Back to the U.S. After President Trump’s Immigration Order\n\nThe ban affects travelers with passports from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\n\nThe official argued the pause on travel from the countries is a response to concerns that immigration and refugee programs are being abused. The Trump administration is developing stricter rules for vetting people who want to come to the United States.\n\nAsked about lawsuits filed against the order, the official declined specific comment, but said foreigners do not have a right to enter into the United States, and dismissed as “ludicrous” the notion that the move amounted to a “Muslim ban.”\n\nAfghanistan, Malaysia, Pakistan, Oman, Tunisia and Turkey were Muslim-majority countries not included in the order, a second official said.", "authors": [], "publish_date": "2017-01-28", "source": "cnn", "top_words": ["approach", "case", "official", "trump", "residents", "holders", "immigration", "card", "rules", "united", "states", "trumps", "countries", "syria", "green", "order"], "summary": "U.S. green card holders from Syria and six other Muslim-majority countries traveling outside the United States need to check with a U.S. consulate to see whether they can return, senior U.S. administration officials said on Saturday.\nThe official defended the scope and execution of the new rules, saying it moved with “astonishing rapidity” but worked as intended.\nGoogle CEO Orders Employees Back to the U.S. After President Trump’s Immigration OrderThe ban affects travelers with passports from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\nThe official argued the pause on travel from the countries is a response to concerns that immigration and refugee programs are being abused.\nThe Trump administration is developing stricter rules for vetting people who want to come to the United States."}