{"url": "http://www.cnn.com/2017/03/10/politics/keith-ellison-donald-trump-travel-ban/index.html", "id": "303", "title": "Ellison on travel ban: 'Just because it's legal doesn't make it right'", "text": "Story highlights The revised ban comes after Trump's original order was temporarily blocked by federal courts\n\nEllison said the new order amounts to religious discrimination\n\n(CNN) The possibility that President Donald Trump's revised travel ban may pass legal muster doesn't make it ethical, Rep. Keith Ellison said Friday.\n\n\"Just because it's legal doesn't make it right,\" Ellison, the first Muslim elected to Congress, told CNN's Alisyn Camerota on \"New Day.\"\n\nThe new travel ban came weeks after Trump's original executive order was temporarily blocked by federal courts. The revised order removes language in the original that indefinitely banned Syrian refugees and called for prioritizing the admission of refugees who are religious minorities in their home countries. It also bans immigration from six Muslim-majority countries.\n\nThe Minnesota Democrat said that regardless of revisions, the origin of Trump's controversial executive order is religious discrimination.\n\n\"It starts out with bad intentions. He campaigned on a Muslim ban. He said that explicitly,\" Ellison said. \"It has changed, but it's not changed to the point where it's no longer intended to harm and block people based on their religion.\"\n\nRead More", "authors": ["Eugene Scott"], "publish_date": "2017-03-10", "source": "cnn", "top_words": ["original", "travel", "right", "revised", "ban", "temporarily", "refugees", "trumps", "religious", "ellison", "order", "doesnt", "legal"], "summary": "Story highlights The revised ban comes after Trump's original order was temporarily blocked by federal courtsEllison said the new order amounts to religious discrimination(CNN) The possibility that President Donald Trump's revised travel ban may pass legal muster doesn't make it ethical, Rep. Keith Ellison said Friday.\n\"Just because it's legal doesn't make it right,\" Ellison, the first Muslim elected to Congress, told CNN's Alisyn Camerota on \"New Day.\"\nThe new travel ban came weeks after Trump's original executive order was temporarily blocked by federal courts.\nThe revised order removes language in the original that indefinitely banned Syrian refugees and called for prioritizing the admission of refugees who are religious minorities in their home countries.\nThe Minnesota Democrat said that regardless of revisions, the origin of Trump's controversial executive order is religious discrimination."}