{"url": "http://www.cnn.com/2017/03/24/politics/hawaii-travel-ban-judge-threatening-messages/index.html", "id": "322", "title": "Federal judge who blocked Trump's travel ban gets threats", "text": "Story highlights The FBI declined to provide additional details on the investigation\n\nJudge Derrick Watson has been the target of threats since the ruling\n\n(CNN) A Hawaii federal judge who ruled against President Donald Trump's revised travel ban has been the target of threatening messages, the FBI says.\n\nUS District Judge Derrick Watson's ruling last week resulted in a temporary restraining order nationwide -- hours before the revised travel ban was set to go into effect.\n\nIn the 43-page ruling , Watson concluded that the new executive order failed to pass legal muster, and the state had established \"a strong likelihood of success\" on their claims of religious discrimination.\n\nWatson, who presides in Honolulu, has received threatening messages since the ruling. FBI spokeswoman Michele Ernst said the agency is aware of the situation and prepared to assist.\n\nThe FBI declined to provide additional details on the investigation. The US Marshals Service, which is spearheading the investigation, said it does not discuss specific security measures.\n\nRead More", "authors": ["Faith Karimi", "Joe Sutton"], "publish_date": "2017-03-24", "source": "cnn", "top_words": ["ruling", "travel", "revised", "ban", "judge", "threatening", "threats", "gets", "order", "target", "trumps", "federal", "blocked", "watson", "provide", "fbi", "messages"], "summary": "Story highlights The FBI declined to provide additional details on the investigationJudge Derrick Watson has been the target of threats since the ruling(CNN) A Hawaii federal judge who ruled against President Donald Trump's revised travel ban has been the target of threatening messages, the FBI says.\nUS District Judge Derrick Watson's ruling last week resulted in a temporary restraining order nationwide -- hours before the revised travel ban was set to go into effect.\nIn the 43-page ruling , Watson concluded that the new executive order failed to pass legal muster, and the state had established \"a strong likelihood of success\" on their claims of religious discrimination.\nWatson, who presides in Honolulu, has received threatening messages since the ruling.\nThe US Marshals Service, which is spearheading the investigation, said it does not discuss specific security measures."}