{"url": "http://www.cnn.com/2017/01/29/opinions/translators-who-helped-us-are-left-in-the-cold-israel/index.html", "id": "399", "title": "Muslim translators who helped the US are hurt by Trump's ban (Opinion)", "text": "Story highlights Steve Israel: Muslim translators who helped US troops are among the most hurt by the ban\n\nThey risked their lives to serve the US military and intelligence forces, he writes\n\nFormer Rep. Steve Israel, a Democrat from New York, is chairman of the Long Island University Global Institute and a CNN contributor. The opinions expressed in this commentary are his.\n\n(CNN) President Trump's executive order banning refugees and others from entering the United States damages many; but none worse than a small group of Muslims who were willing to sacrifice their lives aiding our troops: language translators in Iraq and Afghanistan.\n\nThese people took a grave risk by serving the US military and intelligence forces in their home countries. Rather than plotting against us, they stood next to us, helping us understand local languages and dialects; gathering and interpreting lifesaving intelligence.\n\nAssisting our troops often branded these brave Iraqis and their families unfairly as traitors or American spies, making them prime targets for the same extremist groups we were fighting against.\n\nFacing grave danger in their home nation, they sought a new life in America, seeking only safety and the opportunity to work toward the American dream. In fact, in 2007, our immigration system faced an influx of visa applications from Iraqis who served as translators for the US military in the Iraq War.\n\nThat year, I met a brave man named Norwas: one of many Iraqis who assisted our troops in Iraq and arrived in the United States on a special immigrant visa. Through his story , I learned that a translator's arrival in the United States was only the next chapter in a story of struggle, not the happy ending imagined.\n\nRead More", "authors": ["Steve Israel"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["hurt", "lives", "steve", "ban", "iraq", "visa", "iraqis", "opinion", "united", "trumps", "states", "military", "helped", "muslim", "translators", "troops"], "summary": "(CNN) President Trump's executive order banning refugees and others from entering the United States damages many; but none worse than a small group of Muslims who were willing to sacrifice their lives aiding our troops: language translators in Iraq and Afghanistan.\nThese people took a grave risk by serving the US military and intelligence forces in their home countries.\nIn fact, in 2007, our immigration system faced an influx of visa applications from Iraqis who served as translators for the US military in the Iraq War.\nThat year, I met a brave man named Norwas: one of many Iraqis who assisted our troops in Iraq and arrived in the United States on a special immigrant visa.\nThrough his story , I learned that a translator's arrival in the United States was only the next chapter in a story of struggle, not the happy ending imagined."}