{"url": "http://www.cnn.com/2017/06/04/politics/trump-travel-ban-supreme-court/index.html", "id": "348", "title": "Has Trump finally found a court that will endorse the travel ban once and for all?", "text": "(CNN) With a stroke of a pen in January, President Donald Trump triggered chaos as lawful permanent residents, refugees and others seeking entry suddenly found themselves in a legal no man's land, stuck between the US border and the President's executive order on immigration.\n\nNow, after the courts have blocked the order and the President has issued a revised edition, the Department of Justice has gone to the Supreme Court.\n\nHas the President finally found a court that will endorse the legal underpinnings of the travel ban and allow it to go into effect?\n\nIn legal briefs filed at 10:51 p.m. ET Thursday night, acting Solicitor General Jeffrey B. Wall asked the court for two things: allow the ban to go into effect now and hear arguments concerning its legality next fall.\n\nMany believe the justices will ultimately want to review the lower court opinions that struck down a major initiative of the Executive Branch. But would they allow the ban to go into effect immediately, before they even have the opportunity to hear arguments?\n\nAs the court contemplates the government's requests -- and the country and much of the world waits -- legal experts are in overdrive exploring potential off ramps for the justices. As usual, Justice Anthony Kennedy could be the decider-in-chief.\n\nComplicating efforts could be the President's own words. Trump on Monday emphatically referred to his executive order on immigration as a \"travel ban\" and said his Justice Department should not have submitted a \"watered down, politically correct version\" to the Supreme Court.\n\nTrump's suggestion that changes to the ban were due to political correctness could hamper his administration's legal argument that the executive order did not target Muslims. As a candidate, Trump called for a \"total and complete shutdown\" of Muslim immigration to the United States, and Justice Department lawyers have gone to great lengths to avoid calling it a \"travel ban\" in court, referring to it as a \"temporary pause\" or simply \"the executive order.\"\n\nShould the ban go into effect immediately?\n\nThe first request the government makes -- asking for the court to put a hold on the lower courts' injunctions -- might be an uphill climb.\n\nOne factor the justices will consider is whether \"irreparable harm\" would result from a denial of the government's request, keeping the lower courts' injunctions on the ban in place.\n\nLate Friday afternoon, the justices asked the challengers to respond to the government's petition.\n\nThe challengers are likely to point out that since the revised travel ban was blocked before it could ever go into effect, there can't be any \"irreparable harm\" in maintaining the status quo.\n\nThat might doom the government's application.\n\nJUST WATCHED Court upholds blocking of Trump's travel ban Replay More Videos ... MUST WATCH Court upholds blocking of Trump's travel ban 01:37\n\nBut what if the court did grant the government's request and allowed the ban to go into effect now? That could unleash an unusual circumstance because of the travel ban's unique time limitation.\n\nThe ban suspends entry for 90 days for those seeking entry from six Muslim-majority countries. So, if the court allows it to go into effect immediately, by the time the justices hear the case next fall, the ban will have expired.\n\n\"At that point, the case may very well be moot,\" wrote Leah Litman, an assistant professor of law at University of California Irvine School of Law.\n\nEasy way out?\n\nSome believe the Supreme Court might be able to find a way to defuse the issue that is tangled up in two slightly different injunctions that have been issued by the Fourth Circuit Court of Appeals and by a district court judge under the jurisdiction of the Ninth Circuit Court of Appeals.\n\nIn essence, the justices would respond to the government's stay application by narrowing the scope of the injunctions, allowing some of the challenged provisions of the ban go into effect while upholding a block on the most contentious aspect: the section that actually suspends travel.\n\nHarvard Law School Professor Mark Tushnet floated the idea, calling it an \"easy out\" for the court.\n\n\"The case will then almost certainly be moot by the time it's argued, and all that would be left would be to clean things up, presumably by directing that whatever injunctions are still in effect should be vacated,\" he posited on the Balkinization blog, which discusses legal matters.\n\nThe Kennedy factor\n\nBut what if the court does not take Tushnet's off ramp and eventually digs into the merits of the case? Kennedy could, as usual, be a critical vote.\n\nHere's why:\n\nChallengers say the order is motivated by religious animus in violation of the Establishment Clause of the Constitution. The President's intent, they say, is evident from statements he made on the campaign trail referring to a so-called \"Muslim Ban.\"\n\nIn its opinion that upheld a halt of the ban, the Fourth Circuit Court of Appeals issued a ringing endorsement of that argument.\n\nPhotos: Today's Supreme Court The justices of the US Supreme Court sit for an official photograph on June 1, 2017. In the front row, from left, are Ruth Bader Ginsburg, Anthony Kennedy, Chief Justice John Roberts, Clarence Thomas and Stephen Breyer. In the back row, from left, are Elena Kagan, Samuel Alito, Sonia Sotomayor and Neil Gorsuch. Hide Caption 1 of 10 Photos: Today's Supreme Court In 2005, John Roberts was nominated by President George W. Bush to succeed Sandra Day O'Connor as an associate justice on the US Supreme Court. After Chief Justice William Rehnquist died, Bush named Roberts to the chief justice post. The court has moved to the right during Roberts' tenure, although Roberts supplied the key vote to uphold Barack Obama's Affordable Care Act. Hide Caption 2 of 10 Photos: Today's Supreme Court Anthony Kennedy was appointed to the court by President Ronald Reagan in 1988. He is a conservative justice but has provided crucial swing votes in many cases. He has authored landmark opinions that include Obergefell v. Hodges, which legalized same-sex marriage nationwide. Hide Caption 3 of 10 Photos: Today's Supreme Court Clarence Thomas is the second African-American to serve on the court, succeeding Thurgood Marshall when he was appointed by President George H. W. Bush in 1991. Thomas is a conservative and a strict constructionist who supports states' rights. Hide Caption 4 of 10 Photos: Today's Supreme Court Ruth Bader Ginsburg is the second woman to serve on the Supreme Court. Appointed by President Bill Clinton in 1993, she is a strong voice in the court's liberal wing. Hide Caption 5 of 10 Photos: Today's Supreme Court Stephen Breyer was appointed by Clinton in 1994 and is part of the court's liberal wing. Hide Caption 6 of 10 Photos: Today's Supreme Court Samuel Alito was appointed by President George W. Bush in 2006 and is known as one of the most conservative justices to serve on the court in modern times. Hide Caption 7 of 10 Photos: Today's Supreme Court Sonia Sotomayor is the court's first Hispanic and third female justice. She was appointed by Obama in 2009 and is regarded as a resolutely liberal member of the court. Hide Caption 8 of 10 Photos: Today's Supreme Court Elena Kagan is the fourth female justice to ever be appointed, and she is counted among the court's liberal wing. She was appointed by Obama in 2010 at the age of 50. She is the court's youngest member. Hide Caption 9 of 10 Photos: Today's Supreme Court Neil Gorsuch is the court's newest member. He was chosen by President Donald Trump to replace Antonin Scalia, who died in 2016. Hide Caption 10 of 10\n\n\"Then-candidate Trump's campaign statements reveal that on numerous occasions, he expressed anti-Muslim sentiment, as well as his intent, if elected, to ban Muslims from the United States.\"\n\nIn briefs filed with the Supreme Court, however, Wall insists that the courts were wrong to look at Trump's campaign statements.\n\nInstead, he argues, they need to look only at the face of the order. In doing so, they will find the order is neutral with respect to religion and is necessary to support national security determinations.\n\n\"It is religion-neutral in operation,\" Wall wrote. \"It draws distinctions among countries based on national-security risks identified by Congress and the Executive (Branch), not religion.\"\n\nThat's where Kennedy could come in play. Would he consider the campaign statements?\n\nJUST WATCHED Sessions: Taking travel ban to Supreme Court Replay More Videos ... MUST WATCH Sessions: Taking travel ban to Supreme Court 00:58\n\nChallengers say he would, based upon a concurring opinion he wrote in 2015 in a case called Kerry v. Din.\n\n\"Justice Kennedy's separate opinion in that case raised the prospect that courts could look behind the neutral justifications offered by the government in immigration cases in which the plaintiffs claim that the relevant officials acted in bad faith,\" said CNN contributor Stephen I. Vladeck of the University of Texas School of Law.\n\n\"Here, the question is whether Justice Kennedy would look at an array of statements by Candidate Trump, President Trump, and his advisers and surrogates as evidence that the travel ban was in fact motivated by inappropriate anti-Muslim bias,\" he said.\n\nNot surprisingly, in blocking the order, the Fourth Circuit relied in large part on what Kennedy wrote in Din.\n\nIn its opinion, the majority of the Fourth Circuit said: \"Kennedy explained that where a plaintiff makes 'an affirmative showing of bad faith' ... courts may 'look behind' the challenged action.\"\n\nIn his legal filings, Wall said the Court of Appeals got it wrong and rested on a \"misreading of a statement in Justice Kennedy's concurrence in Din.\"\n\nWall said, in essence, that Kennedy was not endorsing a \"wide-ranging search for pretext.\"\n\nEnd of the term\n\nThe court is likely to act on the government's requests sometime in June during the final month of the current term. The travel ban has turned a sleepy term into a potential blockbuster.\n\nAs the justices race to finish opinions from this term, they are also considering hot button issues for the next term, including cases on the Second Amendment, religious liberty and even a follow-up to the same-sex marriage opinion from 2015.\n\nNow, the travel ban is a part of that list.", "authors": ["Ariane De Vogue", "Cnn Supreme Court Reporter"], "publish_date": "2017-06-04", "source": "cnn", "top_words": ["travel", "courts", "trump", "ban", "supreme", "kennedy", "court", "president", "hide", "todays", "finally", "justice", "endorse"], "summary": "Has the President finally found a court that will endorse the legal underpinnings of the travel ban and allow it to go into effect?\nJUST WATCHED Court upholds blocking of Trump's travel ban Replay More Videos ... MUST WATCH Court upholds blocking of Trump's travel ban 01:37But what if the court did grant the government's request and allowed the ban to go into effect now?\nPhotos: Today's Supreme Court The justices of the US Supreme Court sit for an official photograph on June 1, 2017.\nHide Caption 4 of 10 Photos: Today's Supreme Court Ruth Bader Ginsburg is the second woman to serve on the Supreme Court.\nJUST WATCHED Sessions: Taking travel ban to Supreme Court Replay More Videos ... MUST WATCH Sessions: Taking travel ban to Supreme Court 00:58Challengers say he would, based upon a concurring opinion he wrote in 2015 in a case called Kerry v. Din."}