{"url": "http://money.cnn.com/2017/02/02/technology/elon-musk-trump-travel-ban/index.html", "id": "37", "title": "Elon Musk is taking his travel ban objections directly to Trump", "text": "Elon Musk says he will raise objections to President Trump's controversial immigration order at a meeting at the White House on Friday.\n\nThe Tesla (TSLA) chief defended his participation in Trump's business advisory council just hours after Uber CEO Travis Kalanick announced he was pulling out of it.\n\n\"Advisory councils simply provide advice and attending does not mean that I agree with actions by the Administration,\" Musk said in a statement posted on Twitter late Thursday.\n\n\"I understand the perspective of those who object to my attending this meeting,\" he said. \"But I believe at this time that engaging on critical issues will on balance serve the greater good.\"\n\nRelated: Uber CEO drops out of Trump's business advisory council\n\nMusk said that he and others would \"express our objections\" to Trump's travel ban that affects all refugees as well as people from seven Muslim-majority countries -- and \"offer suggestions for changes to the policy.\"\n\nThe meeting Friday is the first for the economic advisory council, which included 19 business leaders before Kalanick dropped out.\n\n\"Joining the group was not meant to be an endorsement of the president or his agenda but unfortunately it has been misinterpreted to be exactly that,\" Kalanick said in a memo to employees.\n\nRelated: Companies and executives speak out on Trump's travel ban\n\nOther high-profile members of the council, which is officially called the Strategic and Policy Forum, include Jamie Dimon of JPMorgan Chase (JPM), Mary Barra of General Motors (GM) and Jim McNerney of Boeing (BA).\n\nMusk, who's also the CEO of SpaceX, said he's taking part in order to make his case for his main goals, which are \"to accelerate the world's transition to sustainable energy and to help make humanity a multi-planet civilization.\"\n\nThe blanket entry ban on citizens from certain primarily Muslim countries is not the best way to address the country's challenges — Elon Musk (@elonmusk) January 29, 2017\n\nHe has previously voiced criticism of Trump's travel ban, calling it \"not the best way to address the country's challenges.\"\n\n\"Many people negatively affected by this policy are strong supporters of the US,\" he tweeted over the weekend. \"They've done right, not wrong & don't deserve to be rejected.\"\n\nRelated: Elon Musk's surprising secret weapon: Trump?\n\nDays before Trump won the election, Musk said the Republican nominee was \"not the right guy.\" But the Tesla chief has shown a willingness to engage in dialog with Trump and his team, joining the business council and visiting Trump Tower before the inauguration.\n\nThe relationship has caught the attention of Tesla investors, with one analyst suggesting it could provide \"strategic value\" for the company.", "authors": ["Jethro Mullen"], "publish_date": "2017-02-02", "source": "cnn", "top_words": ["travel", "council", "trump", "objections", "taking", "elon", "ban", "tesla", "kalanick", "trumps", "meeting", "directly", "musk", "business"], "summary": "Elon Musk says he will raise objections to President Trump's controversial immigration order at a meeting at the White House on Friday.\nThe Tesla (TSLA) chief defended his participation in Trump's business advisory council just hours after Uber CEO Travis Kalanick announced he was pulling out of it.\nRelated: Uber CEO drops out of Trump's business advisory councilMusk said that he and others would \"express our objections\" to Trump's travel ban that affects all refugees as well as people from seven Muslim-majority countries -- and \"offer suggestions for changes to the policy.\"\nThe blanket entry ban on citizens from certain primarily Muslim countries is not the best way to address the country's challenges — Elon Musk (@elonmusk) January 29, 2017He has previously voiced criticism of Trump's travel ban, calling it \"not the best way to address the country's challenges.\"\nBut the Tesla chief has shown a willingness to engage in dialog with Trump and his team, joining the business council and visiting Trump Tower before the inauguration."}