{"url": "http://money.cnn.com/2017/02/01/pf/college/somalia-somaliland-students-trump-travel-ban/index.html", "id": "35", "title": "Somaliland students to Trump: You're destroying our dreams", "text": "President Trump's decision to ban the citizens of seven Muslim-majority countries has jeopardized the university dreams of hundreds of students from the self-declared republic of Somaliland.\n\nThe Abaarso boarding school in Somaliland has become an unlikely feeder school for elite universities in the United States, having sent dozens of its students to schools like Harvard, Yale and MIT since 2013.\n\nSomaliland is an autonomous region that declared its independence from Somalia in 1991, but its residents are also included in Trump's travel ban. The risk of the ban being extended beyond 90 days has made students at the school question their future.\n\n\"I feel lucky that I've been accepted to an elite college in the U.S., but also sad that I might not be able to start my college education,\" said Shukri Ali, a 19-year-old Abaarso student who was accepted last month to study at Wellesley College in September.\n\nShe said she wants to study neuroscience in order to open a hospital in Somaliland after completing her education.\n\nDespite the uncertainty, Ali was stoic, saying she accepts Trump's explanation that the travel ban was intended to keep the U.S. safe.\n\n\"I will not take this personally because I know I'm not a terrorist,\" she said.\n\nThe Abaarso school was founded in 2009 by Jonathan Starr, an American former hedge fund manager. It was designed to educate underprivileged kids in the local community.\n\nStarr said he's now concerned about his students' ability to study and travel, and he argued that the ban was counterproductive.\n\n\"Our students are wonderful for America and its safety,\" he said. \"They are only in the U.S. to get the education needed to develop their country.\"\n\nStarr noted that the first five of his former students will be graduating from U.S. colleges this year and plan to come back home.\n\n\"They'll be educating their population and developing industry using American know-how. A developed Somaliland and Somalia is good for America and its safety,\" he said.\n\nRelated: Trump's immigration ban triggers panic at universities\n\nStarr's students have secured millions of dollars in scholarships to pursue higher education. Most Abaarso students need full scholarships to pursue their undergraduate studies, which can cost up to $50,000 per year.\n\nStarr said it's important for them to study in the U.S., where scholarship financing is more readily available.\n\n\"Europe has few full scholarships for international students. Our students have no money so they must get full scholarships,\" he said.\n\nStarr said he is worried about students in Somaliland, and those already studying in the U.S. As it stands now, anyone with a Somaliland passport who leaves the U.S. risks being barred from re-entry.\n\nRelated: The world's best university costs just $12,000 a year\n\nStarr has worked for years to build up the reputation of his school in Somaliland.\n\nGetting colleges to notice Abaarso's bright students was a struggle in the beginning. Starr said he was aggressive about canvassing universities and promoting his school.\n\nStarr also works with U.S. boarding schools to send his students on extended exchanges to ensure they are up-to-speed with their Western peers before attending college. This additional year -- or years -- of education helps students acclimatize to Western culture.\n\nFahima Ali, an Abaarso student who is finishing her final year of high school in upstate New York, said she's relieved that she can stay in the U.S. and begin her studies at Columbia University in the autumn. But Ali -- who is not related to Shukri Ali -- said she is upset that her classmates and younger siblings may not have these opportunities.\n\n\"Not letting people into the U.S. for their education is basically destroying their dreams,\" she said.\n\n\"We live in a world where there are people who are here to support us ... We should just stay as optimistic as we can and keep working hard,\" she said.\n\nAbaarso currently has 225 students who are taught by American teachers on volunteer salaries. Starr said demand for places at his school has shot up, with 20 applicants for every spot.", "authors": ["Alanna Petroff"], "publish_date": "2017-02-01", "source": "cnn", "top_words": ["dreams", "trump", "ban", "scholarships", "ali", "youre", "trumps", "school", "destroying", "abaarso", "study", "students", "education", "somaliland"], "summary": "President Trump's decision to ban the citizens of seven Muslim-majority countries has jeopardized the university dreams of hundreds of students from the self-declared republic of Somaliland.\nThe risk of the ban being extended beyond 90 days has made students at the school question their future.\nThe Abaarso school was founded in 2009 by Jonathan Starr, an American former hedge fund manager.\nRelated: Trump's immigration ban triggers panic at universitiesStarr's students have secured millions of dollars in scholarships to pursue higher education.\nMost Abaarso students need full scholarships to pursue their undergraduate studies, which can cost up to $50,000 per year."}