{"url": "http://money.cnn.com/2017/08/23/technology/marc-benioff-salesforce-earnings-charlottesville/index.html", "id": "429", "title": "Salesforce CEO bemoans 'horrors of the last week'", "text": "Marc Benioff kicked off Salesforce's second-quarter earnings call with an urgent plea: \"This hatred must end now.\"\n\nThe company's CEO began what is usually a formulaic presentation to investors by commenting on violence at a rally of white supremacists in Charlottesville, Virginia and the terror attacks in Spain.\n\n\"The world has watched with all of us the horrors of the last week taking place in the United States and Spain,\" he said Tuesday. \"The pure hatred that we have seen displayed is everything we all want to end.\"\n\nBenioff went into particular detail about the events in Charlottesville, where an alleged Nazi sympathizer drove his car into a crowd of counter-protesters, killing one woman and wounding 19.\n\nWhat happened behind the scenes as Trump's business councils fell apart\n\n\"I've been especially disheartened to see the display of symbols of hatred including Nazi flags and salutes to KKK hoods,\" he said. \"The horrible, tragic death of Heather Heyer was a senseless act of terror, and this hatred must end now.\"\n\nIn the call, Benioff did not directly take on President Trump, whose response to Charlottesville has been widely criticized, including by top business leaders.\n\nThe president's repeated insistence that the violence in Virginia should be blamed on \"many sides\" led to the dissolution of his two business advisory councils last week.\n\nRelated: A timeline of President Trump's very bad week with business\n\nBenioff wasn't a member of either council, but he has expressed his support on Twitter for executives who decided to take a stand.\n\n\"CEOs have the obligation to stand for what is morally right,\" he tweeted on Saturday.\n\nCEOs have the obligation to stand for what is morally right. @dgelles claims The Moral Voice of Corporate America.https://t.co/ldJuvCNUuS — Marc Benioff (@Benioff) August 19, 2017\n\nThe Salesforce (CRM) CEO has weighed in on a number of national issues so far this year.\n\nIn July, he tweeted support for transgender members of the military after Trump said he would ban them from serving.\n\nThe month before, he said he was \"deeply disappointed\" by the president's decision to withdraw from the Paris climate agreement.\n\nDeeply disappointed by President's decision to withdraw from ParisAgreement. We will double our efforts to fight climate change. pic.twitter.com/cmCLf9CoVY — Marc Benioff (@Benioff) June 1, 2017\n\nAnd in January, he made clear his opposition to the president's ban on travel from seven Muslim-majority countries.\n\n\"When we close our hearts & stop loving other people as ourselves (MK 12:31) we forget who we truly are---a light unto the nations. #noban,\" he tweeted.", "authors": ["Julia Horowitz"], "publish_date": "2017-08-23", "source": "cnn", "top_words": ["marc", "charlottesville", "benioff", "virginia", "salesforce", "week", "tweeted", "ceo", "withdraw", "horrors", "bemoans", "hatred", "business", "presidents"], "summary": "Marc Benioff kicked off Salesforce's second-quarter earnings call with an urgent plea: \"This hatred must end now.\"\nThe company's CEO began what is usually a formulaic presentation to investors by commenting on violence at a rally of white supremacists in Charlottesville, Virginia and the terror attacks in Spain.\n\"The world has watched with all of us the horrors of the last week taking place in the United States and Spain,\" he said Tuesday.\n@dgelles claims The Moral Voice of Corporate America.https://t.co/ldJuvCNUuS — Marc Benioff (@Benioff) August 19, 2017The Salesforce (CRM) CEO has weighed in on a number of national issues so far this year.\npic.twitter.com/cmCLf9CoVY — Marc Benioff (@Benioff) June 1, 2017And in January, he made clear his opposition to the president's ban on travel from seven Muslim-majority countries."}