{"url": "http://www.cnn.com/2017/01/26/opinions/trump-abandoning-americas-principles-aslan/index.html", "id": "409", "title": "Trump abandoning America's principles", "text": "Story highlights Reza Aslan says Donald Trump's proposals amount to a religious test on migration\n\nAslan: Trump takes another step to forsaking principles upon which Constitution rests\n\nReza Aslan is the author of \"Zealot: The Life and Times of Jesus of Nazareth\" and the host of CNN's new original series \"Believer With Reza Aslan,\" which premieres at 10 p.m. ET March 5. The views expressed are his own.\n\n(CNN) When I was 7, my family fled a violent revolution in Iran that had transformed our country from an oppressive secular dictatorship to an even more oppressive religious one. We arrived in the United States with nothing but a single suitcase each. We had no money, no jobs and no place to live but a cramped, one-room motel we could barely afford.\n\nReza Aslan\n\nThis was during the Iranian hostage crisis -- 444 days in which Americans were held captive in the US Embassy in Tehran. People would routinely shout at us on the street, call us terrorists, tell us to \"go back home.\"\n\nIt didn't matter that we had no home; we had abandoned everything and everyone we knew for an uncertain life in a foreign land precisely because we were fleeing the same repressive regime that our neighbors were so frightened of. What mattered was that we looked different. We seemed different. And so we became the enemy.\n\nAnd yet we knew that no matter what happened, we had the law on our side. That was, after all, the entire reason we had come to the United States. While many of our friends and family members in Iran fled to France, Germany and the United Kingdom, we chose America because we knew what America meant. We knew what it stood for. We were certain we could weather any attack on our faith or ethnicity because the US Constitution -- which we had heard so much about in Iran -- would be our shield against the fears and prejudice of our neighbors.\n\nFollow CNN Opinion Join us on Twitter and Facebook\n\nToday, the man whose job it is to enforce that Constitution is taking yet another step toward abandoning the principles upon which it was written. Donald Trump is expected to sign an executive order that will effectively bar citizens of a number of Muslim countries -- including Iraq, Iran, Yemen, Somalia and Syria -- from entering the United States. The reported plan would be a first step in Trump's repeated promise of a ban on all Muslim immigrants", "authors": ["Reza Aslan"], "publish_date": "2017-01-26", "source": "cnn", "top_words": ["principles", "iran", "reza", "aslan", "trump", "constitution", "abandoning", "americas", "united", "knew", "trumps", "step", "states"], "summary": "We arrived in the United States with nothing but a single suitcase each.\nThat was, after all, the entire reason we had come to the United States.\nFollow CNN Opinion Join us on Twitter and FacebookToday, the man whose job it is to enforce that Constitution is taking yet another step toward abandoning the principles upon which it was written.\nDonald Trump is expected to sign an executive order that will effectively bar citizens of a number of Muslim countries -- including Iraq, Iran, Yemen, Somalia and Syria -- from entering the United States.\nThe reported plan would be a first step in Trump's repeated promise of a ban on all Muslim immigrants"}