{"url": "http://money.cnn.com/2017/01/30/media/trump-reality-tv/index.html", "id": "413", "title": "The Trump Show: Controlled distraction", "text": "With the nation still erupting over his travel ban on refugees and people from seven majority-Muslim countries, President Trump made a programming announcement: Tuesday at 8 p.m. -- what's known as \"prime time\" in the TV business -- he would announce his nominee for the Supreme Court.\n\n\"I have made my decision on who I will nominate for The United States Supreme Court,\" Trump tweeted Monday morning. \"It will be announced live on Tuesday at 8:00 P.M. (W.H.)\"\n\nThe announcement was unrelated to the controversial executive order he had signed late Friday afternoon, and the chaos that order had sown in cities and airports around the world. In television parlance, he was counterprogramming: pitting one show (his announcement) against another (the rolling and largely negative coverage of his executive order and the protests against it).\n\nIn turning one of the most consequential decisions of the presidency into a primetime television event, and doing so before publicly sorting out the details of his latest executive order, Trump is governing in the way a television executive might, making moves that have the effect of controlling the narrative and driving ratings.\n\nRelated: Donald Trump's photo op presidency\n\nThe decision on timing was Trump's idea, an aide said Monday. Modeled after President George W. Bush's introduction of John Roberts as his nominee for chief justice of the Supreme Court in an evening appearance in the East Room of the White House, the aide said, it was an attempt to draw a larger audience on Tuesday evening than he would receive during the day.\n\nIt's a familiar play for Trump: During his presidential campaign, he made controversial statements or scheduled rallies to distract attention from his opponents. Days before the Iowa caucuses, Trump hosted a veterans' benefit at the same time as the Fox News debate he had chosen to skip. When he was under fire for attacking the parents of U.S. Army Captain Humayun Khan, he announced that he would not necessarily endorse Paul Ryan or John McCain in their respective primaries. And during the transition, Trump attacked the cast of \"Hamilton\" (saying they'd been rude to then-Vice President-elect Mike Pence) in what was widely seen as an effort to distract attention away from coverage of his financial conflicts of interest. During the transition, he scheduled a press conference on the same day several of his cabinet nominees were in confirmation hearings. Again, insiders thought the intent was to keep the media distracted.\n\nAs president, however, Trump's big swings haven't moved the news cycle quite as much as they once did. Every major news organization covered Trump's Supreme Court tweet, but normally an impending nomination announcement would dominate the news; on Monday, it barely registered amid the cacophony of headlines and analysis surrounding the travel ban. At Monday's White House press briefing, the majority of questions focused on the ban. There were only two about the forthcoming Supreme Court nominee.\n\nWhite House Press Secretary Sean Spicer was also asked why Trump moved up the announcement from Thursday to Tuesday. Spicer's response was simply, \"Because he wanted to.\"\n\nTen days into his presidency, it may be that the media is figuring Trump's game out. It may also be that some decisions Trump makes -- including the most recent executive order -- will be so controversial or so historic, or both, that they cannot be counterprogrammed, even by the president himself.", "authors": ["Dylan Byers"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["executive", "trump", "supreme", "television", "court", "president", "trumps", "controlled", "press", "order", "announcement", "distraction"], "summary": "\"I have made my decision on who I will nominate for The United States Supreme Court,\" Trump tweeted Monday morning.\nThe announcement was unrelated to the controversial executive order he had signed late Friday afternoon, and the chaos that order had sown in cities and airports around the world.\nIt's a familiar play for Trump: During his presidential campaign, he made controversial statements or scheduled rallies to distract attention from his opponents.\nThere were only two about the forthcoming Supreme Court nominee.\nWhite House Press Secretary Sean Spicer was also asked why Trump moved up the announcement from Thursday to Tuesday."}