{"url": "http://www.cnn.com/2017/01/28/politics/what-to-know-about-immigration-order/index.html", "id": "417", "title": "What immigrants need to know about Trump's order", "text": "(CNN) Amid the confusion over President Donald Trump's executive order limiting immigration, immigrants -- those living in the United States and those wanting to travel here -- are understandably worried. Here are some things you need to know:\n\nHow do I know if it affects me?\n\nFor now, President Trump's executive order affects citizens of seven Muslim-majority countries.\n\nThey are: Iraq, Iran, Libya, Somalia, Sudan, Syria and Yemen. But the executive order also makes clear those seven countries are just a starting point for a likely broader ban that might include more countries.\n\nWhat can I do to protect myself?\n\nIf you're a citizen of any of the countries listed above, do not travel outside the US at least for the next 90 days.\n\nWhat if I have an emergency and I have to travel?\n\nIf you absolutely HAVE to travel, please consult an immigration lawyer first.\n\nWhat if I am already abroad and need to travel back to the US?\n\nIf you're a citizen of any of the countries listed above, you may have difficulty getting back into the US.\n\nIf you're a lawful permanent resident of the US from any of the countries above, get in touch with an immigration lawyer before flying back. Even though the White House's latest guidance is green card holders won't be affected, it's best to check.\n\nWhat if I'm a naturalized US citizen?\n\nIf you're an American citizen, you should be fine -- even if you are from one of the targeted countries.\n\nCan my relatives fly back with me if I'm a citizen?\n\nNot if you're from one of the countries listed above. In that case, your relatives may face difficulties at immigration upon entering the US.\n\nWhat if I have family or friends who were waiting to resettle to the US as refugees?\n\nThe executive order also halted the refugee program, at least for the next 120 days. This applies to all refugees, not just those from the seven countries above.\n\nIn the case of Syria, the resettlement process has been halted indefinitely.\n\nWhat else do I need to know?\n\nKnow your rights. The Immigration Defense Project has prepared a flyer that outlines how to lawfully interact with Immigration and Customs Enforcement agents if they come to your house.", "authors": ["Saeed Ahmed"], "publish_date": "2017-01-28", "source": "cnn", "top_words": ["executive", "seven", "travel", "immigrants", "immigration", "know", "youre", "trumps", "need", "countries", "listed", "citizen", "order"], "summary": "(CNN) Amid the confusion over President Donald Trump's executive order limiting immigration, immigrants -- those living in the United States and those wanting to travel here -- are understandably worried.\nFor now, President Trump's executive order affects citizens of seven Muslim-majority countries.\nBut the executive order also makes clear those seven countries are just a starting point for a likely broader ban that might include more countries.\nThe executive order also halted the refugee program, at least for the next 120 days.\nThis applies to all refugees, not just those from the seven countries above."}