{"url": "http://www.cnn.com/2017/03/07/health/travel-ban-doctors-by-the-numbers-trnd/index.html", "id": "426", "title": "Here's how the travel ban could affect your health", "text": "(CNN) President Trump has made it clear that health care and immigration reform are both big priorities for his administration. But have you ever considered where these two huge issues intersect?\n\nHere is an interesting detail about Trump's new executive order on immigration : Thousands of America's doctors hail from the six affected countries.\n\nWhat does that mean for you? It depends on where you live, and what the future of health care professions will look like under these new immigration laws. Some things to think about:\n\nTrump's new travel ban targets 6 Muslim majority countries\n\nThe US has nearly a million working physicians\n\nThough the number is always changing, the Henry J Kaiser Family Foundation's latest figures show the total at 926,119. Bear in mind this number is specialists and primary care physicians combined.\n\nThe six affected countries provide thousands of these physicians\n\nAccording to the Immigrant Doctors Project, headed by researchers from Harvard and MIT, more than 7,000 physicians in the US were trained in a country blacklisted under the new immigration order . That may not sound like a lot, but if you were to take away all of these physicians, it would be like taking away every physician in the state of Arkansas.\n\nThese physicians are responsible for millions of lives\n\nThat's a lot of appointments, and a lot of people counting on these doctors to be around. The state of Michigan alone relies on physicians from travel ban countries for 1.2 million appointments a year . Sure, if you live in an urban area or in a state with a lot of options, you may not miss a few dozen physicians, but factor in rural areas and the possible absence of specialists like neurologists and cardiologists, and these few thousands physicians start to make a real difference.\n\nThe Rust Belt and Appalachia are highly reliant on them\n\nCities and states in the Midwest have a high concentration of doctors whose backgrounds mean they would be affected by the new travel ban. Again, it's not just about the doctors themselves -- it's also about the patients they treat. Other than California and New York, which top the list by population density and diversity alone, the states that rely most on physicians trained in travel ban countries are Michigan, Ohio, Illinois, Pennsylvania and Florida.\n\nThe ban has far-reaching implications\n\nObviously, just because the new travel ban was signed doesn't mean these thousands of doctors are going to vanish on the spot. However, the ban and its implications could change the future of health care in America -- if doctors from banned countries can't come to practice, or promising medical students can't come to study, the holes they leave in our health care needs down the road could affect millions of people.", "authors": ["Aj Willingham"], "publish_date": "2017-03-07", "source": "cnn", "top_words": ["heres", "doctors", "travel", "ban", "thousands", "affect", "immigration", "lot", "countries", "physicians", "health", "care"], "summary": "(CNN) President Trump has made it clear that health care and immigration reform are both big priorities for his administration.\nIt depends on where you live, and what the future of health care professions will look like under these new immigration laws.\nThe state of Michigan alone relies on physicians from travel ban countries for 1.2 million appointments a year .\nOther than California and New York, which top the list by population density and diversity alone, the states that rely most on physicians trained in travel ban countries are Michigan, Ohio, Illinois, Pennsylvania and Florida.\nThe ban has far-reaching implicationsObviously, just because the new travel ban was signed doesn't mean these thousands of doctors are going to vanish on the spot."}