{"url": "http://money.cnn.com/2017/03/10/news/companies/travel-ban-tourism/index.html", "id": "45", "title": "Trump travel ban is discouraging U.S. visitors", "text": "President Donald Trump's travel ban could keep out more international travelers than he bargained for.\n\nInternational airline bookings to the United States, which measure future travel plans, have fallen substantially since the first travel ban went into effect -- even from countries that are not identified in the ban.\n\n\"This is all about perception now,\" said Mike McCormick, executive director of the Global Business Travel Association. He and others in the industry are worried many travelers simply feel that foreigners are unwelcome in Trump's America.\n\nAbout 38% of corporate travel professionals in Europe say they are avoiding the U.S., according to a survey the group conducted this week after the new, less restrictive ban was unveiled.\n\n\"We've done surveys after terrorism events, when there were high fuel prices, SARS and Ebola outbreaks. This is unlike anything we've ever seen before,\" McCormick said.\n\nRelated: Airport Lawyer service helps fliers worried about the travel ban\n\nThe new travel restrictions block citizens of six majority Muslim countries in the Middle East and Africa -- Syria, Iran, Libya, Somalia, Sudan and Yemen -- from getting visas to travel to the U.S. for at least 90 days.\n\nBut there are lots of signs that travelers from Europe and Asia also plan to stay away.\n\nBookings for inbound travel to the United States from around the globe fell 6.5%, compared to last year, during the period that the original travel ban was in effect, according to data released Monday by ForwardKeys, a research firm that tracks 16 million airline bookings a day. (The ban started on Jan. 27 and was put on hold by a federal judge on Feb. 4.)\n\nBookings recovered slightly after the original ban was blocked by the courts, but President Trump's vow on Feb. 16 to unveil a new travel ban order sent them down again.\n\nRelated: Tech companies condemn Trump's revised travel ban\n\n\"The information ... makes it clear that the travel ban has damaged the U.S. travel industry,\" said Olivier Jager, CEO, ForwardKeys. \"The presidential rhetoric appears to be deterring visitors to the USA.\"\n\nOther factors could be hurting travel into the U.S., including a strong dollar that makes travel here more expensive for foreign visitors. But the dollar was already strong when industry forecasts, before Trump's election, called for a 2017 increase in international travel to the U.S.\n\nJonathan Grella, spokesman for the U.S. Travel Association, which represents hotels and tourist attractions, said members of his group are reporting canceled reservations. He said people in his industry would like to see the administration do more to promote travel to the U.S. even as it puts restrictions in place.\n\n\"We understand the administration's responsibility to keep the nation safe,\" said Grella. \"But nothing is lost if you say 'We would love to have people visit.' People do need to be overtly welcomed.\"\n\nNew York City, the largest U.S. destination for foreign travelers, plans a $3.5 million ad campaign in foreign markets to drum up international travel.\n\nThe city had expected to see a 400,000 increase in foreign visitors in 2017, according to the firm Tourism Economics, but it now expects a 300,000 decline.\n\nRelated: More than 100 companies join legal fight against travel ban\n\nNationwide, the number of foreign travelers to the U.S. is expected to drop 3% in 2017 after having originally been forecast to grow by 4%.\n\nForeign travelers to New York City spend four times as much as domestic visitors, staying longer and spending more while they are here. New York City believes that it could lose $600 million in spending by international travelers this year.\n\nAnd that spending translates into jobs. The U.S. Travel Association estimates more than 1 million jobs are tied to spending by foreign travelers.\n\nFebruary traffic reports released this week by the three largest U.S. airlines -- American (AAL), United (UAL) and Delta (DAL) -- show no real sign of a drop-off in international travel. The declines were similar to what was reported for January, before the travel restrictions were announced.\n\nBut travel executives say the drop in bookings is very real.\n\n\"While we're not seeing impact quite yet, we're worried,\" said Chris Heywood, spokesman for the New York City's visitors bureau. \"This is a critical time of year when many foreign travelers are booking their summer holiday. People have choices.\"", "authors": ["Chris Isidore"], "publish_date": "2017-03-10", "source": "cnn", "top_words": ["travel", "foreign", "international", "trump", "visitors", "ban", "travelers", "spending", "trumps", "discouraging", "million", "york"], "summary": "President Donald Trump's travel ban could keep out more international travelers than he bargained for.\nInternational airline bookings to the United States, which measure future travel plans, have fallen substantially since the first travel ban went into effect -- even from countries that are not identified in the ban.\nBookings recovered slightly after the original ban was blocked by the courts, but President Trump's vow on Feb. 16 to unveil a new travel ban order sent them down again.\nRelated: Tech companies condemn Trump's revised travel ban\"The information ... makes it clear that the travel ban has damaged the U.S. travel industry,\" said Olivier Jager, CEO, ForwardKeys.\nOther factors could be hurting travel into the U.S., including a strong dollar that makes travel here more expensive for foreign visitors."}