{"url": "http://money.cnn.com/2017/02/06/technology/elon-musk-trump-travel-ban/index.html", "id": "40", "title": "Elon Musk joins court fight against Trump travel ban", "text": "Elon Musk has signed on to fight President Trump's travel ban.\n\nTesla, SpaceX and 29 other companies joined dozens of other tech companies Monday in the legal fight, declaring that Trump's executive order on immigration \"violates the immigration laws and the Constitution.\"\n\nThat brings the total number of companies who've cosigned the friend of the court brief to 127.\n\nMusk's companies, Tesla and SpaceX, were not among the original list of nearly 100 companies that were part of a court motion on Sunday evening.\n\nOther companies that joined the brief Monday include mattress startup Casper, office services platform Managed by Q, and the messaging startup Slack.\n\nThe motion was filed with the Ninth Circuit Court of Appeals, which on Sunday morning denied the U.S. government's emergency request to resume Trump's travel ban. The appeals court has asked for both sides to file legal briefs before it makes a final decision.\n\nRelated: These 127 companies are fighting Donald Trump's travel ban\n\nMusk, who is the CEO of both Tesla and SpaceX, was one of about a dozen top tech execs who had met with Trump in December. Executives from Palantir, Cisco, Oracle, and IBM also attended the meeting. They have not joined the friend of the court brief.\n\nThe big four telecom companies, AT&T, (T) Verizon (VZ), T-Mobile (TMUS) and Sprint (S), have not joined the brief.\n\nElon Musk is also a member Trump's Economic Advisory Council. The group met last Friday and Musk later tweeted that, at his request, the travel ban was \"first and foremost\" on the agenda.\n\nMusk publicly criticized the travel ban in one tweet as \"not the best way to address the country's challenges.\"\n\nSpaceX, as well as Oracle and Palantir, all have lucrative government contracts.\n\n--CNNTech's Seth Fiegerman contributed reporting", "authors": ["Sara Ashley O'Brien"], "publish_date": "2017-02-06", "source": "cnn", "top_words": ["travel", "joins", "companies", "trump", "fight", "elon", "ban", "tech", "tesla", "court", "trumps", "joined", "spacex", "musk"], "summary": "Elon Musk has signed on to fight President Trump's travel ban.\nMusk's companies, Tesla and SpaceX, were not among the original list of nearly 100 companies that were part of a court motion on Sunday evening.\nThe motion was filed with the Ninth Circuit Court of Appeals, which on Sunday morning denied the U.S. government's emergency request to resume Trump's travel ban.\nThe group met last Friday and Musk later tweeted that, at his request, the travel ban was \"first and foremost\" on the agenda.\nMusk publicly criticized the travel ban in one tweet as \"not the best way to address the country's challenges.\""}