{"url": "http://money.cnn.com/2017/03/07/technology/airport-lawyer-travel-ban/index.html", "id": "44", "title": "Airport Lawyer service helps fliers worried about the travel ban", "text": "A new service called Airport Lawyer is helping concerned travelers \"lawyer up\" in the wake of President Trump's travel ban, 2.0.\n\nTrump signed a revised executive order on Monday banning immigration from six Muslim-majority countries, and reinstating a temporary blanket ban on all refugees. But the second time around, many major U.S. airports have lawyers on the ready to support travelers who are worried they'll be impacted by the Trump administration's policy changes.\n\nThat's courtesy of Airport Lawyer, which was created in direct response to President Trump's original travel ban signed less than six weeks ago.\n\nTravelers can securely pass along their contact information and flight details to Airport Lawyer through its website. The information will be routed to a coordinator for that airport and an attorney will be on-site, or a phone call away, for their arrival in case they need assistance from a legal expert. Volunteer groups are coordinating through Airport Lawyer currently at 19 airports, including John F. Kennedy Airport and Los Angeles International Airport.\n\n\"It's incredibly simple, so everyone can use it,\" said Takao Yamada, an attorney who co-founded Airport Lawyer. Yamada said he spent 50 hours volunteering in Seattle-Tacoma International Airport the week after the original ban on January 27.\n\n\"Things like this are personal to me,\" he said, noting he had family in the Japanese internment camps in the 1940s. \"I wanted to do something to help. The climate right now for border enforcement is pretty aggressive, so there's a lot of need for attorneys.\"\n\nRelated: Tech companies condemn Trump's revised travel ban\n\nBut the experience at the Seattle airport led him and attorney Greg McLawsen, co-founder of Airport Lawyer, to a realization: There had to be a more efficient way to handle the intake at airports. Lawyers were approaching strangers in the airport who looked like they might be upset, or scared to ask if they needed help. \"You're facing an information deficit and you can't do anything to prepare,\" said Yamada. \"Being lawyers, preparation is sort of everything.\"\n\nWith the help of legal software firm Clio and software development services company Neota Logic, within three days of developing the idea for the app, Airport Lawyer became a reality.\n\nAirport Lawyer teams are decentralized, with each location functioning on its own, so Yamada doesn't know many volunteers are working through the app nationwide. But he said roughly 200 volunteers -- mostly attorneys, paralegals and some law students -- are in Seattle.\n\nRelated: Tech startup questions why Nigerian engineer was detained\n\nWhile most, like Yamada, are not immigration attorneys (\"Their time is better spent doing their substantive work\"), every Airport Lawyer volunteer has access to an on-call immigration attorney via a partnership with the American Immigration Lawyers Association.\n\nThe Seattle airport is staffed for 12 hours each day. According to Yamada, a lot of requests don't ultimately require action. But he anticipates an uptick in requests after Monday's order.\n\n\"The new order is still targeting very specific groups of people, making everyone in those communities very frightened,\" he said. \"[But] there are people who are willing to help them while they are being targeted by the administration.\"", "authors": ["Sara Ashley O'Brien"], "publish_date": "2017-03-07", "source": "cnn", "top_words": ["fliers", "travel", "helps", "airport", "lawyers", "worried", "ban", "immigration", "yamada", "service", "lawyer", "trumps", "attorney", "help"], "summary": "A new service called Airport Lawyer is helping concerned travelers \"lawyer up\" in the wake of President Trump's travel ban, 2.0.\nThat's courtesy of Airport Lawyer, which was created in direct response to President Trump's original travel ban signed less than six weeks ago.\nTravelers can securely pass along their contact information and flight details to Airport Lawyer through its website.\nVolunteer groups are coordinating through Airport Lawyer currently at 19 airports, including John F. Kennedy Airport and Los Angeles International Airport.\n\"It's incredibly simple, so everyone can use it,\" said Takao Yamada, an attorney who co-founded Airport Lawyer."}