{"url": "http://tech.fortune.cnn.com/2017/01/30/outside-silicon-valley-not-much-outcry-against-immigration-ban/", "id": "424", "title": "Outside Silicon Valley, Not Much Outcry Against Immigration Ban", "text": "Most U.S. corporate bosses have stayed silent on President Donald Trump’s immigration curbs, underscoring the sensitivities around opposing policies that could provoke a backlash from the White House.\n\nWhile the leaders of Apple Inc, Google and Facebook Inc emailed their staff to denounce the suspension of the U.S. refugee program and the halting of arrivals from seven Muslim-majority countries, many of their\n\ncounterparts in other industries either declined comment or responded with company statements reiterating their commitment to diversity.\n\nThe difference in response shows the pressure large swathes of corporate America faces to avoid tussling publicly with the new administration.\n\nCompanies such as aircraft maker Boeing and automakers Ford Motor and General Motors have already had run-ins with Trump over other issues, and they have much at stake in policy decisions that the administration will make on tax, trade and regulatory matters.\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\nBefore office, Trump attacked Boeing over the cost of the future Air Force One program. Boeing Chief Executive Officer Dennis Muilenburg met with him earlier this month and said he and Trump had made progress on the Air Force One issue and the potential sale of fighter aircraft. Representatives from Boeing, General Motors and Ford declined to comment on Trump’s immigration curbs.\n\nWall Street, meanwhile, is hoping the new administration will ease some of the regulations introduced in the wake of the 2007-08 financial crisis and adopt a lighter touch in their enforcement.\n\nIndustries including banking, healthcare and auto manufacturing “see themselves on the cusp of a new era of deregulation, and they do not want to do anything that would offend the new emperor,” said Cornelius Hurley, director of Boston University’s Center for Finance, Law & Policy.\n\nTrump had targeted both the tech industry and Wall Street during his presidential campaign, but once elected, he tapped former investment bankers, hedge fund managers and private equity investors to join his administration – most notably Goldman Sachs’s long-time chief operating officer Gary Cohn, who will now head the National Economics Council.\n\nWith friends in high places, Wall Street may have less reason to be as outspoken about the new restrictions.\n\n“Bankers have direct access to this White House,” said Erik Gordon, who teaches at the University of Michigan’s Ross School of Business. “They don’t have to protest publicly.” Representatives of Goldman Sachs Group Inc, Citigroup Inc, Bank of America Corp and Morgan Stanley declined to comment on Trump’s immigration order.\n\nWells Fargo & Co said in a statement that it was reviewing the executive order and its implications for staff and its business. JPMorgan Chase & Co’s Operating Committee, which includes CEO Jamie Dimon, sent a note to staff saying it was reaching out to all employees affected and noted that the country was, “strengthened by the rich diversity of the world around us.”\n\nTo be sure, some CEOs were more outspoken. Nike Inc CEO Mark Parker said the company did not support the executive order.\n\n“Nike believes in a world where everyone celebrates the power of diversity,” he said in a statement. “Those values are being threatened by the recent executive order in the U.S. banning refugees, as well as visitors, from seven Muslim-majority countries.”\n\nIn more pragmatic vein, Brent Saunders, CEO of U.S. drugmaker Allergan, tweeted: “Oppose any policy that puts limitations on our ability to attract the best & diverse talent.”\n\nBut many boardrooms kept quiet. Representatives for some energy companies, including Exxon Mobil Corp, for example, declined to comment.\n\nAs the idea of corporate social responsibility has taken root, so companies have increasingly championed a range of causes, including gay rights, diverse workplaces and a global view.\n\nMany in corporate America are still trying to work out how to deal with a new government that takes a more conservative stance on some social issues and has an anti-globalisation platform.\n\nThose non-tech companies that did issue statements over the weekend tended to emphasize their role as good corporate citizens rather than openly criticize Trump’s policies. Starbucks Corp CEO Howard Schultz has put the coffee chain in the national spotlight before, asking customers\n\nnot to bring guns into stores and urging conversations on race\n\nrelations.\n\nIn a letter to employees, he said Starbucks was developing plans to hire 10,000 refugees over five years across dozens of countries, but he did not directly criticize Trump’s order.\n\n“I am hearing the alarm you all are sounding that the civility and human rights we have all taken for granted for so long are under attack,” he wrote.\n\nIn his statement, General Electric Co CEO Jeff Immelt told staff that the company would engage with the U.S. government.\n\n“We will continue to make our voice heard with the new administration and Congress, and reiterate the importance of this issue to GE and to the business community overall,” he wrote.\n\nOne of the most immediate ways for corporate bosses to communicate with Trump about the immigration order will be the first meeting of his advisory panel of business leaders next week.\n\nOf the 19 leaders on that panel, only two, Elon Musk, who founded Tesla Motors Inc and SpaceX, and Travis Kalanick, CEO of Uber Technologies Inc, have spoken out against Trump’s immigration curbs.\n\nA spokeswoman for Stephen Schwarzman, the billionaire chief executive of Blackstone Group LP whom Trump tasked to set up and chair the panel, declined to comment.", "authors": ["Fortune Editors"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["executive", "comment", "trump", "ban", "immigration", "corporate", "valley", "order", "outside", "outcry", "trumps", "ceo", "declined", "staff", "silicon"], "summary": "Most U.S. corporate bosses have stayed silent on President Donald Trump’s immigration curbs, underscoring the sensitivities around opposing policies that could provoke a backlash from the White House.\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 AdvertisementBefore office, Trump attacked Boeing over the cost of the future Air Force One program.\nRepresentatives from Boeing, General Motors and Ford declined to comment on Trump’s immigration curbs.\n“They don’t have to protest publicly.” Representatives of Goldman Sachs Group Inc, Citigroup Inc, Bank of America Corp and Morgan Stanley declined to comment on Trump’s immigration order.\nWells Fargo & Co said in a statement that it was reviewing the executive order and its implications for staff and its business."}