{"url": "http://money.cnn.com/2017/06/26/technology/business/tech-travel-ban-supreme-court/index.html", "id": "48", "title": "Tech industry reacts to Supreme Court travel ban move", "text": "For nearly five months, Silicon Valley has been fighting President Trump over the travel ban.\n\nOn Monday, Trump scored his first victory.\n\nThe Supreme Court said it will allow parts of the Trump administration's travel ban against citizens of six majority-Muslim countries to go into effect until it ultimately weighs in on the case in October.\n\nFor Trump, the court's opinion marks a step forward after both versions of the travel ban were blocked by lower courts.\n\nFor the tech industry, which filed legal briefs in those lower courts opposing the ban, the decision once again raised alarms about the potential fallout of the ban. But it could have been worse.\n\nThe court's opinion states that the ban does not apply to non-citizens who have formal relationships with people or entities in the US. That means tech companies looking to hire workers from the affected countries should be unaffected.\n\n\"It does not seem to directly impact employers,\" says Carl Guardino, CEO of the Silicon Valley Leadership Group, a trade association. But, he adds, \"there's the law and there's the tone. And the tone is that in a nation of immigrants, the welcome mat is being rolled up.\"\n\nRelated: Silicon Valley's impossible balancing act with Trump\n\nThere are now concerns in the tech industry about the unintended consequences of allowing parts of the travel ban to stand.\n\n\"Allowing parts of the ban to go into effect with respect to some immigrants and refugees is disappointing.\" says Michal Rosenn, general counsel at Kickstarter, said in a statement provided to CNN Tech. \"It will have a negative impact on America's standing in the world, and on companies' ability to recruit and retain the best talent.\"\n\nJulie Samuels, executive director of Tech:NYC, worries the partial travel ban could \"keep out the future founders and job creators whom we most want to attract to the United States.\"\n\n\"A potential founder who has no family or existing business relationship to the U.S. would fall outside of today's partial stay,\" says Samuels, whose nonprofit group represents New York tech companies and joined an amicus brief against the ban in February.\n\nAnd that doesn't even factor in the potential for chaos and confusion at the nation's borders as the partial travel ban is implemented.\n\nIf anything, Monday's announcement is a reminder of the uncertainty ahead for businesses and workers until the Supreme Court hears the case in October.\n\n\"There's certainly uncertainty,\" says David Cole, national legal director at the ACLU. \"As long as the Supreme Court has not ruled, there will be uncertainty.\"", "authors": ["Seth Fiegerman"], "publish_date": "2017-06-26", "source": "cnn", "top_words": ["parts", "travel", "industry", "uncertainty", "trump", "ban", "tech", "supreme", "reacts", "partial", "court", "silicon", "potential"], "summary": "For nearly five months, Silicon Valley has been fighting President Trump over the travel ban.\nFor Trump, the court's opinion marks a step forward after both versions of the travel ban were blocked by lower courts.\nRelated: Silicon Valley's impossible balancing act with TrumpThere are now concerns in the tech industry about the unintended consequences of allowing parts of the travel ban to stand.\nJulie Samuels, executive director of Tech:NYC, worries the partial travel ban could \"keep out the future founders and job creators whom we most want to attract to the United States.\"\nAnd that doesn't even factor in the potential for chaos and confusion at the nation's borders as the partial travel ban is implemented."}