{"url": "http://money.cnn.com/2017/07/06/news/economy/international-travel-trump-impact/index.html", "id": "49", "title": "Trump's travel ban not hitting international visits to U.S. -- yet", "text": "The travel industry has worried that the Trump administration's travel ban and immigration policy would hurt visits to the United States. But the early figures show it's not happening yet.\n\nInternational travel to the U.S. grew 5.2% in May compared to last year, according to the U.S. Travel Association's latest report released Wednesday. The group also revised its April reading higher, to year-over-year growth of 6.6%.\n\nThe index measures data from a number of sources, including advance search and booking data, hotel room demand and the number of passengers who actually get on planes.\n\n\"There is widespread talk of daunting challenges to the U.S. travel market. Perception of the country abroad is mentioned most. Yet the resilience of our sector continues to astound,\" said Roger Dow, CEO of the trade group, in the report. In part, overseas marketing campaigns -- launched due to concerns about the administration's travel policies -- are helping to keep travel to the U.S. strong.\n\nTravel industry experts have been worried since early this year that President Trump's travel restrictions and immigration policies could dent travel to the U.S. Though the policies affect only a small fraction of visitors, the experts speculated the rules would make even travelers from Europe and other countries not covered by the ban feel unwelcome.\n\nStill, the Travel Association warned the gains may not last long. The part of the index that projects future travel projects a slowing in international travelers could still be ahead in the next three to six months.\n\nRelated: Trump travel ban could keep out more international travelers than he bargained for\n\n\"President Trump's rhetoric and policies, including travel restrictions and an anti-immigration stance, pose additional risks to international traveler sentiment,\" said the report.\n\nDow mentioned several additional factors working against inbound U.S. visits including the strong dollar, which makes trips expensive for international travelers, and slowing economies elsewhere.\n\nA slowdown in international travel would be bad for the U.S. economy. More than 1 million U.S. jobs are tied to spending by foreign travelers, according to the Travel Association's estimates.\n\nThe Trump administration has faced challenges implementing many aspects of its travel policies. Only last week did the U.S. Supreme Court clear the way for some limited restrictions on travel here by citizens of six Muslim-majority nations.", "authors": ["Chris Isidore"], "publish_date": "2017-07-06", "source": "cnn", "top_words": ["travel", "international", "restrictions", "trump", "policies", "hitting", "ban", "including", "worried", "travelers", "trumps", "visits"], "summary": "The travel industry has worried that the Trump administration's travel ban and immigration policy would hurt visits to the United States.\nInternational travel to the U.S. grew 5.2% in May compared to last year, according to the U.S. Travel Association's latest report released Wednesday.\nIn part, overseas marketing campaigns -- launched due to concerns about the administration's travel policies -- are helping to keep travel to the U.S. strong.\nTravel industry experts have been worried since early this year that President Trump's travel restrictions and immigration policies could dent travel to the U.S.\nRelated: Trump travel ban could keep out more international travelers than he bargained for\"President Trump's rhetoric and policies, including travel restrictions and an anti-immigration stance, pose additional risks to international traveler sentiment,\" said the report."}