{"url": "http://www.cnn.com/2017/01/31/opinions/trump-immigration-order-stewart/index.html", "id": "408", "title": "Trump order about keeping Americans safe", "text": "Alice Stewart is a CNN political commentator and Republican strategist. She served as communications director on the Ted Cruz for President campaign. The views expressed are her own.\n\nThose were the last words spoken , via air phone, by Tom Burnett to his wife, Deena, as he and a team of heroes stormed the cockpit of United Airlines Flight 93 on 9/11; moments later, the plane crashed into a field in Shanksville, Pennsylvania. All 44 people on board, including the four hijackers, were killed. Nearly 3,000 died that day in the four coordinated terror attacks.\n\nWhile the 9/11 terrorists were in the United States legally, it is clear that proper vetting of their activities even once inside the United States would have raised red flags for most of them. And with the memory of that tragic day in mind, it is hardly surprising that President Donald Trump -- who ran and won on a promise to keep Americans safe and a vow \"to do something\" to stop such terrorists from entering our country -- has decided to act.\n\nPresident Trump's executive order, aimed at protecting America from foreign terrorist entry, calls for a temporary travel ban on people from seven countries compromised by terrorism -- Iraq, Iran, Syria, Libya, Yemen, Somalia and Sudan. This includes a strict ban and extreme vetting.\n\nBut it's important to remember that the key thing about this temporary travel ban is that is just that -- temporary. It's meant as an opportunity to review the vetting process, including for Syrian refugees, who, according to the order, will be allowed to come to the United States again when \"sufficient changes have been made\" to the refugee program to ensure that admission \"is consistent with the national interest.\"\n\nAnd the reality is that the United States is in dire need of basic maintenance on our visa admissions vetting process for many reasons, including that there are an overwhelming number of people seeking refugee status, many seeking refugee status don't meet the definition, and an alarming number of people are applying from high-risk areas where terrorists have indicated a determination to use the refugee process to enter Western nations, a threat that former CIA Director John Brennan raised last year\n\nShortly after President Trump's executive order was implemented last Friday, the administration faced a flood of criticism over its intent and its implementation, despite the fact that of the more than 300,000 air travelers that day, only 109 were detained and processed at US airports.\n\nThis small number of people being detained didn't stop attorneys filing lawsuits challenging the constitutionality of the executive order -- nor thousands of protesters shouting their frustration at airports across the country.\n\nBut the administration has been right to defend the rapid implementation of the executive order. It would be extremely reckless to announce such a strategy ahead of time and risk tipping our hat to those planning to come to this country to wreak havoc.\n\nOf course, many critics refer to the order as a Muslim ban, falsely claiming the order includes a religious test. Indeed, former President Barack Obama has also expressed his opposition to the ban, and what he calls the \"notion of discriminating against individuals because of their faith or religion.\"\n\nDemocratic Sen. Chuck Schumer publicly cried over the ban, calling it \"mean spirited and un-American.\" But where were those very public tears when innocent people were killed by ISIS-inspired terrorists in San Bernardino, or at the Pulse nightclub in Orlando? Or how about when applications from Iraq were slowed in 2011 as President Obama called for closer vetting?\n\nTo Obama, Schumer and others, I say: don't confuse theology with national sovereignty. This is not about religion. It's about keeping Americans safe.\n\nUnfortunately, it has not just been Democrats who have complained about this. Republican Senators John McCain and Lindsey Graham have criticized the travel ban, saying they \"fear this executive order will become a self-inflicted wound in the fight against terrorism.\" (President Trump responded with a tweet saying they are \"weak on immigration\" and simply \"looking to start World War III.\")\n\nBut White House press secretary Sean Spicer perhaps said it best at his briefing Monday that to come to America \"is a privilege, not a right.\" And remember that for tens of millions of people from around the world who travel to the United States each year, the executive order will have no impact.\n\nFor many people, 9/11 is now a part of history. But for people like Deena Burnett Bailey -- a 9/11 widow who supports President Trump's call for extreme vetting -- it's a part of who she is. In her view, the men who murdered her husband \"should never have been in this country in the first place.\"\n\nI agree. I'm also proud to have a President who promised \"to do something\" to prevent terrorism -- and actually is.", "authors": ["Alice Stewart"], "publish_date": "2017-01-31", "source": "cnn", "top_words": ["executive", "travel", "trump", "ban", "vetting", "refugee", "order", "united", "states", "terrorists", "safe", "president", "keeping", "americans"], "summary": "But it's important to remember that the key thing about this temporary travel ban is that is just that -- temporary.\nThis small number of people being detained didn't stop attorneys filing lawsuits challenging the constitutionality of the executive order -- nor thousands of protesters shouting their frustration at airports across the country.\nBut the administration has been right to defend the rapid implementation of the executive order.\nOf course, many critics refer to the order as a Muslim ban, falsely claiming the order includes a religious test.\nRepublican Senators John McCain and Lindsey Graham have criticized the travel ban, saying they \"fear this executive order will become a self-inflicted wound in the fight against terrorism.\""}