{"url": "http://tech.fortune.cnn.com/2017/01/30/sage-steele-immigration-ban/", "id": "402", "title": "ESPN's Sage Steele Criticized for Saying Airport Protesters Disrupted Her Travel Plans", "text": "The lives of refugees seeking sanctuary in the United States were thrown into chaos this weekend when President Donald Trump issued an executive order forbidding them from entering the country. But it seems that refugees weren’t the only ones negatively affected by the immigration ban; Sage Steele missed her flight to Houston.\n\nOn Monday, the ESPN anchor posted a lengthy Instagram post describing her experience getting to Los Angeles International Airport. “Thousands of us dragged luggage nearly 2 miles to get to LAX, but still missed our flights,” she wrote. “Fortunately, a 7 hour wait for the next flight to Houston won’t affect me that much, but my heart sank for the elderly and parents with small children who did their best to walk all that way but had no chance of making their flights.” Steele added that “immigrants were affected as well.”\n\nThe post was seen by many on social media as being tone-deaf to the disruption in the lives of the refugees who had been indefinitely detained at airports around the country. “Some things are bigger than [you],” wrote one user.\n\nhey Sage..w/ all due respect..what types of protest do you prefer? The 'disruption' is the point of protest. — Taylor Rooks (@TaylorRooks) January 30, 2017\n\nAs a volunteer attorney who helped reunite a family this past weekend your comments are stunning. Some things are bigger than u. — Natalie Camille (@nce1913) January 30, 2017\n\nSteele’s response was simply to point out that she is entitled to her own opinion.\n\nAll good! But just bc someone has a different opinion, doesn't mean they're \"the worst\". Unless, of course, only YOUR opinion is allowed🤔 https://t.co/iiZXuD4Ne2 — Sage Steele (@sagesteele) January 30, 2017\n\nThe executive order that was issued Friday suspended the entry of all refugees to the United States for 120 days, barred Syrian refugees indefinitely, and blocked U.S. entry for citizens of seven predominantly Muslim countries for at least 90 days. Over the weekend, more than a dozen petitions on behalf of individuals being held at airports were filed. By Sunday, federal judges in New York, Massachusetts, Washington and Virginia had issued orders blocking authorities from deporting travelers.\n\nSign up: Click here to subscribe to the Broadsheet, Fortune’s daily newsletter on the world’s most powerful women.", "authors": ["Valentina Zarya"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["travel", "sage", "espns", "airport", "steele", "plans", "weekend", "wrote", "criticized", "united", "states", "issued", "saying", "things", "refugees", "protesters", "30", "disrupted"], "summary": "But it seems that refugees weren’t the only ones negatively affected by the immigration ban; Sage Steele missed her flight to Houston.\nOn Monday, the ESPN anchor posted a lengthy Instagram post describing her experience getting to Los Angeles International Airport.\n“Thousands of us dragged luggage nearly 2 miles to get to LAX, but still missed our flights,” she wrote.\n— Natalie Camille (@nce1913) January 30, 2017Steele’s response was simply to point out that she is entitled to her own opinion.\nBy Sunday, federal judges in New York, Massachusetts, Washington and Virginia had issued orders blocking authorities from deporting travelers."}