{"url": "http://www.cnn.com/2017/01/26/politics/khizr-khan-trump-muslim-ban/index.html", "id": "411", "title": "Khizr Khan: Muslim ban could hurt US security", "text": "Story highlights \"He should be reaching out to Muslims,\" Khan said\n\nTrump is considering a temporary ban on Muslim immigrants\n\n(CNN) If the President alienates Muslim Americans, frequent President Donald Trump critic Khizr Khan said he may end up endangering national security.\n\n\"Muslim are at the front lines. Patriotic Muslims within the United States feel alienated and if they are alienated, they will not be as supportive of his policies, as supportive of security and the threats that loom within our country,\" the Gold Star father told CNN's Alisyn Camerota Thursday on \"New Day.\"\n\n\"He should be reaching out to Muslims. He should be reaching out, joining hands to deal with the safety of the United States.\"\n\nKhan, whose son was killed in Iraq, hit the national stage after delivering a passionate appeal at July's Democratic National Convention to encourage voters to support Hillary Clinton. He said Trump regularly smears religious minorities like his family.\n\nTrump is considering a blanket ban on refugees. The ban is one of the more controversial of his campaign promises aimed at fighting terrorism and could specifically affect Muslim immigrants and refugees.\n\nRead More", "authors": ["Eugene Scott"], "publish_date": "2017-01-26", "source": "cnn", "top_words": ["supportive", "hurt", "national", "trump", "ban", "security", "khizr", "reaching", "united", "president", "muslim", "muslims", "khan"], "summary": "Story highlights \"He should be reaching out to Muslims,\" Khan saidTrump is considering a temporary ban on Muslim immigrants(CNN) If the President alienates Muslim Americans, frequent President Donald Trump critic Khizr Khan said he may end up endangering national security.\nHe should be reaching out, joining hands to deal with the safety of the United States.\"\nKhan, whose son was killed in Iraq, hit the national stage after delivering a passionate appeal at July's Democratic National Convention to encourage voters to support Hillary Clinton.\nTrump is considering a blanket ban on refugees.\nThe ban is one of the more controversial of his campaign promises aimed at fighting terrorism and could specifically affect Muslim immigrants and refugees."}