{"url": "http://tech.fortune.cnn.com/2017/01/28/tech-execs-criticize-trump-immigrant-ban/?iid=sr-link5", "id": "403", "title": "Trump's Immigration Ban: CEOs of Apple and Facebook Speak Out", "text": "President Trump and top business leaders settled into an uneasy detente after his shock-victory in November. It began to fray Saturday, when a handful of tech executives spoke out against Trump’s order banning U.S. entry to immigrants from seven majority-Muslim countries.\n\nDissent started trickling in from Silicon Valley chiefs as the extent of the ban, issued late Friday afternoon, became clear. With green card-holding employees left stranded abroad—and news reports dominated by reports of refugees from war zones getting detained in American airports—execs from Google, Facebook, Apple, Lyft, and Uber voiced varying degrees of alarm.\n\nA federal judge on Saturday issued an emergency ruling protecting refugees and other immigrants stuck in American airports from being sent back to their countries. But the judge did not grant them entry or address the constitutionality of Trump’s directive.\n\n“It’s painful to see the personal cost of this executive order on our colleagues,” Google CEO Sunar Pichai wrote in a memo obtained by Bloomberg News. The travel ban ensnared some 187 Googlers who hail from the countries it targets. “We’ve always made our view on immigration issues known publicly and will continue to do so,” Pichai added.\n\nApple CEO Tim Cook weighed in, as well, writing in his own memo to his workforce that the company—founded by Steve Jobs, the son of immigrants from Syria, one of the impacted countries—“would not exist without immigration, let alone thrive and innovate the way we do.” Writing from Washington, where Cook has been meeting with senior lawmakers and senior Trump hands, Apple’s CEO said some of the iPhone makers’ employees were “directly affected” by the ban. Apple’s human resources, legal, and security teams were doing what they could for them, Cook wrote, and the company has already reached out to the White House to register its objections.\n\nFacebook CEO Mark Zuckerberg took to his own platform Friday afternoon to opine that the U.S. should focus its security measures on “people who actually pose a threat. Expanding the focus of law enforcement beyond people who are real threats would make all Americans less safe by diverting resources, while millions of undocumented folks who don’t pose a threat will live in fear of deportation.” Zuckerberg noted his family and that of his wife, Priscilla, arrived here as refugees.\n\nThe criticism from tech leaders marked the first meaningful breach between corporate brass and Trump since his win quieted what had been seemingly near-uniform opposition to his candidacy from Silicon Valley and other business leaders. No Fortune 100 CEO endorsed Trump in the race, while others, including some who self-identify as Republicans, backed Democratic nominee Hillary Clinton. Trump’s victory initiated a truce. A market rally unleashed by expectations of new infrastructure spending and regulatory rollbacks helped hold it together—as did fear in C-suites of being singled out by the new president, who’s wielded his Twitter account to name and shame American companies he believes are underinvesting at home.\n\nFortune on Saturday reached out to most of the companies in the Fortune 100. Many didn’t respond to requests for comment on the immigration ban. Others declined to comment or said they were still reviewing its impact.", "authors": ["Tory Newmyer"], "publish_date": "2017-01-28", "source": "cnn", "top_words": ["cook", "facebook", "trump", "ban", "immigrants", "immigration", "zuckerberg", "trumps", "speak", "ceo", "apple", "ceos", "leaders", "american"], "summary": "It began to fray Saturday, when a handful of tech executives spoke out against Trump’s order banning U.S. entry to immigrants from seven majority-Muslim countries.\nDissent started trickling in from Silicon Valley chiefs as the extent of the ban, issued late Friday afternoon, became clear.\n“We’ve always made our view on immigration issues known publicly and will continue to do so,” Pichai added.\nNo Fortune 100 CEO endorsed Trump in the race, while others, including some who self-identify as Republicans, backed Democratic nominee Hillary Clinton.\nMany didn’t respond to requests for comment on the immigration ban."}