{"url": "http://www.cnn.com/2017/01/26/opinions/us-iran-immigration-hamid-dabashi/index.html", "id": "407", "title": "Iranians no strangers to a US ban, but Trump era is different", "text": "Hamid Dabashi is the Hagop Kevorkian Professor of Iranian Studies and Comparative Literature at Columbia University in New York City.\n\n(CNN) Nuke Iran, Maim Iranians!\" I can still hear the chants of undergraduate students marching down Locust Walk as they passed by McNeal Building on the University of Pennsylvania campus -- where the Department of Sociology was located in 1980 -- precisely at the moment when I was taking my grueling comprehensive MA exam.\n\nThis was during the Iran Hostage Crisis of 1979-1981 when US President Jimmy Carter was in office. He had just singled out and ordered all of us Iranian students to report to immigration officers coming to our campus to prove we were here legally, be yet again fingerprinted and put against a wall in the Bennett Hall on the Penn campus and be photographed. If anyone of us had \"violated\" the terms of our visas, we would be deported.\n\nWhile under this US visa restriction, I lost my mother in Iran in 1982, unable to go and see her before she passed away or to attend her funeral.\n\nPresident Carter also ordered no more visas to be issued to any Iranian students, which meant that if we left for Iran to visit our families or left even as far as Canada we risked not being allowed to come back to continue our education, which is precisely what happened in April 1980 when a group of Iranian students returning from Canada were detained at the US-Canada border. A prominent Iranian filmmaker, Parviz Sayyad later made a movie about this incident called \" Checkpoint \" (1987).\n\nWhile under this US visa restriction, I lost my mother in Iran in 1982, unable to go and see her before she passed away or to attend her funeral.\n\nThis visa restriction was issued by a Democratic President who I now have the deepest admiration for what he's done for the sick, the poor, and the homeless after his presidency -- and particularly for daring to utter the word \"apartheid\" about the Israeli occupation of Palestinian territories.\n\nDéjà vu?\n\nAll these memories rushed back to me reading the news that \"US President Donald Trump is expected to sign executive orders . . . [imposing] a temporary ban on most refugees and a suspension of visas for citizens of Syria and six other Middle Eastern and African countries.\"\n\nThe comparison goes only so far before it becomes a cliché and prevents our more accurate reading of what is happening to my adopted homeland here in the US. Trump is not Carter. US diplomats are not held hostage by any militant band of revolutionaries anywhere in the world.\n\nPresident Jimmy Carter, Vice President Walter Mondale, Secretary of State Cyrus Vance and Secretary of Defense Harold Brown disembark from their helicopter to meet about the Iran hostage crisis at Camp David in Maryland on November 23, 1979.\n\nWe have an entirely different geopolitics today framing President Trump's executive orders.\n\nOf the seven countries included in Mr. Trump's executive order -- Syria, Iraq, Iran, Libya, Somalia, Sudan, and Yemen -- six of them (all except Iran) have been a target of US military operations over the last two decades. Until very recently Iran too has been the subject of crippling economic sanctions.\n\nBanning the citizens of these war-torn regions will not increase US national security. Quite to the contrary. The xenophobic belligerence of the Trump administration singling out and indiscriminately targeting Muslims will in fact vastly increase the animus toward innocent Americans around the globe.\n\nBut the security of Americans is farthest removed from the unfolding agenda of an administration that is now systematically targeting every single dimension of a civic life in the US -- from frightening disregard for environmental policies to ridicule of masses of millions of women protesting their vulnerability under a Trump demonstration.\n\nFrom immigrants to Americans\n\nThe discriminatory and Islamophobic targeting of Muslims by banning them into the US, however, has also a strong domestic dimension to it. This measure is not just to ban peaceful Muslims entering the US through the common and already stringent vetting that any other immigrant or refugee must follow. This is to frighten, silence, and turn into second rate citizens millions of Muslim Americans right here in the US.\n\nThere are even talks of a \"Muslim registry\" or even internment of Muslims on the model of Americans of Japanese descent during World War II.\n\nThe systematic targeting of Muslim is integral to Mr. Trump's xenophobic propaganda to divide and rule Americans by pitting them against each other.\n\nJUST WATCHED Trump on a national database for U.S. Muslims Replay More Videos ... MUST WATCH Trump on a national database for U.S. Muslims 00:54\n\nMy paramount feeling in 1979-1980, when targeted for discriminatory abuse by US officials, was fear and anger. But today my thoughts are exactly the opposite. Today I am the father of four American children, born and raised in the United States, two of them in Allentown, Pennsylvania, and the other two in New York City.\n\nI am neither angry, nor disappointed, nor frightened. Quite to the contrary. More than ever, I feel integral to the very fabric of American society. Every single one of us, from native Americans to the most recent immigrants from around the globe: We are here to stay and to welcome generations of other hardworking, peaceful, law-abiding immigrants.\n\nBy being integral to this national resistance to bigotry and racism we help rebuild the moral fabric of this country for posterity. This is how immigrants become Americans: supporting and defending the Constitution of the US \"against all enemies, foreign and domestic.\"", "authors": ["Hamid Dabashi"], "publish_date": "2017-01-26", "source": "cnn", "top_words": ["iran", "muslims", "different", "students", "trump", "national", "ban", "targeting", "carter", "strangers", "era", "iranians", "iranian", "president", "americans"], "summary": "Hamid Dabashi is the Hagop Kevorkian Professor of Iranian Studies and Comparative Literature at Columbia University in New York City.\nThis was during the Iran Hostage Crisis of 1979-1981 when US President Jimmy Carter was in office.\nAll these memories rushed back to me reading the news that \"US President Donald Trump is expected to sign executive orders .\nThe xenophobic belligerence of the Trump administration singling out and indiscriminately targeting Muslims will in fact vastly increase the animus toward innocent Americans around the globe.\nThis is how immigrants become Americans: supporting and defending the Constitution of the US \"against all enemies, foreign and domestic.\""}