{"url": "http://www.cnn.com/2017/08/25/opinions/trump-response-hurricane-harvey-opinion-kayyem/index.html", "id": "430", "title": "Trump has to rely on the 'swamp' for Hurricane Harvey response", "text": "Story highlights Juliette Kayyem: With hurricane,Trump will be judged on how well he lets bureaucracy he maligns as 'the swamp' actually do its job\n\nKayyem: His budget proposals have sought FEMA cuts. If things go poorly he won't be able to tweet against Mother Nature\n\nCNN analyst Juliette Kayyem is the author of the best-seller, \"Security Mom: An Unclassified Guide to Protecting Our Homeland and Your Home.\" She is a professor at Harvard's Kennedy School, a former assistant secretary of the Department of Homeland Security in the Obama administration, host of the national security podcast, \"The SCIF,\" and founder of Kayyem Solutions, a security consulting firm. The opinions expressed in this commentary are hers.\n\n(CNN) Hurricane Harvey is destined to be the first major homeland security and emergency management crisis the Trump administration has faced. And, ironically, it is at this moment that President Donald Trump will be judged on how well he lets a bureaucracy he so often maligns or denigrates actually do its job.\n\nBy all accounts, Hurricane Harvey will deliver a gut punch of rain, wind and storm surges in Texas. And though weather, like a teenager's mood, is unpredictable, this storm is not slowing down -- it is rapidly gaining strength, and f orecasters say it's likely to be a Category 3 hurricane when it makes landfall.\n\nHarvey is expected to hit the Texas coast somewhere near Corpus Christi Friday night and potentially linger there for a few days. Texas residents are bracing for the potential of serious danger and significant damage.\n\nPresident Trump, this is not a test.\n\nJUST WATCHED NOAA: Days of miserable weather ahead Replay More Videos ... MUST WATCH NOAA: Days of miserable weather ahead 01:46\n\nThough there have been many crises to speak of during Trump's tenure, for the most part they have been self-created. Think, for example, of the first days of the administration: a Muslim ban planned in secret, implemented in haste, with no operational input -- all ultimately leading to rallies, protests and lawsuits.\n\nRead More", "authors": ["Juliette Kayyem", "Cnn National Security Analyst"], "publish_date": "2017-08-25", "source": "cnn", "top_words": ["rely", "trump", "kayyem", "homeland", "security", "days", "weather", "storm", "response", "texas", "hurricane", "swamp", "harvey", "administration"], "summary": "Story highlights Juliette Kayyem: With hurricane,Trump will be judged on how well he lets bureaucracy he maligns as 'the swamp' actually do its jobKayyem: His budget proposals have sought FEMA cuts.\n(CNN) Hurricane Harvey is destined to be the first major homeland security and emergency management crisis the Trump administration has faced.\nBy all accounts, Hurricane Harvey will deliver a gut punch of rain, wind and storm surges in Texas.\nHarvey is expected to hit the Texas coast somewhere near Corpus Christi Friday night and potentially linger there for a few days.\nPresident Trump, this is not a test."}