{"url": "http://tech.fortune.cnn.com/2017/01/28/trump-refugee-ban-turkey-response/", "id": "58", "title": "Trump's Refugee Ban No Solution to Problems, Turkey PM Says", "text": "President Donald Trump’s sweeping ban on people seeking refuge in the United States is no solution to problems, Turkish Prime Minister Binali Yildirim said on Saturday, adding that Western countries should do more to help ease Turkey’s refugee burden.\n\nThe new Republican president on Friday put a four-month hold on allowing refugees into the United States and temporarily barred travelers from Syria and six other Muslim-majority countries, although NATO ally Turkey was not among them.\n\nWhen asked by a reporter about Trump’s ban during a joint news conference with British Prime Minister Theresa May in Ankara, Yildirim said: “Regional issues cannot be solved by closing the doors on people. We expect the Western world to lighten Turkey’s burden.”\n\nIran Says to Ban U.S. Visitors in Retaliation to Trump Move\n\n“You can build a wall but it’s not a solution. That wall will come down like the Berlin wall,” he said, adding Turkey has spent some $26 billion on sheltering refugees.\n\nMay, who met with Trump in Washington a day earlier, told the news conference that the United States was responsible for its position on refugees. She has previously said a “special relationship” between the United States and Britain meant the two countries could speak frankly to each other when they disagreed on issues.\n\nYildirim said little directly about Trump. “We are not very informed about Trump’s decisions. But problems are solved through dealing with the causes,” he said.\n\nFor more on Trump’s policies, watch:\n\nTurkey, a member of the U.S.-led coalition against Islamic State, has been hoping for a reset in its relationship with the Washington under the Trump administration. Ankara was long frustrated by former President Barack Obama’s decision to back a Syrian Kurdish militia. Turkey considers the group a terrorist organization.\n\nTurkey is home to the world’s largest refugee population sheltering some 3 million people, most of them Syrians.", "authors": [], "publish_date": "2017-01-28", "source": "cnn", "top_words": ["trump", "ban", "problems", "turkey", "refugee", "wall", "united", "trumps", "countries", "solution", "yildirim", "states", "president"], "summary": "President Donald Trump’s sweeping ban on people seeking refuge in the United States is no solution to problems, Turkish Prime Minister Binali Yildirim said on Saturday, adding that Western countries should do more to help ease Turkey’s refugee burden.\nWhen asked by a reporter about Trump’s ban during a joint news conference with British Prime Minister Theresa May in Ankara, Yildirim said: “Regional issues cannot be solved by closing the doors on people.\nThat wall will come down like the Berlin wall,” he said, adding Turkey has spent some $26 billion on sheltering refugees.\nMay, who met with Trump in Washington a day earlier, told the news conference that the United States was responsible for its position on refugees.\nTurkey is home to the world’s largest refugee population sheltering some 3 million people, most of them Syrians."}