{"url": "http://tech.fortune.cnn.com/2017/01/27/donald-trump-muslim-immigration-ban-conflict/", "id": "56", "title": "These Countries with Business Links to Trump Aren't Part of His Immigration Ban", "text": "A little over a year ago, then-Republican presidential candidate Donald Trump called for a “total and complete shutdown of Muslims entering the United States,” until the country’s leadership could “figure out what is going on.”\n\nAlong the campaign trail, he modified this blanket ban to a suspension of “immigration from terror-prone regions, where vetting cannot safely occur,” which he promised to enact during his first 100 days in office.\n\nAnd now, a week into Trump’s presidency, he has tried to make good on that promise—or, at least, partly so. A draft proposal of an executive order obtained by Bloomberg News reportedly shows that Trump is poised to suspend all entry to the U.S. from seven Muslim-majority countries.\n\nNotably missing from the blacklist, however, are several Muslim-majority countries where Trump has business dealings, according to Bloomberg.\n\nThe news organization has put together a map of the proposed suspensions, with the Muslim-majority countries where Trump has business interests—Egypt, Saudi Arabia, Turkey, and Azerbaijan—rendered in yellow.\n\nTrump’s immigration ban excludes countries with business ties https://t.co/XEcwMJaKht pic.twitter.com/nRNNmXscMZ — Bloomberg Politics (@bpolitics) January 26, 2017\n\nWhile Muslim-majority countries such as Oman, Qatar, Kuwait, and others are not included on the list, the omission of Turkey and Egypt may be argued as being seen at odds with Trump’s definition. Both Turkey and Egypt endured high-profile terror attacks in 2016.\n\nThe President has positions in two companies that may be related to business in Egypt, and has previously praised the country’s autocratic leader, Abdel Fattah al-Sisi. In Turkey, Trump has a licensing deal to use his name on two luxury towers in Istanbul.", "authors": ["Joseph Hincks"], "publish_date": "2017-01-27", "source": "cnn", "top_words": ["muslimmajority", "countrys", "bloomberg", "trump", "ban", "arent", "immigration", "turkey", "trumps", "countries", "links", "egypt", "business"], "summary": "A draft proposal of an executive order obtained by Bloomberg News reportedly shows that Trump is poised to suspend all entry to the U.S. from seven Muslim-majority countries.\nNotably missing from the blacklist, however, are several Muslim-majority countries where Trump has business dealings, according to Bloomberg.\nThe news organization has put together a map of the proposed suspensions, with the Muslim-majority countries where Trump has business interests—Egypt, Saudi Arabia, Turkey, and Azerbaijan—rendered in yellow.\nTrump’s immigration ban excludes countries with business ties https://t.co/XEcwMJaKht pic.twitter.com/nRNNmXscMZ — Bloomberg Politics (@bpolitics) January 26, 2017While Muslim-majority countries such as Oman, Qatar, Kuwait, and others are not included on the list, the omission of Turkey and Egypt may be argued as being seen at odds with Trump’s definition.\nIn Turkey, Trump has a licensing deal to use his name on two luxury towers in Istanbul."}