{"url": "http://tech.fortune.cnn.com/2017/01/28/nationwide-stay-trump-executive-order-immigration/", "id": "57", "title": "Trump Immigration Ban: Judge Issues Nationwide Stay on Executive Order", "text": "A federal court judge on Saturday night ordered that refugees and other immigrants stuck at American airports should not be sent back to their home countries after President Donald Trump signed a surprise executive order blocking them from entering the U.S.\n\nIn an emergency hearing in a Brooklyn courthouse, Judge Ann Donnelly of the Eastern District of New York issued a stay of proceedings for part of Trump’s executive order, which bars citizens of seven predominantly Muslim countries—Iran, Iraq, Libya, Somalia, Sudan, Syria, and Yemen—”to protect the American people from terrorist attacks by foreign nationals admitted to the United States.”\n\nSending travelers home could cause them “irreparable harm,” Donnelly said.\n\nSigned judge's order. No refugees are going to be immediately deported pic.twitter.com/sbfaG7DBt0 — ACLU National (@ACLU) January 29, 2017\n\nThe U.S. is “enjoined and restrained from, in any manner or by any means, removing individuals with refugee applications approved by U.S. Citizenship and Immigration Services as part of the U.S. Refugee Admissions Program, holders of valid immigrant and non-immigrant visas, and other individuals from Iraq, Syria, Iran, Sudan, Libya, Somalia, and Yemen legally authorized to enter the United States,” according to the ruling. (Read the full text of the order here.)\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\nThe ruling does not allow detainees to enter the country. The judge did not address the constitutionality of Trump’s actions, which come just one week into his presidency.\n\n“This ruling preserves the status quo and ensures that people who have been granted permission to be in this country are not illegally removed off U.S. soil,” said Lee Gelernt, who argued the case as deputy director of the ACLU’s Immigrants’ Rights Project, in a statement.\n\nThe ruling is immediate and applies nationwide. Attorneys are reportedly working pro bono through the weekend on behalf of detainees impacted by the order, which Trump signed on Friday evening. Between 100 and 200 people are affected, according to a New York Times estimate.\n\nBroad and important nationwide stay granted! This means folks will not be deported. We will get you more information as we have it. — Nat'l Imm Law Center (@NILC_org) January 29, 2017\n\nIn addition, the U.S. government must provide a list of those immigrants who are affected by the change in policy, according to Dale Ho, the director of the American Civil Liberties Union’s Voting Rights Project.\n\nClarification:Stay covers the airport detainees and those currently in transit. Doesn't change ban going forward. Prev unclear tweet deleted — Jessica Huseman (@JessicaHuseman) January 29, 2017\n\nThe stay only affects those immigrants who were detained at U.S. airports or are currently in transit, according to ProPublica senior reporting fellow Jessica Huseman, and does not impact those who have not yet left for the United States.", "authors": ["Andrew Nusca"], "publish_date": "2017-01-28", "source": "cnn", "top_words": ["stay", "executive", "ruling", "trump", "ban", "immigrants", "issues", "immigration", "judge", "united", "nationwide", "according", "detainees", "order", "american"], "summary": "A federal court judge on Saturday night ordered that refugees and other immigrants stuck at American airports should not be sent back to their home countries after President Donald Trump signed a surprise executive order blocking them from entering the U.S.\nSigned judge's order.\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 AdvertisementThe ruling does not allow detainees to enter the country.\nThe judge did not address the constitutionality of Trump’s actions, which come just one week into his presidency.\nAttorneys are reportedly working pro bono through the weekend on behalf of detainees impacted by the order, which Trump signed on Friday evening."}