{"url": "http://tech.fortune.cnn.com/2017/01/29/asghar-farhadi-trump-travel-ban/", "id": "59", "title": "Asghar Farhadi Will Not Attend Oscars, Condemns President Trump's Immigration Ban", "text": "Iranian Oscar nominee Asghar Farhadi released a statement on Sunday addressing President Donald Trump’s immigration ban. While unconfirmed reports previously claimed the filmmaker would not be able to enter the U.S. to attend the Oscars in February, Farhadi states he will not be present either way.\n\n“Over the course of the past few days and despite the unjust circumstances which have risen for the immigrants and travelers of several countries to the United States, my decision had remained the same: to attend this ceremony and to express my opinions about these circumstances in the press surrounding the event,” Farhadi writes in a statement, via the New York Times. “I neither had the intention to not attend nor did I want to boycott the event as a show of objection, for I know that many in the American film industry and the Academy of Motion Picture Arts and Sciences are opposed to the fanaticism and extremism which are today taking place more than ever.”\n\nFarhadi’s The Salesman is a nominee for Best Foreign Language Film. Despite initial plans to attend the ceremony with his cinematographer, Hossein Jafarian, he writes, “the possibility of this presence is being accompanied by ifs and buts which are in no way acceptable to me even if exceptions were to be made for my trip.”\n\nInstead, he included a statement he would’ve made to press in the U.S.\n\nIranian Academics Scared and Stranded by Trump Travel Ban\n\n“Hardliners, despite their nationalities, political arguments and wars, regard and understand the world in very much the same way. In order to understand the world, they have no choice but to regard it via an ‘us and them’ mentality, which they use to create a fearful image of ‘them’ and inflict fear in the people of their own countries,” Farhadi writes. “This is not just limited to the United States; in my country hardliners are the same. For years on both sides of the ocean, groups of hardliners have tried to present to their people unrealistic and fearful images of various nations and cultures in order to turn their differences into disagreements, their disagreements into enmities and their enmities into fears. Instilling fear in the people is an important tool used to justify extremist and fanatic behavior by narrow-minded individuals.”\n\nWhile he condemned “the unjust conditions forced upon some of my compatriots and the citizens of the other six countries trying to legally enter the United States of America,” Farhadi believes “the similarities among the human beings on this earth and its various lands, and among its cultures and its faiths, far outweigh their differences. I believe that the root cause of many of the hostilities among nations in the world today must be searched for in their reciprocal humiliation carried out in its past and no doubt the current humiliation of other nations are the seeds of tomorrow’s hostilities.”\n\nGlobal Backlash Grows Against Trump’s Immigration Order\n\nHe adds, “To humiliate one nation with the pretext of guarding the security of another is not a new phenomenon in history and has always laid the groundwork for the creation of future divide and enmity.”\n\nThe Academy released its own statement on the matter Saturday in light of Trump’s executive order, which bars refugees and immigrants from several Middle Eastern countries, including Iran, from entering the U.S.\n\n“As supporters of filmmakers — and the human rights of all people — around the globe, we find it extremely troubling that Asghar Farhadi, the director of the Oscar-winning film from Iran A Separation, along with the cast and crew of this year’s Oscar-nominated film The Salesman, could be barred from entering the country because of their religion or country of origin,” it read in part.\n\nThis story originally appeared on EW.com", "authors": ["Nick Romano", "Entertainment Weekly"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["film", "world", "ban", "condemns", "immigration", "oscars", "statement", "farhadi", "attend", "united", "trumps", "countries", "states", "president", "writes", "asghar"], "summary": "Iranian Oscar nominee Asghar Farhadi released a statement on Sunday addressing President Donald Trump’s immigration ban.\nWhile unconfirmed reports previously claimed the filmmaker would not be able to enter the U.S. to attend the Oscars in February, Farhadi states he will not be present either way.\nIn order to understand the world, they have no choice but to regard it via an ‘us and them’ mentality, which they use to create a fearful image of ‘them’ and inflict fear in the people of their own countries,” Farhadi writes.\n“This is not just limited to the United States; in my country hardliners are the same.\nThis story originally appeared on EW.com"}