{"url": "http://rss.cnn.com/~r/rss/cnn_us/~3/JwbeV1FOCwY/", "id": "55", "title": "Lawyers Set Up Shop At JFK Airport As President Trump’s Travel Ban Takes Effect", "text": "NEW YORK (CBSNewYork) — President Donald Trump’s revised temporary travel ban went into effect Thursday.\n\nIt impacts travelers from Libya, Syria, Iran, Somalia, Yemen and Sudan.\n\nVisa applicants in those six Muslim-majority countries will have to prove a relationship with family already in the U.S. to enter.\n\nIf not, they’ll be banned for at least 90 days.\n\nThe new rules took effect at 8 p.m. EST, according to the State Department.\n\nAt least a dozen attorneys were volunteering at John F. Kennedy Airport’s Terminal 4, where they will monitor the effects of the ban and assist passengers where needed, 1010 WINS’ Glenn Schuck reported.\n\n“We have an army of over 1,000 lawyers who have their back and are ready to go back out to JFK if that becomes necessary,” said Camille Mackler, Director of Legal Initiatives at the New York Immigration Coalition.\n\nMackler said travelers coming in Thursday are already approved.\n\n“In terms individuals arriving at the United States… they should already have visas approved, and are not subject to the ban, the injunction, the stay on the injunction or anything like that,” Mackler said.\n\nAs 1010 WINS’ Andrew Falzon reported, Mackler emphasized the need to hold President Trump accountable.\n\n“We have to remind the president that he is accountable to the American people, and to the court system, and to the Congress ultimately,” she said.\n\nIn particular, Mackler took issue with the Supreme Court’s decision to allow part of the ban to stand until the case is heard in the fall.\n\n“I think that their interpretation was just so narrow that really, it defies even a common sense belief of what the Supreme Court could have reasonably expected would have been the implementation of this standard that they created,” she said.\n\nMacler said they don’t expect the same kind of chaos they saw at the airport the first time the travel ban kicked in back in January, Schuck reported.\n\n“For now it seems, just from the way that the second order was written and also from the Supreme Court’s pretty limited stay on the injunction, that most of those who will be impacted are actually abroad,” Mackler said.\n\nLower courts previously blocked the controversial policy, but earlier this week the Supreme Court partially restored Trump’s executive order.", "authors": [], "publish_date": "2017-06-29", "source": "cnn", "top_words": ["travel", "lawyers", "courts", "ban", "supreme", "court", "wins", "trumps", "takes", "shop", "president", "york", "mackler", "set", "effect", "jfk", "injunction"], "summary": "NEW YORK (CBSNewYork) — President Donald Trump’s revised temporary travel ban went into effect Thursday.\nVisa applicants in those six Muslim-majority countries will have to prove a relationship with family already in the U.S. to enter.\nAs 1010 WINS’ Andrew Falzon reported, Mackler emphasized the need to hold President Trump accountable.\nIn particular, Mackler took issue with the Supreme Court’s decision to allow part of the ban to stand until the case is heard in the fall.\nLower courts previously blocked the controversial policy, but earlier this week the Supreme Court partially restored Trump’s executive order."}