{"url": "http://tech.fortune.cnn.com/2017/01/29/trump-immigration-order-backlash/", "id": "64", "title": "Global Backlash Grows Against Trump's Immigration Order", "text": "A global backlash against U.S. President Donald Trump’s immigration curbs gathered pace on Sunday as several countries including long-standing American allies criticised the measures as discriminatory and divisive.\n\nGovernments from London and Berlin to Jakarta and Tehran spoke out against Trump’s order to put a four-month hold on allowing refugees into the United States and temporarily ban travellers from Syria and six other Muslim-majority countries, which he said would help protect Americans from terrorism.\n\nIn Germany—which has taken in large numbers of people fleeing the Syrian civil war—Chancellor Angela Merkel said the global fight against terrorism was no excuse for the measures and “does not justify putting people of a specific background or faith under general suspicion”, her spokesman said.\n\nShe expressed her concerns to Trump during a phone call and reminded him that the Geneva Conventions require the international community to take in war refugees on humanitarian grounds, the spokesman added.\n\nDozens Barred From Flying Out of Istanbul Airport after Trump Ban\n\nMerkel’s sentiments were echoed in Paris and London; “Terrorism knows no nationality. Discrimination is no response,” said French Foreign minister Jean-Marc Ayrault, while his British counterpart Boris Johnson tweeted: “Divisive and wrong to stigmatise because of nationality.”\n\nAlong with Syria, the U.S. ban affects travellers with passports from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\n\nTrump said his order, which indefinitely bans refugees from Syria, was “not a Muslim ban”, though he added he would seek to prioritise Christian refugees fleeing the war-torn country.\n\nWashington’s Arab allies, including the Gulf states and Egypt, were mostly silent.\n\nFor more on world leaders and Trump, watch:\n\nThe government in Iraq, which is allied with Washington in the battle against ultra-hardline Islamist group Islamic State and hosts over 5,000 U.S. troops, also did not comment on the executive order.\n\nBut some members of the parliament said Iraq should retaliate with similar measures against the United States.\n\nIn Baghdad, influential Shi’ite cleric Moqtada al-Sadr said American nationals should leave Iraq, in retaliation for the travel curbs.\n\n“It would be arrogance for you to enter freely Iraq and other countries while barring to them the entrance to your country … and therefore you should get your nationals out,” he said on his website.\n\nThere was no immediate reaction to the curbs from Islamic State, although in the past it has used U.S. monitoring of Muslim foreigners to stoke Muslim anger against Washington.\n\nTrump Refugee Ban Causes Chaos, Panic, Anger Worldwide\n\nTrump’s executive order on Friday took effect immediately, wreaking havoc and confusion for would-be travellers with passports from the seven countries and plunging America’s immigration system into chaos. U.S. civil rights and faith groups, activists and Democratic politicians vowed to fight the order.\n\nThe Tehran government vowed to respond in kind to the U.S. ban on visitors from Iran, but on Sunday Foreign Minister Mohammad Javad Zarif said on Twitter that Americans who already hold Iranian visas can enter the country.\n\n#MuslimBan shows baselessness of U.S. claims of friendship with the Iranian people while only having issues with the Government. 4/7 — Javad Zarif (@JZarif) January 28, 2017\n\nWhile respecting Americans & differentiating between them &hostile U.S. policies, Iran will take reciprocal measures to protect citizens.5/7 — Javad Zarif (@JZarif) January 28, 2017\n\nFull statement of the Ministry of Foreign Affairs of the Islamic Republic of Iran on the #MuslimBan. 6/7 pic.twitter.com/Y3gAxT0B8m — Javad Zarif (@JZarif) January 28, 2017\n\nUnlike the U.S., our decision is not retroactive. All with valid Iranian visa will be gladly welcomed. #MuslimBan 7/7 — Javad Zarif (@JZarif) January 28, 2017\n\n“Unlike the U.S., our decision is not retroactive. All with valid Iranian visa will be gladly welcomed,” Zarif said.\n\nTrump, a businessman who successfully tapped into American fears about militant attacks during his campaign, had promised what he called “extreme vetting” of immigrants and refugees from areas the White House said the U.S. Congress deemed high risk.\n\nTrump’s Immigration Ban: CEOs of Apple and Facebook Speak Out\n\nHe said on Saturday of his order: “It’s working out very nicely. You see it at the airports, you see it all over.”\n\nThe travel curbs, however, also drew criticism from several other countries around the globe.\n\nIn Jakarta, Indonesian Foreign Minister Retno Marsudi said the Muslim-majority nation deeply regretted Trump’s plans for “extreme vetting” of people from some Muslim countries.\n\nThe US decision not to allow entry of people from certain countries is NOT fair. Meet every man/woman as an individual #dkpol — Anders Samuelsen (@anderssamuelsen) January 29, 2017\n\nThe Danish, Swedish and Norwegian governments all registered their opposition, with Danish foreign minister Anders Samuelsen tweeting: “The U.S. decision not to allow entry of people from certain countries is NOT fair.”\n\nCanadian Prime Minister Justin Trudeau said his country welcomed those fleeing war and persecution, even as Canadian airlines said they would turn back U.S.-bound passengers to comply with an immigration ban on people from seven Muslim-majority countries.\n\nTo those fleeing persecution, terror & war, Canadians will welcome you, regardless of your faith. Diversity is our strength #WelcomeToCanada — Justin Trudeau (@JustinTrudeau) January 28, 2017\n\n“To those fleeing persecution, terror & war, Canadians will welcome you, regardless of your faith. Diversity is our strength #WelcomeToCanada,” he tweeted.", "authors": [], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["javad", "backlash", "foreign", "grows", "ban", "global", "immigration", "iraq", "refugees", "zarif", "trumps", "countries", "order", "28", "fleeing", "minister"], "summary": "A global backlash against U.S. President Donald Trump’s immigration curbs gathered pace on Sunday as several countries including long-standing American allies criticised the measures as discriminatory and divisive.\nTrump said his order, which indefinitely bans refugees from Syria, was “not a Muslim ban”, though he added he would seek to prioritise Christian refugees fleeing the war-torn country.\n6/7 pic.twitter.com/Y3gAxT0B8m — Javad Zarif (@JZarif) January 28, 2017Unlike the U.S., our decision is not retroactive.\nTrump’s Immigration Ban: CEOs of Apple and Facebook Speak OutHe said on Saturday of his order: “It’s working out very nicely.\nIn Jakarta, Indonesian Foreign Minister Retno Marsudi said the Muslim-majority nation deeply regretted Trump’s plans for “extreme vetting” of people from some Muslim countries."}