{"url": "http://tech.fortune.cnn.com/2017/01/30/aclu-muslim-ban-tech-hollywood/", "id": "67", "title": "Tech and Hollywood Stars Spur ACLU Efforts With Matching Funds", "text": "The firestorm sparked by President Donald Trump’s executive order on Friday to ban immigration and travel to the U.S. by people from seven predominantly Muslim countries proved a boon to the American Civil Liberties Union, which reportedly collected more than $24 million in contributions over the weekend.\n\nNot bad for an organization that typically raises about $4 million annually.\n\nMany of those donations likely came from first-time donors, some of which responded to matching fund offers from tech stars like venture capitalist Chris Sacca. On Saturday, Sacca promised to match up to the first $25,000 of donations resulting from his offer but he later raised the limit to $150,000. Sacca is known for his early investments in Twitter (twtr) and Uber as well as appearances ABC’s startup competition show Shark Tank.\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\nFred Wilson and Albert Wenger of Union Square Ventures joined the fund-raising race on Sunday, offering matches for up to $20,000. as did Foundry Group’s Brad Feld. There’s also a handy list of matching funders.\n\nThe ACLU, which provides legal services to underserved people, went to court to fight the executive orders this weekend. Four federal judges subsequently issued a stay on the ban.\n\nThe @aclu took Trump to court. Let's stand with them. Reply w/ donation receipts from today & I'll match to $25k. https://t.co/0uiQPpQsyH — Chris Sacca (@sacca) January 28, 2017\n\nOther matching fund offers flooded in from techies, including Patrick Collison, chief executive of online payment company Stripe, and Nat Friedman, co-founder and chief executive of Xamarin, the software development company acquired last year by Microsoft (msft). Logan Green and John Zimmer, co-founders of the Lyft ride-sharing service pledged to donate $1 million to the ACLU over the next four years.\n\nBut it wasn’t just tech luminaries. On Saturday, pop star Sia promised to match the first $100,000 flowing in. Hollywood hyphenate (writer-producer-director-actor) Judd Apatow followed her lead.\n\nOkay @sia. We are all going to join you. I am in! https://t.co/XN8tqp7sPX — Judd Apatow (@JuddApatow) January 29, 2017\n\nSo did actress/comedian (and frequent Trump foil) Rosie O’Donnell. Singer/songwriter Jack Antonoff of the Bleachers offered to match up to $10,000 as did Jessie Tyler Ferguson, co-star of ABC (dis) comedy Modern Family.\n\nIncredible! I'll match your donations to @ACLU in support of our LGBTQ immigrant family up to $10,000 through @TieTheKnotOrg. #NoBanNoWall https://t.co/Xv3ETmWJxI — Jesse Tyler Ferguson (@jessetyler) January 30, 2017\n\nThe ACLU also got shout-outs during Sunday night’s Screen Actors Guild Awards broadcast. Most notably, Sarah Paulson, who won an award for her role in the miniseries The People vs. O.J. Simpson, used her acceptance speech to drum up more support, asking everyone who is able to donate to the ACLU “to protect the rights and liberties of people across this country.”", "authors": ["Barb Darrow"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["executive", "hollywood", "trump", "tech", "match", "funds", "million", "union", "tyler", "aclu", "donations", "stars", "sacca", "efforts", "spur", "matching"], "summary": "Many of those donations likely came from first-time donors, some of which responded to matching fund offers from tech stars like venture capitalist Chris Sacca.\nThe ACLU, which provides legal services to underserved people, went to court to fight the executive orders this weekend.\nLogan Green and John Zimmer, co-founders of the Lyft ride-sharing service pledged to donate $1 million to the ACLU over the next four years.\nI'll match your donations to @ACLU in support of our LGBTQ immigrant family up to $10,000 through @TieTheKnotOrg.\n#NoBanNoWall https://t.co/Xv3ETmWJxI — Jesse Tyler Ferguson (@jessetyler) January 30, 2017The ACLU also got shout-outs during Sunday night’s Screen Actors Guild Awards broadcast."}