{"url": "http://tech.fortune.cnn.com/2017/01/30/donald-trump-muslim-ban-ford/", "id": "69", "title": "Ford's CEO Criticizes President Trump's Muslim Travel Ban", "text": "Ford Motor on Monday criticized President Donald Trump’s controversial immigration order, becoming one of the highest profile U.S. manufacturers to question the decision to temporary ban travelers coming from seven predominantly Muslim countries.\n\nFord Executive Chairman Bill Ford Jr. and Chief Executive Officer Mark Fields said in a statement to employees that the company does not support what it called a new U.S. travel ban.\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\n“We do not support this policy or any other that goes against our values as a company,” they said, adding that Ford is not aware of any employees directly affected by the policy.\n\nFields met twice with Trump last week to talk about economic issues. Ford was harshly criticized by Trump during the campaign for moving some production to Mexico, but he has praised the automaker in recent weeks for announcing new U.S. investments.\n\nFord is based in Dearborn, Mich., home to one of the largest Arab-American populations in the United States.\n\nGeneral Motors, Fiat Chrysler Group NV, Toyota Motor, and Honda Motor are among automakers that have declined to comment when asked by Reuters about the immigration order.\n\nTesla Motors CEO Elon Musk has also criticized the order.", "authors": [], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["executive", "travel", "trump", "ban", "immigration", "criticizes", "support", "criticized", "trumps", "ceo", "ford", "motors", "motor", "order", "president", "muslim", "employees", "fords"], "summary": "Ford Motor on Monday criticized President Donald Trump’s controversial immigration order, becoming one of the highest profile U.S. manufacturers to question the decision to temporary ban travelers coming from seven predominantly Muslim countries.\nFord Executive Chairman Bill Ford Jr. and Chief Executive Officer Mark Fields said in a statement to employees that the company does not support what it called a new U.S. travel ban.\nFord is based in Dearborn, Mich., home to one of the largest Arab-American populations in the United States.\nGeneral Motors, Fiat Chrysler Group NV, Toyota Motor, and Honda Motor are among automakers that have declined to comment when asked by Reuters about the immigration order.\nTesla Motors CEO Elon Musk has also criticized the order."}