{"url": "http://tech.fortune.cnn.com/2017/01/29/white-house-immigration-order/", "id": "66", "title": "White House: Immigration Order 'Small Price' for Safety", "text": "The White House on Sunday tried to tamp down concerns about President Donald Trump’s sweeping immigration order in the face of widespread protests, as some Republicans in Congress urged him to proceed with caution in the face of legal pushback. Top congressional Republicans, however, remain largely behind the new president.\n\nDuring a round of Sunday show interviews, Trump’s aides stressed that just a small portion of travelers had been affected by the order, which temporarily bars the citizens of seven majority Muslim nations from entering the country. The aides also reversed course and said that citizens of those countries who hold permanent U.S. residency “green cards” will not be barred from re-entering the country, as officials had previously said.\n\n“I can’t imagine too many people out there watching this right now think it’s unreasonable to ask a few more questions from someone traveling in and out of Libya and Yemen before being let loose in the United States,” insisted Trump’s chief of staff Reince Priebus. “And that’s all this is.”\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\nAs of Sunday afternoon, one legal permanent resident had been denied entry to the country as a result of the order, according to a federal law enforcement official. The official was not permitted to discuss the order’s impact publicly and spoke on the condition of anonymity.\n\nThe changes, said White House adviser Kellyanne Conway, are “a small price to pay” to keep the nation safe.\n\nStarbucks CEO Wants to Hire 10,000 Refugees\n\nBut it’s unclear whether the order, which also suspends refugee admissions for 120 days and indefinitely bars the processing of refugees from Syria, will accomplish that. The order does not address homegrown extremists already in America, a primary concern of federal law enforcement officials. And the list of countries in Trump’s order doesn’t include Saudi Arabia, where most of the Sept. 11 hijackers were from.\n\nPriebus said that other countries could be added to the list.\n\nThe order has sparked widespread protests and denunciations from Democrats and a handful of Republicans. Many have accused the administration of rushing to implement the changes, resulting in panic and confusion at the nation’s airports.\n\n“You have an extreme vetting proposal that didn’t get the vetting it should have had,” said Sen. Rob Portman, R-Ohio, who urged the new president to “slow down” and work with lawmakers on how best to tighten screening for foreigners who enter the United States.\n\n“In my view, we ought to all take a deep breath and come up with something that makes sense for our national security” and reflects the fact that “America’s always been a welcoming home for refugees and immigrants,” he said.\n\nThe Koch Brothers Oppose President Trump’s Immigration Ban\n\nThe comments came the morning after a federal judge in New York issued an emergency order temporarily barring the U.S. from deporting people from the seven majority Muslim nations subject to Trump’s 90-day travel ban. The judge said travelers who had been detained had a strong argument that their legal rights had been violated.\n\nThe order barred U.S. border agents from removing anyone who arrived in the U.S. with a valid visa from Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen. It also covered anyone with an approved refugee application.\n\nThe Department of Homeland Security, however, said Sunday said the court ruling would not affect the overall implementation of the White House order.\n\n“President Trump’s executive orders remain in place — prohibited travel will remain prohibited, and the U.S. government retains its right to revoke visas at any time if required for national security or public safety,” the department said in a statement.\n\nIraq Threatens Ban on U.S. Citizens, Putting the Fight Against ISIS at Risk\n\nTop congressional Republicans, meanwhile, were backing Trump despite concerns raised Sunday from a handful of GOP lawmakers.\n\nSenate Majority Leader Mitch McConnell, R-Ky., said he supports more stringent screening mechanisms, though he cautioned that Muslims are some of the country’s “best sources in the war against terror.”\n\n“I think it’s a good idea to tighten the vetting process But I also think it’s important to remember that some of our best sources in the war against radical Islamic terrorism are Muslims, both in this country and overseas,” he said.\n\nHe also stressed the need “to be careful as we do this,” and said it would be up to the courts to decide “whether or not this has gone too far.”\n\nRepublican Sens. John McCain and Lindsey Graham, meanwhile, warned of unintended consequences, expressing fear the order could “become a self-inflicted wound in the fight against terrorism.”\n\nLyft Pledges $1 Million to ACLU after Trump Travel Restrictions\n\n“This executive order sends a signal, intended or not, that America does not want Muslims coming into our country. That is why we fear this executive order may do more to help terrorist recruitment than improve our security,” they wrote.\n\nTrump billed his sweeping executive order as a necessary step to stop “radical Islamic terrorists” from coming to the U.S.\n\nKoch political network, which is among the most influential players in the conservative movement, also condemned the plan Sunday.\n\n“The travel ban is the wrong approach and will likely be counterproductive,” network co-chairman Brian Hooks said in a statement. “We believe it is possible to keep Americans safe without excluding people who wish to come here to contribute and pursue a better life for their families.”\n\nPriebus was on NBC’s Meet the Press and Portman was on CNN’s State of the Union, while McConnell appeared on ABC’s This Week.", "authors": ["The Associated Press"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["executive", "travel", "price", "trump", "immigration", "security", "republicans", "vetting", "small", "trumps", "country", "order", "house", "white", "safety"], "summary": "The changes, said White House adviser Kellyanne Conway, are “a small price to pay” to keep the nation safe.\nThe order does not address homegrown extremists already in America, a primary concern of federal law enforcement officials.\nAnd the list of countries in Trump’s order doesn’t include Saudi Arabia, where most of the Sept. 11 hijackers were from.\nThe Department of Homeland Security, however, said Sunday said the court ruling would not affect the overall implementation of the White House order.\nThat is why we fear this executive order may do more to help terrorist recruitment than improve our security,” they wrote."}