{"url": "http://management.fortune.cnn.com/2017/01/29/trump-travel-ban-istanbul/", "id": "6", "title": "Dozens Barred From Flying Out of Istanbul Airport after Trump Ban", "text": "Dozens of people were stopped from flying to the United States from Istanbul Ataturk Airport on Sunday, Turkish airport officials said, after U.S. President Donald Trump ordered a ban on refugees and nationals from seven Muslim-majority countries.\n\nIn his most sweeping action since taking office, Trump on Friday put a four-month hold on allowing refugees into the United States and temporarily barred travelers from Syria, Iran, Iraq, Libya, Somalia, Sudan, and Yemen. He said the moves would protect Americans from terrorism.\n\nAlthough NATO member Turkey is not on the list, Ataturk airport is a major regional hub frequently used by travelers from the Middle East heading to Europe or the United States.\n\nTrump’s Refugee Ban No Solution to Problems, Turkey PM Says\n\nOfficials at Ataturk, Europe’s third-busiest airport, told Reuters they had stopped “dozens” of people from traveling on Sunday, due to the ban. One official said the number was fewer than 80, but declined to give further details.\n\nOne 32-year-old Syrian man, Nail Zain, told Reuters he arrived at the airport expecting to fly to Los Angeles, but officials prevented him from boarding, saying his visa was canceled.\n\n“My wife and my son are in the United States. My son has American nationality. And we have been waiting for this moment for two years. Finally when I got the chance, they prevented me as a Syrian passport holder from traveling,” Zain said.\n\nHe was later taken out of the terminal by authorities.\n\nIt was not immediately clear whether the ban would have an impact on flagship carrier Turkish Airlines. Officials for the airline were not immediately available to comment on Sunday.\n\nThe U.S. Department of Homeland Security said about 375 travelers had been affected by the order, 109 of whom were in transit and were denied entry to the United States. Another 173 were stopped by airlines before boarding.", "authors": [], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["turkish", "stopped", "ataturk", "airport", "trump", "ban", "travelers", "officials", "united", "barred", "zain", "istanbul", "states", "flying", "dozens"], "summary": "Dozens of people were stopped from flying to the United States from Istanbul Ataturk Airport on Sunday, Turkish airport officials said, after U.S. President Donald Trump ordered a ban on refugees and nationals from seven Muslim-majority countries.\nIn his most sweeping action since taking office, Trump on Friday put a four-month hold on allowing refugees into the United States and temporarily barred travelers from Syria, Iran, Iraq, Libya, Somalia, Sudan, and Yemen.\nAlthough NATO member Turkey is not on the list, Ataturk airport is a major regional hub frequently used by travelers from the Middle East heading to Europe or the United States.\nTrump’s Refugee Ban No Solution to Problems, Turkey PM SaysOfficials at Ataturk, Europe’s third-busiest airport, told Reuters they had stopped “dozens” of people from traveling on Sunday, due to the ban.\n“My wife and my son are in the United States."}