{"url": "http://tech.fortune.cnn.com/2017/01/30/companies-silent-trump-travel-ban/", "id": "68", "title": "Non-Tech Companies Mostly Silent on Trump's Travel Ban", "text": "An uneasy truce that’s presided between big business and the Trump administration showed its first cracks over the weekend, as the tech industry in particular registered its disapproval of the president’s immigration ban. Executives from Apple, Facebook, Google, Microsoft , Airbnb, Lyft, Twitter, and Uber all voiced objections to Trump’s Friday order, which left refugees, legal residents, and visa holders from seven majority-Muslim countries stranded in American airports over the weekend and set off protests in major cities nationwide.\n\nGoogle and Lyft announced seven-figure contributions to the ACLU; Uber pledged to compensate drivers left stranded by the ban; and Airbnb offered free housing to refugees. And some of the industry’s representatives in Washington lodged criticism as well, with TechNet and the Internet Association expressing opposition.\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\nIt’s no surprise that Silicon Valley would emerge as the first corporate hub of dissent, considering both the liberal bent of the industry’s workforce and its reliance on foreign-born talent. Less clear is how many non-tech companies with sprawling global operations will join the chorus.\n\nGoldman Sachs, which counts several alumni among the tops ranks of the new administration, may have been the first. In a voicemail to the bank’s employees on Sunday night, CEO Lloyd Blankfein said the executive order is “not a policy we support.” And General Electric CEO Jeff Immelt said in a Sunday blog post he shares his employees’ “concern” over the ban. They’ve since been joined by Ford’s Mark Fields (but not execs from Fiat or GM) who sent out a staff memo stressing commitment to diversity, along with Morgan Stanley’s James Gorman, JPMorgan’s Jamie Dimon, and Starbucks Howard Schultz. But the more common reaction among major non-tech companies has been silence.\n\nAlong with two Fortune colleagues, I reached out over the weekend to nearly every company in the Fortune 100 for a response. To the extent we heard back, the responses were almost uniformly no-comments or punts, with spokespeople explaining executives were still assessing the impacts of the ban. Appearing on Bloomberg TV this morning, former Clinton administration Treasury Secretary Larry Summers said it’s “an extraordinary thing if business leaders in the United States are being intimidated by a president’s threats of calling them out, when the president’s been in office for one week.” We’re following up today with companies likely affected by the order and will be updating our coverage accordingly.", "authors": ["Tory Newmyer"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["travel", "silent", "companies", "weekend", "trump", "ban", "refugees", "stranded", "nontech", "trumps", "uber", "order", "presidents", "administration"], "summary": "An uneasy truce that’s presided between big business and the Trump administration showed its first cracks over the weekend, as the tech industry in particular registered its disapproval of the president’s immigration ban.\nGoogle and Lyft announced seven-figure contributions to the ACLU; Uber pledged to compensate drivers left stranded by the ban; and Airbnb offered free housing to refugees.\nLess clear is how many non-tech companies with sprawling global operations will join the chorus.\nBut the more common reaction among major non-tech companies has been silence.\nTo the extent we heard back, the responses were almost uniformly no-comments or punts, with spokespeople explaining executives were still assessing the impacts of the ban."}