{"url": "http://tech.fortune.cnn.com/2017/01/29/donald-trump-immigration-ban-republicans/", "id": "60", "title": "Here Are the Republicans Who Have Criticized President Trump's Immigration Ban", "text": "At least 20 Republicans have spoken out against President Donald Trump’s executive order that bans immigrants from seven Muslim-majority countries.\n\nThe order, which prohibits citizens from Iran, Iraq, Syria, Yemen, Sudan, Somalia and Libya from entering the United States for at least 90 days, also bans refugees from Syria indefinitely — a move that critics say make those in support “complicit in a humanitarian crisis,” the Washington Post reports. The order also bans refugees from anywhere in the world for 120 days, and gives priority admission to Christians.\n\nThough House Speaker Paul Ryan (R-Wis.) and Senate Majority Leader Mitch McConnell were among some of the first to back the President’s decision, many other members of the GOP have condemned the action.\n\n“President Trump is right to make sure we are doing everything possible to know exactly who is entering our country,” the speaker said Friday, according to the Post.\n\nBelow is a list of Republican elected officials who have criticized the ban, and what they’ve said in response to it.\n\nRep. Charlie Dent (R-Pa.):\n\n“This is ridiculous. “I guess I understand what his intention is, but unfortunately the order appears to have been rushed through without full consideration. You know, there are many, many nuances of immigration policy that can be life or death for many innocent, vulnerable people around the world,” he said, according to the Post.\n\nHe continued:\n\n“This 90-day ban could imperil the lives of this family and potentially others, and it’s unacceptable, and I urge the administration to halt enforcement of this order until a more thoughtful and deliberate policy can be reinstated.”\n\nSen. Jeff Flake (R-Ariz.):\n\nFlake publicly opposed the ban in a Medium post on Saturday.\n\n“It’s unacceptable when even legal permanent residents are being detained or turned away at airports and ports of entry,” Flake wrote. “Enhancing long term national security requires that we have a clear-eyed view of radical Islamic terrorism without ascribing radical Islamic terrorist views to all Muslims.”\n\nRep. Justin Amash (R-Mich.):\n\nIn a Twitter post, Amash wrote that “President Trump’s executive order overreaches and undermines our constitutional system.”\n\n“It’s not lawful to ban immigrants on basis of nationality. If the president wants to change immigration law, he must work with Congress,” he tweeted, before adding that the denial of green card holders is, “particularly troubling.”\n\n1/ Like Pres. Obama's executive actions on immigration, Pres. Trump's executive order overreaches and undermines our constitutional system. — Justin Amash (@justinamash) January 28, 2017\n\nSen. Ben Sasse (R-Neb.):\n\nThough Sasse agrees with Trump’s decision to protect the country’s borders, the Post reports, he said that the ban is “too broad.”\n\n“If we send a signal to the Middle East that the U.S. sees all Muslims as jihadis, the terrorist recruiters win by telling kids that America is banning Muslims and that this is America versus one religion,” Sasse said. “Our generational fight against jihadism requires wisdom.”\n\nSen. Susan Collins (R-ME):\n\nCollins released a statement criticizing Trump’s executive order. “A preference should not be given to people who practice a particular religion, nor should a greater burden be imposed on people who practice a particular religion. As I stated last summer, religious tests serve no useful purpose in the immigration process and run contrary to our American values.”\n\nGOP Sen. Susan Collins is 4th Republican to criticize Trump's Exec. Order: \"Religious tests…run contrary to our American values.\" pic.twitter.com/dimsEVY5SN — Kyle Griffin (@kylegriffin1) January 29, 2017\n\nRep. Barbara Comstock (R-VA):\n\nComstock wrote that though she believes in “increased vetting based on national security concerns,” she wrote that the President’s executive order “went beyond the increased vetting actions that Congress has supported on a bipartisan basis and inexplicably applied to green card holders, people who are legally within our country who have followed the rules.”\n\nGOP Rep. Barbara Comstock is at least the 5th Republican to hit Trump's EO: \"Went beyond the increased vetting actions\" Congress supported. https://t.co/48DSW3h3F8 — Kyle Griffin (@kylegriffin1) January 29, 2017\n\nSen. John McCain (R-Ariz) and Sen. Lindsey Graham (R-SC):\n\nMcCain and Graham released a joint statement on the immigration ban Sunday, saying that, “Such a hasty process risks harmful results. We should not stop green-card holders from returning to the country they call home. We should not stop those who have serves as interpreters for our military and diplomats from seeking refuge in a country they risked their lives to help. And we should not turn our backs on those refugees ho have been shown through extensive vetting to pose no demonstrable threat to our nation, and who have suffered unspeakable horrors, most of them women and children.”\n\n“Ultimately,” they continue, “we fear this executive order will become a self-inflicted wound in the fight against terrorism.”\n\nThe latter statement echoes a similar notion Sen. McCain emphasized early Sunday: On CBS’ Face the Nation, McCain said that Trump’s order on immigration will “probably in some areas give ISIS more propaganda.”\n\nSen. Rob Portman (R-OH)\n\nPortman, a member of the Homeland Security Committee, said Trump’s new vetting procedure was itself “not properly vetted.” In an interview with CNN’s Jake Tapper on Sunday, Portman said that while the U.S. does need to “tighten things up,” Trump’s approach was hasty and inconsistent with American values and national security interests.\n\n“In my view, we ought to all take a deep breath and come up with something that makes sense for our national security and again for this notion that America has always been a welcoming home for refugees and immigrants,” Portman said. “In fact, we are more welcoming than any country in the world and we should continue to be so.”\n\nSen. Orrin Hatch (R-UT)\n\nPresident of the Senate Finance Committee and Utah Senator Hatch, recalled that many of his own ancestors “were themselves refugees, religious minorities violently driven from their homes who undertook a long and dangerous journey to build a new life in a distant land.” The Senator urged the Trump administration to “move quickly to tailor its policy on visa issuance as narrowly as possible” and reduce “unnecessary burdens on the vast majority of visa-seekers that present a promise—not a threat—to our nation.”\n\nSen. Dean Heller (R-Nev.):\n\nThough Heller told the Post that he supports better vetting and border protection, he said he is “deeply troubled by the appearance of a religious ban.”\n\n“The use of an overly broad executive order is not the way to strengthen national security,” he said. “‎I encourage the Administration to partner with Congress to find a solution.”\n\nRep. Brian Fitzpatrick (R-Pa.):\n\n“The president’s policy entirely misses the mark,” Fitzpatrick said, according to the Philadelphia Inquirer.\n\nFitzpatrick said that he thinks terrorism inspired by radicalism requires a “comprehensive response,” not a “purely regional focus.” Though he does think serious actions should be taken to protect the country, “these must not be done in a way that singles out any specific nations or ethnicities,” he said.\n\nRep. Ileana Ros-Lehtinen (R-Fla.):\n\nShortly after Trump’s executive order was announced, Lehtinen said she “objected to the suspension of visas” from the seven countries that are included in the ban. Instead, she suggests that “we could have accomplished our objective of keeping our homeland safe by immediate implementation of more thorough screening procedures,” the Miami Herald reports.\n\n“Both the letter and the spirit of the rule of law, on which our liberties rest, require that we honor legal commitments and procedures established by law, including existing visas and approved refugee status, absent specific articulable reasons for reversing a prior decision. The new Administration needs to pay careful attention to crafting orders that honor existing legal commitments and existing law, in contrast to this broad brush approach which doesn’t focus on the precise problems,” she told the Herald in a statement Saturday.\n\nRep. Elise Stefanik (R-N.Y.):\n\nIn a Facebook post, Stefanik wrote that she thinks the country needs to both reform and strengthen its vetting process. However, she opposes Trump’s immigration ban—writing that “On the House Armed Services Committee, I have advocated for Iraqi and Afghans who have served side by side as our allies to be prioritized to access visas. It is Congress’ role to write our immigration laws and I strongly urge the President to work with Congress moving forward as we reform our immigration system to strengthen our homeland security.”\n\nCory Gardner (R-Colo.):\n\nThough Gardner said he is supportive of the country’s screening processes, “the travel blanket goes too far,” he said, according to the Post.\n\n“I also believe that lawful residents of the United States should be permitted to enter the country,” he said. “I urge the Administration to take the appropriate steps to fix this overly broad executive order.”\n\nRep. Will Hurd (R-Tex.):\n\nInstead of fighting extremism alone, Hurd stressed that the U.S. should work with its allies.\n\n“This visa ban is the ultimate display of mistrust and will erode our allies’ willingness to fight with us,” he said. “The ban also provides terrorist with another tool to gain sympathy and recruit new fighters.”\n\nBreaking: GOP Congressman @HurdOnTheHill calls #TravelBan \"ultimate display of mistrust\", \"will erode allies' willingness to fight w/us.\" pic.twitter.com/iKldgnGDqQ — The Reagan Battalion (@ReaganBattalion) January 29, 2017\n\nRep. Leonard Lance (R-N.J.):\n\nWhile Lance says the Trump Administration should be concerned about “the security and safety of the American people,” he says the executive order went too far: Lance wrote in a Facebook post that “the President’s current travel ban executive order appears rushed and poorly implemented. Reports of green card holders and those who assisted us in the War on Terror being denied or delayed entry into the U.S. is deeply concerning and must be remedied immediately.”\n\nHe continued: “It is Congress’ role to amend our immigration laws and I strongly urge President Trump to work with legislators to enact a clear, effective and enhanced vetting and monitoring process.”\n\nRep. Steve Stivers (R-Ohio):\n\nLike many of the other Republicans who oppose the ban, Stivers agrees with Trump that the nation should improve its vetting process. However, he believes that “the executive order risks violating our nation’s values and fails to differentiate mainstream Islamic partners from radical Islamic terrorists—setting back our fight against radical Islam. I urge the Administration to quickly replace this temporary order with permanent improvements in the visa vetting process,” he said, according to the Post.\n\nSen. Pat Toomey (R-Pa.):\n\nToomey supports increased vetting, as well as a temporary suspension of “certain individuals from states that sponsor or provide safe havens to terrorists, or are too weak to prosecute terrorists within their borders.” However, the senator does think the initial executive order was flawed—saying that it was “too broad and poorly explained.”\n\n“This apparently resulted in denied entry into the United States for lawful permanent residents and others who should have been allowed immediate entry,” he said, according to the Post.\n\nSen. Jerry Moran (R-Kan.):\n\nWhile Moran said he supports “thorough” vetting, he does not support “restricting the rights of U.S. citizens and lawful permanent residents,” he said, the Post reports.\n\n“Furthermore, far-reaching national security policy should always be devised in consultation with Congress and relevant government agencies,” he said.\n\nThis post has been updated.", "authors": ["Madeline Farber"], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["executive", "congress", "ban", "immigration", "vetting", "republicans", "post", "security", "criticized", "trumps", "country", "order", "president"], "summary": "At least 20 Republicans have spoken out against President Donald Trump’s executive order that bans immigrants from seven Muslim-majority countries.\nBelow is a list of Republican elected officials who have criticized the ban, and what they’ve said in response to it.\nTrump's executive order overreaches and undermines our constitutional system.\n“Our generational fight against jihadism requires wisdom.”Sen. Susan Collins (R-ME):Collins released a statement criticizing Trump’s executive order.\nRep. Ileana Ros-Lehtinen (R-Fla.):Shortly after Trump’s executive order was announced, Lehtinen said she “objected to the suspension of visas” from the seven countries that are included in the ban."}