{"url": "http://tech.fortune.cnn.com/2017/01/29/iranian-academics-trump-travel-ban/", "id": "61", "title": "Iranian Academics Scared and Stranded by Trump Travel Ban", "text": "Duke University professor and Iranian dissident Mohsen Kadivar left his home in North Carolina 10 days ago to attend a fellowship program in Germany.\n\nNow, stranded in Berlin as a result of new U.S. immigration rules, the longstanding critic of Iran’s ruling clerical establishment does not know whether or when he can rejoin his wife and two children in the United States.\n\nU.S. President Donald Trump on Friday put a four-month hold on allowing refugees into the United States and temporarily banned travellers from seven Muslim-majority countries. He said the move would help protect Americans from terrorism.\n\nThe ban affects travellers with passports from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen, including those with dual nationality that includes one of those countries, and extends on a case-by-case basis to “green card” holders who are authorised to live and work in the United States.\n\nAirbnb to Offer Free Housing to Blocked Travelers\n\nKadivar, once an active participant in Iran’s 1979 Islamic revolution who later fell foul of its leaders, told Reuters from Berlin he was concerned about his family and career in America.\n\n“I have a fellowship in Germany until July … but what happens after that is not clear. I am concerned about my future. I don’t know whether I will be able to return to the United States as a green card holder Iranian national,” he said.\n\nThere are an estimated 1 million Iranian-Americans in the United States, including those with U.S. citizenship, dual nationality and green card holders, so Trump’s executive order could create myriad travel complications.\n\n“My two children and wife live in the United States … My wife was planning to join me in Berlin, where I arrived on July 18 and was supposed to stay until July … But we were advised by the university’s immigration lawyers to cancel her trip to Berlin,” Kadivar said.\n\nKadivar, a research professor of Islamic studies at Duke University in North Carolina since 2009, is an outspoken critic of Iran’s hardline clerical leadership.\n\nThe 58-year-old, who was jailed for a year in Iran in 1999 for “disseminating lies and disturbing public opinion”, has called for more autonomy from religion in political life and has been a staunch critic of Iran’s most powerful authority, Supreme Leader Ayatollah Ali Khamenei.\n\nDozens Barred From Flying Out of Istanbul Airport after Trump Ban\n\nIn 2001, he travelled to the United States with an invitation from the Islamic Law Program of Harvard Law School for research and teaching. He was awarded the Hellman-Hammett Prize for writers deemed to be at risk from political persecution.\n\nKadivar said Trump’s travel ban was “humiliating and discriminatory”.\n\n“I have received so many emails from my colleagues, who regretted the ban … Iranians have never been involved in any terrorist act in the United States.”\n\n‘TURNING IRANIANS HOSTILE’\n\nThe United States and its allies in the Middle East accuse Iran of supporting terrorism and interfering in the affairs of regional states, including Syria, Yemen and Iraq – charges denied by Tehran.\n\nHardline allies of Khamenei, worried about losing their grip on power since a nuclear deal was reached with the United States and other world powers in 2015, have continued to denounce Washington publicly.\n\nMiddle Eastern Immigrants to U.S. Confront Upended Lives\n\nHowever, pragmatic President Hassan Rouhani has sought to reduce tensions with the United States. Iranian Foreign Minister Mohammad Javad Zarif, a Rouhani ally, tweeted on Sunday that the travel ban was “a great gift to extremists”.\n\nThe Tehran government on Saturday vowed to retaliate by banning the entry of Americans, but Zarif said on Twitter that Americans who already hold Iranian visas could enter Iran.\n\n“Unlike the U.S., our decision is not retroactive. All with valid Iranian visa will be gladly welcomed,” he said.\n\nDespite differences in tone from factions, political analysts said the U.S. measures would unite Iran’s political establishment to some extent, at least for a short while.\n\nIt would also turn public opinion firmly against the United States, they added.\n\nWhy Twitter Is Talking About Steve Bannon With the Hashtag #StopPresidentBannon\n\n“Besides tearing apart many families, this ban is materialising an objective that the leadership in Tehran has not been able to achieve for decades since the revolution,” said Ali Vaez from the International Crisis Group conflict research group.\n\n“That is turning Iranians hostile towards the United States. The top-down enmity towards the U.S. risks becoming bottom-up.”\n\n‘NOT MY AMERICAN DREAM’\n\nIranian author Azar Nafisi, a professor of English literature who has lived in the United States since 1997 and became a U.S. citizen nine years later, said the ban was contrary to American values.\n\n“We came to the United States because we believed it is a country of freedom, a country friendly to immigrants. People like me should raise their voice and express their concerns. This is not a political issue,” said Nafisi.\n\nUber Responds to Accusations of ‘Strikebreaking’ During Protest\n\nAnother Iranian-born academic, Mohammad, said he was returning to his home in the United States after attending his father’s funeral in Tehran, when the ban came into effect.\n\nTurkish Airlines refused to allow him to board his connecting flight to New York from Istanbul, he said.\n\nMohammad, 42, who refused to give his family name because he said he was concerned about administrative steps being taken against his U.S.-based family, said the ban was “certainly going to make things harder for mostly well-educated Iranian immigrants.\n\n“I have a green card and have been living in the U.S. for years. My two little daughters are awaiting for me. What can my wife tell them?” he said.\n\n“This is not what I dreamed about America.”", "authors": [], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["academics", "travel", "trump", "ban", "political", "wife", "scared", "card", "stranded", "iranian", "united", "irans", "green", "states", "berlin"], "summary": "U.S. President Donald Trump on Friday put a four-month hold on allowing refugees into the United States and temporarily banned travellers from seven Muslim-majority countries.\nI don’t know whether I will be able to return to the United States as a green card holder Iranian national,” he said.\nConfront Upended LivesHowever, pragmatic President Hassan Rouhani has sought to reduce tensions with the United States.\n“We came to the United States because we believed it is a country of freedom, a country friendly to immigrants.\n“I have a green card and have been living in the U.S. for years."}