{"url": "http://tech.fortune.cnn.com/2017/01/29/iraq-ban-us-citizens-isis-trump/", "id": "62", "title": "Iraq Threatens Ban on U.S. Citizens, Putting the Fight Against ISIS at Risk", "text": "Iraqi lawmakers said Sunday that they might ban U.S. nationals from entering the country in retaliation against U.S. President Donald Trump’s executive order on Iraqis in the U.S., a move that could hinder the fight against ISIS.\n\nThe Iraqi parliament’s foreign committee issued a statement calling on the Iraqi government to act after President Trump controversially ordered that citizens from Iraq and six other Muslim-majority countries be refused entry to the U.S. for at least ninety days.\n\n“Iraq is on the front line of the war on terrorism,” said the statement. “It is unfair that the Iraqis are treated in this way.” The proposal could now be put to a vote in the Iraqi parliament. Some Iraqi members of parliament (MPs) are in support of a ban on U.S. nationals, while others say they will urge Washington to reconsider.\n\nIf a ban is enacted it could impact thousands of American aid workers, contractors and journalists currently working in Iraq, as well as more than 5,000 U.S, military personnel there to aid Iraqi forces in their effort to oust ISIS from Mosul and the country.\n\nIran Says to Ban U.S. Visitors in Retaliation to Trump Move\n\n“This decision by the U.S. is arbitrary,” said Intisar Al-Jabbouri, a Sunni MP from the Nineveh Governorate in northern Iraq. “The Iraqi government has the right to reciprocate.”\n\nThe U.S. withdrew troops from Iraq in 2011, but since ISIS captured swathes of Iraqi territory in 2014, it has slowly sent advisors, trainers and special forces back to the country. Their guidance — as well as weapons and funding – has been key to the fight against ISIS.\n\nIraqi forces are battling the militants of the so-called Islamic State in the neighborhoods of Mosul, Iraq’s second largest city and the largest urban center still under ISIS control. American military advisors are nearby, helping to direct the fight.\n\n“If Iraq were to ban U.S. citizens from traveling to Iraq it would have devastating consequences for our fight against ISIS, Al-Qaeda and other terrorist organizations,” said Chris Harmer, a senior analyst with the Washington-based Institute for the Study of War. “That’s just in the short term.”\n\nTrump Refugee Order Dashes Hopes of Iraqis Who Helped the U.S.\n\nNevertheless the idea has caught on in certain, influential circles. Moqtada Al-Sadr, a powerful Shi’ite cleric who led a violent insurgency in the aftermath of the 2003 invasion, quickly issued a statement saying Americans should leave. “It would be arrogant for you to enter freely to Iraq and other countries while barring them the entrance to your country,” Sadr said on his website, addressing the U.S. “And therefore you should get your nationals out.”\n\nSadr’s motivations may have more to do with his alignment with Iran, however, than reciprocity for President Trump’s ban on Iraqi nationals. “Those that closely aligned with Iran might think this is a good idea—an opportunity to remove American influence from Iraq once and for all,” said Dr. Renad Mansour, an Academy Fellow for the Middle East and North Africa at Chatham House.\n\nIt’s possible Trump’s order could exacerbate cracks in the already fragile coalition in Iraq, in which groups who receive support from the U.S. fight in concert with those who are backed by Iran. Iranian generals have been spotted on the frontlines in key battles against ISIS, both in Iraq and Syria. Shi’ite militias, many funded by Tehran, are ruthless fighters but have been accused of abuses against civilian populations, fueling sectarian tensions.\n\nDozens Barred From Flying Out of Istanbul Airport after Trump Ban\n\nMansour says Sadr and those with his very powerful movement will try to stoke those tensions further by pressuring the government to ban Americans. The Popular Mobilization Forces, a coalition of mostly Shi’ite militias, also issued a statement on Sunday urging Iraqi Prime Minister Haider al-Abadi to kick out U.S. nationals. “It’s going to be tricky for [Prime Minister] al-Abadi to deal with,” said Mansour.\n\nDespite the strong rhetoric and anti-American sentiment in response to Trump’s decision, lawmaker Jabbouri says it would be difficult for Iraq to approve and implement such a ban given the essential role the U.S. plays in both its military and humanitarian efforts. “There is a strategic need to keep American experts to ensure the sustainability of the coalition fight against ISIS,” she says. However, leaders of some of the parliament’s most powerful blocs have called the for ban on Americans.\n\nBut if the Iraqi people demand even a temporary ban on U.S. personnel, it could provide an opening for Iran to extend its influence on the country. The U.S. scaling-back of operations have already left room for an increasing Iranian presence, Harmer says. “Long term, it would complete the decline of U.S. strategic influence in Iraq and pave the way for Iran to increase their already significant influence over the Iraqi government.” The effect, he says, would be “catastrophic.”\n\nThis article was originally published on TIME.com", "authors": [], "publish_date": "2017-01-29", "source": "cnn", "top_words": ["iran", "isis", "risk", "iraqi", "citizens", "fight", "ban", "nationals", "iraq", "statement", "threatens", "trumps", "influence", "putting"], "summary": "Some Iraqi members of parliament (MPs) are in support of a ban on U.S. nationals, while others say they will urge Washington to reconsider.\nTheir guidance — as well as weapons and funding – has been key to the fight against ISIS.\n“If Iraq were to ban U.S. citizens from traveling to Iraq it would have devastating consequences for our fight against ISIS, Al-Qaeda and other terrorist organizations,” said Chris Harmer, a senior analyst with the Washington-based Institute for the Study of War.\nIranian generals have been spotted on the frontlines in key battles against ISIS, both in Iraq and Syria.\n“There is a strategic need to keep American experts to ensure the sustainability of the coalition fight against ISIS,” she says."}