{"url": "http://tech.fortune.cnn.com/2017/01/31/donald-trump-immigration-ban-responses/", "id": "77", "title": "Donald Trump Immigration Ban: Company Responses", "text": "When President Donald Trump signed an executive order to bar immigrants from seven Muslim-majority countries from entering the U.S., the ban promised to have far-reaching consequences for businesses and employees. After all, several of the country’s largest businesses were were made possible by immigrants—including Apple, Amazon, Google, and Yahoo.\n\nIn the aftermath of the ban, we contacted the majority of the Fortune 100 for comment. Below are the responses to the ban we gathered from some of the country’s largest global employers, in addition to public comments made by the companies. This list will be updated as more companies respond to requests.\n\n21st Century Fox\n\n“21CF is a global company, proudly headquartered in the U.S., founded by—and comprising at all levels of the business – immigrants,” Chairman Lachlan Murdoch and CEO James Murdoch said in an internal memo. “We deeply value diversity and believe immigration is an essential part of America’s strength.”\n\nThe Murdoch brothers added that the company would continue to monitor developments in what they call a “fluid situation.”\n\nCoca-Cola\n\n“Coca-Cola is resolute in its commitment to diversity, fairness and inclusion, and we do not support this travel ban or any policy that is contrary to our core values and beliefs,” CEO Muhtar Kent said in a statement to Bloomberg. “As a U.S. company that has operations in more than 200 countries and territories, we respect people from all backgrounds.”\n\nAmazon\n\nThe company is offering its “full support” to those affected by the ban, CEO Jeff Bezos wrote in an employee email Monday.\n\n“We are a nation of immigrants whose diverse backgrounds, ideas and points of view have helped us build and invent as a nation for over 240 years.”\n\nGoogle\n\nThe company plans to raise $4 million that will be donated to the American Civil Liberties Union, the Immigrant Legal Resource Center, the International Rescue Committee and the United Nation’s refugee agency (UNHCR) in response to Trump’s order. CEO Sundar Pichai also posted a tweet on Saturday in response to the immigration ban, and both Pichai and co-founder Sergey Brin protested the decision alongside fellow staff on Monday.\n\nBank of America\n\n“As a global company, we depend upon the diverse sources of talent that our teammates represent,” CEO Brian Moynihan said in a memo to employees, according to a statement obtained by Fortune. “In view of this, we are closely monitoring the recent refugee- and immigration-related executive order in the United States, and subsequent developments.”\n\n“We are connecting with teammates who may be affected, in response to questions. We also are working to ensure we have the most accurate and timely information to best assist potentially impacted teammates. We will share information and provide updates as the situation continues to develop.”\n\nProcter & Gamble\n\n“In short, we do monitor our people traveling on business however we do not anticipate any impact on P&G employees who are currently traveling,” the company said in a statement to Fortune.\n\nApple\n\nIn an email to the company, CEO Tim Cook reminded employees co-founder Steve Jobs was the son of a Syrian immigrant — meaning the iPhone maker would not exist without immigration.\n\n“I’ve heard from many of you who are deeply concerned about the executive order issued yesterday restricting immigration from seven Muslim-majority countries,” Cook wrote. “I share your concerns. It is not a policy we support.”\n\nFord\n\n“Respect for all people is a core value of Ford Motor Company, and we are proud of the rich diversity of our company here at home and around the world. That is why we do not support this policy or any other that goes against our values as a company. We are not aware, to date, of any Ford employees directly affected by this policy. We will continue working to ensure the well-being of our employees by promoting the values of respect and inclusion in the workplace,” Executive Chairman Bill Ford and President & CEO Mark Fields told Fortune in a statement.\n\nJ.P. Morgan\n\n“In light of recent executive orders in the United States regarding immigration policy, we want every one of you to know of our unwavering commitment to the dedicated people working here at JPMorgan Chase,” the memo from the bank’s operating committee reads.\n\nJ.P. Morgan CEO Jamie Dimon is a member of the committee.\n\nMicrosoft\n\nIn a post on LinkedIn, CEO Satya Nadella wrote: “As an immigrant and as a CEO, I’ve both experienced and seen the positive impact that immigration has on our company, for the country, and for the world.”\n\nIBM\n\nDiane Gherson, IBM senior vice president of human resources, said the company’s “first priority has been to identify and engage IBMers who may be affected, in order to provide any assistance they need,” according to a memo IBM sent to Fortune. So far Gherson said three of IBM’s employees are “directly affected by the executive order, and none have concerns at this time.”\n\nWells Fargo\n\nThe company is “reviewing the order and its implications to staff,” according to a report.\n\nCitigroup\n\nCEO Mike Corbat is concerned about “the message the executive order sends” as well as the impact immigration policies might have “on our ability to serve our clients and contribute to growth,” he told employees in a statement Monday, according to a report.\n\nCisco\n\n“Our first priority is always the safety and well-being of our employees. We are assessing the potential impact of this executive order to any of our employees and their extended families, and offering these employees legal advice and assistance,” the company told Fortune. “In a global world driven by technology, a diverse and mobile workforce is critical to the growth of businesses and our national economy. Cisco values a diverse and inclusive environment and believes in an effective high-skilled immigration system.”\n\nFedEx\n\n“FedEx, like all global companies, is monitoring this situation closely, and we are actively working to seek clarification as quickly as possible,” the company told Fortune.\n\nMerck\n\n“We are committed to our employees of all nationalities and religions,” the company told Fortune. We are actively reaching out to employees who may be affected by the Executive Order to provide legal advice and other assistance.”\n\nGoldman Sachs\n\n“For us to be successful, our men and women must reflect the diversity of the communities and cultures in which we operate. That means we must attract, retain and motivate people from many backgrounds and perspectives. Being diverse is not optional; it is what we must be. Now is a fitting time to reflect on those words and the principles that underlie them,” CEO Lloyd Blankfein told employees. You can read his full statement here.\n\nMorgan Stanley\n\n“We are closely monitoring developments around the new U.S. travel restrictions imposed this weekend. While no individual employees were impacted in their travel to date, we are concerned for those individuals and their families who could be impacted and will provide them support as needed,” CEO James Gorman wrote in a memo to employees. “We value immensely the contribution of all our employees from all over the world. Continuing to draw on talent from across the globe is a key element of Morgan Stanley’s culture and ultimately to our success in serving our clients.”\n\nAmerican Express\n\n“Our top priority is ensuring the safety and well-being of our employees. A note to all (worldwide) employees was sent on Sunday 1/29 regarding the executive order on immigration. We will work to assist all employees and contractors who may be directly impacted by the order, both those who may be traveling, as well as those currently in the United States from one of the restricted countries with Green Cards or visas,” the company told Fortune. “We are monitoring this situation closely and will continue to provide information and assistance to employees as this situation develops.”\n\nNike\n\nCEO Mark Parker said the company did not support the executive order.\n\n“Nike believes in a world where everyone celebrates the power of diversity,” he said in a statement. “Those values are being threatened by the recent executive order in the U.S. banning refugees, as well as visitors, from seven Muslim-majority countries.”\n\nGeneral Motors\n\n“At General Motors, we value and respect individual differences,” SVP of global human resources John Quattrone told employees. “We appreciate what each individual brings to the team, including background, education, gender, race, ethnicity, working and thinking styles, sexual orientation, gender identity, veteran status, religious background, age, generation, disability, cultural expertise and technical skill. Empowering these unique perspectives keeps GM on the cutting edge of technological innovation in the fast-paced automotive industry.”\n\nGeneral Electric\n\n“I share your concern,” CEO Jeff Immelt wrote in a post for employees. “There would be no G.E. without people of all religions, nationalities, gender, sexual orientation and race.”\n\nHewlett Packard Enterprise\n\n“I want you all to rest assured that HPE will continue to support its diverse and global family of employees through these challenging times,” CEO Meg Whitman wrote in an email to employees on Monday. “We are in this together. We will also continue to advocate for immigration policies that recognize America’s core principles and the contributions immigrants make to our collective strength and prosperity. Even while securing its borders, America must not turn its back on the ideals that have motivated generations and inspired the world.”\n\nBoeing, Oracle, Marathon Petroleum, ADM, Mondelēz International, and United Technologies have all declined to comment.", "authors": ["Tory Newmyer", "David Morris", "Madeline Farber", "Lucinda Shen"], "publish_date": "2017-01-31", "source": "cnn", "top_words": ["executive", "wrote", "trump", "ban", "global", "immigration", "employees", "told", "fortune", "company", "donald", "ceo", "order", "responses"], "summary": "When President Donald Trump signed an executive order to bar immigrants from seven Muslim-majority countries from entering the U.S., the ban promised to have far-reaching consequences for businesses and employees.\n“I’ve heard from many of you who are deeply concerned about the executive order issued yesterday restricting immigration from seven Muslim-majority countries,” Cook wrote.\nMerck“We are committed to our employees of all nationalities and religions,” the company told Fortune.\nNow is a fitting time to reflect on those words and the principles that underlie them,” CEO Lloyd Blankfein told employees.\nA note to all (worldwide) employees was sent on Sunday 1/29 regarding the executive order on immigration."}