{"url": "http://tech.fortune.cnn.com/2017/01/30/mark-cuban-blasts-trump-on-muslim-travel-ban/", "id": "71", "title": "Mark Cuban Blasts Donald Trump On Muslim Travel Ban", "text": "Mark Cuban, the billionaire owner of the Dallas Mavericks, continued to push back against President Donald Trump over the weekend on Twitter, this time criticizing Trump’s immigration ban on citizens from seven majority-Muslim nations.\n\nTrump signed his executive order for the ban on Friday, which sparked protests at airports in New York, Boston, Los Angeles, and other cities. Four federal judges in New York, Massachusetts, Virginia, and Washington state, subsequently issued stays on a ban that Cuban characterized, in a series of tweets over the weekend, as “not vetted or thought through.”\n\nCuban, like Trump himself, is a reality TV personality—having appeared on ABC’s Shark Tank for the last few years. And, like Trump, he is a Twitter (twtr) aficionado. Cuban is a self-made billionaire who sold startup Broadcast.com to Yahoo (yhoo) in 1999 for $5.7 billion. And he has never been shy about sharing his opinions—whether the topic is NBA officiating or telecommunications policy, or politics.\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\nSome tech leaders were also unsettled by Trump’s orders, which suspended the country’s refugee program and temporarily banned visas for citizens of Iraq, Syria, Iran, Sudan, Libya, Somalia, and Yemen. Critics have pointed out the conspicuous absence of Saudi Arabia, and other predominantly Muslim countries that have been tied to the Sept. 11 attacks on the U.S. but that also have strong business ties with this country.\n\nOn Saturday, Google chief executive Sunder Pichai, for example, told Google (goog) employees traveling abroad who would be affected by the executive orders to return to the U.S. as soon as possible.\n\nGet Data Sheet, Fortune’s technology newsletter.\n\nBusiness Insider has more about the latest tweetstorm, which came a day after Cuban criticized Trump’s policy on Mexico, saying the president’s plan to impose a 20% tariff on Mexican imports would lead to a trade war.\n\nFor more on reaction to Trump’s travel ban, watch:\n\nCuban endorsed Democrat Hillary Clinton in her bid for the White House last July but had previously toyed with the idea of backing Trump, as noted in this Fortune timeline.", "authors": ["Barb Darrow"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["executive", "travel", "trump", "weekend", "ban", "orders", "cuban", "twitter", "donald", "mark", "trumps", "blasts", "muslim", "york", "policy"], "summary": "Mark Cuban, the billionaire owner of the Dallas Mavericks, continued to push back against President Donald Trump over the weekend on Twitter, this time criticizing Trump’s immigration ban on citizens from seven majority-Muslim nations.\nTrump signed his executive order for the ban on Friday, which sparked protests at airports in New York, Boston, Los Angeles, and other cities.\nCuban is a self-made billionaire who sold startup Broadcast.com to Yahoo (yhoo) in 1999 for $5.7 billion.\nOn Saturday, Google chief executive Sunder Pichai, for example, told Google (goog) employees traveling abroad who would be affected by the executive orders to return to the U.S. as soon as possible.\nBusiness Insider has more about the latest tweetstorm, which came a day after Cuban criticized Trump’s policy on Mexico, saying the president’s plan to impose a 20% tariff on Mexican imports would lead to a trade war."}