{"url": "http://tech.fortune.cnn.com/2017/01/30/trump-muslim-ban-harvard/", "id": "76", "title": "Donald Trump Muslim Ban: Read Harvard University's Response", "text": "Dear Members of the Harvard Community,\n\nLast Friday’s executive order imposing restrictions on travel to the United States has provoked uncertainty and escalating anxiety among many people in our own University and others. Although the situation remains in flux and doubt, I write to share information about resources available to students and faculty and to underscore that our international students and scholars are essential to our identity and excellence. We are all Harvard.\n\nIn times of unsettling change, we look toward our deepest values and ideals. Among them is the recognition that drawing people together from across the nation and around the world is a paramount source of our University’s strength. Thousands of students and scholars and visitors come to Harvard each year from all over the globe—to study, to teach, to propel our research enterprise, to join in conferences and colloquia, to share insights and abilities that transcend nationality. Thousands more leave Harvard each year to travel abroad, learning from experiences they could not replicate here, gaining insight into cultures and perspectives different from their own, visiting colleagues and family and friends, forming and sustaining the human bonds essential to mutual understanding.\n\nOur robust commitment to internationalism is not an incidental or dispensable accessory. It is integral to all we do, in the laboratory, in the classroom, in the conference hall, in the world. It fuels the capacity of universities to spur innovation, to advance scholarship and scientific discovery, and to help address society’s hardest challenges. It is a crucial ingredient in making American higher education a singular national asset, the destination of choice for countless scholars and students whose contributions serve our nation and our world. Especially at a time of sharp divisions at home and abroad, we must do all we can to sustain the ability of U.S. universities to bring people from around the world to our campuses and to enable people from our campuses to engage the world. Nearly half of the deans of Harvard’s schools are immigrants—from India, China, Northern Ireland, Jamaica, and Iran. Benefiting from the talents and energy, the knowledge and ideas of people from nations around the globe is not just a vital interest of the University; it long has been, and it fully remains, a vital interest of our nation.\n\nAs I write, we are still working to understand the concrete implications of the new travel restrictions, and we are following related developments in the courts. But the disruption and disorientation flowing from these restrictions are palpable and distressing. While questions may at this point be far more apparent than answers, the restrictions are already posing barriers to scholars and students seeking to enter the country and are inhibiting others from pursuing important travel abroad, fearful about their ability to return. Amid this widespread doubt and unease, we will continue to insist that policymakers take full account of how fundamentally our universities depend on the ability of people to travel across borders without undue constraint. National security is, of course, an essential element of our nation’s immigration policy. But we are confident those considerations can be fairly addressed while avoiding the large-scale disruption and distress that the new restrictions portend—and while honoring the ideals of openness, nondiscrimination, and opportunity that our universities and our nation hold dear. We urge the administration, the Congress, and the courts to address these concerns without delay.\n\nMeanwhile, we are taking immediate steps to better inform and assist the members of our community in the face of the new restraints on travel. The Harvard International Office (HIO) has written to Harvard’s international students, faculty, and staff offering immediate advice in light of the executive order. The HIO is available as a resource to all community members with questions or concerns. The University’s Global Support Services has likewise offered guidance and stands ready to assist community members who are already abroad and may experience difficulties in seeking to return. This Wednesday at 4:00 p.m., the University will hold a town hall in Science Center B, where representatives of the HIO, the Office of the Vice Provost for International Affairs, and Harvard Law School’s Immigration and Refugee Clinic will offer information and perspectives on the present situation and take questions from all interested members of the Harvard community. Our federal relations staff are aggressively pursuing these issues with contacts in Washington and locally, and have been in touch directly with the Massachusetts congressional delegation, state leaders, and city officials in Boston and Cambridge to convey our grave concern. HIO staff are working assiduously to develop travel guidance with whatever clarity can be achieved given the circumstances. This weekend, the Association of American Universities, of which Harvard is a member, issued a statement expressing deep concern about the new executive order. I intend to keep working vigorously with my counterparts in other universities—both to share information and to advocate approaches meant to sustain the international flow of students and scholars, and thereby safeguard a vital national interest.\n\nOur undocumented students are also experiencing the present moment with anxiety, even fear, in view of reports that federal policy toward them may change. Having strongly advocated for the DREAM Act, I have joined other college and university presidents in urging that the federal government preserve DACA—the program prescribing Deferred Action for Childhood Arrivals—and that Congress incorporate its protections into the proposed legislation known as the BRIDGE Act. With others in the higher education community, we will continue to press this case, hopeful that the rumored changes will not come to pass. At the same time, we are strengthening our efforts to aid students potentially affected by such changes. I detailed our expanding efforts in a letter to the community on November 28.\n\nSince then, with support from my office, Harvard Law School’s Immigration and Refugee Clinic has amplified its capacity in this area by engaging a new, full-time staff attorney specially focused on representing and advising undocumented students in the Harvard community. We have launched and are further developing a website pointing toward resources of particular interest to undocumented students and their friends and colleagues. We have initiated several in-person information sessions and webinars, as well as training sessions to inform key staff about the concerns facing undocumented students and about how they can help. This work will continue, and we will calibrate our next steps as circumstances evolve.\n\nLet me also take this opportunity to note the anxieties and concerns prevalent among members of our community who are also members of the Islamic faith. Ours is a nation founded and built on the bedrock of religious pluralism and religious freedom. Our University embraces that commitment, in the spirit not of mere tolerance but of genuine inclusion. We must not and will not conflate people of a venerable faith with people predisposed to acts of terrorism and violence. And, recognizing the special concerns of the Muslims among us at this moment in our national life, I believe we must pursue more tangible ways to support their distinctive needs. With this in mind, at the recommendation of the Pusey Minister in the Memorial Church, I have initiated a search for Harvard’s first Muslim chaplain, who will serve full-time to provide guidance and support to members of the Islamic faith and to join colleagues in promoting a wider sense of community and understanding among members of different spiritual traditions at Harvard. I hope that this new appointment will bring a welcome measure of further institutional support for valued members of our University who have particular reason to feel a sense of vulnerability at this time.\n\nI have focused this letter on just a few of the issues and challenges brought to the fore by Friday’s executive order and related developments. As we address those matters, we have a close eye on other potential changes in the policy landscape affecting universities, and we must work energetically to advance a far wider range of vital interests—in the progress of university-based science and in the vitality of the humanities and the arts, in the expansion of educational opportunity and in the effort to redress inequality, in seeking ways for people with starkly different views to speak and to listen across widening divides, and in striving for a shared commitment to the pursuit of truth. These and other present concerns are anything but endnotes; they lie at the core of our University.\n\nIn these times of change, I hope and trust that all of us committed to the strength of American higher education can pursue these efforts together. Let us do so—to borrow the words of the poet Seamus Heaney, one of Harvard’s most beloved visitors from other shores—with our gates unbarred.\n\nSincerely,\n\nDrew Faust", "authors": ["Jen Wieczner"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["travel", "world", "trump", "ban", "university", "read", "harvard", "community", "members", "support", "donald", "universities", "response", "universitys", "muslim", "students", "concerns"], "summary": "It is integral to all we do, in the laboratory, in the classroom, in the conference hall, in the world.\nThe Harvard International Office (HIO) has written to Harvard’s international students, faculty, and staff offering immediate advice in light of the executive order.\nThe HIO is available as a resource to all community members with questions or concerns.\nThe University’s Global Support Services has likewise offered guidance and stands ready to assist community members who are already abroad and may experience difficulties in seeking to return.\nThis weekend, the Association of American Universities, of which Harvard is a member, issued a statement expressing deep concern about the new executive order."}