{"url": "http://tech.fortune.cnn.com/2017/01/30/donald-trump-muslim-ban-tech-companies/", "id": "70", "title": "Donald Trump Muslim Ban: 5 Tech Giants Lose $32 Billion In Value", "text": "Investors suspected Silicon Valley wouldn’t have it easy under President Donald Trump’s protectionist trade and immigration policies.\n\nTrump deepened those fears Friday when he signed an executive order barring citizens of several Muslim-majority countries from entering the U.S. The move sent the market cap of the five biggest tech companies on the S&P 500 down by $32 billion Monday, as investors worried Trump’s anti-immigration policies may cut into the workforces of tech companies.\n\nShares of Apple, Alphabet, Microsoft, Amazon, and Facebook (fb) together fell roughly 1% for a total market cap of $2.4 trillion on Monday. Alphabet alone shed $13.8 billion in market cap.\n\nTech companies quickly condemned Trump’s executive order over the weekend. Google CEO Sundar Pichai called the order “painful” in a company memo that noted over 100 of his employees were affected by the order. Facebook CEO Mark Zuckerberg wrote on his social media site that, “we should also keep our doors open to refugees and those who need help.” Microsoft on the other hand called the order “misguided.”\n\nBut tech companies might have to brace for further headwinds from the White House: On Monday, Bloomberg obtained a draft of an executive order from the Trump administration that could discourage U.S.-based companies from hiring foreign workers by directly targeting the work-visa programs tech giants frequently use.\n\nAn exchange-traded fund tracking the technology sector, the Technology Select Sector SPDR fund fell nearly 1% in trading Monday. That was roughly in line with the broader stock market, with the S&P 500 falling 0.9%.\n\nShares of Apple have fallen 0.67%; Alphabet 2.6%; Amazon 1%; Facebook 1.4%; and Microsoft 1.3%.\n\nCorrection, Jan. 30, 2017: The original headline of this story misstated the loss incurred by the companies. They lost billions in value, not revenue.", "authors": ["Lucinda Shen"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["executive", "companies", "facebook", "trump", "technology", "ban", "tech", "lose", "market", "donald", "value", "trumps", "microsoft", "billion", "32", "order", "muslim", "giants", "alphabet"], "summary": "Trump deepened those fears Friday when he signed an executive order barring citizens of several Muslim-majority countries from entering the U.S.\nThe move sent the market cap of the five biggest tech companies on the S&P 500 down by $32 billion Monday, as investors worried Trump’s anti-immigration policies may cut into the workforces of tech companies.\nShares of Apple, Alphabet, Microsoft, Amazon, and Facebook (fb) together fell roughly 1% for a total market cap of $2.4 trillion on Monday.\nTech companies quickly condemned Trump’s executive order over the weekend.\nAn exchange-traded fund tracking the technology sector, the Technology Select Sector SPDR fund fell nearly 1% in trading Monday."}