{"url": "http://tech.fortune.cnn.com/2017/01/30/mark-cuban-elon-musk-trump-immigration/", "id": "72", "title": "Trump Immigration Ban: Mark Cuban, Elon Musk, Mark Zuckerberg React", "text": "Silicon Valley executives rolled into action over the weekend, voicing their disapproval of President Trump’s executive order to ban immigration from seven Middle Eastern countries for 90 days. The order also indefinitely suspended travel by new refugees from war-torn Syria.\n\nThe executives who took to Twitter helm some of the most economically powerful companies in the world; after all, the immigration ban strikes at the heart of what makes Silicon Valley such a powerful force. More than half of tech companies valued at over $1 billion have at least one immigrant founder, and some 40% of Fortune 500 companies were founded by immigrants, or the descendants of immigrants, according to the Kauffman Foundation. Tech companies also rely on the work of those on H-1B visas, and restrictions on their ability to travel will cause havoc for many companies.\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\nHere’s a sampling of reactions from Twitter, which unfolded as tens of thousands of protesters took to the streets in cities around the country, or swarmed airports where security officials had detained travelers from the banned countries.\n\nBox co-founder and chief executive Aaron Levie said the ban was un-American:\n\nOn every level -moral, humanitarian, economic, logical, etc.- this ban is wrong and is completely antithetical to the principles of America. — Aaron Levie (@levie) January 28, 2017\n\nSalesforce CEO Marc Benioff cited the New Testament:\n\nWhen we close our hearts & stop loving other people as ourselves (MK 12:31) we forget who we truly are—a light unto the nations. #noban — Marc Benioff (@Benioff) January 28, 2017\n\nReddit co-founder Alexis Ohanian pointed to his own immigrant roots:\n\nTim Cook, was somewhat oblique on Twitter, although he sent a more detailed memo to employees, saying Apple would not exist without immigration:\n\nDeeply moved today visiting @FordsTheatreNPS and Peterson House where Abraham Lincoln took his last breath. His words are timeless. pic.twitter.com/z6mMAvOdzK — Tim Cook (@tim_cook) January 28, 2017\n\nMicrosoft CEO Satya Nadella linked to an internal post from Microsoft’s president and chief legal officer Brad Smith that offered advice to employees. In a post on LinkedIn, Nadella added: “As an immigrant and as a CEO, I’ve both experienced and seen the positive impact that immigration has on our company, for the country, and for the world.”\n\nOur thoughts on yesterday's U.S. Executive Order on Immigration https://t.co/XaVk2z1sQj on @LinkedIn — Satya Nadella (@satyanadella) January 28, 2017\n\nGoogle CEO Sundar Pichai referenced a story in the Wall Street Journal about a Google employee, nine months pregnant, whose Iranian parents may not be able to travel to the U.S. to see their new grandchild.\n\nFor generations, this country has been home to immigrants like Sanaz. Her story is playing out all over the country. Google is with you. https://t.co/mllnZ5gNDB — Sundar Pichai (@sundarpichai) January 29, 2017\n\nTwitter founder and CEO Jack Dorsey retweeted Harry Potter author J.K. Rowling, also citing scripture. His post also contains an archived tweet from Vice President Mike Pence, from when he was governor of Indiana:\n\n'For what will it profit a man if he gains the whole world and forfeits his soul?'\n\nMatthew 16:26 https://t.co/cYFglX3yRW — J.K. Rowling (@jk_rowling) January 29, 2017\n\nReid Hoffman, co-founder of Linkedin, posted the Linkedin page of Hadi Partovi, a refugee from Iran who founded Code.org, which teaches coding to minorities and women.\n\nThis is the true story of America, our heart and soul. https://t.co/bGqZ7equ2E — Reid Hoffman (@reidhoffman) January 29, 2017\n\nTech investor Fred Wilson promised to match $20,000 in funding for the American Civil Liberties Union. By Sunday, Wilson said he he had surpassed his goal, and would be contributing at least $50,000 to the civil rights organization.\n\nA $20,000 Match Offer On ACLU Donations Today. Tweet your ACLU receipts to @bfeld @abatchelor @thegothamgal or me https://t.co/fTmFdC0njR — Fred Wilson (@fredwilson) January 29, 2017\n\nStripe co-founder Patrick Collison picked up the torch from Wilson and pushed donations to $70,000.\n\nWe did it! We're about to hit $70k. Both @natfriedman and I will match with the full amount — $50k each. — Patrick Collison (@patrickc) January 29, 2017\n\nPaypal co-founder Max Levchin, spoke about coming from Russia with his family in the 1990s to escape persecution for being Jewish:\n\nMy family & I, & 1000s of Soviet Jews like us came to US as refugees in '91 running from regime that persecuted us because of who we were. — Max Levchin (@mlevchin) January 29, 2017\n\nUber CEO Travis Kalanick, sits on Trump’s business advisory council. Uber was caught up in a social media storm when customers learned Uber did away with surge pricing, just as New York taxi cab drivers went on strike outside of JFK airport. Kalanick had this to say:\n\n1/The travel ban is against everything @Uber stands for. 1000’s of drivers affected – https://t.co/1YXQ5XRnGU — travis kalanick (@travisk) January 29, 2017\n\n2/ Any driver who can't work because of the ban will be compensated for lost earnings. We have set up $3mm legal defense fund as well. — travis kalanick (@travisk) January 29, 2017\n\n3/ I'm going to use my position on Pres economic council to stand up for what's right – https://t.co/L6U9LOv3IX — travis kalanick (@travisk) January 29, 2017\n\nLogan Green, co-founder and CEO of Lyft, Uber’s biggest competitor, said the company would donate $1 million to the ACLU over the next four years.\n\n1/ Lyft has worked hard to create an inclusive, diverse and conscientious community where all our drivers and passengers feel welcome. — logangreen (@logangreen) January 29, 2017\n\n2/ Trump’s immigration ban is antithetical to both Lyft's and our nation's core values. — logangreen (@logangreen) January 29, 2017\n\n3/ We are donating $1,000,000 over the next four years to the ACLU to defend our constitution. https://t.co/0umGOlkhSx — logangreen (@logangreen) January 29, 2017\n\nElon Musk, SpaceX and Tesla founder and Paypal co-founder, also sits on Trump’s business advisory council. He took to Twitter to ask his 7 million followers what specific amendments to the executive order should be:\n\nPlease read immigration order. Lmk specific amendments. Will seek advisory council consensus & present to President. https://t.co/qLpbsP4lEk — Elon Musk (@elonmusk) January 29, 2017\n\n23andme founder Anne Wojicki, the ex-wife of Google Fonder Sergei Brin, retweeted a post from New York Times columnist Thomas Friedman:\n\nMr. Trump. Steve Job’s biological father’s name was Abdulfattah Jandali. He came to the US as a student. He was from Homs, Syria. — Thomas L. Friedman (@tomfriedman) January 28, 2017\n\nTech investor and Shark Tank star Mark Cuban told Trump to stop watching TV, and reach out to the 109 immigrants who had been detained at airports over the weekend:\n\nFacebook’s Mark Zuckerberg, who doesn’t tweet, said in a long post on Facebook, “Like many of you, I’m concerned about the impact of the recent executive orders signed by President Trump. We need to keep this country safe, but we should do that by focusing on people who actually pose a threat.”\n\nRelated: These Celebrities Spoke Out About Trump’s Immigration Ban at the SAG Awards\n\nAmong the most prominent Silicon Valley executives to offer little to no response are Amazon’s Jeff Bezos, who didn’t make a personal statement. Amazon sent an internal memo to employees, however, advising employees from the banned countries about travel restrictions.", "authors": ["Jeremy Quittner"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["travel", "trump", "elon", "ban", "immigration", "cuban", "29", "logangreen", "zuckerberg", "mark", "ceo", "trumps", "react", "order", "president", "musk", "cofounder"], "summary": "Silicon Valley executives rolled into action over the weekend, voicing their disapproval of President Trump’s executive order to ban immigration from seven Middle Eastern countries for 90 days.\nKalanick had this to say:1/The travel ban is against everything @Uber stands for.\n— logangreen (@logangreen) January 29, 20172/ Trump’s immigration ban is antithetical to both Lyft's and our nation's core values.\n— logangreen (@logangreen) January 29, 20173/ We are donating $1,000,000 over the next four years to the ACLU to defend our constitution.\nHe took to Twitter to ask his 7 million followers what specific amendments to the executive order should be:Please read immigration order."}