{"url": "http://tech.fortune.cnn.com/2017/01/30/trump-immigration-ban-amazon-expedia/", "id": "74", "title": "Amazon and Expedia Join Lawsuit to Stop Trump's Immigration Ban", "text": "Pressure on U.S. President Donald Trump grew on Monday over his order banning travel from seven Muslim-majority nations, as the state of Washington announced a legal challenge and former President Barack Obama took a swipe at his successor.\n\nThe leader of the Democrats in the U.S. Senate, Chuck Schumer, said he would bring legislation on Monday evening seeking to end the ban, although his effort stood little chance of being passed by the Republican-led Congress\n\nBritish Foreign Secretary Boris Johnson joined a chorus of concern expressed by U.S. allies, ranging from Iraq to Germany, at Trump’s executive order to forbid entry into America by refugees and people from some predominantly Muslim countries.\n\nWashington will be the first state to take on the executive order, announcing an effort to sue in federal court.\n\n“It is an insult and a danger to all of the people of the state of Washington, of all faiths,” Governor Jay Inslee, a Democrat, told reporters. He said it was important for the Trump administration to face lawsuits from the state itself, and not just cases filed by people who have been impacted by the order.\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\nWashington state Attorney General Bob Ferguson said the lawsuit would include constitutional claims, including allegations that Trump’s order violates the equal protection clause and the First Amendment. Those arguments are also being used in other lawsuits filed over the weekend on behalf of individuals detained at U.S. airports.\n\nRepublican Trump’s directive on Friday put a 120-day hold on allowing refugees into the country, an indefinite ban on refugees from Syria and a 90-day bar on citizens from Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\n\nThe president argues that his action will protect America from terror attacks but critics complain that it unfairly singles out Muslims, violates U.S. law and the Constitution, and defiles America’s historic reputation as a welcoming place for immigrants.\n\nTechnology companies Amazon.com and Expedia, both of which are based in Washington state’s Seattle area, will support the state’s suit, Ferguson said.\n\nAnother Washington state company, Microsoft, said it has been cooperating with the attorney general’s office to provide information about the order’s impact “in order to be supportive.”\n\n“To our employees in the U.S. and around the world who may be directly affected by this order, I want you to know that the full extent of Amazon’s resources are behind you,” Amazon.com CEO Jeff Bezos said in a note to employees.\n\nChaos broke out over the weekend as border and customs officials struggled to put the order into practice amid loud protests at major U.S. airports. Federal judges blocked deportation of those detained under the order.\n\nSeveral other state attorneys general, including those from California and New York, have said they are considering whether to take their own legal action. The Council on American-Islamic Relations, the country’s biggest Muslim advocacy group, filed a federal lawsuit on behalf of more than 20 people.\n\nU.S. stocks suffered their biggest drop of 2017 as investors took the curb on immigration as a reminder that not all the new president’s policies would be market-friendly.\n\nOBAMA CRITICISM\n\nWhite House spokesman Sean Spicer said Trump’s move was popular with Americans.\n\n“The majority of Americans agree with the president. They recognize that the steps that he’s taken were to keep the country safe,” Spicer said, citing unnamed polls.\n\nReferring to protests, Trump’s predecessor Obama said through a spokesman that he is heartened by the political activism he sees across the country and disagrees with discrimination against people based on their religion.\n\nKevin Lewis, a spokesman for Obama, said the Democrat who left office 10 days ago “fundamentally disagrees with the notion of discriminating against individuals because of their faith or religion.” He did not mention Trump by name. It is rare for former presidents to criticize their successor’s policies so soon after leaving the White House.\n\nOn Twitter, Trump appeared to blame the airport confusion on protesters as well as on Schumer, who teared up over the weekend while discussing the ban, and even a computer system failure at Delta Air Lines late on Sunday.\n\n“Only 109 people out of 325,000 were detained and held for questioning. Big problems at airports were caused by Delta computer outage … protesters and the tears of Senator Schumer. Secretary Kelly said that all is going well with very few problems. MAKE AMERICA SAFE AGAIN!” he tweeted.\n\nGet Data Sheet, Fortune’s technology newsletter.\n\nSchumer, a New York Democrat, urged repealing the order.\n\n“We should repeal this, and then we should sit down in a careful, thoughtful way to figure out ways we need to tighten up things against terrorism,” he told NBC News, noting that some Republican lawmakers also had spoken out against Trump’s action.\n\nBut even if the Republican leadership in the Senate allowed a vote on Monday to repeal the order as Schumer wants, the Democrats would need all of their members plus at least three Republicans to back him for the measure to pass.\n\nAnd a proposed repeal of the ban would face even stronger resistance in the House if it passed the Senate.\n\nALLIES WORRIED\n\nTrump rejected criticism that the order amounted to a Muslim ban, saying more than 40 Muslim-majority countries were not affected.\n\nBut abroad, concern mounted.\n\n“This is, of course, a highly controversial policy, which has caused unease and, I repeat, this is not an approach that this government would take,” Britain’s Johnson told parliament.\n\nBritain, which is trying to maintain its so-called special relationship with the United States, is potentially one of Trump’s strongest allies abroad. Prime Minister Theresa May last week became the first foreign leader to visit him as president.\n\nTens of thousands of protesters gathered in London and other British cities on Monday to demonstrate against the ban. People, some holding placards reading “No to Racism, No to Trump” and “Dump Trump,” staged a protest outside May’s Downing Street residence.\n\nThe Iraqi parliament voted to ask the government to retaliate against the United States, putting at risk cooperation in the fight against Islamic State.\n\nA government official in Baghdad said Foreign Minister Ibrahim al-Jaafari plans to meet the U.S. ambassador on Monday or Tuesday to express dismay at Trump’s decision.\n\nU.S. State Department officials circulated a draft memo dissenting from Trump’s executive order and separately, U.S. officials said the department received multiple cables from U.S. embassies over the weekend reporting foreign dissatisfaction at the order.", "authors": [], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["trump", "weekend", "ban", "join", "immigration", "state", "stop", "states", "trumps", "expedia", "amazon", "lawsuit", "order", "president", "washington", "schumer"], "summary": "Washington will be the first state to take on the executive order, announcing an effort to sue in federal court.\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 AdvertisementWashington state Attorney General Bob Ferguson said the lawsuit would include constitutional claims, including allegations that Trump’s order violates the equal protection clause and the First Amendment.\nTechnology companies Amazon.com and Expedia, both of which are based in Washington state’s Seattle area, will support the state’s suit, Ferguson said.\nTens of thousands of protesters gathered in London and other British cities on Monday to demonstrate against the ban.\nPeople, some holding placards reading “No to Racism, No to Trump” and “Dump Trump,” staged a protest outside May’s Downing Street residence."}