{"url": "http://tech.fortune.cnn.com/2017/02/05/iraq-trump-travel-ban-block/", "id": "89", "title": "Iraq Says Ruling Against Trump Travel Ban is Move in Right Direction", "text": "Iraq is satisfied with a U.S. appeals court ruling against a travel ban imposed by U.S. President Donald Trump, a government spokesman said on Sunday.\n\nThe ruling given late on Saturday denied a request from the U.S. Department of Justice to immediately restore Trump’s order, which a judge in Washington state had blocked on Friday.\n\n“It is a move in the right direction to solve the problems that it caused,” the Iraqi spokesman, Saad al-Hadithi, told Reuters.\n\nTrump’s executive order last week put a 120-day halt on the U.S. refugee program, barred Syrian refugees indefinitely and imposed a 90-day suspension on people from seven majority Muslim countries – Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen.\n\nReligious minorities persecuted by the Islamic State group, and other Iraqis fleeing violence, were among those affected.\n\nTrump Refugee Order Dashes Hopes of Iraqis Who Helped the U.S\n\nThe ban would have prevented a total of 20,000 people in “precarious circumstances” in the seven countries targeted from resettling in the U.S. during the 120 days covered by the suspension, according to the United Nations.\n\nBaghdad protested against the ban, calling it unfair and saying that no Iraqi had been involved in attacks on U.S. soil.\n\nBut it refrained from retaliating as it seeks to maintain U.S. support for Iraqi forces battling Islamic State in Mosul.\n\nThe U.S. has more than 5,000 troops deployed in Iraq, providing critical air and ground support for Iraqi and Kurdish forces fighting the militants, who declared a self-styled caliphate over parts of Syria and Iraq in 2014.", "authors": [], "publish_date": "2017-02-05", "source": "cnn", "top_words": ["ruling", "seven", "travel", "iraqi", "spokesman", "right", "trump", "ban", "state", "suspension", "iraq", "direction", "support", "syria", "order"], "summary": "Iraq is satisfied with a U.S. appeals court ruling against a travel ban imposed by U.S. President Donald Trump, a government spokesman said on Sunday.\n“It is a move in the right direction to solve the problems that it caused,” the Iraqi spokesman, Saad al-Hadithi, told Reuters.\nBaghdad protested against the ban, calling it unfair and saying that no Iraqi had been involved in attacks on U.S. soil.\nBut it refrained from retaliating as it seeks to maintain U.S. support for Iraqi forces battling Islamic State in Mosul.\nThe U.S. has more than 5,000 troops deployed in Iraq, providing critical air and ground support for Iraqi and Kurdish forces fighting the militants, who declared a self-styled caliphate over parts of Syria and Iraq in 2014."}