{"url": "http://tech.fortune.cnn.com/2017/02/02/microsoft-trump-muslim-ban/", "id": "82", "title": "Microsoft Wants Trump to Establish an Exception Program on the Immigration Ban", "text": "Microsoft on Thursday said it had sent a proposal to U.S. President Donald Trump’s administration to create a program to let people from seven predominantly Muslim nations enter and leave the United States on business or family emergency travel if they hold a valid work or student visa and have not committed any crimes.\n\nIn a letter to Secretary of Homeland Security John Kelly and Secretary of State Rex Tillerson, Microsoft President Brad Smith outlined a program for case-by-case review of exceptions to a travel ban instituted last week for “Responsible Known Travelers with Pressing Needs.”\n\nThe proposal argues that the secretaries have the power to grant exceptions to the travel ban under the order issued last week by President Trump.\n\nGet Data Sheet, Fortune’s technology newsletter\n\nTechnology companies including Microsoft (msft), Google owner Alphabet (googl), Apple (aapl), and Amazon.com have been vocal in their opposition to Trump’s order, arguing that they rely on workers from around the world to create their products and services.\n\nAmazon (amzn) and Expedia (expe) filed declarations of support on Monday in a legal challenge by the Washington state Attorney General to the order. Microsoft said on Thursday that 76 of its employees and 41 dependents were affected by the travel ban.\n\nMicrosoft’s proposal would cover holders of the H-1B visa, a temporary work visa that the tech sector relies on to recruit foreign talent. Secretary Kelly issued an order on Sunday saying that green card holders would be allowed to travel under the executive orders, but H-1B holders from the seven affected countries are still banned.", "authors": [], "publish_date": "2017-02-02", "source": "cnn", "top_words": ["travel", "wants", "trump", "ban", "immigration", "proposal", "visa", "exception", "establish", "holders", "week", "secretary", "work", "microsoft", "order", "president", "program"], "summary": "In a letter to Secretary of Homeland Security John Kelly and Secretary of State Rex Tillerson, Microsoft President Brad Smith outlined a program for case-by-case review of exceptions to a travel ban instituted last week for “Responsible Known Travelers with Pressing Needs.”The proposal argues that the secretaries have the power to grant exceptions to the travel ban under the order issued last week by President Trump.\nAmazon (amzn) and Expedia (expe) filed declarations of support on Monday in a legal challenge by the Washington state Attorney General to the order.\nMicrosoft said on Thursday that 76 of its employees and 41 dependents were affected by the travel ban.\nMicrosoft’s proposal would cover holders of the H-1B visa, a temporary work visa that the tech sector relies on to recruit foreign talent.\nSecretary Kelly issued an order on Sunday saying that green card holders would be allowed to travel under the executive orders, but H-1B holders from the seven affected countries are still banned."}