{"url": "http://tech.fortune.cnn.com/2017/02/04/trump-travel-ban-visa-holders/", "id": "87", "title": "Visa Holders Hurry to Board Flights to U.S. Amid Reprieve", "text": "Visa holders from seven majority-Muslim countries affected by President Donald Trump’s travel ban hurried to board U.S.-bound flights Saturday, fearing they might have only a slim window through which to enter the country after a federal judge temporarily blocked the ban.\n\nThose who could travel immediately were being urged to do so because of uncertainty over whether the Justice Department would be granted an emergency freeze of the order issued Friday by U.S. District Judge James Robart in Seattle. The government on Saturday suspended enforcement of the week-old ban as it scurried to appeal Robart’s order, although an immigration lawyer said passengers in at least one African airport were told they couldn’t get on the planes.\n\nRula Aoun, director of the Arab American Civil Rights League in Dearborn, Michigan, told The Detroit News that her group is advising people to hurry.\n\n“We’re … instructing people who can travel immediately to the United States to basically go ahead and do that before anything further happens,” Aoun said, adding that one family intends to fly back from Egypt on Sunday. Another woman in Egypt, who had been denied a visa, is booking her flight to come as soon as possible, said Aoun, whose group filed a lawsuit Tuesday in federal court in Detroit asking a judge to declare Trump’s immigration order unconstitutional.\n\nU.S. officials have said up to 60,000 foreigners had their visas “provisionally revoked” to comply with Trump’s order.\n\nTrump Could Cut Federal Funding for Refugee Resettlement\n\nAmong them was Ammar Alnajjar, a 24-year-old Yemeni green card holder and student at Southwest Tennessee Community College who had traveled to Turkey to visit his fiancee and planned to stay for three months. When he heard the ban was lifted, he paid $1,000 to come back immediately. He arrived at John F. Kennedy International Airport on Saturday.\n\n“I got to study. I got to do some work,” said Alnajjar, who said he fled civil war in Yemen and moved to the U.S. from Turkey in 2015. “I’m Muslim. I’m proud of it. Islam means peace.”\n\nAlthough the government suspended enforcement of the travel ban while it sought an emergency stay of Robart’s order, some airlines reportedly still weren’t letting some people from the seven countries board their planes, at least initially.\n\nRoyal Jordanian Airlines, which operates direct flights from Amman to New York, Chicago and Detroit, said it would resume carrying nationals from the seven countries as long as they presented a valid U.S. visa or green card.\n\nBut in the African nation of Djibouti, immigration attorney Julie Goldberg said a Qatar Airways representative told her that immigrants from all seven countries affected by the ban—Iraq, Syria, Sudan, Libya, Yemen, Iran and Somalia—were not allowed to fly Saturday afternoon. A Qatar Airways spokeswoman said the airline would begin boarding travelers from those countries.\n\nThese Airlines Allowing Previously Banned Passengers on U.S. Flights\n\nGoldberg said she was trying to arrange flights for dozens of Yemeni citizens who have immigrant visas and were stranded there. She said a supervisor at Turkish Airlines told her that people holding immigrant and non-immigrant visas from the seven countries still were being banned unless they had a special email from the U.S. Customs and Border Protection with the person’s name and passport number.\n\nA 12-year-old Yemeni girl whose parents and siblings are U.S. citizens living in California was finally allowed to depart after “an hour-and-half of fighting” with officials, Goldberg said. It was unclear when she would arrive.\n\n“Her mother is on pins and needles … her father is on the plane with her,” Stacey Gartland, a San Francisco attorney who represented the girl, said in an email.\n\nThe fate of some refugees still was in limbo.\n\nElon Musk Explains Role as Trump Advisor After Immigration Ban\n\nA Somali refugee said about 140 refugees whose resettlement in the U.S. was blocked by Trump’s executive order were sent back to their refugee camp and it was unclear if or when they could travel.\n\nNadir Hassan said the group of Somali refugees was relocated to Dadaab camp in eastern Kenya on Saturday. They had been expected to settle in the U.S. this week and had been staying at an International Organization for Migration transit center in Nairobi. Officials at the International Organization for Migration could not immediately be reached for comment.\n\n“I was hoping to start a new life in the U.S.” Hassan said. “We feel bad.”\n\nAmerican businesses affected by the ban also were jumping into action. Uber CEO Travis Kalanick, who quit Trump’s business advisory council this week under criticism of his initial response to Trump’s ban, said his company is buying plane tickets for some of its drivers who are stranded, tweeting Friday night that the head of litigation for the ride-hailing app is “buying a whole bunch of airline tickets ASAP!”\n\nDoctors Across America Are Slamming the Cleveland Clinic’s CEO for His Ties to Trump\n\nMeanwhile, legal advocates waited at airports to offer assistance to new arrivals in case anything went wrong.\n\nVolunteer attorney Renee Paradis was among 20-25 lawyers and interpreters who stationed themselves inside JFK’s Terminal 4 in case anyone arrived Saturday needing help. They were carrying handmade signs in Arabic and Farsi “that say we’re lawyers, we’re here to help. We’re not from the government,” Paradis said.\n\n“We’re all just waiting to see what actually happens and who manages to get through,” she said.", "authors": ["The Associated Press"], "publish_date": "2017-02-04", "source": "cnn", "top_words": ["reprieve", "seven", "travel", "amid", "immediately", "ban", "holders", "told", "immigration", "airlines", "board", "flights", "trumps", "countries", "order", "hurry", "visa"], "summary": "Visa holders from seven majority-Muslim countries affected by President Donald Trump’s travel ban hurried to board U.S.-bound flights Saturday, fearing they might have only a slim window through which to enter the country after a federal judge temporarily blocked the ban.\nRula Aoun, director of the Arab American Civil Rights League in Dearborn, Michigan, told The Detroit News that her group is advising people to hurry.\n“We’re … instructing people who can travel immediately to the United States to basically go ahead and do that before anything further happens,” Aoun said, adding that one family intends to fly back from Egypt on Sunday.\nAnother woman in Egypt, who had been denied a visa, is booking her flight to come as soon as possible, said Aoun, whose group filed a lawsuit Tuesday in federal court in Detroit asking a judge to declare Trump’s immigration order unconstitutional.\nU.S. officials have said up to 60,000 foreigners had their visas “provisionally revoked” to comply with Trump’s order."}