{"url": "http://tech.fortune.cnn.com/2017/02/03/uber-lyft-delete-donald-trump-executive-order/", "id": "85", "title": "Donald Trump Muslim Ban: 200,000 Uber Users Have Deleted the App", "text": "Since the #DeleteUber protest began on Twitter last weekend, over 200,000 customers had deleted their Uber accounts in protest of Uber CEO Travis Kalanick’s perceived support for President Trump, the New York Times reports.\n\nThe problems started when Uber turned off surge pricing for trips to New York’s JFK Airport amid protests of Trump’s immigration ban. Critics and rivals interpreted Uber’s actions as a sign of support for Trump’s executive order banning immigration from seven Muslim-majority nations, and a movement on Twitter—#DeleteUber—then sprouted. Uber users were pushed to leave the ride-hailing service.\n\nRival car-hailing service Lyft, which seized the moment to pledge $1 million to the ACLU, overtook Uber in total App Store downloads on Sunday. Under pressure from angry users, Kalanick then left Donald Trump’s business advisory council Thursday, just a day before the group was scheduled to meet with the president.\n\nStill, 200,000 is a mere fraction of Uber’s total numbers. In October, Kalanick said the app had roughly 40 million monthly active users. The deleted accounts would amount to just 0.5% of that total. And that percentage could be even lower, if Uber has since added users or a portion of the deletions came from inactive users.", "authors": ["Lucinda Shen"], "publish_date": "2017-02-03", "source": "cnn", "top_words": ["trump", "ban", "immigration", "deleted", "kalanick", "total", "support", "donald", "uber", "trumps", "ubers", "protest", "million", "muslim", "200000", "users", "app"], "summary": "The problems started when Uber turned off surge pricing for trips to New York’s JFK Airport amid protests of Trump’s immigration ban.\nUber users were pushed to leave the ride-hailing service.\nUnder pressure from angry users, Kalanick then left Donald Trump’s business advisory council Thursday, just a day before the group was scheduled to meet with the president.\nStill, 200,000 is a mere fraction of Uber’s total numbers.\nAnd that percentage could be even lower, if Uber has since added users or a portion of the deletions came from inactive users."}