{"url": "http://tech.fortune.cnn.com/2017/02/01/reddit-trump-travel-ban-letter-goes-viral/", "id": "80", "title": "This Techie's Open Letter on Trump Travel Ban Goes Viral", "text": "On Monday, Alexis Ohanian posted an open letter on Reddit, a popular online message board he co-founded, protesting an executive order by President Donald Trump banning citizens of seven countries from traveling to the U.S. Then, Ohanian invited Reddit users—known as Redditors—to post their own experiences.\n\nAnd did they ever. As of Wednesday afternoon, his post had generated more than 32,000 comments and was “upvoted,” the equivalent of a Facebook “like,” 111,000 times. The difference between up- and down-votes determines the ranking of a post and its prominence on the site.\n\nFor those who are not familiar, Reddit is famous for its robust and sometimes scary discussions about technology, media, politics, and everything in between. It’s also known for its online Ask Me Anything (AMA) question-and-answer sessions with luminaries from physicist Stephen Hawking to WikiLeaks founder Julian Assange.\n\nOhanian wrote about the important role immigrants have played in this country and about his own personal history, including the fact that his father had been an undocumented immigrant from Germany and that his great-grandfather barely escaped the Armenian genocide as a little boy.\n\nTwo days after posting, Ohanian’s letter is among the 30 highest scoring items in Reddit’s 11 year history. For context, the second-highest scoring post is President Barack Obama’s four-year-old AMA, which scored 216,000 upvotes.\n\nGet Data Sheet, Fortune’s technology newsletter.\n\nIn a sample response to Ohanian, a Redditor going by the name BlaueKrieger wrote:\n\nI am an immigrant. My father was murdered in my home country in the late 70’s. My mother brought me to the U S., legally, as a child. I went on to serve in the U S. military for nearly three decades, which included tours in Iraq and Afghanistan (twice). During my time in the military I graduated from college with honors and also earned a masters degree. I am now a civilian working professional with a good job, a family and paying a nice chunk in taxes. That’s my story in a nutshell.\n\nTo which DorisCrockford responded: “It’s our turn to defend the immigrants who defended us.”\n\nRelated discussions cropped up in diverse Reddit discussion pages for politics, Islam, and Australia, where users offered support and even legal advice to those requesting help.\n\nOne correspondent, theconfuserx2, used a Mark Twain quote to sum it up:\n\nTravel is fatal to prejudice, bigotry, and narrow-mindedness, and many of our people need it sorely on these accounts. Broad, wholesome, charitable views of men and things cannot be acquired by vegetating in one little corner of the earth all one’s lifetime.\n\nTo which another, mi_father_es_mufasa, responded:\n\nCould that dude be any more on point from a couple centuries away.\n\nAs usual, Redditors were not in total agreement. Zmemetime wrote: “As much as I disagree with Trump’s policies, I don’t think it’s reddit’s job to get involved like this.”\n\nAnd, MostlyMisanthropic said if Ohanian cared so much about immigrants, Reddit should delete subreddits (or groups) for racists or the alt-right.\n\nDo NOT give nazis a place to gather and discuss and plan. Nazis DO NOT DESERVE a safe space, and you, descendant of someone that escaped a genocide, are willingly providing them with one. STAND UP TO NAZIS.\n\nFor more on Reddit, watch Fortune’s video:\n\nAn official Reddit blog post has more about Ohanian’s letter and its ripple effect throughout the community.\n\nReddit on Wednesday did shut down one alt-right subreddit called r/altright, claiming that members had violated its terms of service.\n\nDate: (Feb. 1, 2017 8:09 p.m.) This story was updated to add mention of Reddit’s closure of one alt-right subreddit.", "authors": ["Barb Darrow"], "publish_date": "2017-02-01", "source": "cnn", "top_words": ["scoring", "travel", "wrote", "technology", "trump", "viral", "ban", "immigrants", "subreddit", "goes", "post", "techies", "ohanian", "open", "reddit", "reddits", "letter"], "summary": "Two days after posting, Ohanian’s letter is among the 30 highest scoring items in Reddit’s 11 year history.\nFor context, the second-highest scoring post is President Barack Obama’s four-year-old AMA, which scored 216,000 upvotes.\nFor more on Reddit, watch Fortune’s video:An official Reddit blog post has more about Ohanian’s letter and its ripple effect throughout the community.\nReddit on Wednesday did shut down one alt-right subreddit called r/altright, claiming that members had violated its terms of service.\nDate: (Feb. 1, 2017 8:09 p.m.) This story was updated to add mention of Reddit’s closure of one alt-right subreddit."}