{"url": "http://tech.fortune.cnn.com/2017/02/03/trump-immigration-order-blocked/", "id": "84", "title": "Judge Halts Trump Immigration Order Nationwide", "text": "A federal judge in Seattle on Friday put a nationwide block on President Donald Trump’s week-old executive order barring nationals from seven countries from entering the United States.\n\nThe judge’s temporary restraining order represents a major challenge to Trump’s action, although his administration could still appeal the ruling and have the policy upheld.\n\nThe Seattle judge, James Robart, made his ruling effective immediately on Friday, suggesting that travel restrictions could be lifted straight away.\n\n“It’s a wonderful day for the rule of law in this country,” said Washington state solicitor general Noah Purcell.\n\nThe state’s attorney general, Bob Ferguson, said: “This decision shuts down the executive order right now.” He said he expected the federal government to honor the ruling.\n\nThe new Republican president’s order signed on Jan. 27 triggered chaos at U.S. airports last weekend. Some travelers abroad were turned back from flights into the United States, crowds of hundreds of people packed into arrival areas to protest and legal objections were filed across the country.\n\nThe challenge was brought by the state of Washington and later joined by the state of Minnesota. The Seattle judge ruled that the states have legal standing to sue, which could help Democratic attorneys general take on Trump in court on issues beyond immigration.\n\nThe decision came on a day that attorneys from four states were in courts challenging Trump’s executive order. The Trump administration justified the action on national security grounds, but opponents labeled it an unconstitutional order targeting people based on religious beliefs.\n\nEarlier on Friday, a federal judge in Boston declined to extend a temporary restraining order that allowed some immigrants into the United States from countries affected by Trump’s three-month ban.\n\nAlso on Friday in Virginia, a federal judge ordered the White House to provide a list of all people stopped from entering the United States by the travel ban.\n\nThe State Department said on Friday that fewer than 60,000 visas previously issued to citizens of Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen had been invalidated as a result of the order. That disclosure followed media reports that government lawyers were citing a figure of 100,000.\n\nU.S. District Judge Leonie Brinkema in Alexandria, Virginia ordered the federal government to give the state a list by Thursday of “all persons who have been denied entry to or removed from the United States.”\n\nThe state of Hawaii on Friday joined the challenge to the order, filing a lawsuit alleging that the order is unconstitutional and asking the court to block the order across the country.\n\nFor more about President Trump, watch:\n\nThe order also temporarily stopped the entry of all refugees into the country and indefinitely halted the settlement of Syrian refugees.\n\nOn Friday the Department of Homeland Security issued additional clarification of the order, stating that there were no plans to extend it beyond the seven countries. The DHS also reiterated that the ban did not apply to permanent residents, or green card holders, and some others, such as those who have helped the U.S. military.\n\nIn the Boston case, U.S. District Judge Nathan Gorton denied the request, after expressing skepticism during oral arguments about a civil rights group’s claim that Trump’s order represented religious discrimination.", "authors": [], "publish_date": "2017-02-03", "source": "cnn", "top_words": ["trump", "immigration", "state", "judge", "seattle", "united", "states", "trumps", "nationwide", "general", "federal", "order", "halts"], "summary": "A federal judge in Seattle on Friday put a nationwide block on President Donald Trump’s week-old executive order barring nationals from seven countries from entering the United States.\nThe Seattle judge, James Robart, made his ruling effective immediately on Friday, suggesting that travel restrictions could be lifted straight away.\nThe Seattle judge ruled that the states have legal standing to sue, which could help Democratic attorneys general take on Trump in court on issues beyond immigration.\nAlso on Friday in Virginia, a federal judge ordered the White House to provide a list of all people stopped from entering the United States by the travel ban.\nIn the Boston case, U.S. District Judge Nathan Gorton denied the request, after expressing skepticism during oral arguments about a civil rights group’s claim that Trump’s order represented religious discrimination."}