{"url": "http://tech.fortune.cnn.com/2017/02/05/elon-musk-trump-travel-ban/", "id": "88", "title": "Elon Musk Pushed Muslim Travel Ban to Top of Trump Meeting Agenda", "text": "At a Friday meeting of President Donald Trump’s economic advisory council, Tesla and SpaceX CEO Elon Musk says he made sure the Trump administration’s travel ban was a major topic of discussion.\n\nAt my request, the agenda for yesterday's White House meeting went from not mentioning the travel ban to having it be first and foremost — Elon Musk (@elonmusk) February 4, 2017\n\nNo details of the meeting have emerged, but Musk was following up on previous public commitments to use his role to share a pro-business and pro-innovation perspective with the President. Along with personal concerns about human rights and equity, many tech leaders see the President’s attempts to restrict immigration—including visas for skilled guest workers—as potentially throttling the stream of global talent that has allowed American companies to dominate the global technology industry.\n\nGet Data Sheet, Fortune’s technology newsletter.\n\nMusk’s continued engagement with Trump is risky, given that many of his educated, high-income, and climate-conscious customers likely oppose the Trump administration. It stands in contrast to the decision of Uber CEO Travis Kalanick to leave the council this week.\n\nKalanick’s departure came on the heels of a viral #deleteuber boycott that accused Uber (probably speciously) of interfering with a taxi drivers’ strike in opposition to Trump’s Muslim travel ban. At the time of his departure, Kalanick wrote to employees that “The implicit assumption that Uber (or I) was somehow endorsing the Administration’s agenda has created a perception-reality gap between who people think we are, and who we actually are.”\n\nMusk has repeatedly made clear that his participation in the council meetings is not an endorsement of Trump administration policies, and observers seem to have largely accepted his reasoning. While Buzzfeed News recently reported on a handful of customers cancelling pre-orders for the forthcoming Tesla Model 3, there has been no sign of a groundswell akin to the #deleteuber boycott.\n\nRegarding the meeting at the White House: pic.twitter.com/8b1XH4oW6h — Elon Musk (@elonmusk) February 3, 2017\n\nTwitter responses to Musk were cautious, but frequently supportive.\n\nsurely the only guaranteed way he will have less of a + influence is not showing up @ all — Fee (@FiveOhFour) February 4, 2017\n\nHerr Dictator already has a voice. Musk is a rational voice whispering in his ear. That seems good to me… — robert davies (@robsMast) February 4, 2017\n\nMusk also said he raised the issue of climate change during the meeting. It’s an issue that has animated Musk’s entire career, but Trump has expressed extreme skepticism about climate change, and his administration has already moved to quash the subject.\n\nIn addition, I again raised climate. I believe this is doing good, so will remain on council & keep at it. Doing otherwise would be wrong. — Elon Musk (@elonmusk) February 4, 2017\n\nThe lingering question, of course, is whether President Trump is likely to be influenced by input that conflicts with his own worldview, even when it comes from one of the most admired people in America.", "authors": ["David Z. Morris"], "publish_date": "2017-02-05", "source": "cnn", "top_words": ["elonmusk", "travel", "council", "trump", "elon", "ban", "pushed", "uber", "agenda", "president", "meeting", "climate", "muslim", "musk"], "summary": "At a Friday meeting of President Donald Trump’s economic advisory council, Tesla and SpaceX CEO Elon Musk says he made sure the Trump administration’s travel ban was a major topic of discussion.\nMusk’s continued engagement with Trump is risky, given that many of his educated, high-income, and climate-conscious customers likely oppose the Trump administration.\nRegarding the meeting at the White House: pic.twitter.com/8b1XH4oW6h — Elon Musk (@elonmusk) February 3, 2017Twitter responses to Musk were cautious, but frequently supportive.\nThat seems good to me… — robert davies (@robsMast) February 4, 2017Musk also said he raised the issue of climate change during the meeting.\n— Elon Musk (@elonmusk) February 4, 2017The lingering question, of course, is whether President Trump is likely to be influenced by input that conflicts with his own worldview, even when it comes from one of the most admired people in America."}