{"url": "http://tech.fortune.cnn.com/2017/02/03/trump-immigration-ban-nonprofits/", "id": "83", "title": "Nonprofits Are Rejecting Federal Money Because of Trump's Refugee Ban", "text": "Nonprofit groups are rejecting federal grant money to combat violent extremism because of what they described as President Donald Trump’s actions against the Muslim and Arab community.\n\nThe Obama administration in its final days awarded 31 grants through the Homeland Security Department worth a total of about $10 million. Those agreements haven’t been signed, and no money has been disbursed.\n\nNow, two groups are rejecting the money they already had been offered, while others have objected to Trump’s plans.\n\nLeaders Advancing and Helping Communities in Dearborn, Michigan, said it was turning down $500,000 for youth development and public health programs because of the “current political climate.”\n\nKa Joog, a leading Somali nonprofit in Minneapolis, rejected nearly $500,000 for its youth programs. “Our nation’s new administration and their policies which promote hate, fear, uncertainty and even worse; an unofficial war on Muslim-Americans and immigrants,” the group said in a statement.\n\nThe Homeland Security Department did not immediately respond to email and phone requests for comment from The Associated Press.\n\nTrump has endorsed extreme vetting and ordered a temporary ban on refugees from seven predominantly Muslim countries. Charities that already have worked with U.S. government agencies, including the CIA, Justice Department and Homeland Security Department, said they were reacting to discussions within the Trump administration to exclusively target “radical Islamic terrorists” under a U.S. program to counter violent extremism, known as CVE.\n\nA U.S. official with knowledge of the discussions said the Trump administration has been discussing changing the Obama administration program’s name, established as a presidential strategy in 2011, to some iteration of “countering Islamic extremism.” The official spoke on condition of anonymity because this person was not authorized to speak publicly.\n\nMost of the 31 federal grants were promised to municipalities, but some were directed to nonprofit groups such as Life After Hate Inc. in Chicago, which received $400,000 for its work with former white supremacists — a large portion of which will also go to a partner group to work with individuals inspired by al-Qaida or the Islamic State group.\n\nThe U.S. official said it was unclear whether a group such as Life After Hate would continue to receive funding or be included in any future program.\n\nChristian Picciolini, the co-founder of Life After Hate and a former white supremacist, said such a change would be troubling and “sends a message that white extremism does not exist, or is not a priority in our country, when in fact it is a statistically larger and more present terror threat than any by foreign or other domestic actors.”\n\nWhite supremacist groups saw renewed interest during the presidential campaign, which many credited to Trump’s candidacy. Picciolini said that since his group had not received its funding yet, “I suppose it’s possible it could be rescinded altogether.”\n\nThe nonprofit Washington-based Muslim Public Affairs Council had encouraged the Muslim community to give the program countering violent extremism a chance.\n\nCouncil President Salam Al-Marayati said Thursday, “If there’s a policy change that basically in effect tells us we have to fight our own religion, then this is a fundamental violation of our constitutional rights and we will consider all possible actions for redress.”\n\nStill, Al-Marayati said there is such disarray throughout federal agencies that “nobody knows where this is going.”\n\n“With this toxic vitriol coming out of the White House … this administration may undermine everything we’ve been working on for the last 10 years,” Al-Marayati said.\n\nSince 2014, when pilot programs under CVE were announced by the Obama administration, U.S. officials have worked to convince the American Muslim community that the program was not just about them.\n\nSuehaila Amen, a director for Leaders Advancing and Helping Communities, said its members voted unanimously Jan. 26 to reject the funds and were influenced by recent discussions of a possible name change.\n\n“What’s most important is we protect our community and their needs and concerns,” she said. “Our patriotism isn’t tied to a grant, and at the end of the day we need to continue to serve our community (and) ensure transparency and trust, and we’re not willing to compromise that.”\n\nAmen, who worked with the Bush and Obama administrations to help build outreach to minority groups, said she told U.S. officials this past week that she will no longer be participating in discussions around countering violent extremism with the Trump administration.\n\nJihad Turk, the founding president of the Islamic graduate school Bayan Claremont in California, said its board would review the language of its $800,000 award before accepting to make sure it doesn’t place additional restrictions or impositions on them.\n\nHe said the problem with making the program focus on “Islamic extremism” is that “there’s nothing illegal about an extreme interpretation of your religion.”\n\n“What’s illegal is terrorism,” he said, and that’s why the word “violent” is key.\n\nJohn Cohen, a former DHS official who helped write the CVE strategy and led its implementation, said it specifically didn’t target extremists inspired by al-Qaeda and the Islamic State, because local law enforcement said white supremacist and other extremist groups were more problematic, and communities and police were targeted.\n\nHe criticized the program for focusing too much on Muslim and Arab communities since he left in 2014, and called on Trump to dump his campaign language from any reimagining of CVE or risk driving “an even greater wedge between those responsible for stopping violent attacks and those within the community who are critical partners in effectively doing that.”", "authors": ["The Associated Press"], "publish_date": "2017-02-03", "source": "cnn", "top_words": ["trump", "ban", "extremism", "groups", "refugee", "community", "trumps", "white", "federal", "rejecting", "violent", "muslim", "islamic", "nonprofits", "administration", "program", "money"], "summary": "Nonprofit groups are rejecting federal grant money to combat violent extremism because of what they described as President Donald Trump’s actions against the Muslim and Arab community.\nThe Obama administration in its final days awarded 31 grants through the Homeland Security Department worth a total of about $10 million.\nNow, two groups are rejecting the money they already had been offered, while others have objected to Trump’s plans.\nThe Homeland Security Department did not immediately respond to email and phone requests for comment from The Associated Press.\nTrump has endorsed extreme vetting and ordered a temporary ban on refugees from seven predominantly Muslim countries."}