{"url": "http://management.fortune.cnn.com/2017/01/30/jp-morgan-trump-immigrant-ban-memo/", "id": "8", "title": "Donald Trump Muslim Ban: J.P. Morgan Reassures Employees", "text": "J.P. Morgan Chase issued a memo to its entire staff on Sunday, affirming its commitment to them in the wake of the Trump administration’s new executive order that restricts travel from seven Muslim-majority countries.\n\n“In light of recent executive orders in the United States regarding immigration policy, we want every one of you to know of our unwavering commitment to the dedicated people working here at JPMorgan Chase,” the memo from the bank’s operating committee reads, according to Business Insider. J.P. Morgan CEO Jamie Dimon is a member of the committee.\n\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 Advertisement\n\nAn unspecified number of J.P. Morgan employees are on sponsored visas and may be impacted by the Trump administration order, according to the memo. The company said it worked to reach those employees over the weekend.\n\n“We understand the situation is evolving quickly, so if you have any concerns about your own situation and have not been contacted, please reach out to your local immigration specialist or HR team,” the memo reads.\n\nMany companies have come out in support of their employees in the wake of the order, and some have denounced the Trump administration’s ban on travel. Ride-hailing company Lyft announced over the weekend it would donate $1 million to the American Civil Liberties Union , which has already challenged Trump’s order, over the next four years.", "authors": ["Maya Rhodan"], "publish_date": "2017-01-30", "source": "cnn", "top_words": ["travel", "jp", "trump", "ban", "wake", "immigration", "memo", "donald", "reassures", "situation", "order", "muslim", "employees", "morgan"], "summary": "J.P. Morgan Chase issued a memo to its entire staff on Sunday, affirming its commitment to them in the wake of the Trump administration’s new executive order that restricts travel from seven Muslim-majority countries.\nJ.P. Morgan CEO Jamie Dimon is a member of the committee.\nTens of Thousands in U.S. Cities Protest Trump Immigration Order 1 of 31 AdvertisementAn unspecified number of J.P. Morgan employees are on sponsored visas and may be impacted by the Trump administration order, according to the memo.\nThe company said it worked to reach those employees over the weekend.\nMany companies have come out in support of their employees in the wake of the order, and some have denounced the Trump administration’s ban on travel."}