{"url": "http://tech.fortune.cnn.com/2017/02/08/donald-trump-entrance-restrictions-travel/", "id": "97", "title": "President Trump's Entrance Restrictions Are Already Cutting Demand for Travel to the U.S.", "text": "The travel restrictions put in place by U.S. President Donald Trump on seven countries are deterring travelers from other countries too, according to a travel analysis company.\n\nForwardKeys, which analyses 16 million flight reservations a day from major global reservation systems, said bookings for international arrivals to the United States over the next three months were 2.3% higher than last year.\n\nBut on Jan. 27, the day Trump issued the executive order, bookings had been 3.4% ahead of the previous year, Forwardkeys data showed.\n\nWhen the travel ban was in place from Jan. 28 to Feb. 4, bookings to the United States dropped 6.5%, including an 80% slump in reservations from the seven countries listed on Trump’s order and a 13.6% drop from Western Europe.\n\nOn the day the curbs were lifted by a U.S. judge, bookings from Iran surged, ForwardKeys said, leaving reservations for travel to the United States five times higher on Feb. 3 and Feb. 4 than the same two days a year earlier. Most of those bookings were for arrival in the United States on Feb. 5 and Feb. 6.\n\nForwardKeys CEO Olivier Jager cautioned that the data was just a snapshot of an eight-day period and it would continue to monitor the situation.\n\nOther groups, such as the U.N. World Tourism Organization, have also warned travel demand could be hurt by U.S. restrictions, which are still suspended pending a U.S. appeals court hearing due to start at 23:00 GMT on Tuesday.\n\n“The ambiguity of these very latest developments introduced by President Trump is casting a shadow over the future travel demand to and from the U.S.,” said Nadejda Popova, travel project manager at Euromonitor.\n\n“The new executive order could also impact how the U.S. is perceived as a tourism destination and how open to foreign travelers it will be in the future.”\n\nFollowing is a geographical breakdown of net bookings to the United States while the ban was in place, according to ForwardKeys data.\n\nNet Bookings to U.S. (Jan. 28—Feb. 4)\n\nFrom seven banned countries*: -80.0%\n\nFrom Northern Europe -6.6%\n\nFrom Western Europe -13.6%\n\nFrom Southern Europe -2.9%\n\nFrom Middle East -37.5%\n\nFrom Asia/Pacific** -14.0%\n\nFrom Central/Eastern Europe +15.8%\n\nFrom Africa -6.1%\n\nFrom Americas +2.3%\n\nOverall -6.5%\n\n* Iran, Iraq, Libya, Somalia, Sudan, Syria and Yemen\n\n** Not including China/Hong Kong due to seasonal effect of Chinese New Year demand\n\n*** Includes U.S. domestic", "authors": [], "publish_date": "2017-02-08", "source": "cnn", "top_words": ["seven", "travel", "restrictions", "trump", "bookings", "europe", "entrance", "united", "feb", "trumps", "demand", "countries", "reservations", "states", "president", "cutting"], "summary": "The travel restrictions put in place by U.S. President Donald Trump on seven countries are deterring travelers from other countries too, according to a travel analysis company.\nForwardKeys, which analyses 16 million flight reservations a day from major global reservation systems, said bookings for international arrivals to the United States over the next three months were 2.3% higher than last year.\nBut on Jan. 27, the day Trump issued the executive order, bookings had been 3.4% ahead of the previous year, Forwardkeys data showed.\nMost of those bookings were for arrival in the United States on Feb. 5 and Feb. 6.\n“The ambiguity of these very latest developments introduced by President Trump is casting a shadow over the future travel demand to and from the U.S.,” said Nadejda Popova, travel project manager at Euromonitor."}