{"url": "http://tech.fortune.cnn.com/2017/02/06/donald-trump-travel-ban-elon-musks-tesla-spacex-companies/", "id": "93", "title": "Elon Musk's Tesla and SpaceX Join 97 Other Companies in Brief Against President Trump's Travel Ban", "text": "Elon Musk’s Tesla and SpaceX have joined the 97 companies that signed a legal brief opposing President Donald Trump’s executive order temporarily blocking travel from seven Muslim-majority countries.\n\nThe brief has been signed by several tech giants, including Apple, Google, Facebook and Microsoft, and says Trump’s ban “inflicts significant harm on American business.” According to the companies, the travel ban harms their employees and customers and limits their growth.\n\nTesla and SpaceX had not signed the brief at the time of filing on Sunday. Reuters reported Monday afternoon that the companies had joined.\n\nMusk has come under fire in recent days for his affiliation with Trump – the Tesla and SpaceX CEO is currently part of two advisory councils under the President. He defended his connection to Trump through several tweets, saying he used a council meeting to discuss the immigration ban and climate change.\n\nAt my request, the agenda for yesterday's White House meeting went from not mentioning the travel ban to having it be first and foremost — Elon Musk (@elonmusk) February 4, 2017\n\n“I understand the perspective of those who object to my attending this meeting, but I believe at this time that engaging on critical issues will on balance serve the greater good,” he wrote in a note posted on Twitter.", "authors": ["Mahita Gajanan"], "publish_date": "2017-02-06", "source": "cnn", "top_words": ["travel", "companies", "trump", "elon", "ban", "join", "tesla", "trumps", "signed", "meeting", "spacex", "musks", "brief", "president"], "summary": "Elon Musk’s Tesla and SpaceX have joined the 97 companies that signed a legal brief opposing President Donald Trump’s executive order temporarily blocking travel from seven Muslim-majority countries.\nThe brief has been signed by several tech giants, including Apple, Google, Facebook and Microsoft, and says Trump’s ban “inflicts significant harm on American business.” According to the companies, the travel ban harms their employees and customers and limits their growth.\nTesla and SpaceX had not signed the brief at the time of filing on Sunday.\nMusk has come under fire in recent days for his affiliation with Trump – the Tesla and SpaceX CEO is currently part of two advisory councils under the President.\nHe defended his connection to Trump through several tweets, saying he used a council meeting to discuss the immigration ban and climate change."}