{"url": "http://tech.fortune.cnn.com/2017/02/08/starbucks-howard-shultz-immigration-muslim-ban-legal-advice-lawsuit/", "id": "98", "title": "Starbucks Is Giving Employees Free Legal Advice on Immigration", "text": "After pledging to hire thousands of refugees, Starbucks is now offering its employees free legal advice on immigration.\n\nThe coffee giant sent a letter to workers Monday, saying that the company had partnered with Ernest & Young to offer free legal advice to “help navigate immigration issues and get answers in these uncertain times,” CNNMoney reported.\n\nStarbucks (sbux) has also reached out to employees who hold visas from countries affected by President Donald Trump’s executive order banning immigration from seven Muslim-majority nations, according to the letter.\n\n“Our partners (employees) and their families have questions about travel and immigration status, so we wanted to provide them with a newly developed Immigration Advisory Program to meet their needs,” a Starbucks spokesperson wrote in an emailed statement to Fortune.\n\nStarbucks CEO Howard Schultz is one of many business executives who have spoken out against Trump’s executive order. In a response to that order, Starbucks pledged to hire 10,000 refugees worldwide in the next five years.\n\nHere is the letter in its entirety:\n\nPartners,\n\nAfter the recent Executive Order placing restrictions on immigration and the subsequent legal challenges to its enforcement, we understand many partners still have questions about what this means for them. As you saw in Howard’s message, we are putting our partners first and leading with humanity.\n\nOur Partner Resources team has and will continue to proactively reach out to partners who we know are impacted by the Executive Order, and any related actions, to connect them to the legal resources needed for their individual scenarios. In addition, we are proud to announce a new service in partnership with the immigration arm of Ernst & Young; the Immigration Advisor Program. This service will allow all partners and family members to help navigate immigration issues and get answers in these uncertain times. If you are a partner or a family member and you have questions about immigration, travel restrictions, or how the Executive Order and any related actions may otherwise impact you, please access this legal support and guidance from the Global Mobility and Immigration team by clicking on this link: ******* or opening the attached email draft.\n\nThe team will connect you with the right resources to answer your questions and provide clarity. This team, supported by legal counsel, will stay on top of all the latest developments and will continue to be available as a source for the most up-to-date and accurate information available.\n\nErnst & Young did not respond to immediate requests for comment.\n\nThis story has been updated to include comments from the Starbucks team.", "authors": ["Lucinda Shen"], "publish_date": "2017-02-08", "source": "cnn", "top_words": ["executive", "advice", "questions", "resources", "young", "immigration", "free", "giving", "starbucks", "partners", "order", "employees", "team", "legal"], "summary": "After pledging to hire thousands of refugees, Starbucks is now offering its employees free legal advice on immigration.\nStarbucks (sbux) has also reached out to employees who hold visas from countries affected by President Donald Trump’s executive order banning immigration from seven Muslim-majority nations, according to the letter.\nStarbucks CEO Howard Schultz is one of many business executives who have spoken out against Trump’s executive order.\nIn a response to that order, Starbucks pledged to hire 10,000 refugees worldwide in the next five years.\nThis story has been updated to include comments from the Starbucks team."}