{"url": "http://tech.fortune.cnn.com/2017/02/06/trump-immigration-travel-ban/", "id": "94", "title": "The White House Says It Expects Trump's Travel Ban to Be Restored", "text": "The White House says it expects the courts to restore President Donald Trump’s ban on refugees and travelers from seven predominantly Muslim countries, an executive order founded on a claim of national security.\n\nThe next opportunity for the president’s team to argue in favor of the ban will come in the form of a response to a lawsuit by Washington state and Minnesota contending that Trump’s order harms residents and effectively mandates discrimination. The 9th U.S. Circuit Court of Appeal has ordered the Justice Department to file its briefs by 6 p.m. EST Monday.\n\nThe San Francisco-based appeals court has already turned down a Justice Department request to set aside immediately a Seattle judge’s ruling that put a temporary hold on the ban nationwide. That ruling last Friday prompted an ongoing Twitter rant by Trump, who dismissed U.S. District Court Judge James Robart as a “so-called judge” and his decision “ridiculous.”\n\nTrump renewed his Twitter attacks against Robart on Sunday. “Just cannot believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!” He followed with another tweet saying he had instructed the Homeland Security Department to check people coming into the country but that “the courts are making the job very difficult!”\n\nVice President Mike Pence said Sunday that “we don’t appoint judges to our district courts to conduct foreign policy or to make decisions about the national security.” Trump himself had offered an optimistic forecast the previous night, telling reporters during a weekend at his private club in Florida: “We’ll win. For the safety of the country, we’ll win.”\n\nThe government had told the appeals court that the president alone has the power to decide who can enter or stay in the United States, an assertion that appeared to invoke the wider battle to come over illegal immigration.\n\nCongress “vests complete discretion” in the president to impose conditions on entry of foreigners to the United States, and that power is “largely immune from judicial control,” according to the court filing.\n\nSen. Dianne Feinstein, the top Democrat on the Judiciary Committee, predicted the appeals court would not have the last word. “I have no doubt that it will go to the Supreme Court, and probably some judgments will be made whether this president has exceed his authority or not,” she said.\n\nIn his ruling, Robart said it was not the court’s job to “create policy or judge the wisdom of any particular policy promoted by the other two branches,” but to make sure that an action taken by the government “comports with our country’s laws.”\n\nWhatever the outcome and however the case drags on, a president who was used to getting his way in private business is finding, weeks into his new job that obstacles exist to quickly fulfilling one of his chief campaign pledges.\n\n“The president is not a dictator,” said Feinstein, D-Calif. “He is the chief executive of our country. And there is a tension between the branches of government.”\n\nThe Twitter attacks on Robart — appointed by President George W. Bush — prompted scolding from fellow Republicans as well as Democrats.\n\n“We don’t have so-called judges,” said Sen. Ben Sasse, R-Neb. “We don’t have so-called senators. We don’t have so-called presidents. We have people from three different branches of government who take an oath to uphold and defend the Constitution.”\n\nHowever, Pence defended the president, saying he “can criticize anybody he wants.” The vice president added that he believes the American people “find it very refreshing that they not only understand this president’s mind, but they understand how he feels about things.”\n\nTrump’s order applied to Iraq, Syria, Iran, Sudan, Libya, Somalia and Yemen — Muslim-majority countries that the administration said raise terrorism concerns. The order had caused unending confusion for many foreigners trying to reach the United States, prompting protests across the United States and leading to multiple court challenges.\n\nThe State Department said last week that as many as 60,000 foreigners from those seven countries had had their visas canceled. After Robart’s decision, the department reversed course and said they could travel to the U.S. if they had a valid visa.\n\nThe department also advised refugee aid agencies that refugees set to travel before Trump signed his order would now be allowed in.\n\nThe Homeland Security Department no longer was directing airlines to prevent visa-holders affected by Trump’s order from boarding U.S.-bound planes. The agency said it had “suspended any and all actions” related to putting in place Trump’s order.\n\nPence appeared on ABC’s “This Week,” CBS’ “Face the Nation,” NBC’s “Meet the Press” and “Fox News Sunday. McConnell was on CNN, Feinstein spoke on Fox and Sasse was interviewed by ABC.", "authors": ["The Associated Press"], "publish_date": "2017-02-06", "source": "cnn", "top_words": ["socalled", "travel", "ban", "expects", "judge", "court", "house", "president", "trumps", "department", "united", "states", "order", "white", "restored", "robart"], "summary": "The White House says it expects the courts to restore President Donald Trump’s ban on refugees and travelers from seven predominantly Muslim countries, an executive order founded on a claim of national security.\nThe next opportunity for the president’s team to argue in favor of the ban will come in the form of a response to a lawsuit by Washington state and Minnesota contending that Trump’s order harms residents and effectively mandates discrimination.\nThe order had caused unending confusion for many foreigners trying to reach the United States, prompting protests across the United States and leading to multiple court challenges.\nThe Homeland Security Department no longer was directing airlines to prevent visa-holders affected by Trump’s order from boarding U.S.-bound planes.\nThe agency said it had “suspended any and all actions” related to putting in place Trump’s order."}