{"url": "http://management.fortune.cnn.com/2017/02/06/trump-travel-ban-supreme-court/", "id": "9", "title": "Donald Trump Immigration Ban: The Supreme Court and What Happens Next", "text": "The furor over President Trump’s immigration executive order shows no sign of abating. Over the weekend, nearly 100 major tech companies—including Apple and Google—filed a brief to oppose it, and on Thursday the 9th Circuit Court of Appeals upheld a temporary block of the order.\n\nMeanwhile, the specter of the Supreme Court looms large as the country looks for a final answer over whether Trump’s order—which seeks to ban refugees and all visitors from seven mostly Muslim countries—is lawful. After Thursday’s ruling, President Trump promptly said he will take the matter to the top court:\n\nSEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE! — Donald J. Trump (@realDonaldTrump) February 9, 2017\n\nTo understand what might happen next, it’s helpful to recall where the process stands so far:\n\nA federal judge in Seattle issued an order last week that blocks the President’s ban nationwide. This means refugees and travelers from the seven countries can once again enter the U.S. (They must still pass rigid visa and screening rules.)\n\nOn Saturday, a panel of two appeals courts judges on the 9th Circuit refused to issue a so-called “administrative stay” on the Seattle judge’s ruling, and asked the White House to instead file a legal brief by Monday.\n\nThe California appeals court on Thursday upheld all parts of the temporary restraining order—setting the stage for the case to reach the Supreme Court.\n\nAs for the Supreme Court, keep in mind there are two issues at stake: If the President’s order is legal under the Constitution, and whether the order should be suspended (as it is right now) while the courts take a closer look.\n\nRight now, the fight is over the temporary stay, or block on the immigration ban under the executive order. The White House has some tactical decisions to make over how and when to turn to the Supreme Court.\n\nAs law professor Josh Blackman explains, the White House has three options. The first is to ask Justice Anthony Kennedy, who hears emergency applications that arise in Washington state, to suspend the Seattle ruling.\n\nGet Data Sheet, Fortune’s technology newsletter.\n\nThe problem with this, however, is that Kennedy would have to persuade four of this colleagues to go along with him—and that’s probably a long shot since the Supreme Court’s four liberals probably prefer to leave the temporary stay in place.\n\nBut as Blackman points out, the White House could use a different procedural approach, and ask the Supreme Court to grant a hearing. This would likely succeed, and would only require a total of four votes. This tactic (known as “certiorari before judgment” might not overturn the temporary stay, but it would get the case before the top court in a hurry. Finally, the White House could just wait until the Seattle court issues its final decision—and then appeal up the chain from there, which would take longer.\n\n90 Days and a Ninth Justice\n\nIf all this sounds complicated, don’t forget there’s yet another factor here that makes it even more complex. Namely, Trump just nominated a new Supreme Court Justice, Neil Gorsuch, who could play a big role in deciding the real question here: whether the order is legal at all.\n\nIf the Trump Administration asks the full Supreme Court to review the the lower court ruling right away, there’s a good chance Gorsuch will not be on the bench by the time of the hearing. This raises the specter of a 4-4 tie, which would mean the lower ruling stays in place.\n\nIf Gorsuch is able to hear the case, however, there’s no chance of a tie decision.\n\nAs for the substance of Trump’s order, many legal scholars suggest it probably is legal given the executive branch has very broad powers when it comes to immigration—though other disagree. Meanwhile, almost everyone seems to agree the order is a terrible idea from a policy perspective. (A widely-cited post at the blog Lawfare described the order as “Malevolence Tempered by Incompetence“).\n\nThe upshot is that Trump has a good shot at winning the underlying legal question, but only after more court wrangles and more criticism over how he’s handled the process so far—including his decisions to insult and belittle the judiciary by calling the author of the Seattle ruling (a Republican appointed by President George W. Bush) a “so-called judge.”\n\nFinally, there is also a change this doesn’t get resolved at will given that Trump’s controversial order is only supposed to last for 90 days. In light of the incredible controversy it has generated, the White House may choose to modify the ban, which could make the whole issue moot before the Supreme Court has a chance to decide.\n\nThis post was updated on Thursday to take account of the 9th Circuit ruling.", "authors": ["Jeff John Roberts"], "publish_date": "2017-02-06", "source": "cnn", "top_words": ["ruling", "trump", "ban", "supreme", "immigration", "seattle", "court", "donald", "happens", "temporary", "order", "house", "white", "legal"], "summary": "Meanwhile, the specter of the Supreme Court looms large as the country looks for a final answer over whether Trump’s order—which seeks to ban refugees and all visitors from seven mostly Muslim countries—is lawful.\nThe California appeals court on Thursday upheld all parts of the temporary restraining order—setting the stage for the case to reach the Supreme Court.\nThe White House has some tactical decisions to make over how and when to turn to the Supreme Court.\nBut as Blackman points out, the White House could use a different procedural approach, and ask the Supreme Court to grant a hearing.\nIf the Trump Administration asks the full Supreme Court to review the the lower court ruling right away, there’s a good chance Gorsuch will not be on the bench by the time of the hearing."}