{"url": "http://tech.fortune.cnn.com/2017/02/09/apple-ceo-tim-cook-donald-trump-travel-ban/", "id": "99", "title": "Apple CEO Tim Cook Does Not like President Trump's Travel Ban", "text": "Tim Cook does not like President Trump’s travel ban.\n\nThe Apple (aapl) executive repeated his criticism for the ban while receiving an honorary doctorate at Scotland’s University of Glasgow, BBC News reports.\n\n“I wrote this letter, you probably read about it unless you’re living underground, about the most recent executive order that was issued in the U.S.,” Cook said according to BBC News, as he was responding to questions from students and staff at the University.\n\n“We have employees that secured a work visa, they brought family to the U.S., but happened to be outside the U.S. when the executive order was issued and all of a sudden their families were affected,” he said. “They couldn’t get back in. That’s a crisis. You can imagine the stress.”\n\nCook continued to say that if no one speaks out against it, it’s “as if we’re agreeing, that we become a part of it. It’s important to speak out.”\n\nCook isn’t the only tech CEO who’s spoken out against the ban. The executive order, which prohibits immigrants from seven Muslim-majority countries from entering the United States for at least 90 days, and bars Syrian refugees indefinitely, has caused an outcry from Silicon Valley chiefs—namely from Google (goog), Facebook (fb), Lyft, and Uber, and of course, Apple.", "authors": ["Madeline Farber"], "publish_date": "2017-02-09", "source": "cnn", "top_words": ["executive", "does", "travel", "cook", "wrote", "ban", "bbc", "order", "youre", "trumps", "ceo", "issued", "work", "tim", "apple", "president"], "summary": "Tim Cook does not like President Trump’s travel ban.\nThe Apple (aapl) executive repeated his criticism for the ban while receiving an honorary doctorate at Scotland’s University of Glasgow, BBC News reports.\n“We have employees that secured a work visa, they brought family to the U.S., but happened to be outside the U.S. when the executive order was issued and all of a sudden their families were affected,” he said.\nIt’s important to speak out.”Cook isn’t the only tech CEO who’s spoken out against the ban.\nThe executive order, which prohibits immigrants from seven Muslim-majority countries from entering the United States for at least 90 days, and bars Syrian refugees indefinitely, has caused an outcry from Silicon Valley chiefs—namely from Google (goog), Facebook (fb), Lyft, and Uber, and of course, Apple."}