{"url": "http://tech.fortune.cnn.com/2017/02/08/brainstorm-health-02-08-intro/", "id": "96", "title": "The Real Danger of Trump’s Travel Ban", "text": "This essay appears in today’s edition of the Fortune Brainstorm Health Daily. Get it delivered straight to your inbox.\n\nImagine you were just named CEO of a long-running business. Your business model, admittedly, is rather loosely defined: You hire the smartest people in the world—the vast majority of them on the cheap—and leave them alone to invent stuff. But as crazy as it sounds, it works—or at least it has worked for a number of decades. Your company has invented and brought to market countless amazing things: life-changing medicines, new technologies that make virtually every aspect of our daily lives easier to manage, and even tools to probe the great mysteries of nature and human life.\n\nAs the new CEO, though, you want to make some changes. First, you rework your longstanding hiring practices, screening out would-be inventors who come from certain areas. (Not everywhere—just a handful of places you don’t trust.) Then you introduce some new rules for company meetings, telling your senior staff to put visitors through a modest interrogation process before letting them in. The screening isn’t onerous, necessarily, it just takes time. You hear grumbling from your top talent—but hey, every company has grumpy talent. So you ignore it.\n\nYou’re still the No. 1 company in your field. You’re the top banana and everybody knows it. Except there’s one nagging issue that worries your investors: It’s that damn amorphous business model: There’s no special secret sauce to it. There’s no barrier to entry—meaning any of the company’s competitors can copy it and grab market share.\n\nSure, the company has been the overwhelming market leader for a long, long time—but then, so was Kodak. So was Sears. So was Encyclopedia Brittanica.\n\nThis, in case you missed it, is the story of American science.\n\nAnd that cacophony you hear now around the world is the sound of a market share under siege: of purple markers scrawling out formulas at the Karolinska in Stockholm, of patents being filed by researchers at the University of Jiangnan, of revolutionary ideas being bandied about in an incubator at Hyderabad.\n\nThe truth is, scientists from around the world have complained for years about the onerous process (through a Visa Mantis review, for instance) that many face merely to attend a meeting in the U.S. (Worth reading, for some context, is this 2006 article from Science.)\n\nBut in the wake of President Trump’s Jan. 27 executive order banning people from seven predominantly Muslim countries entry to the U.S. for 90 days, the cry from the global community of scientists and biomedical entrepreneurs—the world’s storied inventors—has gotten only louder.\n\nSome are urging a boycott of the U.S.—arriving at the obvious conclusion that there’s no need to have a global scientific gathering in any one country. And yesterday, an impressive array of more than 150 biotech company entrepreneurs, executives, and investors published an open letter in the journal Nature Biotechnology’s blog bashing the ban in no uncertain terms:\n\n“If this misguided policy is not reversed,” the authors wrote, “America is at risk of losing its leadership position in one of its most important sectors, one that will shape the world in the twenty-first century. Indeed, it will harm an industry dominated by smaller companies and startups, the very kind of industry the administration has said it wants to support. It will slow the fight against the many diseases that afflict us, as well as carry negative economic consequences for the United States.”\n\nMy colleague Sy Mukherjee has more on the story here.\n\nIdeas, good and bad, have no border. They sweep across the world, as knowledge does. There is no reason that the U.S. has to remain the center of life sciences innovation and entrepreneurialism—and that’s a realization that many outside our borders have come to already.", "authors": ["Clifton Leaf"], "publish_date": "2017-02-08", "source": "cnn", "top_words": ["theres", "travel", "nature", "world", "screening", "ban", "real", "market", "company", "onerous", "trumps", "danger", "scientists", "business", "process"], "summary": "But as crazy as it sounds, it works—or at least it has worked for a number of decades.\nFirst, you rework your longstanding hiring practices, screening out would-be inventors who come from certain areas.\nExcept there’s one nagging issue that worries your investors: It’s that damn amorphous business model: There’s no special secret sauce to it.\nThere’s no barrier to entry—meaning any of the company’s competitors can copy it and grab market share.\nSure, the company has been the overwhelming market leader for a long, long time—but then, so was Kodak."}